[{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "What Your Workplace Should Be Doing About the Coronavirus", "description": "We know how individuals should protect themselves from COVID-19 : mainly by washing hands and staying home if you’re sick. But workplaces have some more responsibility here, because they can be a place where the virus can circulate. Read more...", "url": "https://vitals.lifehacker.com/what-your-workplace-should-be-doing-about-the-coronavir-1842064369", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/vczlz1uox335djn9vn2d.jpg", "publishedAt": "2020-03-03T21:45:00Z", "content": "We know how individuals should protect themselves from COVID-19: mainly by washing hands and staying home if youre sick. But workplaces have some more responsibility here, because they can be a place where the virus can circulate. \r\nThe CDC has recommendation… [+3071 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Tim Mulkerin", "title": "What's the Best Lotion for Over-Washed Hands?", "description": "Are anyone else’s hands really goddamn scaly and dry lately? Flu season / coronavirus paranoia has us scrubbing up even more than usual—and that, combined with the winter weather, is leaving our poor hands crying out for moisture. Read more...", "url": "https://lifehacker.com/whats-the-best-lotion-for-over-washed-hands-1842064812", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yhgeipxbizna4fd57hhj.jpg", "publishedAt": "2020-03-03T22:00:00Z", "content": "Are anyone elses hands really goddamn scaly and dry lately? Flu season/coronavirus paranoia has us scrubbing up even more than usualand that, combined with the winter weather, is leaving our poor hands crying out for moisture.\r\nMoisturizing after you wash you… [+595 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Facebook fact-checking is becoming a political cudgel", "description": "Controversy has arisen over a Daily Caller fact-checking group declaring “false information” in an article about President Donald Trump’s coronavirus comments at a South Caroline rally.", "url": "https://www.theverge.com/2020/3/3/21163388/facebook-fact-checking-trump-coronavirus-hoax-comment-politico-daily-caller", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RKYjLazuTxjNs5ZezTDCT-j5kVA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742497/acastro_180828_1777_facebook_0002.jpg", "publishedAt": "2020-03-03T22:10:24Z", "content": "Trump called something a hoax but was it coronavirus?\r\nIllustration by Alex Castro / The Verge\r\nFacebooks fact-checking program is designed to stop false information from spreading. But being able to decide whats true can also be a political weapon, and for t… [+5066 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Caitlin McGarry", "title": "Google Cancels I/O Developer Conference Because of Coronavirus Concerns", "description": "Google I/O is the latest tech event to be canceled due to concerns over the coronavirus outbreak. Read more...", "url": "https://gizmodo.com/google-cancels-i-o-developer-conference-because-of-coro-1842066312", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hr6b4kq0573xchewvbik.jpg", "publishedAt": "2020-03-03T21:40:00Z", "content": "Google I/O is the latest tech event to be canceled due to concerns over the coronavirus outbreak. \r\nGoogle is following in the footsteps of Facebook, which canceled its annual F8 event last week, and of the organizers behind the smartphone-centric Mobile Worl… [+1463 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Josh Constine", "title": "Facebook fact-check feud erupts over Trump virus “hoax”", "description": "Who fact-checks the fact-checkers? Did Trump call coronavirus the Democrat’s “new hoax”? Those the big questions emerging from a controversial “false” label applied to Politico and NBC News stories by right-wing publisher The Daily Caller. Its Check Your Fact…", "url": "http://techcrunch.com/2020/03/03/trump-coronavirus-hoax-fact-check/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/09/trump-zuckerberg-1.jpg?w=712", "publishedAt": "2020-03-03T21:34:48Z", "content": "Who fact-checks the fact-checkers? Did Trump call coronavirus the Democrat’s “new hoax”?\r\nThose the big questions emerging from a controversial “false” label applied to Politico and NBC News stories by right-wing publisher The Daily Caller. Its Check Your Fac… [+4118 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Jack Morse", "title": "Google cancels annual I/O developer conference due to coronavirus fears", "description": "Google's playing it safe. The tech giant emailed would-be attendees of its annual Google I/O developer conference today to let them know that the \"physical\" event would be canceled. Much like Facebook's cancelation of its own developer conference, F8, Google …", "url": "https://mashable.com/article/google-io-2020-canceled-coronavirus/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F03%252Fa9%252Ffb6c47da279d4a91a13d140554cb217d.36fdb.jpg%252F1200x630.jpg?signature=W-uY6o-34fVPya3krRDDEW_Lmz8=", "publishedAt": "2020-03-03T21:13:59Z", "content": "Google's playing it safe. \r\nThe tech giant emailed would-be attendees of its annual Google I/O developer conference today to let them know that the \"physical\" event would be canceled. Much like Facebook's cancelation of its own developer conference, F8, Googl… [+1358 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "What Facebook could learn from Microsoft", "description": "Improving your public reputation often means taking a step out of the spotlight", "url": "https://www.theverge.com/interface/2020/3/3/21161516/facebook-public-opinion-research-microsoft-verge-tech-survey", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mRsbBEAHbrYY0kVnjEEyueKxHno=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10595581/jbareham_180405_1777_facebook_0003.jpg", "publishedAt": "2020-03-03T21:46:17Z", "content": "Illustration by James Bareham / The Verge It was a big weekend on the tech and governance beat, led by news of the spread of the COVID-19 disease in the United States and its spiraling consequences for companies in Silicon Valley and beyond. Today we’re intro… [+16008 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Latest coronavirus news to drive next Fed decision: Mester", "description": "The Federal Reserve's next policy decision in two weeks' time will be driven by the latest news on how the coronavirus is affecting the economy, Cleveland Federal Reserve Bank President Loretta Mester said on Tuesday after an emergency rate cut.", "url": "https://www.reuters.com/article/us-usa-fed-mester-outlook-idUSKBN20Q30E", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T21:30:12Z", "content": "LONDON (Reuters) - The Federal Reserve’s next policy decision in two weeks’ time will be driven by the latest news on how the coronavirus is affecting the economy, Cleveland Federal Reserve Bank President Loretta Mester said on Tuesday after an emergency rate… [+523 chars]"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Stan Choe", "title": "Dow sinks 2.9% after rate cut fails to stem market's dread - CP24 Toronto's Breaking News", "description": "Dow sinks 2.9% after rate cut fails to stem market's dread CP24 Toronto's Breaking News Stocks soar on plans for more stimulus measures, Biden wins Kamloops Matters Dow Jones surges more than 1,100 points after coronavirus stimulus measures, Biden win Global …", "url": "https://www.cp24.com/dow-sinks-2-9-after-rate-cut-fails-to-stem-market-s-dread-1.4837241", "urlToImage": "https://www.cp24.com/polopoly_fs/1.4837245.1583271150!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-03T21:33:00Z", "content": "NEW YORK -- Fear and uncertainty continue to control Wall Street, and stocks fell sharply Tuesday after an emergency interest-rate cut by the Federal Reserve failed to reassure markets wracked by worries that a fast-spreading virus will cause a recession.\r\nTh… [+7312 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Ryan Flanagan", "title": "How contagious is COVID-19 compared to other viral diseases? - CTV News", "description": "How contagious is COVID-19 compared to other viral diseases? CTV News Coronavirus outbreak: What is Canada's plan to combat COVID-19? Global News People are hoarding supplies as COVID-19 spreads – but, why? And is it useful? An expert weighs in CTV News Coron…", "url": "https://www.ctvnews.ca/health/how-contagious-is-covid-19-compared-to-other-viral-diseases-1.4836734", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4833728.1583030327!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-03T22:00:00Z", "content": "TORONTO -- \r\nAs scientists scramble to learn as much as they can about COVID-19 and the new coronavirus that causes it, theyre still grappling with a number of major unanswered questions.\r\nIts still not clear why children do not seem to be affected by the dis… [+3289 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "How the Coronavirus’ Effect On the Fashion Industry Reveals Flaws in the Global Economy", "description": "What's happening to Italy's fashion industry is likely a preview of the coronavirus' impact on the global economy more broadly.", "url": "https://time.com/5794928/coronavirus-fashion-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/coronavirus-fashion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-03T21:56:38Z", "content": "After the coronavirus outbreak forced Chinese fashion designers, buyers and other industry insiders to skip Milan’s Fashion Week in late February, the Camera Nazionale della Moda Italiana, or National Chamber of Italian Fashion, launched a campaign to demonst… [+4660 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Dean Takahashi", "title": "Coronavirus inspires University of Washington to create protein-folding puzzle game", "description": "To fight off the coronavirus, the University of Washington has launched a puzzle game that challenges you to build a protein that could stop COVID-19.", "url": "https://venturebeat.com/2020/03/03/coronavirus-inspires-university-of-washington-to-create-protein-folding-puzzle-game/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2020/03/coronavirus-foldit.jpg?w=1200&strip=all", "publishedAt": "2020-03-03T22:01:45Z", "content": "To address the coronavirus, the University of Washington has launched a puzzle game that challenges you to build a protein that could stop COVID-19 (the viruss official name) from attacking human cells.\r\nThe game is available on Foldit, a website that the Cen… [+2705 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Coronavirus: You may need to take a 2-week break from your life, CDC says", "description": "CDC stresses individual action as situation looks out of hand.", "url": "https://arstechnica.com/science/2020/03/118-us-coronavirus-cases-9-deaths-as-ramped-up-testing-uncovers-hidden-spread/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/03/GettyImages-1204231102-760x380.jpg", "publishedAt": "2020-03-03T22:07:30Z", "content": "Enlarge/ SEATTLE, WA - FEBRUARY 29: Healthcare workers transport a patient on a stretcher into an ambulance at Life Care Center of Kirkland on February 29, 2020, in Kirkland, Washington. Dozens of staff and residents at Life Care Center of Kirkland are report… [+4290 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "rmahbubani@businessinsider.com (Rhea Mahbubani), Rhea Mahbubani", "title": "'It was such a panic': A woman's hangover triggered hysteria about coronavirus aboard her flight to Heathrow Airport", "description": "Julia Walentin/Instagram Julia Walentin and Dina Oetterli spent their layover in Singapore drinking. Without enough food or rest, though, Walentin ended up with a terrible hangover. By asking a steward for medicine to help with her headache, Walentin sparked …", "url": "https://www.businessinsider.com/womans-hangover-triggers-coronavirus-panic-flight-cambodia-heathrow-airport-2020-3", "urlToImage": "https://i.insider.com/5e5ec384fee23d6cb361f936?width=1200&format=jpeg", "publishedAt": "2020-03-03T21:13:22Z", "content": "Heading home from a Cambodian holiday, Julia Walentin and her friend, Dina Oetterli, spent their layover in Singapore barely eating, drinking too much alcohol, and not getting enough sleep.\r\nThe trifecta ensured that the 26-year-old was in bad shape on Februa… [+3582 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Restricts Employee Travel to South Korea and Italy, Two Countries Hit Hard by Coronavirus", "description": "Apple is no longer allowing its employees to travel to Italy or South Korea because of the coronavirus outbreak affecting those countries, reports Bloomberg. Apple had already restricted employee travel to China, which is an issue because Apple engineers ofte…", "url": "https://www.macrumors.com/2020/03/03/apple-employee-travel-restrictions-korea-italy/", "urlToImage": "https://images.macrumors.com/article-new/2019/10/unitedplane.jpg", "publishedAt": "2020-03-03T21:36:41Z", "content": "Apple is no longer allowing its employees to travel to Italy or South Korea because of the coronavirus outbreak affecting those countries, reports Bloomberg.\r\nApple had already restricted employee travel to China, which is an issue because Apple engineers oft… [+1540 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "David Fickling", "title": "What If You Can't Afford to Fight Coronavirus?", "description": "(Bloomberg Opinion) -- As the coronavirus has tiptoed closer to global pandemic status, the world’s major economies are ramping up their spending on defenses. Italy plans to spend $4 billion on emergency economic measures to tackle the outbreak, while South K…", "url": "https://news.yahoo.com/cant-afford-fight-coronavirus-220022959.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GnTW2Xi2kCpeQwasxNpc5A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzUuMg--/https://s.yimg.com/uu/api/res/1.2/yugAYzIW3vY3e2.wsadyQA--~B/aD04NDY7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_politics_602/406d105d6c33a29610b64d0c38cd4323", "publishedAt": "2020-03-03T22:00:22Z", "content": "(Bloomberg Opinion) -- As the coronavirus has tiptoed closer to global pandemic status, the worlds major economies are ramping up their spending on defenses. \r\nItaly plans to spend $4 billion on emergency economic measures to tackle the outbreak, while South … [+4910 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "AP", "title": "Virus Kills 77 In Iran, Infects 23 Members of Parliament", "description": "There are 2,336 cases of the new coronavirus in Iran, including a top emergency official and at least 23 members of parliament.", "url": "https://www.huffpost.com/entry/iran-23-top-officials-coronavirus-covid_n_5e5ed36ec5b63aaf8f5e9b30", "urlToImage": "https://img.huffingtonpost.com/asset/5e5ed586230000ff120bf8f0.jpeg?cache=fyfamaslgs&ops=1778_1000", "publishedAt": "2020-03-03T22:10:27Z", "content": "TEHRAN, Iran (AP) Iran put its armed forces on alert Tuesday to assist health officials in battling the new coronavirus thats killed at least 77 people, an outbreak that has sickened top officials and pushed even its supreme leader into wearing disposable glo… [+6622 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Apple restricts employee travel to Italy and Korea, encourages virtual meetings due to coronavirus", "description": "Apple continues to restrict employee travel in response to the ongoing coronavirus outbreak. Bloomberg reports today that Apple has put new travel restrictions in place for Italy and Korea, and is also making other recommendations to employees. more… The post…", "url": "https://9to5mac.com/2020/03/03/apple-restricts-employee-travel-to-italy-and-korea/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/07/2019-MacBook-Pro-Space-Gray-Apple-Logo.jpg?quality=82&strip=all", "publishedAt": "2020-03-03T21:33:28Z", "content": "Apple continues to restrict employee travel in response to the ongoing coronavirus outbreak. Bloomberg reports today that Apple has put new travel restrictions in place for Italy and Korea, and is also making other recommendations to employees.\r\nIn a memo to … [+1641 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "Washington State could see explosion in coronavirus cases, study says", "description": "The coronavirus outbreak in the Seattle area is at a critical juncture and could see explosive growth much like Wuhan, China, an expert says.", "url": "https://www.statnews.com/2020/03/03/washington-state-risks-seeing-explosion-in-coronavirus-without-dramatic-action-new-analysis-says/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/03/AP_19312648917994-1024x576.jpg", "publishedAt": "2020-03-03T21:21:33Z", "content": "The coronavirus outbreak in the Seattle area is at a critical juncture and could see explosive growth in cases much like Wuhan, China, if public officials dont take immediate, forceful measures, according to a new analysis of genetic data.\r\nThe author of the … [+6430 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "'It was such a panic': A woman's hangover triggered hysteria about coronavirus aboard her flight to Heathrow Airport", "description": "Once back in the UK, Julia Walentin and her friend were quarantined for 14 days. They passed time by ordering \"room service — with Corona to drink.\"", "url": "https://news.yahoo.com/panic-womans-hangover-triggered-hysteria-211322790.html", "urlToImage": null, "publishedAt": "2020-03-03T21:13:22Z", "content": null}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Google I/O conference latest to fall to coronavirus", "description": "Google on Tuesday canceled its annual I/O developer conference in Mountain View amid concerns about the global coronavirus crisis, raising questions about Apple's expected events.", "url": "https://appleinsider.com/articles/20/03/03/google-io-conference-latest-to-fall-to-coronavirus", "urlToImage": "https://photos5.appleinsider.com/gallery/34755-62995-Google-IO-xl.jpg", "publishedAt": "2020-03-03T21:48:58Z", "content": "Google on Tuesday canceled its annual I/O developer conference in Mountain View amid concerns about the global coronavirus crisis, raising questions about Apple's expected events.Google in emails sent out today notified attendees about its decision to cancel … [+1894 chars]"}, {"source": {"id": null, "name": "Phandroid.com"}, "author": "Nick Gray", "title": "Google I/O canceled due to coronavirus (COVID-19) outbreak", "description": "The Google I/O 2020 developer conference which was scheduled to take place in Mountain View California May 12-14 has officially been canceled! Google made the announcement this afternoon, citing the coronavirus (COVID-19) outbreak as the cause. “Due to concer…", "url": "https://phandroid.com/2020/03/03/google-i-o-cancelled-due-to-coronavirus-covid-19-outbreak/", "urlToImage": "https://phandroid.com/wp-content/uploads/2019/05/google-io-2019-640x330.jpg", "publishedAt": "2020-03-03T21:51:53Z", "content": "Nick Gray\r\nMar 3rd, 2020The Google I/O 2020 developer conference which was scheduled to take place in Mountain View California May 12-14 has officially been canceled! Google made the announcement this afternoon, citing the coronavirus (COVID-19) outbreak as t… [+1279 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Aaron Rupar", "title": "Facebook’s top news stories are like a window into an alternate dimension", "description": "It’s Super Tuesday and the coronavirus is spreading, but Facebook is talking about Clinton’s emails.", "url": "https://www.vox.com/2020/3/3/21163363/facebook-top-news-stories-hillary-clinton-emails", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YxRT7OmFqYFrR29JJvtMb-ZffC8=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19765309/493815798.jpg.jpg", "publishedAt": "2020-03-03T22:00:00Z", "content": "Hillary Clinton testifies before Congress in October 2015. | Samuel Corum/Anadolu Agency/Getty Images It’s Super Tuesday and the coronavirus is spreading, but Facebook is talking about Hillary Clinton’s emails. There are a lot of consequential and important t… [+5244 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Sarah Owermohle and Sarah Karlin-Smith", "title": "Coronavirus emergency bill held up over vaccine cost concerns", "description": "Democrats are insisting the spending package include significant funding to purchase large amounts of coronavirus diagnostics.", "url": "https://www.politico.com/news/2020/03/03/coronavirus-emergency-bill-119729", "urlToImage": "https://static.politico.com/c3/49/f899fd0a4578819b6b507eb4e3c6/200303-chuck-schumer-getty-773.jpg", "publishedAt": "2020-03-03T21:34:50Z", "content": "The administration's top scientists have said any coronavirus vaccine could be at least a year away from reaching the market. Moderna Therapeutics is working with National Institutes of Health on a vaccine while Johnson &amp; Johnson has received funding from… [+1467 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: US death toll rises, Google cancels its biggest event - CNET", "description": "The latest updates on the COVID-19 outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-us-death-toll-at-9-google-cancels-biggest-event/", "urlToImage": "https://cnet3.cbsistatic.com/img/Ps4pNNwmdQEJ3WpUS-fEpRv9suU=/756x567/2020/03/03/d3e555ce-f996-491f-8f5a-303e9516ddb1/gettyimages-1203669279.jpg", "publishedAt": "2020-03-03T21:50:00Z", "content": "Coronavirus has spread across every continent, except Antarctica, in three months, leaving some cities empty and silent.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a previously-unseen coronavirus first detected in the Chinese city of Wuhan … [+15928 chars]"}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Tyler Cowen", "title": "The coronavirus debate is splitting into two broad camps", "description": "The “growthers” and the “base-raters” — which are you and why? Here is my latest Bloomberg column. Hard to excerpt but good. The post The coronavirus debate is splitting into two broad camps appeared first on Marginal REVOLUTION.", "url": "https://marginalrevolution.com/marginalrevolution/2020/03/the-coronavirus-debate-is-splitting-into-two-broad-camps.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-03-03T22:03:28Z", "content": "The “growthers” and the “base-raters” — which are you and why?  Here is my latest Bloomberg column.  Hard to excerpt but good."}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "As coronavirus deaths rise, Italy considers new quarantine zones", "description": "Italy now has the highest number of coronavirus-related deaths outside China, having surpassed Iran.", "url": "https://www.aljazeera.com/news/2020/03/coronavirus-deaths-rise-italy-considers-quarantine-zones-200303211143776.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/25/809c78c0f0dc48b180bcbdbb85eeef2d_18.jpg", "publishedAt": "2020-03-03T21:51:32Z", "content": "Italy's health authorities are considering setting up a new quarantine red zone to try to contain the coronavirus outbreak in Europe's worst-hit country, after the death toll and the number of cases jumped.\r\nTwenty-seven people died of the highly contagious i… [+3726 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Todd Spangler", "title": "Google I/O 2020 Cancelled Over Coronavirus", "description": "Google has axed its biggest annual event, the I/O conference, becoming the latest confab to pull the plug over concerns about the coronavirus outbreak. I/O 2020 had been set to run in Mountain View, Calif., from. Last year’s developers conference, featuring k…", "url": "https://variety.com/2020/digital/news/google-i-o-2020-cancelled-coronavirus-1203522971/", "urlToImage": "https://pmcvariety.files.wordpress.com/2020/03/google-io-sundar-pichai.jpg?w=700&h=393&crop=1", "publishedAt": "2020-03-03T21:34:41Z", "content": "Google has axed its biggest annual event, the I/O conference, becoming the latest confab to pull the plug over concerns about the coronavirus outbreak.\r\nI/O 2020 had been set to run in Mountain View, Calif., from. Last year’s developers conference, featuring … [+1234 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Citing coronavirus concerns, Apple restricts employee travel to Italy and South Korea, following its similar restrictions for China (Mark Gurman/Bloomberg)", "description": "Mark Gurman / Bloomberg : Citing coronavirus concerns, Apple restricts employee travel to Italy and South Korea, following its similar restrictions for China — - Company sends memo to employees about Covid-19 response — Sick employees told to take leave; virt…", "url": "https://www.techmeme.com/200303/p27", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iBGrq.nNP5SQ/v0/1200x600.jpg", "publishedAt": "2020-03-03T22:10:01Z", "content": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 5:20 PM ET, March 3, 2020.\r\nThe most current version of the site as always is available at our home page.\r\nTo view an earlier snapshot click here\r\nand then modify the date in… [+7 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Bed Bath & Beyond Stock Fell Today", "description": "Shares of the home goods retailer slipped as markets continued to react to the coronavirus outbreak.", "url": "https://www.fool.com/investing/2020/03/03/why-bed-bath-beyond-stock-fell-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561297/home-goods-shopping.jpg", "publishedAt": "2020-03-03T22:07:00Z", "content": "What happened\r\nShares of Bed Bath &amp; Beyond (NASDAQ:BBBY) were slipping again today as investors continued to bet against the stock in the face of the COVID-19 coronavirus outbreak.\r\nDuring a volatile day for stocks, the home goods retailer was briefly in … [+1879 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Under Armour Stock Was Sliding Today", "description": "Shares of the sportswear company got tripped up by the coronavirus again.", "url": "https://www.fool.com/investing/2020/03/03/why-under-armour-stock-was-sliding-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561272/under-armour-shoes.jpg", "publishedAt": "2020-03-03T21:23:00Z", "content": "What happened\r\nShares of Under Armour (NYSE:UAA)(NYSE:UA) were sliding today as the market continued to pummel struggling apparel stocks in the midst of the COVID-19 coronavirus sell-off. \r\nThe overall market was volatile today -- stocks were in positive terr… [+2040 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Shannon Melero", "title": "Everything Is Going to be Okay, the Olympics are Still Happening", "description": "As the world continues to panic about coronavirus, the International Olympic Committee brings us some good news. Today, during a press briefing, IOC spokesperson Mark Adams confirmed that this year’s games scheduled to take place in Tokyo starting July 24 wil…", "url": "https://jezebel.com/everything-is-going-to-be-okay-the-olympics-are-still-1842066252", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/osbrdizoyod3tv1jzx8k.jpg", "publishedAt": "2020-03-03T21:35:00Z", "content": "As the world continues to panic about coronavirus, the International Olympic Committee brings us some good news. Today, during a press briefing, IOC spokesperson Mark Adams confirmed that this years games scheduled to take place in Tokyo starting July 24 will… [+1026 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "POLL: TRUMP APPROVAL 41%...", "description": "President Trump's job approval rating rose during impeachment, but relapsed as the coronavirus hit the economic outlook, the IBD/TIPP Poll finds.", "url": "https://www.investors.com/politics/trump-job-approval-relapses-amid-coronavirus-threat-ibd-tipp-poll/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/03/POL02-trump-030220-AP.jpg", "publishedAt": "2020-03-03T21:37:38Z", "content": "Impeachment couldn't stop President Donald Trump's job approval from rising, but the coronavirus might. As Americans' near-term view of the economy soured in February, amid worry over the coronavirus and a Dow Jones correction, Trump's job approval rating rel… [+2388 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Clint Henderson", "title": "Alaska Airlines updates inflight procedures in an effort to keep passengers safe", "description": "On a flight yesterday on Alaska Airlines from San Francisco to Newark, a flight attendant curtly refused my request for a refill of water. At first I thought she was too busy, but later another flight attendant told me they were no longer refilling glasses in…", "url": "http://thepointsguy.com/news/alaska-airlines-inflight-procedures-coronavirus/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2020/03/Alaska-Airlines-Boeing-737-800-scaled.jpg?fit=2560%2C1920px&ssl=1", "publishedAt": "2020-03-03T21:30:15Z", "content": "On a flight yesterday on Alaska Airlines from San Francisco to Newark, a flight attendant curtly refused my request for a refill of water. At first I thought she was too busy, but later another flight attendant told me they were no longer refilling glasses in… [+2274 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Alissa McAloon", "title": "Google calls off I/O 2020 dev conference over coronavirus concerns", "description": "Google is the latest to call off a planned gathering, but notes that itâ€ \u0099ll be looking at ways the conference can 'evolve' to still reach devs following the cancelation....", "url": "https://www.gamasutra.com/view/news/359076/Google_calls_off_IO_2020_dev_conference_over_coronavirus_concerns.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29", "urlToImage": "http://www.gamasutra.com/db_area/images/news/2020/Mar/359076/thewheel413.jpg", "publishedAt": "2020-03-03T21:13:00Z", "content": "Google is the latest company to call off its annual developer event, announcing today that the Google I/O 2020 event set to take place in California this May has been canceled.\r\nThe decision was made, like many other recent cancellations, due to the COVID-19 … [+394 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Sam Mintz and Brianna Gurciullo", "title": "CDC may lack contact information for some airline passengers possibly exposed to coronavirus", "description": "Airlines and the CDC disagree about how to fix the problem.", "url": "https://www.politico.com/news/2020/03/03/cdc-coronavirus-airline-passengers-119751", "urlToImage": "https://static.politico.com/ea/2b/433be56a4e6ea5965eceb59ed7e1/200303-coronavirus-airlines-getty-773.jpg", "publishedAt": "2020-03-03T21:50:21Z", "content": "Policy should be developed from knowledgeable people at FAA or DOT so we can begin to better track passengers, DeFazio added. But he noted later that he expected \"they ought to able to figure this out.\"\r\nAs first reported by The Washington Post, the CDC is in… [+5625 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Stephanie Pappas", "title": "If you have the coronavirus, how long before symptoms show up? - Livescience.com", "description": "If you have the coronavirus, how long before symptoms show up? Livescience.com Coronavirus live updates: US death toll rises to 9, mortality rate of COVID-19 rises CNBC Coronavirus outbreak: CDC doctor outlines U.S. anti-virus strategy Global News Who is gett…", "url": "https://www.livescience.com/coronavirus-incubation-period-when-symptoms-appear.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hUpBrhALK8vS9xpdEerKr8-1200-80.jpg", "publishedAt": "2020-03-03T21:22:00Z", "content": "The incubation period for a virus is the time between catching the virus and showing symptoms of disease. For the novel coronavirus\r\n SARS-CoV-2, health officials estimate an incubation period of between one and 14 days.Most people start showing symptoms abou… [+3372 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Cory Renauer)", "title": "Faulty COVID-19 Test Kits Tilt Scales in Coronavirus's Favor", "description": "Flawed coronavirus test kits from the Centers for Disease Control severely limited the number of U.S. patients screened in January and February.", "url": "https://www.fool.com/investing/2020/03/03/faulty-covid-19-test-kits-tilt-scales-in-coronavir.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561273/coronavirus-sample-getty.jpg", "publishedAt": "2020-03-03T21:33:00Z", "content": "The U.S. government's response to the rapidly escalating coronavirus outbreak is receiving a strong dose of criticism. Instead of quickly testing every individual known to have been exposed to SARS-CoV-2, the coronavirus that causes COVID-19, just 3,600 were … [+1759 chars]"}, {"source": {"id": null, "name": "Kdvr.com"}, "author": "Dara Bitler", "title": "'If I do get Coronavirus I'm attending every MAGA rally'...", "description": "'If I do get Coronavirus I'm attending every MAGA rally'... (Top headline, 10th story, link ) Related stories: Tensions rise as U.S. death toll from coronavirus reaches 9... First Death Earlier Than Officials Realized... TWITTER Tells All Employees To Work At…", "url": "https://kdvr.com/news/local/if-i-do-get-coronavirus-im-attending-every-maga-rally-i-can-denver-councilwoman-quotes-solidarity-to-tweet/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2020/03/tweet.png?w=361&h=273&crop=1&resize=1280,720", "publishedAt": "2020-03-03T21:37:36Z", "content": "DENVER (KDVR) — Denver Councilwoman Candi CdeBaca is getting major blowback over a controversial tweet sent on Friday.\r\nCdeBaca quoted a tweet that said, “For the record, if I do get the coronavirus I’m attending every MAGA rally I can.” \r\nCdeBaca responded a… [+1188 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "Coronavirus outbreak: Rupee falls below 73/USD", "description": "The rupee had fallen to 72.76 against the dollar on Monday. This is the third consecutive session of fall for the domestic unit during which it has depreciated by 160 paise.", "url": "https://indianexpress.com/article/business/economy/coronavirus-outbreak-rupee-falls-below-73-usd-6297879/", "urlToImage": "https://images.indianexpress.com/2020/03/rupee.jpg?w=759", "publishedAt": "2020-03-03T21:45:38Z", "content": "After starting on a positive note, the rupee witnessed heavy volatility during the session and finally settled below 73 per US dollar level as uncertainty over coronavirus spooked investors. (File Photo)Despite the rally in the markets, the rupee on Tuesday s… [+1097 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus leads to drop in advertising sales - CBS News", "description": "Coronavirus leads to drop in advertising sales CBS News Federal Reserve slashes interest rates amid coronavirus outbreak CBS News Coronavirus death toll rises in US CBS Evening News Climate change a key issue as voters head to polls on Super Tuesday CBS News …", "url": "https://www.youtube.com/watch?v=TY-mRnpeOsI", "urlToImage": null, "publishedAt": "2020-03-03T21:57:02Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "John Hudson", "title": "‘We’re beyond desperate’: Officials fear the spread of coronavirus to Americans and Europeans held in Iran’s cramped prisons - The Washington Post", "description": "‘We’re beyond desperate’: Officials fear the spread of coronavirus to Americans and Europeans held in Iran’s cramped prisons The Washington Post Iran men who licked holy shrine face prison, flogging, as troops ordered to fight coronavirus outbreak Fox News Co…", "url": "https://www.washingtonpost.com/national-security/were-beyond-desperate-officials-fear-the-spread-of-coronavirus-to-americans-and-europeans-held-in-irans-cramped-prisons/2020/03/03/ef9f9402-5d4f-11ea-8baf-519cedb6ccd9_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/sR3-uu01BO0kzUe5t2KCQBgQ_hU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FH74ZQS5OYI6VMAUJ6X2QZV3QE.jpg", "publishedAt": "2020-03-03T21:41:00Z", "content": "Iran has struggled to manage the outbreak, even among its most senior government officials, arousing concern about the welfare of the Western detainees it has branded as spies, traitors and counter-revolutionaries.\r\nOn Tuesday, Irans health ministry reported … [+5746 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Seoul mobilizes troops and military equipment to respond to coronavirus outbreak | ABC News - ABC News", "description": "Seoul mobilizes troops and military equipment to respond to coronavirus outbreak | ABC News ABC News Overnight Defense: US, Taliban deal hits snag in first days | Military helping to find coronavirus vaccine | White House withdraws nomination for official who…", "url": "https://www.youtube.com/watch?v=2ezO-S-ub9k", "urlToImage": "https://i.ytimg.com/vi/2ezO-S-ub9k/maxresdefault.jpg", "publishedAt": "2020-03-03T21:43:36Z", "content": "Seoul mobilized troops and military equipment to respond to the coronavirus outbreak, spraying streets and alleys with disinfectant. President Moon Jae-in has declared \"war\" on the novel coronavirus after 600 new infections were recorded on Tuesday. https://a… [+270 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Josh Constine", "title": "Facebook fact-check feud erupts over Trump virus \"hoax\"", "description": "Did Trump call coronavirus the Democrat's \"new hoax\"? Its Check Your Fact division is a Facebook fact-checking partner, giving it the power to flag links on the social network as false, demoting their ranking in the News Feed as well as the visibility of the …", "url": "https://techcrunch.com/2020/03/03/trump-coronavirus-hoax-fact-check/", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-03T21:34:48Z", "content": "Who fact-checks the fact-checkers? Did Trump call coronavirus the Democrat's \"new hoax\"?\r\nThose the big questions emerging from a controversial \"false\" label applied to Politico and NBC News stories by right-wing publisher The Daily Caller. Its Check Your Fac… [+4183 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Krishn Kaushik", "title": "Coronavirus scare: Navy postpones its largest ever exercise", "description": "The event was scheduled to begin on March 18 in Visakhapatnam, Andhra Pradesh.", "url": "https://indianexpress.com/article/india/coronavirus-scare-indian-navy-postpones-its-largest-ever-exercise-6298042/", "urlToImage": "https://images.indianexpress.com/2020/03/Indian-navy.jpg?w=759", "publishedAt": "2020-03-03T21:38:14Z", "content": "Written by Krishn Kaushik\r\n | New Delhi | \r\nPublished: March 4, 2020 3:08:14 am\r\nOn Tuesday, the Navy said the exercise – Milan 2020 – has been indefinitely postponed taking into consideration the safety of all participants and travel restrictions imposed by … [+1710 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Philip Johnston", "title": "The big danger of coronavirus is that we panic ourselves into a greater crisis", "description": "Growing up, I never heard the phrase Keep Calm and Carry On.", "url": "https://www.telegraph.co.uk/news/2020/03/03/big-danger-coronavirus-panic-greater-crisis/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2016/11/01/112226590_Original_Keep_Calm_and_Carry_On_poster_on_display_at_a_secret_wartime_lab_in_1939-xlarge_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwSp7-edaSPSLcOI-nmPuW_s.jpg?imwidth=1200", "publishedAt": "2020-03-03T21:30:00Z", "content": "Growing up, I never heard the phrase Keep Calm and Carry On. The wartime poster on which it was emblazoned did not feature in any of the jingoistic comics I read as a child because it was never actually distributed, or at least not widely. Propagandists felt … [+1231 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Trump Says U.S. Is Moving Aggressively to Develop a Coronavirus Vaccine", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-03/trump-says-u-s-is-moving-aggressively-to-develop-a-coronavirus-vaccine-video", "urlToImage": null, "publishedAt": "2020-03-03T21:22:23Z", "content": null}, {"source": {"id": null, "name": "Abovethelaw.com"}, "author": "Staci Zaretsky", "title": "New York Law Student In Self-Quarantine After Contact With Infected Lawyer’s Firm", "description": "What is your law school or law firm doing to protect students and employees from coronavirus?", "url": "https://abovethelaw.com/2020/03/new-york-law-student-in-self-quarantine-after-contact-with-infected-lawyers-firm/", "urlToImage": "https://abovethelaw.com/uploads/2020/03/coronavirus-alert-sign-GettyImages-1201383916.jpg", "publishedAt": "2020-03-03T21:13:25Z", "content": "(Image via Getty)\r\nEarlier today, we reported that a New York lawyer was the second confirmed case of coronavirus in the state. We can now confirm that one of his children is an undergraduate student at Yeshiva University in New York City and that a student a… [+2067 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Adria Cimino)", "title": "Why Mattel Shares Fell 19.4% in February", "description": "Could China’s factory shutdown mean fewer toys for the holidays?", "url": "https://www.fool.com/investing/2020/03/03/why-mattel-shares-fell-194-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561304/gettyimages-mattel.jpg", "publishedAt": "2020-03-03T22:03:00Z", "content": "What happened\r\nShares of Mattel(NASDAQ:MAT) fell 19.4% in February, according to data from S&amp;P Global Market Intelligence, on concerns that factory disruptions resulting from the coronavirus may weigh on earnings in the coming quarters.\r\nThe coronavirus h… [+2033 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Susan Albers Psy.D.", "title": "Feeling Anxious about the Coronavirus and the Flu? Eat This", "description": "Here are some of the best foods to help your body fight off illness and soothe your anxiety.", "url": "https://www.psychologytoday.com/ca/blog/comfort-cravings/202003/feeling-anxious-about-the-coronavirus-and-the-flu-eat", "urlToImage": null, "publishedAt": "2020-03-03T21:56:36Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "anthonypauldalessandro", "title": "Disney-Pixar’s ‘Onward’ Eyes $100M Global Start, Even With Coronavirus Concerns", "description": "Despite the swelling panic about the coronavirus, the global business for Disney/Pixar’s elf fantasy feature Onward should turn out to be solid. To date, there aren’t any theaters closed in the U.S. (nor do sources expect any in the near future), certainly no…", "url": "https://deadline.com/2020/03/onward-ben-affleck-the-way-back-box-office-coronavirus-1202873492/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/onward-online-use-t551_4b_pub.pub16.108.jpg?w=1024", "publishedAt": "2020-03-03T22:08:01Z", "content": "Despite the swelling panic about the coronavirus, the global business for Disney/Pixar’s elf fantasy feature Onwardshould turn out to be solid.\r\nTo date, there aren’t any theaters closed in the U.S. (nor do sources expect any in the near future), certainly no… [+5716 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Brian Orelli)", "title": "Inovio Pharmaceuticals Accelerates Timeline for Its Coronavirus Vaccine, Shares Jump 70%", "description": "The biotech wants to start testing its candidate vaccine against SARS-CoV-2 in April.", "url": "https://www.fool.com/investing/2020/03/03/inovio-pharmaceuticals-accelerates-timeline-for-it.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561298/coronavirus-outbreak.jpg", "publishedAt": "2020-03-03T21:54:00Z", "content": "Inovio Pharmaceuticals(NASDAQ:INO) is making progress in its efforts to develop a vaccine for SARS-CoV-2, the coronavirus that causes COVID-19. Shares of the biotech company closed up 70% on Tuesday on word that it could start a clinical trial next month. \r\nR… [+1301 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sonia Rao", "title": "Coronavirus is shutting down movies, tours and festivals. Here’s where things stand. - The Washington Post", "description": "Coronavirus is shutting down movies, tours and festivals. Here’s where things stand. The Washington Post Hollywood, Tech Brace for Billions in Losses Due to Coronavirus Variety Coronavirus hits entertainment industry — and some shows may not go on LA Daily Ne…", "url": "https://www.washingtonpost.com/arts-entertainment/2020/03/03/coronavirus-film-festival-concert-cancellations/", "urlToImage": "https://www.washingtonpost.com/resizer/7VCJPKW3b_vEkhfZSAzNnmxT4M8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2B5Z5CCZ44I6VDX5B6IEXXMAK4.jpg", "publishedAt": "2020-03-03T21:35:00Z", "content": "The decision to not cancel events has also caused rifts in some cases, such as the Association of Writers and Writing Programs Conference director resigning over its continuance. Countless jobs will be affected by the virus, and financial reverberations for i… [+5743 chars]"}, {"source": {"id": null, "name": "Mynorthwest.com"}, "author": "", "title": "Coronavirus spreads from Kirkland to North Carolina - MyNorthwest.com", "description": "North Carolina identified its first case of coronavirus Tuesday. The case is a person who traveled to Washington state and was exposed at the Life Care Center in Kirkland.", "url": "https://mynorthwest.com/1746387/coronavirus-spreads-kirkland-north-carolina/?", "urlToImage": "https://mynorthwest.com/wp-content/uploads/2020/03/ap_0a40e3cb2811456d921a4fc3f5ed3a93.jpg", "publishedAt": "2020-03-03T21:28:24Z", "content": "North Carolina identified its first case of coronavirus Tuesday. The case is a person who traveled to Washington state and was exposed at the Life Care Center in Kirkland where there is currently an outbreak of coronavirus.\r\n“I know that people are worried ab… [+995 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Joshua Jamerson, John McCormick", "title": "Poll Workers Don Gloves, Offer Curbside Voting...", "description": "Poll Workers Don Gloves, Offer Curbside Voting... (Top headline, 21st story, link ) Related stories: Tensions rise as U.S. death toll from coronavirus reaches 9... First Death Earlier Than Officials Realized... TWITTER Tells All Employees To Work At Home... F…", "url": "https://www.wsj.com/articles/coronavirus-prompts-poll-workers-to-don-gloves-offer-curbside-voting-11583237082", "urlToImage": "https://images.wsj.net/im-159939/social", "publishedAt": "2020-03-03T21:37:36Z", "content": "WASHINGTONVoters heading to the polls in some Super Tuesday states will be met by workers wearing medical gloves and check-in tables decorated with Purell bottles, as the coronavirus outbreak collides with the presidential campaign.\r\nJohn Gardner, an election… [+205 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "U.S. Coronavirus Cases Top 100 as Death Toll Reaches 9: 'Don't Let the Virus Spread,' Says CDC", "description": "U.S. cases of the new coronavirus now number 108, as state health officials in Washington say that three more people have died, bringing the death toll up to nine. All nine of the U.S. deaths have been in Washington state, with most coming from patients at a …", "url": "https://people.com/health/us-coronavirus-cases-top-100-death-toll-hits-9/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fgettyimages-1210144924.jpg%3Fcrop%3D0px%2C855px%2C6000px%2C3153px%26resize%3D1200%2C630", "publishedAt": "2020-03-03T21:26:53Z", "content": "U.S. cases of the new coronavirus now number 108, as state health officials in Washington say that three more people have died, bringing the death toll up to nine.\r\nAll nine of the U.S. deaths have been in Washington state, with most coming from patients at a… [+2903 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Google cancels annual developer conference amid coronavirus concerns", "description": "Alphabet Inc said on Tuesday it has canceled its annual developer event, Google I/O, amid concerns related to the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-health-coronavirus-google-idUSKBN20Q30K", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498335173&w=1200&r=LYNXMPEG221Z9", "publishedAt": "2020-03-03T21:51:31Z", "content": "(Reuters) - Alphabet Inc said on Tuesday it has canceled its annual developer event, Google I/O, amid concerns related to the coronavirus outbreak. \r\n“Over the coming weeks, we will explore other ways to evolve Google I/O to best connect with and continue to … [+680 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "Sensex recovers 480 points", "description": "After a highly volatile session, the 30-share benchmark index snapped its seven-day losing streak, surging 479.68 points, or 1.26 per cent, to end at 38,623.70.", "url": "https://indianexpress.com/article/business/market/sensex-recovers-480-points-6297894/", "urlToImage": "https://images.indianexpress.com/2019/12/bse-bombay-stock-exchange-759-16.jpg?w=759", "publishedAt": "2020-03-03T21:42:03Z", "content": "The BSE Sensex rallied 480 points as the investor sentiment got a big boost amid expectations of policy measures from various central banks to mitigate the economic impact of coronavirus outbreak. (File)India and other global financial markets on Tuesday stag… [+1471 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jim Carlton, Jennifer Calfas, Jing Yang", "title": "First Death Earlier Than Officials Realized...", "description": "First Death Earlier Than Officials Realized... (Top headline, 2nd story, link ) Related stories: Tensions rise as U.S. death toll from coronavirus reaches 9... TWITTER Tells All Employees To Work At Home... FAUCI PANDEMIC WARNING... CDC blocked FDA official f…", "url": "https://www.wsj.com/articles/confirmed-coronavirus-cases-outside-china-pass-10-000-11583228968", "urlToImage": "https://images.wsj.net/im-159947/social", "publishedAt": "2020-03-03T21:37:36Z", "content": "The first death linked to the novel coronavirus in the U.S. happened last week, days earlier than previously known, as the death count rose and is expected to continue to climb. \r\nThe first-known deceased, a 54-year-old man, was admitted to Harborview Medical… [+274 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Rania Aniftos", "title": "‘Weird Al’ Yankovic Decides Against Coronavirus Parody", "description": "Amid the disease's increasing spread, fans were hoping for a twist on The Knack's 1979 hit, \"My Sharona.\"", "url": "https://www.billboard.com/articles/news/9327687/weird-al-yankovic-coronavirus-parody", "urlToImage": "https://static.billboard.com/files/2020/03/weird-al-yankovic-2019-yxh-billboard-1548-1583272277-1024x677.jpg", "publishedAt": "2020-03-03T22:10:52Z", "content": "Sure, \"Weird Al\" Yankovic's got songs like \"Germs\" and \"Party at the Leper Colony,\" but a coronavirus joke might be too far for the parody musician.\r\nAmid the disease's increasing spread, fans were hoping for a twist on The Knack's 1979 hit, \"My Sharona.\"\r\nWh… [+541 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ella IDE", "title": "Pope 'tests negative' but Vatican ups controls...", "description": "Pope 'tests negative' but Vatican ups controls... (Top headline, 24th story, link ) Related stories: Tensions rise as U.S. death toll from coronavirus reaches 9... First Death Earlier Than Officials Realized... TWITTER Tells All Employees To Work At Home... F…", "url": "https://news.yahoo.com/pope-tests-negative-coronavirus-vatican-ups-controls-004702909.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/31Kcx0QdenTeJgWNbcyv0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/5liknH1OfVh8vFPjh70zEA--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/200d1a61d098296f4b1132c0c810e13501c8c2b0.jpg", "publishedAt": "2020-03-03T21:37:36Z", "content": "Vatican City (AFP) - The Vatican said on Tuesday that Pope Francis was still suffering from a cold and not exhibiting other symptoms, after a report said he had tested negative for the novel coronavirus.\r\nItaly's Messaggero newspaper reported that the 83-year… [+3194 chars]"}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Evan Selleck", "title": "Apple issues new employee travel restrictions in Italy and South Korea, encourages virtual meetings", "description": "Apple has placed new employee travel restrictions in Italy and South Korea, and is encouraging virtual meetings.", "url": "https://www.idownloadblog.com/2020/03/03/apple-coronavirus-concerns-travel-restrictions/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2018/07/Apple-piazza-liberty-store-milan-italy-architectural-model-014.jpeg", "publishedAt": "2020-03-03T21:53:26Z", "content": "With the continuing global spread of the coronavirus and the disease it causes, COVID-19, Apple has issued another travel restriction notice for employees.\r\nBloomberg has the report on Tuesday, based on a memo that Apple sent out to employees recently. In it,… [+1290 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Noel Randewich", "title": "US STOCKS-Another foul day on Wall Street after surprise Fed rate cut - Yahoo Finance", "description": "US STOCKS-Another foul day on Wall Street after surprise Fed rate cut Yahoo Finance Dow Jones Futures: As Fed Rate Cut Flops; A Coronavirus Stock Market Correction Survival Guide Investor's Business Daily Stocks surge after the Fed cuts rates by half a point,…", "url": "https://finance.yahoo.com/news/us-stocks-another-foul-day-212639099.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DL4ZR1LTgbS4kx3NBIxJmQ--~B/aD0zNDQyO3c9NjEyNjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/03/5e5eca652d85403b50d4c391/5e5eca652d85403b50d4c392_o_U_v2.jpg", "publishedAt": "2020-03-03T21:28:00Z", "content": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)\r\n* Indexes slump: Dow -2.94%, S&amp;P 500 -2.81%, Nasdaq -2.99%\r\n* Fed cuts rates by half percentage point\r\n* Concerns about virus impact dominate (Updates with close)\r\nBy Noel R… [+3273 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Chloe Sorvino, Forbes Staff, Chloe Sorvino, Forbes Staff https://www.forbes.com/sites/chloesorvino/", "title": "Derailed By Coronavirus, A Corner Of The Food Industry Questions The Future Of Its Biggest Event", "description": "The so-called Superbowl of the natural products industry was supposed to kick-off Tuesday.", "url": "https://www.forbes.com/sites/chloesorvino/2020/03/03/derailed-by-coronavirus-a-corner-of-the-food-industry-questions-the-future-of-its-biggest-event/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F466546288%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D3000%26cropY1%3D428%26cropY2%3D1834", "publishedAt": "2020-03-03T21:49:31Z", "content": "A Boomchickapop booth at Expo West in 2015, two years before it was acquired by Conagra for a ... [+] reported $250 million. \r\nWireImage\r\nThe so-called Superbowl of the natural products industry has been cancelled and the Coronavirus is to blame. Expo West wa… [+14125 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: World Bank pledges $12bn in emergency aid", "description": "The organisation said it would prioritise the poorest countries.", "url": "https://www.bbc.co.uk/news/business-51728766", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/8EC8/production/_111125563_gettyimages-1135902076.jpg", "publishedAt": "2020-03-03T21:11:49Z", "content": "Image copyrightAFPImage caption\r\n World Bank President David Malpass\r\nThe World Bank has committed $12bn (£9.4bn) in aid for lower income countries grappling with the spread of the coronavirus.\r\nThe emergency package includes low-cost loans, grants and techni… [+889 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "STAN CHOE / AP", "title": "Stock Market Sinks 2.9 Percent After Federal Reserve Cuts Interest Rate", "description": "Stocks fell sharply Tuesday after an emergency interest-rate cut by the Federal Reserve failed to reassure markets about COVID-19.", "url": "https://time.com/5795105/stock-market-coronavirus-updates/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/coronavirus-stocks.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-03T21:59:18Z", "content": "(NEW YORK) — Fear and uncertainty continue to control Wall Street, and stocks fell sharply Tuesday after an emergency interest-rate cut by the Federal Reserve failed to reassure markets wracked by worries that a fast-spreading virus will cause a recession.\r\nT… [+7350 chars]"}, {"source": {"id": null, "name": "Gamesindustry.biz"}, "author": null, "title": "GamesFirst London 2020 cancelled", "description": "Supercell and Space Ape pull plug on event citing novel coronavirus concerns", "url": "https://www.gamesindustry.biz/articles/2020-03-03-gamesfirst-london-2020-cancelled", "urlToImage": "https://images.eurogamer.net/2020/articles/2020-03-03-21-26/gf20.jpg", "publishedAt": "2020-03-03T21:20:00Z", "content": "Share this article\r\nCompanies in this article\r\nSpace Ape Games\r\nSupercell\r\nOriginal story, March 3, 2020: The games industry event schedule continues to thin, as GamesFirst London 2020 organizers today cancelled the event.\r\nOrganizing studios Space Ape Games … [+1614 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Coronavirus Updates: Outbreak in China Starts to Come Under Control via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_8a3098ad5e57199877d0a987d24665a7", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-03T21:40:08Z", "content": "A.J. Bouye, Denver Broncos, Jacksonville Jaguars, NFL, Cornerback, Houston Texans\r\nCornerback A.J. Bouye, who reached the Pro Bowl two years ago, will soon head to Denver in exchange for a fourth-round draft pick."}, {"source": {"id": null, "name": "Edweek.org"}, "author": "Sarah Schwartz", "title": "How Teachers Are Talking to Students About the Coronavirus", "description": "As the coronavirus spreads across the United States, teachers are put in the hard spot of educating students about prevention without scaring them.", "url": "https://www.edweek.org/ew/articles/2020/03/03/how-teachers-are-talking-to-students-about.html", "urlToImage": "https://www.edweek.org/media/2020/03/03/web-teacher-coronovirus-soc.jpg", "publishedAt": "2020-03-03T21:57:00Z", "content": "At the Foreign Language Immersion and Cultural Studies School in Detroit, DaJuanna Traviers 5th graders can raise any topic on their minds during their Friday restorative discussion circles. \r\nThis past week, they wanted to talk about the coronavirus. \r\nThey … [+7627 chars]"}, {"source": {"id": null, "name": "Gcn.com"}, "author": null, "title": "Going viral: Considerations for agency tech preppers - GCN.com", "description": "As the coronavirus becomes increasingly challenging for all enterprises, agency IT managers must consider how this virus might affect their employees, internal operations and future preparedness planning.", "url": "https://gcn.com/articles/2020/03/03/coronavirus-tech-prep.aspx", "urlToImage": "https://gcn.com/-/media/GIG/GCN/Redesign/Articles/2013/April/sequester.png", "publishedAt": "2020-03-03T22:04:34Z", "content": "Going viral: Considerations for agency tech preppers\r\nWhile going viral usually refers to a popular meme on the internet, the emergence of COVID-19 is behind an *actual* viral epidemic -- one that promises to impact public- and private-sector organizations as… [+6900 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Editorial", "title": "Boosting immunity", "description": "Combating coronavirus requires getting basics right, creating awareness, investing in public health infrastructure.", "url": "https://indianexpress.com/article/opinion/editorials/pm-narendra-modi-on-coronavirus-infection-public-health-infrastructure-covid-19-6297775/", "urlToImage": "https://images.indianexpress.com/2020/02/editorial.jpg?w=759", "publishedAt": "2020-03-03T22:00:37Z", "content": "By: Editorial | \r\nPublished: March 4, 2020 3:30:37 am\r\nWith more than 3,000 recorded deaths, the number of fatalities from the coronavirus outbreak has surpassed the toll of the 2002-2003 SARS outbreak, which also originated in China.Even as Chinas COVID-19 c… [+2848 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Colleen Shalby, Soumya Karlamangla", "title": "As millions vote, California polling places take precautions to lessen coronavirus risk", "description": "As coronavirus cases continue to rise in California, affecting 11 counties from Northern to Southern California, millions throughout the state are hitting the polls to cast their Super Tuesday votes in local, state and national elections.", "url": "https://www.latimes.com/california/story/2020-03-03/as-millions-vote-california-polling-places-take-precautions-to-lessen-coronavirus-risk", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/f8384c2/2147483647/strip/true/crop/2048x1075+0+140/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8c%2F46%2Fa884c37d4bc288a69094f02b0b59%2Felectionday2.jpg", "publishedAt": "2020-03-03T21:18:40Z", "content": "As coronavirus cases continued to rise in California, affecting 11 counties up and down the state, millions hit the polls to cast their Super Tuesday votes in local, state and national elections.\r\nWhether concerns about COVID-19 will affect in-person voter tu… [+2849 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Coronavirus death toll in Washington State reaches 9 people", "description": "Three more patients have succumbed to the coronavirus in the western US state of Washington on Tuesday, bringing the total death toll to 9", "url": "https://www.rt.com/newsline/482240-coronavirus-deaths-us-washington/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5ec5f52030276c3354f658.jpg", "publishedAt": "2020-03-03T21:18:46Z", "content": "Three more patients have succumbed to the coronavirus in the western US state of Washington on Tuesday, bringing the total death toll to 9. The number of diagnosed coronavirus cases also rose from 18 to 27. Several of those who died had been residents of a lo… [+583 chars]"}, {"source": {"id": null, "name": "Webnews.it"}, "author": "Redazione Webnews", "title": "Coronavirus, Google cancella l’evento I/O 2020", "description": "Google decide di cancellare l'attesissimo evento I/O 2020 a causa dell'epidemia di coronavirus COVID-19. The post Coronavirus, Google cancella l’evento I/O 2020 appeared first on Webnews.", "url": "https://www.webnews.it/2020/03/03/coronavirus-google-cancella-levento-i-o-2020/", "urlToImage": "https://www.webnews.it/app/uploads/2018/05/sundar.jpg", "publishedAt": "2020-03-03T21:38:21Z", "content": "Google ha ufficialmente cancellato l’edizione 2020 della conferenza I/O che si sarebbe dovuta tenere tra il 12 e il 14 maggio prossimi presso lo Shoreline Amphitheatre di Mountain View, a pochi passi dal quartier generale di Google.\r\nIl motivo è ovviamente le… [+1071 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Google cancels developers gathering due to coronavirus", "description": "Google on Tuesday cancelled its major annual gathering of software developers amid concerns over the deadly coronavirus. The internet giant said it nixed the festival-like event Google I/O event scheduled for May a short distance from the \"Googleplex\" in the …", "url": "https://news.yahoo.com/google-cancels-developers-gathering-due-coronavirus-213016636.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BFJfb8UPwCv2hzVZRj1Euw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDU-/https://s.yimg.com/uu/api/res/1.2/2.KVrt6xOoHFAKnuxj0mtA--~B/aD00ODM7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/33963827069ec607e207ae4177b7cd97cac4a872.jpg", "publishedAt": "2020-03-03T21:30:16Z", "content": "San Francisco (AFP) - Google on Tuesday cancelled its major annual gathering of software developers amid concerns over the deadly coronavirus.\r\nThe internet giant said it nixed the festival-like event Google I/O event scheduled for May a short distance from t… [+1416 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "US may pay for uninsured coronavirus patients", "description": "The US may invoke an emergency law to pay for uninsured patients who get infected with the new coronavirus, a senior health official said Tuesday. Robert Kadlec, a senior official with the Health and Human Services department told the Senate on Tuesday that t…", "url": "https://news.yahoo.com/us-may-pay-uninsured-coronavirus-patients-214459173.html", "urlToImage": null, "publishedAt": "2020-03-03T21:44:59Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sweta Jaiswal, FRM", "title": "Will China ETFs Suffer as Coronavirus Dents Factory Output?", "description": "China's manufacturing output PMI hit the lowest level in record in February primarily due to the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/china-etfs-suffer-coronavirus-dents-212809198.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/RUqAElj5.5J5h9ADvsLFqQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNzA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/uLUHQ71UepERtAGnJFXv2w--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/559dcc6ca45de6f60253f2b435cbdbc7", "publishedAt": "2020-03-03T21:28:09Z", "content": "The coronavirus impact can be seen on Chinas latest economic data. Per, the National Bureau of Statistics, the worlds second-largest economys official Purchasing Managers' Index (PMI) came in at 35.7 in February in comparison to 50.0 in January. The countrys … [+4221 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "William Ebbs", "title": "HIV & Ebola-Like Mutations Suggest Coronavirus Leaked From a Lab", "description": "Researchers have found shocking similarities between the Wuhan coronavirus and HIV and Ebola. These mutations suggest the virus is manmade. The post HIV & Ebola-Like Mutations Suggest Coronavirus Leaked From a Lab appeared first on CCN.com", "url": "https://www.ccn.com/hiv-ebola-like-mutations-suggest-coronavirus-leaked-from-a-lab/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/Coronavirus.jpg", "publishedAt": "2020-03-03T21:16:07Z", "content": "<ul><li>The novel coronavirus has similarities with HIV and Ebola, according to Chinese researchers.</li><li>This research builds upon earlier speculation that coronavirus may have leaked from a research laboratory in Wuhan.</li><li>When does a conspiracy the… [+5260 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Tim Mulkerin", "title": "What's The Best Lotion For Over-Washed Hands?", "description": "Are anyone else’s hands really goddamn scaly and dry lately? Flu season/coronavirus paranoia has us scrubbing up even more than usual—and that, combined with the winter weather, is leaving our poor hands crying out for moisture. More »", "url": "https://www.lifehacker.com.au/2020/03/whats-the-best-lotion-for-over-washed-hands/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/yhgeipxbizna4fd57hhj.jpg", "publishedAt": "2020-03-03T22:00:00Z", "content": "Are anyone elses hands really goddamn scaly and dry lately? Flu season/coronavirus paranoia has us scrubbing up even more than usualand that, combined with the winter weather, is leaving our poor hands crying out for moisture.\r\nMoisturising after you wash you… [+595 chars]"}, {"source": {"id": null, "name": "Phonescoop.com"}, "author": "Rich Brome", "title": "Google Cancels I/O Due to Coronavirus Concerns", "description": "Google will not hold its annual, in-person developer conference this year, to avoid the risk of the gathering helping to spread the coronavirus (COVID-19). The company is refunding paid attendees. A Google spokesperson said the company \"will explore other way…", "url": "https://www.phonescoop.com/articles/article.php?a=22094", "urlToImage": "https://www.phonescoop.com/img/a/s/c218.jpg", "publishedAt": "2020-03-03T21:21:14Z", "content": "New Emoji for 2019 Address AccessibilityFeb 5, 2019Unicode 12, the annual release for 2019, includes a wide variety of new standard emoji. Many focus on accessibility, including wheelchair, motorized wheelchair, person in wheelchair, probing cane, person with… [+94 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Brittany De Lea", "title": "Fed rate cut to boost homebuyers' spending power - Fox Business", "description": "In an emergency action on Tuesday, the Federal Reserve announced a 50 basis-point reduction in its benchmark federal funds rate.", "url": "https://www.foxbusiness.com/personal-finance/fed-rate-cut-housing-market", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/couple-house-iStock.jpg?ve=1&tl=1", "publishedAt": "2020-03-03T22:02:10Z", "content": "The Federal Reserve cut interest rates on Tuesday in response to the spreading coronavirus, and that could bring benefits to one sector of the U.S. economy just in time for spring: real estate.\r\nMortgage rates were already low – and the addition of a rate cut… [+3634 chars]"}, {"source": {"id": null, "name": "Fujirumors.com"}, "author": "Patrick", "title": "Coronavirus: Fujifilm Resumed Operation at Chinese Digital Camera Plant, but…", "description": "Due to the Coronavirus outbreak, Fujifilm closed their factory in Suzhou, China. Now they re-opened. Fujifilm resumed operation on February 10 at a digital camera assembly plant in Suzhou, China, which had been closed since the Lunar New Year (Chinese… The po…", "url": "https://www.fujirumors.com/coronavirus-fujifilm-resumed-operation-at-chinese-digital-camera-plant-but/", "urlToImage": "https://www.fujirumors.com/wp-content/uploads/2020/03/Fujifilm-Factory-720x371.jpg", "publishedAt": "2020-03-03T21:49:53Z", "content": "Disclaimer: Fujirumors has no affiliation with any of the equipment manufacturers mentioned on this site. Please visit their official websites by typing the specific brand name and adding .com after it in your browser. All trademarks and brands belong to thei… [+709 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jason Hall)", "title": "Axos Financial Stock Falls on Interest Rates, H&R Block Deal Risk", "description": "The online-only bank reported that it could lose a partnership with the big tax preparation company, compounding its stock price fall on a bad day for most bank stocks.", "url": "https://www.fool.com/investing/2020/03/03/axos-financial-stock-falls-on-interest-rates-hr-bl.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561306/bank-vault-digital-online-bank.jpg", "publishedAt": "2020-03-03T22:11:00Z", "content": "What happened\r\nShares of Axos Financial (NYSE:AX) fell 10% in trading on March 3, before rebounding slightly to finish down 9%. Today's big drop was caused by two things: the surprise announcement by the U.S. Federal Reserve that is was cutting a key benchmar… [+2937 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Caitlin McGarry", "title": "Google Cancels I/O Developer Conference Because Of Coronavirus Concerns", "description": "Google I/O is the latest tech event to be cancelled due to concerns over the coronavirus outbreak. More »", "url": "https://www.gizmodo.com.au/2020/03/google-cancels-io-developer-conference-because-of-coronavirus-concerns/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hr6b4kq0573xchewvbik.jpg", "publishedAt": "2020-03-03T21:40:00Z", "content": "Google I/O is the latest tech event to be cancelled due to concerns over the coronavirus outbreak.\r\nGoogle is following in the footsteps of Facebook, which cancelled its annual F8 event last week, and of the organisers behind the smartphone-centric Mobile Wor… [+1468 chars]"}, {"source": {"id": null, "name": "Programmableweb.com"}, "author": "KevinSundstrom", "title": "Nubentos Launches COVID-19 Monitoring API", "description": "Nubentos, the self-proclaimed API marketplace for health, has released a new API that aims to provide valuable resources for tracking the novel coronavirus (COVID-19). The new API provides developers access to data collected from global health organizations a…", "url": "https://www.programmableweb.com/news/nubentos-launches-covid-19-monitoring-api/brief/2020/03/03", "urlToImage": "https://www.programmableweb.com/sites/default/files/pw-200-200.png", "publishedAt": "2020-03-03T21:48:48Z", "content": "Nubentos, the self-proclaimed API marketplace for health, has released a new API that aims to provide valuable resources for tracking the novel coronavirus (COVID-19). The new API provides developers access to data collected from global health organizations a… [+751 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Agence France-Presse", "title": "Google cancels developers gathering due to coronavirus", "description": "Google on Tuesday cancelled its major annual gathering of software developers amid concerns over the deadly coronavirus. The internet giant said it nixed the festival-like event Google I/O event scheduled for May a short distance from the “Googleplex” in the …", "url": "https://www.rawstory.com/2020/03/google-cancels-developers-gathering-due-to-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/01/Google-LOGO.jpeg", "publishedAt": "2020-03-03T21:56:12Z", "content": "Google on Tuesday cancelled its major annual gathering of software developers amid concerns over the deadly coronavirus.\r\nThe internet giant said it nixed the festival-like event Google I/O event scheduled for May a short distance from the “Googleplex” in the… [+1406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Aussie shoppers 'panic buying' toilet paper | Nine News Australia - Nine News Australia", "description": "Coronavirus: Aussie shoppers 'panic buying' toilet paper | Nine News Australia Nine News Australia Coronavirus fears spark 'panic buying' of toilet paper, water, hand sanitizer. Here's why we all need to calm down USA TODAY Jackie Is Freaking Out That She's G…", "url": "https://www.youtube.com/watch?v=MlQifk5WI-k", "urlToImage": "https://i.ytimg.com/vi/MlQifk5WI-k/maxresdefault.jpg", "publishedAt": "2020-03-03T21:31:17Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "US death toll from coronavirus jumps to nine", "description": "The US death toll from the novel coronavirus rose to nine on Tuesday, all in the state of Washington and many of them residents of the same nursing home, officials said. Eight of the deaths have been in King County, which encompasses Seattle, and one was in n…", "url": "https://news.yahoo.com/us-death-toll-coronavirus-jumps-nine-211447108.html", "urlToImage": null, "publishedAt": "2020-03-03T21:14:47Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Google cancels annual developer conference amid coronavirus concerns", "description": "\"Over the coming weeks, we will explore other ways to evolve Google I/O to best connect with and continue to build our developer community,\" the company said. Google becomes the second FAANG member after Facebook Inc to cancel its conference as the virus, tha…", "url": "https://finance.yahoo.com/news/google-cancels-annual-developer-conference-213026598.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/YnzB1BNkIa6hFuA4JkgJeQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjAuOA--/https://s.yimg.com/uu/api/res/1.2/PJQ9cGAEOXg5phri0UpwFw--~B/aD01Mzg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/266d06dbdc82f33d222762bb6a3c213e", "publishedAt": "2020-03-03T21:30:26Z", "content": "(Reuters) - Alphabet Inc &lt;GOOGL.O&gt; said on Tuesday it has canceled its annual developer event, Google I/O, amid concerns related to the coronavirus outbreak.\r\n\"Over the coming weeks, we will explore other ways to evolve Google I/O to best connect with a… [+705 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Fabiana Batista and Patrick McKiernan", "title": "Coffee Defies Coronavirus Rout With Biggest Rally in Three Years", "description": "(Bloomberg) -- Too much rain in Brazil is fueling the biggest coffee rally in years just as other markets crumble under the weight of coronavirus fears.Futures of arabica beans, the mild-tasting variety preferred by Starbucks Corp., have gained 13% since U.S.…", "url": "https://finance.yahoo.com/news/coffee-defies-coronavirus-rout-biggest-220000482.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/XDgE0EkBo3xh6ZAWDR5.Rg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/a28f8d1aa46eb4aae14473c7029663c2", "publishedAt": "2020-03-03T22:00:00Z", "content": "(Bloomberg) -- Too much rain in Brazil is fueling the biggest coffee rally in years just as other markets crumble under the weight of coronavirus fears.\r\nFutures of arabica beans, the mild-tasting variety preferred by Starbucks Corp., have gained 13% since U.… [+2965 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Samantha McDonald", "title": "Ross Stores’ Winning Streak Continues — But Coronavirus Could Stall Momentum", "description": "The novel coronavirus has cast uncertainty over many retailers that do business in China — including Ross Stores Inc., which posted another quarter of better-than-expected earnings but warned of potential supply chain disruptions in China.The Dublin, Calif.-b…", "url": "https://finance.yahoo.com/news/ross-stores-winning-streak-continues-220048043.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CzJP2MHKRUJ3be_6UzV19w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/cO_7SZq.Pvao3wIyCfMugA--~B/aD03Njg7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/footwear_news_finance_8/ca22414c41993fe6c860477ac4b4e48b", "publishedAt": "2020-03-03T22:00:48Z", "content": "The novel coronavirus has cast uncertainty over many retailers that do business in China including Ross Stores Inc., which posted another quarter of better-than-expected earnings but warned of potential supply chain disruptions in China.\r\nThe Dublin, Calif.-b… [+2284 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Heather SCOTT", "title": "US Fed leads charge against economic hit from coronavirus", "description": "The US Federal Reserve led the charge in the global response to the growing economic risk posed by the coronavirus, announcing an emergency interest rate cut Tuesday to boost confidence. In a unanimous decision, the Fed's policy-setting committee slashed its …", "url": "https://news.yahoo.com/us-fed-leads-charge-against-economic-hit-coronavirus-182153538.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6DdEUkTEZdOQkS_HUgGWSA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/NLUSrn_1J6bJ1padAbGX1Q--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/9d855b4446f8eff2074a5f8dad76806f6c008038.jpg", "publishedAt": "2020-03-03T22:04:42Z", "content": "Washington (AFP) - The US Federal Reserve led the charge in the global response to the growing economic risk posed by the coronavirus, announcing an emergency interest rate cut Tuesday to boost confidence.\r\nBut the immediate impact seemed the opposite of what… [+4358 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Kelly Conaboy", "title": "Coronavirus Is Only One Reason Why You Should Stop Biting Your Nails", "description": "The already-unfortunate habit also spreads germs.", "url": "http://www.thecut.com/article/how-to-stop-biting-your-nails-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/03/03-nail-biter.w1200.h630.jpg", "publishedAt": "2020-03-03T21:20:52Z", "content": "The coronavirus is alarming, to say the least. Luckily there are ways of alleviating stress that we can turn to in times like this. Punching a weight bag, for example. Meditating. Washing our hands properly. Having a cup of chamomile tea. Biting our finger na… [+3866 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "How the Coronavirus’ Effect On the Fashion Industry Reveals Flaws in the Global Economy", "description": "What's happening to Italy's fashion industry is likely a preview of the coronavirus' impact on the global economy more broadly.", "url": "https://time.com/5794928/coronavirus-fashion-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/coronavirus-fashion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-03T21:56:38Z", "content": "After the coronavirus outbreak forced Chinese fashion designers, buyers and other industry insiders to skip Milan’s Fashion Week in late February, the Camera Nazionale della Moda Italiana, or National Chamber of Italian Fashion, launched a campaign to demonst… [+4660 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "How to be prepared for a coronavirus outbreak", "description": "Ali Velshi talks with Robyn Gershon, a clinical professor of epidemiology at the New York University School of Global Public Health, about what individuals, companies, and communities should be preparing for a possible coronavirus outbreak.", "url": "https://www.msnbc.com/ali-velshi/watch/how-to-be-prepared-for-a-coronavirus-outbreak-79923269923", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_velshi_gershon_200303_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-03T21:35:28Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Eric Volkman)", "title": "GlaxoSmithKline Reportedly Trying Again to Sell Antibiotics Line", "description": "The divestment of its cephalosporin products could bring in several hundred million dollars.", "url": "https://www.fool.com/investing/2020/03/03/glaxosmithkline-reportedly-trying-again-to-sell-an.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561256/gsk-building-in-the-uk.jpg", "publishedAt": "2020-03-03T21:15:00Z", "content": "GlaxoSmithKline(NYSE:GSK) is hanging a \"for sale\" sign on a group of its antibiotics, according to an article published by Bloomberg. The article, citing \"people familiar with the matter,\" states that the big drugmaker is working with financial advisors to fi… [+1529 chars]"}, {"source": {"id": null, "name": "Skepchick.org"}, "author": "Rebecca Watson", "title": "The Cure for Coronavirus? Medicare for All & Worker’s Rights", "description": "This post contains a video, which you can also view here. To support more videos like this, head to patreon.com/rebecca! Transcript: Look, I would love to not make another video about coronavirus. Last month, I talked about the pseudoscience and racism surrou…", "url": "https://skepchick.org/2020/03/the-cure-for-coronavirus-medicare-for-all-workers-rights/", "urlToImage": "https://skepchick.org/wp-content/uploads/2020/03/covid19vsAmerica.jpg", "publishedAt": "2020-03-03T21:53:38Z", "content": "This post contains a video, which you can also view here. To support more videos like this, head to patreon.com/rebecca!\r\nTranscript:\r\nLook, I would love to not make another video about coronavirus. Last month, I talked about the pseudoscience and racism surr… [+5603 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "AP", "title": "Tornadoes, Coronavirus Fears Impact Voting In Some States", "description": "Just hours before polls were set to open in Tennessee, twisters tore through parts of the state, destroying at least 140 buildings and killing at least 22", "url": "https://www.huffpost.com/entry/super-tuesday-tennessee-tornadoes-coronavirus_n_5e5ed34cc5b6732f50e9a865", "urlToImage": "https://img.huffingtonpost.com/asset/5e5ed714230000840fdddf27.jpeg?cache=esshjarxt3&ops=1778_1000", "publishedAt": "2020-03-03T22:09:43Z", "content": "Deadly tornadoes knocked out polling places in Tennessee while fears over the coronavirus left some polling places in California and Texas short of election workers as Super Tuesday voting was underway around the country.\r\nScattered reports of polling places … [+5728 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Alex Kidman", "title": "Google Cancels Google I/O Due To Coronavirus", "description": "The number of tech conferences actually going ahead right now is astonishingly slim, with Google the latest company to scale back its plans. Its annual Google I/O conference will instead take an \"alternative format\", most likely online. More »", "url": "https://www.gizmodo.com.au/2020/03/google-cancels-google-i-o-due-to-coronavirus/", "urlToImage": "https://edge.alluremedia.com.au/m/g/2020/02/googlereviews.jpg", "publishedAt": "2020-03-03T21:40:46Z", "content": "The number of tech conferences actually going ahead right now is astonishingly slim, with Google the latest company to scale back its plans. Its annual Google I/O conference will instead take an \"alternative format\", most likely online.\r\nGoogle has announced … [+1843 chars]"}, {"source": {"id": null, "name": "Allears.net"}, "author": "Quincy Stanford", "title": "Coronavirus and the Disney Parks: Here’s What We Know", "description": "There have been a lot of concerns about how Coronavirus will affect Disney Parks -- here's everything we know so far. The post Coronavirus and the Disney Parks: Here’s What We Know appeared first on AllEars.Net.", "url": "https://allears.net/2020/03/03/coronavirus-and-the-disney-parks-heres-what-we-know/", "urlToImage": "https://allears.net/wp-content/uploads/2020/01/Magic-Kingdom-Main-Street-USA-General.jpg", "publishedAt": "2020-03-03T21:35:50Z", "content": "Much of the global news has been saturated with talks about a new novel Coronavirus. According to the CDC, the risk of exposure is still relatively low for the general public in the United States.\r\nMain Street\r\nStill, response to the virus has caused the mobi… [+4916 chars]"}]