[{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "This Week in Apps: Coronavirus impacts app stores, Facebook sues mobile SDK maker, Apple kicks out a cloud gaming app", "description": "This week, we'll look at the coronavirus outbreak's impact. We're also talking about Facebook's lawsuit over a data-grabbing SDK, Tinder's new video series, and more.", "url": "http://techcrunch.com/2020/02/29/this-week-in-apps-coronavirus-impacts-app-stores-facebook-sues-mobile-sdk-maker-apple-kicks-out-a-cloud-gaming-app/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/this-week-in-apps-splash.png?w=753", "publishedAt": "2020-02-29T14:33:33Z", "content": "Welcome back to This Week in Apps, the Extra Crunch series that recaps the latest OS news, the applications they support and the money that flows through it all.\r\nThe app industry is as hot as ever, with a record 204 billion downloads in 2019 and $120 billion… [+1007 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "NorthJersey, Gene Myers, NorthJersey", "title": "How do you talk to children about coronavirus? Stay honest and simple to avoid anxiety.", "description": "As health experts throughout the area prepare for the arrival of the coronavirus, how should adults talk about the potential outbreak with children?", "url": "https://www.usatoday.com/story/news/health/2020/02/28/talking-children-coronavirus-keep-simple-avoid-stress/4906147002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/26/USAT/df437c1a-ec77-4e87-bfa0-4fad3576d185-VPC_CORONAVIRUS_PANIC_DESK_THUMB.jpg?crop=1699,956,x0,y14&width=1699&height=956&format=pjpg&auto=webp", "publishedAt": "2020-02-29T14:40:10Z", "content": "BERGEN, N.J. Be careful what you say around children, as anyone who has any or works with them knows they hear everything.\r\nLately, much of what they are overhearing is about coronavirus. \r\nThe talk has been alarming and scary. People wearing masks, the numbe… [+5105 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jessie Pang", "title": "Hong Kong police fire tear gas as black-clad protesters return to streets", "description": "Hong Kong police fired tear gas on Saturday to disperse hundreds of black-clad protesters, some armed with petrol bombs, during a rally to mark six months since the authorities stormed a subway station and arrested demonstrators.", "url": "https://www.reuters.com/article/us-hongkong-protests-idUSKBN20N0MQ", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-29T14:23:18Z", "content": "HONG KONG (Reuters) - Hong Kong police fired tear gas on Saturday to disperse hundreds of black-clad protesters, some armed with petrol bombs, during a rally to mark six months since the authorities stormed a subway station and arrested demonstrators. \r\nThe l… [+2111 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Anmol", "title": "WHO joins TikTok to fight Coronavirus misinformation", "description": "Earlier today, the World Health Organization (WHO) launched its own TikTok account. While TikTok is not really something WHO would be into, the organization aims to share updates using the platform to curb the spread of misinformation surrounding the Coronavi…", "url": "https://mspoweruser.com/who-joins-tiktok-to-fight-misinformation/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2020/02/TikTok.jpg", "publishedAt": "2020-02-29T15:00:34Z", "content": "Earlier today, the World Health Organization (WHO) launched its own TikTok account. While TikTok is not really something WHO would be into, the organization aims to share updates using the platform to curb the spread of misinformation surrounding the Coronavi… [+1350 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "This Bizarre Low-Speed Pursuit Of A Stolen Ambulance In Philadelphia Is Like Something Out Of 'Grand Theft Auto'", "description": "A pantless, shirtless man hijacked an ambulance and went on a wild joyride through Philadelphia. While he crashed into several vehicles, there were no serious injuries reported.", "url": "https://digg.com/video/stolen-ambulance-in-philadelphia", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/02/29135947/Screen-Shot-2020-02-29-at-8.58.46-AM.jpg", "publishedAt": "2020-02-29T14:25:49Z", "content": "With the news that the coronavirus is spreading, it's only a matter of time before people start to think—wait, do I have the coronavirus? At this point it's still extremely rare, and your cough is far more likely to be a cold or flu. Still, here's what you sh… [+7 chars]"}, {"source": {"id": null, "name": "Dailystar.co.uk"}, "author": "Sophie Bateman", "title": "Mystery disease hits Africa as dying villagers 'bleed from eyes'...", "description": "EXCLUSIVE: While the rest of the world is occupied with coronavirus, a gruesome mystery sickness is killing Ethiopians of all ages as hospital treatment appears ineffective", "url": "https://www.dailystar.co.uk/news/world-news/disease-x-feared-hit-ethiopia-21601531", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article21601551.ece/ALTERNATES/s1200/1_JS10748765.jpg", "publishedAt": "2020-02-29T14:37:39Z", "content": "A mysterious and horrifying deadly illness killing villagers in Ethiopia could be the dreaded \"Disease X\".\r\nA concept coined by the World Health Organisation (WHO) to describe a new unknown pathogen with the potential to cause an epidemic, scientists are cons… [+3054 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (David Haen)", "title": "Investors Endure Wild Ride in This Biotech Taking on COVID-19", "description": "In the wake of a broad market sell-off, investors clamor to find companies developing drugs to put an end to the coronavirus outbreak.", "url": "https://www.fool.com/investing/2020/02/29/investors-endure-wild-ride-in-this-biotech-taking.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560810/gettyimages-1202541843.jpg", "publishedAt": "2020-02-29T14:45:00Z", "content": "Vir Biotechnology(NASDAQ:VIR) may not be a familiar name to many investors. This relatively young biotech went public last October. Backed by infamous investor SoftBank (of WeWork fame) among others, investors in Vir find themselves in a situation where they … [+4616 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Specialist: Coronavirus could widely spread though US - CNN", "description": "Specialist: Coronavirus could widely spread though US CNN CDC 'erroneously' identified first coronavirus patient to die in US as female Washington Examiner CDC erroneously identified first patient to die from coronavirus as female | TheHill The Hill First cor…", "url": "https://www.youtube.com/watch?v=I-YRv9pfWV8", "urlToImage": "https://i.ytimg.com/vi/I-YRv9pfWV8/maxresdefault.jpg", "publishedAt": "2020-02-29T15:11:32Z", "content": "Infectious disease specialist Dr. William Schaffner says that coronavirus could widely spread throughout the US as it has been confirmed in three more west coast communities. #CNN#News"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paayal Zaveri", "title": "Wall Street thinks Zoom, Slack and these 2 other companies could see their stock prices soar as the coronavirus means more people work remotely", "description": "As more white collar workers work remotely due to concerns over the coronavirus disease, COVID-19, companies like Zoom, Slack, and Dropbox could benefit from increased usage, analysts say. Zoom has already seen increased usage — and responded by lifting its 4…", "url": "https://www.businessinsider.com/zoom-slack-dropbox-remote-work-coronavirus-analyst-2020-2", "urlToImage": "https://i.insider.com/5e59ac58fee23d63bc1cba42?width=1200&format=jpeg", "publishedAt": "2020-02-29T14:25:00Z", "content": "As concerns over the coronavirus disease, COVID-19, increase, companies are enforcing more rules and restrictions on where employees can travel — and allowing more people to work from home. In order to stay productive, home-bound workers could use more cloud … [+3840 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Coronavirus in the US (Feb. 29): First case in Oregon shuts Lake Oswego school - oregonlive.com", "description": "Coronavirus in the US (Feb. 29): First case in Oregon shuts Lake Oswego school oregonlive.com Oregon coronavirus patient is grade-school employee; school closed for deep cleaning, officials say Fox News Oregon Health Officials Confirm First Case Of Novel Coro…", "url": "https://www.oregonlive.com/health/2020/02/coronavirus-in-the-us-feb-29-first-case-in-oregon-shuts-lake-oswego-school.html", "urlToImage": "https://www.oregonlive.com/resizer/Gm8WrkeKxdNRsUYAV56ana2Gh1U=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/MBM2SWSZ6NAVXGDOKTNJ7JGBRE.jpg", "publishedAt": "2020-02-29T14:50:00Z", "content": "Oregon reported its first coronavirus case on Friday. Heres the latest news:\r\nCoronavirus in Oregon: A Lake Oswego elementary school employee contracted Oregons first apparent case of coronavirus, causing the closure of the 430-student school as health offici… [+2580 chars]"}, {"source": {"id": null, "name": "Abc7ny.com"}, "author": null, "title": "Coronavirus News: States to begin tests; 1 self-quarantines, another being evaluated for COVID-19 in New York City - WABC-TV", "description": "Coronavirus News: States to begin tests; 1 self-quarantines, another being evaluated for COVID-19 in New York City WABC-TV FDA Approves Coronavirus Testing In NY CBS New York NYC Mayor de Blasio blasts CDC and Trump for coronavirus response New York Daily New…", "url": "https://abc7ny.com/5975419", "urlToImage": "https://cdn.abcotvs.com/dip/images/5975832_022920-wabc-coronavirus-watchlive.jpg?w=1600", "publishedAt": "2020-02-29T14:18:20Z", "content": "NEW YORK (WABC) -- BREAKING, 1:15pm: Health officials in Washington State have confirmed the first U.S. death due to COVID-19.The announcement came during a press conference involving officials from Public Health - Seattle &amp; King County and the Washington… [+6146 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Britain reports number of coronavirus cases has risen to 23", "description": "The number of people infected with coronavirus in the United Kingdom had risen to 23 on Saturday, after three more patients tested positive, Britain's health department said.", "url": "https://www.reuters.com/article/us-china-health-britain-idUSKBN20N0N8", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200229&t=2&i=1496983564&w=1200&r=LYNXMPEG1S0I7", "publishedAt": "2020-02-29T14:38:20Z", "content": "(Reuters) - The number of people infected with coronavirus in the United Kingdom had risen to 23 on Saturday, after three more patients tested positive, Britain’s health department said. \r\n“As of 29 February at 9am (0900 GMT), a total of 10,483 people have be… [+440 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "France bans gatherings of more than 5,000 due to coronavirus", "description": "The French government banned public gatherings with more than 5,000 people on Saturday due to the coronavirus outbreak as France reported 16 new cases.", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/5cUKtNhyKkc/france-bans-gatherings-of-more-than-5000-due-to-coronavirus-idUSKBN20N0MD", "urlToImage": null, "publishedAt": "2020-02-29T14:14:15Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marshall Shepherd, Contributor, Marshall Shepherd, Contributor https://www.forbes.com/sites/marshallshepherd/", "title": "Coronavirus And Hurricane Sandy - An Odd Connection Reveals The Need To Prioritize Science", "description": "Coronavirus is a reminder that science must be prioritized \"before\" and \"after\" threats. Some lessons from Hurricane Sandy.", "url": "https://www.forbes.com/sites/marshallshepherd/2020/02/29/coronavirus-and-hurricane-sandyan-odd-connection-reveals-the-need-to-prioritize-science/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204110913%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D6048%26cropY1%3D306%26cropY2%3D3707", "publishedAt": "2020-02-29T14:31:26Z", "content": "As a leader within the field of atmospheric and related sciences, I spend a great deal of time thinking about ways to improve weather prediction, messaging, and preparation for inevitable hazards. Over the past several decades, the weather enterprise (federal… [+10720 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus: Qatar reports first case of COVID-2019, gulf countries to cut links with Iran", "description": "According to the World Health Organization’s latest situation report, five new member states have reported cases of COVID-2019. These are Belarus, Lithuania, Netherlands, New Zealand, and Nigeria.", "url": "https://indianexpress.com/article/world/coronavirus-qatar-reports-first-case-of-covid-2019-gulf-countries-to-cut-links-with-iran/", "urlToImage": "https://images.indianexpress.com/2020/02/coronavirus-47.jpg?w=759", "publishedAt": "2020-02-29T14:33:29Z", "content": "A worker wears a face mask to spray disinfectant as a precaution against the coronavirus at a shopping street in Seoul, South Korea.  (AP Photo)Qatar’s health ministry reported on Saturday the first case of coronavirus infection in the country. The patient is… [+6265 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Azerbaijan closes border with Iran over coronavirus concerns", "description": "Azerbaijan said on Saturday it had closed its border with Iran for two weeks to prevent the spread of coronavirus, after the death toll in Iran rose to 43, the highest number outside of China.", "url": "https://www.reuters.com/article/us-china-health-iran-azerbaijan-idUSKBN20N0MY", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-29T14:32:06Z", "content": "BAKU (Reuters) - Azerbaijan said on Saturday it had closed its border with Iran for two weeks to prevent the spread of coronavirus, after the death toll in Iran rose to 43, the highest number outside of China. \r\nIran is at the epicenter of the outbreak in the… [+841 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Syed Raza Hassan", "title": "Pakistan confirms two coronavirus cases, brings total to four", "description": "Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country.", "url": "https://www.reuters.com/article/us-china-health-pakistan-idUSKBN20N0N2", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200229&t=2&i=1496982172&w=1200&r=LYNXMPEG1S0I4", "publishedAt": "2020-02-29T14:33:00Z", "content": "KARACHI, Pakistan (Reuters) - Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country. \r\n“We have received reports of two more posi… [+342 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "Shanghai lab that first sequenced coronavirus genome shut down", "description": "It was not clear whether the closure was related to the publishing of the sequencing data before the authorities", "url": "https://www.thehindu.com/sci-tech/science/shanghai-lab-that-first-sequenced-coronavirus-genome-shut-down/article30951570.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/gw6ux7/article30951568.ece/ALTERNATES/LANDSCAPE_615/01TH-SCICHINA", "publishedAt": "2020-02-29T14:15:39Z", "content": "A Shanghai-based lab Shanghai Public Health Clinical Center &amp; School of Public Health at Fudan University which was the first to sequence the whole genome of the novel coronavirus (SARS-CoV-2) and publicly share the data on January 11 was shut down on Jan… [+2568 chars]"}, {"source": {"id": null, "name": "Amny.com"}, "author": null, "title": "New suspected case of coronavirus under investigation in NYC - amNY", "description": "New suspected case of coronavirus under investigation in NYC amNY Coronavirus News: States to begin tests; 1 self-quarantines, another being evaluated for COVID-19 in New York City WABC-TV New York State's coronavirus test approved by FDA WKBW-TV De Blasio Ha…", "url": "https://www.amny.com/new-york/new-suspected-case-of-coronavirus-under-investigation-in-nyc/", "urlToImage": null, "publishedAt": "2020-02-29T14:19:56Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "William Pesek, Contributor, William Pesek, Contributor https://www.forbes.com/sites/williampesek/", "title": "How Coronavirus May Bring China’s Debt Pile To The Global Economy", "description": "When temperatures fall and face masks come off, the global economy will confront a China that’s frailer and more systemically risky than before.", "url": "https://www.forbes.com/sites/williampesek/2020/02/29/how-coronavirus-may-bring-chinas-debt-pile-to-the-global-economy/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e58eaaad378190007f484b5%2F960x0.jpg", "publishedAt": "2020-02-29T14:30:00Z", "content": "Passengers wearing protective face masks travel on the subway in Shanghai on February 25, 2020. \r\nNOEL CELIS/AFP via Getty Images\r\nAmid surging uncertainty about the coronavirus, one thing seems clear: China will report that its economy grew close to 6% in 20… [+8468 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Major Counter-Strike tournament is eerily quiet without a crowd", "description": "A major Counter-Strike: Global Offensive tournament forced to go ahead without a crowd due to fears over Coronavirus has pulled in a massive live audience online. IEM Katowice, ongoing at the time of this article's publication, is being played without a crowd…", "url": "https://www.eurogamer.net/articles/2020-02-29-major-counter-strike-tournament-is-eerily-quiet-without-a-crowd", "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2020/articles/2020-02-29-14-47/-1582987672721.jpg/EG11/resize/1200x-1/-1582987672721.jpg", "publishedAt": "2020-02-29T14:51:00Z", "content": "A major Counter-Strike: Global Offensive tournament forced to go ahead without a crowd due to fears over Coronavirus has pulled in a massive live audience online.\r\nIEM Katowice, ongoing at the time of this article's publication, is being played without a crow… [+1609 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Paris half-marathon canceled because of coronavirus", "description": "The Paris half-marathon has been canceled because of the spread of a coronavirus epidemic in the country", "url": "https://www.foxsports.com/other/story/paris-half-marathon-canceled-because-of-coronavirus-022920", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-02-29T15:06:40Z", "content": "PARIS (AP) — The Paris half-marathon has been canceled because of the spread of a coronavirus epidemic in the country. \r\nHealth minister Olivier Veran announced the move on Saturday as the French government also decided to ban all indoor public gatherings of … [+373 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Chris Enloe", "title": "American with coronavirus speaks out for first time, shares advice that has everyone talking", "description": "Carl Goldman, one of the Americans who contracted the coronavirus while quarantined on the cruise ship Diamond Princess, is speaking out about his experience with the disease. Despite the severe stock market downturn this week over fears coronavirus could tri…", "url": "https://www.theblaze.com/news/american-with-coronavirus-speaks-out-for-first-time-shares-advice-that-has-everyone-talking", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgzNjE2OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYzNzYxNDk3Nn0.sfr6F9F3W3Jy5cBx35wcrD7_vWrzgjeFryMiD7SWwko/img.jpg?width=1200&coordinates=0%2C85%2C0%2C85&height=600", "publishedAt": "2020-02-29T14:56:15Z", "content": "Carl Goldman, one of the Americans who contracted the coronavirus while quarantined on the cruise ship Diamond Princess, is speaking out about his experience with the disease.\r\nDespite the severe stock market downturn this week over fears coronavirus could tr… [+3075 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jon Levine", "title": "Pope Francis cancels third day of events amid mysterious illness", "description": "His absence — the longest sick leave of his papacy — comes as coronavirus sweeps Italy.", "url": "https://nypost.com/2020/02/29/pope-francis-cancels-third-day-of-events-amid-mysterious-illness/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/pope-francis-ill-for-third-day.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T14:15:10Z", "content": "Pope Francis has canceled a third day of scheduled events to recuperate from an undisclosed illness.\r\nThe 83-year-old pontiff will skip two official audiences at the Apostolic Palace. One would have been with a team of bioethicists and another with the Cathol… [+821 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "New York Post", "title": "Democrats Spread False Information About Coronavirus Threat", "description": "Democrats Spread False Information About Coronavirus Threat | RealClearPolitics", "url": "https://www.realclearpolitics.com/2020/02/29/democrats_spread_false_information_about_coronavirus_threat_503007.html", "urlToImage": null, "publishedAt": "2020-02-29T14:34:02Z", "content": "In a clear sign that they're not truly worried about the COVID-19 threat, many Democrats are using it as another club to hit President Trump — facts be damned. At Tuesday's debate, Mike Bloomberg s…\r\nRead Full Article »"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "SF Chronicle", "title": "Mixed Messages, Missing Strategy Hamper Coronavirus Response", "description": "Mixed Messages, Missing Strategy Hamper Coronavirus Response | RealClearPolitics", "url": "https://www.realclearpolitics.com/2020/02/29/mixed_messages_missing_strategy_hamper_coronavirus_response_503046.html", "urlToImage": null, "publishedAt": "2020-02-29T14:34:05Z", "content": "Stopping the contagion will take substantive plans from the Trump administration, not feeble assurances.\r\nRead Full Article »"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "Coronavirus could survive up to 9 days outside the body, study says", "description": "The current coronavirus could survive up to nine days outside the human body if it proves as resilient as previous strains, according to researchers studying past outbreaks. Cold, low-humidity environments are ideal for the disease, an analysis of 22 former c…", "url": "https://nypost.com/2020/02/29/coronavirus-could-survive-up-to-9-days-outside-the-body-study-says/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/virus-could-survive-9-days-on-objects-if-as-resilient-as-past-strains.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T15:05:36Z", "content": "The current coronavirus could survive up to nine days outside the human body if it proves as resilient as previous strains, according to researchers studying past outbreaks.\r\nCold, low-humidity environments are ideal for the disease, an analysis of 22 former … [+1038 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "Jon Delano", "title": "'Empty Shelves In TARGET, WALMART Early As April'...", "description": "'Empty Shelves In TARGET, WALMART Early As April'... (Top headline, 12th story, link ) Related stories: FAUCI TELLS LAWMAKERS THERE WILL BE MANY MORE INFECTED... Testing under scrutiny after delays and questions over effectiveness... Missteps at CDC... Lawsui…", "url": "https://pittsburgh.cbslocal.com/2020/02/28/chinese-products-shortage-coronavirus/", "urlToImage": "https://pittsburgh.cbslocal.com/wp-content/uploads/sites/15909642/2020/02/made-in-china.jpg?w=1024", "publishedAt": "2020-02-29T14:37:36Z", "content": "PITTSBURGH (KDKA) – The label “Made in China” is more common on store shelves than “Made in America.”\r\nBut that’s about to change.\r\nLiterally, empty shelves in Target and Walmart as early as April, predicts David Iwinski, a local China business consultant who… [+1352 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Dan Gallagher, Jacky Wong", "title": "Tech’s Coronavirus Workarounds Have Their Limits - Wall Street Journal", "description": "Technology has changed the world since the last major outbreak, but the new workarounds only go so far", "url": "https://www.wsj.com/articles/techs-coronavirus-workarounds-have-their-limits-11582988400", "urlToImage": "https://images.wsj.net/im-148304/social", "publishedAt": "2020-02-29T15:00:00Z", "content": "This is the fourth column in a five-part Heard on the Street series about the market and economic impact of the coronavirus epidemic. \r\nTechnology has changed the world since the last major global virus scare, for better and for worse.\r\nConsider the state of … [+86 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Richard Lawler", "title": "The Morning After: The Galaxy S20 Ultra comes up short", "description": "Hey, good morning! You look fabulous. 5G is here, and to be honest -- I don't get it. I lived through the 4G wars with LTE vs. WiMax, and before that, it was the bad old days of HSPA+, EV-DO and Edge... but now I can't tell mmWave from mid-band. Luckily, Chri…", "url": "https://www.engadget.com/2020-02-29-s20-ultra-morning-after.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-29T14:25:00Z", "content": "Hey, good morning! You look fabulous.\r\n5G is here, and to be honest -- I don't get it. I lived through the 4G wars with LTE vs. WiMax, and before that, it was the bad old days of HSPA+, EV-DO and Edge... but now I can't tell mmWave from mid-band. Luckily, Chr… [+2334 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Gene Myers, NorthJersey", "title": "How do you talk to children about coronavirus? Stay honest and simple to avoid anxiety.", "description": "As health experts throughout the area prepare for the arrival of the coronavirus, how should adults talk about the potential outbreak with children?", "url": "https://news.yahoo.com/talk-children-coronavirus-stay-honest-144010089.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8lNl6Vyd0oR1ZTpgvZsihA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/1kUT8r9qaLuRgDUug3v9sA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/33cb2888919546922bc61839125f48a9", "publishedAt": "2020-02-29T14:40:10Z", "content": "BERGEN, N.J. Be careful what you say around children, as anyone who has any or works with them knows they hear everything.\r\nLately, much of what they are overhearing is about coronavirus. \r\nThe talk has been alarming and scary. People wearing masks, the numbe… [+5549 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "RFI", "title": "South Korea virus cases surge as WHO sounds maximum alert - RFI", "description": "South Korea virus cases surge as WHO sounds maximum alert RFI Coronavirus outbreak update: List of countries affected by COVID-19 Business Insider India South Korea coronavirus cases surge to 2,337 India Today Coronavirus: Wall Street reports worst week since…", "url": "http://www.rfi.fr/en/wires/20200229-south-korea-virus-cases-surge-who-sounds-maximum-alert-0", "urlToImage": "http://s.rfi.fr/media/display/3b720d0e-5b04-11ea-ac87-005056bf87d6/w:1240/p:16x9/5f7632a27927d80e503f633a6f5d058f5b518e14.jpg", "publishedAt": "2020-02-29T14:57:00Z", "content": "Seoul (AFP)\r\nSouth Korea reported its biggest surge in new coronavirus cases on Saturday as concerns grew of a possible epidemic in the United States and the World Health Organization raised its risk alert to its highest level.\r\nThe virus has rapidly spread a… [+4728 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "As coronavirus outbreak looms, what should you do?", "description": "As panic over the coronavirus spreads through the country and the globe, people search for answers about what to look out for and what to do to stay healthy. Dr. David Agus joins “CBS This Morning: Saturday” to provide insights and break down health officials…", "url": "https://www.cbsnews.com/video/as-coronavirus-outbreak-looms-what-should-you-do/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/29/a265b210-456b-4835-9ff5-ea3be0e02c5f/thumbnail/1200x630/e6a0794b610d980ef0df2a8d0f1fb4ae/0229-satmo-coronaviruschat-agus-2038566-640x360.jpg", "publishedAt": "2020-02-29T14:14:54Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Velshi: The damage done to our trust in this government over coronavirus", "description": "MSNBC’s Ali Velshi discusses why the trust Americans have in our government and it’s handling of the coronavirus may take a long time to heal.", "url": "https://www.msnbc.com/ali-velshi/watch/velshi-the-damage-done-to-our-trust-in-this-government-over-coronavirus-79690821843", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_velshi_pencecoronavirus_200229_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T14:54:08Z", "content": null}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Joan McCarter", "title": "No Joke: Trump Administration Considers Tax Cuts To Combat Coronavirus Impact", "description": "Will more tax cuts do anything to help with a possible pandemic or to reassure the markets that everything is okay? Absolutely not. But if impeached president Donald Trump thinks that maybe they'll keep his approval numbers from tanking, then the White House …", "url": "https://crooksandliars.com/2020/02/no-joke-trump-administration-considers-tax", "urlToImage": "https://crooksandliars.com/files/primary_image/20/02/gettyimages-1208916237.jpg", "publishedAt": "2020-02-29T15:06:46Z", "content": "Will more tax cuts do anything to help with a possible pandemic or to reassure the markets that everything is okay? Absolutely not. But if impeached president Donald Trump thinks that maybe they'll keep his approval numbers from tanking, then the White House … [+2890 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus continues to spread as disease rattles global economy", "description": "Global health officials say no country can hope to be spared, and all must be ready to combat outbreaks.", "url": "https://www.cbsnews.com/live-updates/coronavirus-outbreak-death-toll-infections-latest-news-updates-2020-02-29/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/29/24b47274-aab4-4061-b1f1-fb0f78d4be3b/thumbnail/1200x630/9f6aac595f53ac8f2930a80f5e1d0e7c/gettyimages-1204087302.jpg", "publishedAt": "2020-02-29T14:41:08Z", "content": "The World Health Organization says the risk of the new coronavirus expanding worldwide is now \"very high.\" New cases of the disease it causes, COVID-19, are continuing to emerge globally. \r\nSo far, 16 cases have been detected and confirmed in the United State… [+1632 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "France bans gatherings of more than 5,000 due to coronavirus", "description": "The French government on Saturday put a temporary ban on public gatherings with more than 5,000 people due to the coronavirus outbreak, as France reported 16 new cases. Health Minister Olivier Veran said after a special cabinet meeting that the number of conf…", "url": "https://news.yahoo.com/france-bans-gatherings-more-5-141415965.html", "urlToImage": null, "publishedAt": "2020-02-29T14:14:15Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Thomas Moore", "title": "Coronavirus: First UK infection hikes risk of domestic COVID-19 outbreak - Sky News", "description": "Coronavirus: First UK infection hikes risk of domestic COVID-19 outbreak Sky News Radiology Lessons for Coronavirus From the SARS and MERS Epidemics Imaging Technology News How to protect yourself against COVID-19 World Health Organization (WHO) Will Warmer W…", "url": "https://news.sky.com/story/coronavirus-first-uk-infection-hikes-risk-of-domestic-covid-19-outbreak-11946166", "urlToImage": "https://e3.365dm.com/20/02/1600x900/skynews-coronavirus-john-radcliffe_4934373.jpg?20200229125456", "publishedAt": "2020-02-29T15:05:34Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (David Jagielski)", "title": "Like Dividends? I Bet You'll Love These 3 Stocks", "description": "These dividend stocks can be great buys for a variety of investors.", "url": "https://www.fool.com/investing/2020/02/29/like-dividends-i-bet-youll-love-these-3-stocks.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560288/cash-falling-from-the-sky-overtop-of-a-person.jpg", "publishedAt": "2020-02-29T15:04:00Z", "content": "Dividend stocks can be a portfolio's best friend. They can help boost good returns and prevent or offset losses during times like these, when the markets have turned red. Having some dividend stocks in your portfolio is a good way to protect yourself against … [+5048 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "The Associated Press", "title": "Paris half-marathon canceled because of coronavirus", "description": "PARIS (AP) — The Paris half-marathon has been canceled because of the spread of a coronavirus epidemic in the country. Health minister Olivier Veran announced the move on Saturday as the French government also decided to ban all indoor public gatherings of mo…", "url": "https://www.seattletimes.com/sports/paris-half-marathon-canceled-because-of-coronavirus/", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2020-02-29T15:06:40Z", "content": "PARIS (AP) The Paris half-marathon has been canceled because of the spread of a coronavirus epidemic in the country. \r\nHealth minister Olivier Veran announced the move on Saturday as the French government also decided to ban all indoor public gatherings of mo… [+457 chars]"}, {"source": {"id": null, "name": "Powerlineblog.com"}, "author": "John Hinderaker", "title": "Is Coronavirus a Hoax?", "description": "(John Hinderaker) Democratic Party media are claiming that last night in South Carolina, President Trump said that the coronavirus epidemic is a hoax. Politico headlines: The Telegraph, by no means Britain’s most left-wing newspaper, headlines: The talking po…", "url": "http://www.powerlineblog.com/archives/2020/02/is-coronavirus-a-hoax.php", "urlToImage": "https://www.powerlineblog.com/ed-assets/2020/02/image.jpg", "publishedAt": "2020-02-29T14:43:44Z", "content": "Democratic Party media are claiming that last night in South Carolina, President Trump said that the coronavirus epidemic is a hoax. Politico headlines:\r\nThe Telegraph, by no means Britain’s most left-wing newspaper, headlines:\r\nThe talking point has been tak… [+1391 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Connor Perrett)", "title": "At least two dozen US police departments have spread misinformation linking coronavirus to meth", "description": "\"This attempt, although a long shot, still had some possibility behind it,\" one police department said in response to criticism.", "url": "https://news.yahoo.com/least-two-dozen-us-police-150227826.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aVNnGu3mcc1OJovOtF2nQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/tOe3.bCQWaNsApFXj5O5bw--~B/aD0xMzA1O3c9MTc0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/2f2154eee245b8352e39a6f6af88dfe9", "publishedAt": "2020-02-29T15:02:27Z", "content": "Kaylen Smith demonstrates how to don the protective gear that must be worn when dealing with patients with an infectious disease.\r\nErin Clark/The Boston Globe via Getty Images\r\n<ul><li>At least two dozen police departments in the US have shared misinformation… [+4947 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "As coronavirus spreads, world’s richest lose $444 bn after hellish week for markets - Hindustan Times", "description": "As coronavirus spreads, world’s richest lose $444 bn after hellish week for markets Hindustan Times Top 10 richest people in the world – Know who they are Business Insider India This Week’s Biggest Losers: From Bezos To Zuckerberg, These 10 Billionaires Lost …", "url": "https://www.hindustantimes.com/world-news/as-coronavirus-spreads-world-s-richest-lose-444-bn-after-hellish-week-for-markets/story-FGoxC6Ji6IVLqWT3oM2QdM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/02/29/Pictures/jeff-bezos_11e0bdd4-5b02-11ea-84e7-49b76ebb63b1.jpg", "publishedAt": "2020-02-29T14:48:00Z", "content": "Last week was an expensive one for most investors, even for billionaires.\r\nThe combined fortunes of the world’s 500 richest people fell by $444 billion as the coronavirus continued to spread -- and spread fear -- rattling equity markets worldwide. The Dow Jon… [+1471 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "DUMB: Las Vegas Travel Is Down So Caesars Is Raising Resort Fees", "description": "In August the CEO of Caesars declared that resort fees could be the straw that breaks the camel's back for Las Vegas lodging. Yet just two months later Caesars raised resort fees at Caesar’s Palace, Nobu and Rio. Now with visitor arrivals to the U.S. under pr…", "url": "https://viewfromthewing.com/dumb-las-vegas-travel-is-down-so-caesars-is-raising-resort-fees/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2020/02/harrahs.jpg", "publishedAt": "2020-02-29T15:04:18Z", "content": null}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Phil West", "title": "Juventus vs. Inter Milan live stream postponed due to coronavirus concerns", "description": "A Juventus win would move the defending champions closer to the title, but an Inter Milan win would bring some new intrigue. The post Juventus vs. Inter Milan live stream postponed due to coronavirus concerns appeared first on The Daily Dot.", "url": "https://www.dailydot.com/upstream/how-to-stream-juventus-vs-inter-milan-postponed-coronavirus-2019-20-serie-a-matchday-26/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/02/romelu-lukaku-how-to-stream-juventus-vs-inter-milan-live.jpg", "publishedAt": "2020-02-29T14:20:00Z", "content": "The originally-scheduled Juventus vs. Inter Milan match for Sunday has been postponed to May 13 due to coronavirus concerns. \r\nJuventus vs. Inter Milan\r\n<ul><li>When: Wednesday, May 13, time to be announced</li><li>Where: Allianz Stadium in Turin, Italy</li><… [+3418 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Phil West", "title": "Juventus vs. Inter Milan live stream postponed to May 13 due to coronavirus concerns", "description": "A Juventus win would move the defending champions closer to the title, but an Inter Milan win would bring some new intrigue. The post Juventus vs. Inter Milan live stream postponed to May 13 due to coronavirus concerns appeared first on The Daily Dot.", "url": "https://www.dailydot.com/upstream/how-to-stream-juventus-vs-inter-milan-live-2019-20-serie-a-matchday-26/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/02/romelu-lukaku-how-to-stream-juventus-vs-inter-milan-live.jpg", "publishedAt": "2020-02-29T14:20:00Z", "content": "The originally-scheduled Juventus vs. Inter Milan match for Sunday has been postponed to May 13 due to coronavirus concerns. \r\nJuventus vs. Inter Milan\r\n<ul><li>When: Wednesday, May 13, time to be announced</li><li>Where: Allianz Stadium in Turin, Italy</li><… [+3423 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: China focusing on ensuring full recovery of discharged patients - Global News", "description": "Coronavirus outbreak: China focusing on ensuring full recovery of discharged patients Global News France Limits Events; Xi Said to Delay Japan Trip: Virus Update Bloomberg Coronavirus cases now higher globally than inside China CBC News: The National Clinical…", "url": "https://www.youtube.com/watch?v=TgNGGIobEak", "urlToImage": null, "publishedAt": "2020-02-29T14:16:51Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "101greatgoals.com"}, "author": "Conor Laird", "title": "Official: 5 Serie A games, including Juventus vs Inter, postponed due to coronavirus fears", "description": "As confirmed by Serie A officials this afternoon, 5 Italian top-flight fixtures, including the crunch clash between Juventus and Inter Milan, have been postponed this weekend, due to fears over the spread of the coronavirus. Juve vs Inter Tomorrow evening was…", "url": "https://www.101greatgoals.com/news/official-5-serie-a-games-including-juventus-vs-inter-postponed-due-to-coronavirus-fears/", "urlToImage": "https://www.101greatgoals.com/wp-content/uploads/2019/03/GettyImages-1135389504.jpg", "publishedAt": "2020-02-29T14:58:24Z", "content": "As confirmed by Serie A officials this afternoon, 5 Italian top-flight fixtures, including the crunch clash between Juventus and Inter Milan, have been postponed this weekend, due to fears over the spread of the coronavirus.\r\nJuve vs Inter\r\nTomorrow evening w… [+2396 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "MARI YAMAGUCHI", "title": "Japan’s leader announces $2.5B package to help fight virus", "description": "TOKYO (AP) — Japanese Prime Minister Shinzo Abe on Saturday announced a 270 billion yen ($2.5 billion) emergency economic package to help fight the coronavirus as he sought the public’s support for his government’s fight against the outbreak. Abe said at a ne…", "url": "https://www.seattletimes.com/business/japans-leader-announces-2-5b-package-to-help-fight-virus/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-bbe461add26240e116b3e7210044eaeaVirus_Outbreak_Japan_60111-1200x630.jpg", "publishedAt": "2020-02-29T14:42:22Z", "content": "TOKYO (AP) Japanese Prime Minister Shinzo Abe on Saturday announced a 270 billion yen ($2.5 billion) emergency economic package to help fight the coronavirus as he sought the public’s support for his government’s fight against the outbreak.\r\nAbe said at a new… [+2341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Trump to rally conservative base at CPAC amid escalating coronavirus concerns", "description": "President Donald Trump will likely use a speech Saturday at the Conservative Political Action Conference held near Washington to rally his base ahead of the election amid concerns about the growing coronavirus health crisis and fears about its effect on the e…", "url": "https://www.cnn.com/2020/02/29/politics/donald-trump-cpac-2020/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228074701-01-trump-coronavirus-presser-0226-super-tease.jpg", "publishedAt": "2020-02-29T14:23:43Z", "content": "(CNN)President Donald Trump will likely use a speech Saturday at the Conservative Political Action Conference held near Washington to rally his base ahead of the election amid concerns about the growing coronavirus health crisis and fears about its effect on … [+1601 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": "Ivan Oransky", "title": "Weekend reads: A big change in China; revealing a paper mill; plagiarism detection put to the test", "description": "Before we present this week’s Weekend Reads, a question: Do you enjoy our weekly roundup? If so, we could really use your help. Would you consider a tax-deductible donation to support Weekend Reads, and our daily work? Thanks in advance. The week at Retractio…", "url": "https://retractionwatch.com/2020/02/29/weekend-reads-a-big-change-in-china-revealing-a-paper-mill-plagiarism-detection-put-to-the-test/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2013/11/books.jpg", "publishedAt": "2020-02-29T14:40:39Z", "content": "Before we present this weeks Weekend Reads, a question: Do you enjoy our weekly roundup? If so, we could really use your help. Would you consider a tax-deductible donation to support Weekend Reads, and our daily work? Thanks in advance.\r\nThe week at Retractio… [+2893 chars]"}, {"source": {"id": null, "name": "Theeastafrican.co.ke"}, "author": null, "title": "Jumia remodels business as losses lead to share price tumble on NYSE - The East African", "description": "Jumia remodels business as losses lead to share price tumble on NYSE The East African", "url": "https://www.theeastafrican.co.ke/business/Jumia-remodels-business/2560-5473710-7en81cz/index.html", "urlToImage": "https://www.theeastafrican.co.ke/image/view/-/5473728/medRes/2569688/-/8nt36rz/-/jumia_pic.jpg", "publishedAt": "2020-02-29T14:22:31Z", "content": "By NJIRAINI MUCHIRAMore by this Author\r\nE-commerce firm Jumia plans to reorganise its business after operational losses dampened the excitement that surrounded its listing on the New York Stock Exchange a year ago.\r\nOn Tuesday, the firm released fourth quarte… [+4590 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Cherry Reynard, Contributor, Cherry Reynard, Contributor https://www.forbes.com/sites/cherryreynard/", "title": "Who Has Done Best In The Current Market Scourge?", "description": "Prior to the outbreak of Coronavirus, there was a theoretical question over which assets would prove defensive in the next downturn.", "url": "https://www.forbes.com/sites/cherryreynard/2020/02/29/who-has-done-best-in-the-current-market-scourge/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2Fb604fc1926344d128faab921baa5e5f5%2F960x0.jpg", "publishedAt": "2020-02-29T15:06:33Z", "content": "Chinese investors look at a stock price billboard at a private security company in Shanghai, China. ... [+] (AP Photo)\r\nASSOCIATED PRESS\r\nPrior to the outbreak of Coronavirus, there was a theoretical question over which assets would prove defensive in the nex… [+7139 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "MARI YAMAGUCHI", "title": "Japan's leader announces $2.5B package to help fight virus", "description": "Japanese Prime Minister Shinzo Abe on Saturday announced a 270 billion yen ($2.5 billion) emergency economic package to help fight the coronavirus as he sought the public's support for his government's fight against the outbreak. Abe said at a news conference…", "url": "https://news.yahoo.com/japans-leader-announces-2-5b-144220746.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/e0cJTTUlgiXzJ4Ru0qnu8w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/J9HL6N2Rx4_qgsor8AEezA--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/5faf2f6f669dbc65c46d6441b6af0bb1", "publishedAt": "2020-02-29T14:42:20Z", "content": "TOKYO (AP) Japanese Prime Minister Shinzo Abe on Saturday announced a 270 billion yen ($2.5 billion) emergency economic package to help fight the coronavirus as he sought the public's support for his government's fight against the outbreak.\r\nAbe said at a new… [+2337 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Clashes erupt...", "description": "Clashes erupt... (Third column, 11th story, link ) Related stories: Erdogan vows to keep doors open for Syrian refugees heading for Europe... 18,000 cross Greek border...", "url": "https://news.trust.org/item/20200229124626-vkh6s", "urlToImage": "https://d2sh4fq2xsdeg9.cloudfront.net/contentAsset/image/c57081c6-cd7f-42a8-95be-72a9380b1929/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2020-02-29T15:10:40Z", "content": "* Greece says migrants will not be let in\r\n* Says attempt to breach its borders was 'organised'\r\n* Turkey says thousands have left country (Adds detail, includes Bulgaria, colour)\r\nBy Lefteris Papadimas\r\nKASTANIES, Greece, Feb 29 (Reuters) - Greek police fire… [+4027 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Clark Schultz", "title": "Stocks to watch in the week ahead", "description": "<ul><li>Investors prep for another flood of coronavirus developments, an OPEC+ meeting and earnings reports from retailers Target, Kroger and Nordstrom.</li><li>Read Stocks To Watch: Time For Coronavirus Offense Or Defense?</li></ul>", "url": "https://seekingalpha.com/news/3547238-stocks-to-watch-in-week-ahead", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-29T15:05:58Z", "content": "Investors prep for another flood of coronavirus developments, an OPEC+ meeting and earnings reports from retailers Target, Kroger and Nordstrom.\r\nRead Stocks To Watch: Time For Coronavirus Offense Or Defense?"}, {"source": {"id": null, "name": "Playstationlifestyle.net"}, "author": "Zarmena Khan", "title": "As GDC Is Postponed Due to Coronavirus, E3 Organizer Is Monitoring the Situation and Capcom Canceled Events", "description": "Square Enix canceled more events. The post As GDC Is Postponed Due to Coronavirus, E3 Organizer Is Monitoring the Situation and Capcom Canceled Events appeared first on PlayStation LifeStyle.", "url": "https://www.playstationlifestyle.net/2020/02/29/games-industry-coronavirus-impact/", "urlToImage": "https://cdn1-www.playstationlifestyle.net/assets/uploads/2019/06/e3-2020-dates.jpg", "publishedAt": "2020-02-29T14:45:09Z", "content": "After a number of companies pulled out of this years Game Developers Conference due to Coronavirus concerns, GDC organizer announced that it fully intends to host an event later in the summer. However, it has to consult its partners before a program is finali… [+1385 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Clark Schultz", "title": "New coronavirus cases in Oregon and Washington", "description": "<ul><li>The CDC says <a href=\"https://www.nbcnews.com/news/us-news/number-coronavirus-cases-unknown-source-growing-u-s-n1145781\" target=\"_blank\">two</a> new cases of the coronavirus in the U.S. are not related directly to travel to China.</li><li>A new case w…", "url": "https://seekingalpha.com/news/3547237-new-coronavirus-cases-in-oregon-and-washington", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-29T14:59:04Z", "content": "The CDC says two new cases of the coronavirus in the U.S. are not related directly to travel to China.\r\nA new case was reported in Oregon and the state of Washington.\r\nThere are four cases total in the U.S. of community spreading of coronavirus.\r\nYesterday, t… [+297 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Don Reisinger", "title": "Health questions swirled around Apple this week, from coronavirus to a heart study partnership", "description": "Apple CEO Tim Cook thinks Coronavirus is under control in China, but it's still causing plenty of speculation about the future of the iPhone. Meanwhile, Apple is holding another health study and had its shareholder meeting this week.", "url": "https://fortune.com/2020/02/29/apple-news-coronavirus-iphone/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/02/GettyImages-1200789214-e1582926466177.jpg?resize=1200,600", "publishedAt": "2020-02-29T14:30:00Z", "content": null}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "David O Royal", "title": "Fear grips Ogun residents over outbreak of Coronavirus", "description": "By James Ogunnaike ABEOKUTA – Residents of Ewekoro, Abeokuta and adjourning communities in Ogun State are now living with fear over the outbreak of the deadly disease, Coronavirus, which was confirmed yesterday by medical personnel. According to some people w…", "url": "https://www.vanguardngr.com/2020/02/fear-grips-ogun-residents-over-outbreak-of-coronavirus/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/COVID-19_Coronavirus_WHO.jpg?fit=992%2C558&ssl=1", "publishedAt": "2020-02-29T14:22:44Z", "content": "By James Ogunnaike\r\nABEOKUTA – Residents of Ewekoro, Abeokuta and adjourning communities in Ogun State are now living with fear over the outbreak of the deadly disease, Coronavirus, which was confirmed yesterday by medical personnel.\r\nAccording to some people… [+3946 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Bertha Coombs", "title": "Health care stocks see worst week in two decades", "description": "Part of investors' worries surround the uncertainty over the potential impact of a widespread Covid-19 outbreak in the United States. But that's not all that's worrying investors.", "url": "https://www.cnbc.com/2020/02/28/health-care-stocks-see-worst-week-in-two-decades.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106414665-1582844326296gettyimages-1203739611.jpeg?v=1582844438", "publishedAt": "2020-02-29T15:01:00Z", "content": "A man wears a facemask while pushing his shopping cart in Alhambra, California on February 27, 2020.\r\nThis week's market sell-off over coronavirus fears hit health insurance and hospital stocks especially hard. The S&amp;P 500 Managed Health Care sector had i… [+4655 chars]"}, {"source": {"id": null, "name": "247wallst.com"}, "author": "Jon C. Ogg", "title": "As China’s Manufacturing PMI Hits Record Lows, Coronavirus-Linked Recession Concerns Rising", "description": "China released its Purchasing Managers Index (PMI) for February and what was expected to be a very bad report showed an even worse reading.", "url": "https://247wallst.com/economy/2020/02/29/as-chinas-manufacturing-pmi-hits-record-lows-coronavirus-linked-recession-concerns-rising/", "urlToImage": "https://s2.wp.com/wp-content/themes/vip/247wallst/images/247-50x50.png", "publishedAt": "2020-02-29T14:49:42Z", "content": "It was no secret that Chinas economy was shut down for much of February. Manufacturing facilities, retail locations, public venues and offices were more or less closed for much of February due to Chinas efforts to contain the COVID-19 novel coronavirus. China… [+5355 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": "OdAdmin", "title": "WHO raises Novel Coronavirus threat assessment to highest level - Odisha Diary", "description": "WHO raises Novel Coronavirus threat assessment to highest level Odisha Diary Coronavirus: Deaths in Iran Rise to 54 as Global Outbreak Worsens News18 New virus: Over 86,000 infected globally, over 2,900 deaths Washington Post What Small Businesses Need to Kno…", "url": "https://orissadiary.com/who-raises-novel-coronavirus-threat-assessment-to-highest-level/", "urlToImage": "https://orissadiary.com/wp-content/uploads/2020/03/WHO_2.jpg", "publishedAt": "2020-02-29T14:11:37Z", "content": "The World Health Organization (WHO) has raised its global risk assessment of the novel coronavirus to its highest level at global level after the epidemic spread to sub-Saharan Africa and caused financial markets to plunge.\r\nWHO Director General Dr. Tedros sa… [+2384 chars]"}, {"source": {"id": null, "name": "Techpowerup.com"}, "author": "AleksandarK", "title": "Game Developers Conference gets Postponed due to COVID-19 Concerns", "description": "Game Developers Conference is perhaps one of the biggest organizations in the gaming industry, covering everything from gaming hardware to games themselves. This year's GDC event was planned to happen on March 16th, however, due to the Coronavirus COVID-19 co…", "url": "https://www.techpowerup.com/264341/game-developers-conference-gets-postponed-due-to-covid-19-concerns", "urlToImage": "https://www.techpowerup.com/img/uyMMbYJU1RVMEOQy.jpg", "publishedAt": "2020-02-29T15:01:33Z", "content": "Game Developers Conference is perhaps one of the biggest organizations in the gaming industry, covering everything from gaming hardware to games themselves. This year's GDC event was planned to happen on March 16th, however, due to the Coronavirus COVID-19 co… [+658 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Nwafor", "title": "Coronavirus: Italian man attempts escape, after suffering mosquito bites, heat", "description": "Irked by the alleged poor condition of the isolation room given to him, the forty-four (44) year-old Italian man, yesterday threatened to escape the centre. The post Coronavirus: Italian man attempts escape, after suffering mosquito bites, heat appeared first…", "url": "https://www.vanguardngr.com/2020/02/coronavirus-italian-man-attempts-escape-after-suffering-mosquito-bites-heat/", "urlToImage": null, "publishedAt": "2020-02-29T15:00:07Z", "content": "By Nwafor Sunday\r\nIrked by the alleged poor condition of the isolation room given to him, the forty-four (44) year-old Italian man, yesterday threatened to escape the centre.\r\nThe isolation centre located at the Mainland Hospital, Yaba, Lagos, was said to hav… [+1463 chars]"}, {"source": {"id": null, "name": "Investmentwatchblog.com"}, "author": "alexmark", "title": "House Democrat THREATENS Physical Violence Against Donald Trump Jr.", "description": null, "url": "https://www.investmentwatchblog.com/house-democrat-threatens-physical-violence-against-donald-trump-jr/", "urlToImage": null, "publishedAt": "2020-02-29T14:37:00Z", "content": "Rep. John Garamendi, D-Calif., appeared to threaten Donald Trump Jr., the presidents son, on Friday, warning that they better not be in close quarters or they could have a serious altercation.\r\nHe made those comments on MSNBC while discussing the coronavirus.… [+1109 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": null, "title": "French ban on gatherings of more than 5,000 people casts doubts over Ireland's Six Nations clash in Paris", "description": "Ireland's final Six Nations clash with France in Paris is in serious doubt after the French government today announced a ban on public gatherings of more than 5,000 people due to the coronavirus outbreak..", "url": "https://www.independent.ie/sport/rugby/six-nations/french-ban-on-gatherings-of-more-than-5000-people-casts-doubts-over-irelands-six-nations-clash-in-paris-39001959.html", "urlToImage": "https://www.independent.ie/incoming/a8f7e/34790056.ece/alternates/w700/styade44.jpg", "publishedAt": "2020-02-29T15:10:22Z", "content": "Ireland's final Six Nations clash with France in Paris is in serious doubt after the French government today announced a ban on public gatherings of more than 5,000 people due to the coronavirus outbreak.\r\nThe game - a potential Six Nations decider - is due t… [+965 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jon Levine", "title": "Politician apologizes for saying coronavirus caused by Chinese people eating ‘live mice’", "description": "An Italian politician has apologized for suggesting the coronavirus was caused by poor Chinese hygiene and cultural practices, including eating \"live mice.\"", "url": "https://nypost.com/2020/02/29/politician-apologizes-for-saying-coronavirus-caused-by-chinese-people-eating-live-mice/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/luca-zaia.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T14:49:10Z", "content": "An Italian politician has apologized for suggesting the coronavirus was caused by poor Chinese hygiene and cultural practices, including eating “live mice.”\r\nLuca Zaia, the governor of Veneto, made the remarks in a local television interview.\r\nThe hygiene tha… [+1242 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Doug Stanglin and Grace Hauck, USA TODAY", "title": "Coronavirus live updates: 4 unrelated cases in the West Coast, US issues level 3 advisory for Italy", "description": "The coronavirus outbreak continues to spread worldwide, a day after the World Health Organization increased its virus risk assessment to \"very high.&quo...", "url": "https://news.yahoo.com/coronavirus-live-updates-4-unrelated-133448422.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/SXxqLGf9ScWqzikdclCANg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xMjgw/https://s.yimg.com/uu/api/res/1.2/VbrNHfxnwPAGTOcvGcS_SQ--~B/aD0xMDgwO3c9MTA4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/26/5e56bc69de7e2726cc4de273/5e56bc6d0b566200019512bd_1080x1080_FES_v1.jpg", "publishedAt": "2020-02-29T14:41:58Z", "content": "Health officials in California, Oregon and Washington state reported four new apparent cases of the novel coronavirus, raising concerns that it is spreading through West Coast communities.\r\nAuthorities said three of the cases  an older Northern California wom… [+4621 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Stephen Bennett", "title": "French ban on gatherings of more than 5,000 people casts doubt over Ireland's Six Nations clash in Paris", "description": "Ireland's final Six Nations clash with France in Paris is in serious doubt after the French government today announced a ban on public gatherings of more than 5,000 people in \"a confined space\" due to the coronavirus outbreak.", "url": "https://www.independent.ie/sport/rugby/six-nations/french-ban-on-gatherings-of-more-than-5000-people-casts-doubt-over-irelands-six-nations-clash-in-paris-39001959.html", "urlToImage": "https://www.independent.ie/incoming/a8f7e/34790056.ece/alternates/w700/styade44.jpg", "publishedAt": "2020-02-29T15:10:22Z", "content": "Ireland's final Six Nations clash with France in Paris is in serious doubt after the French government today announced a ban on public gatherings of more than 5,000 people in \"a confined space\" due to the coronavirus outbreak.\r\nThe game - a potential Six Nati… [+1246 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Top news of the day: U.S. and Taliban sign deal to end America’s longest-running war, patient tested negative for COVID-19 dies in Kerala, and more", "description": "The major news headlines of the day, and more.", "url": "https://www.thehindu.com/news/top-news-of-february-29-2020-us-and-taliban-sign-deal-to-end-americas-longest-running-war-patient-tested-negative-for-covid-19-dies-in-kerala-and-more/article30951604.ece", "urlToImage": "https://www.thehindu.com/news/w3em3u/article30951603.ece/ALTERNATES/LANDSCAPE_615/QATARUNITEDSTATESAFGHANISTANPEACEDEAL1", "publishedAt": "2020-02-29T14:22:40Z", "content": "The United States and Taliban signed a peace agreement aimed at ending 18 years of conflict in Afghanistan, Americas longest-running war. According to the agreement, United States will begin withdrawing thousands of forces from Afghanistan. U.S. troop levels … [+2394 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Pallavi Aiyar", "title": "Japan’s Diamond Princess fiasco", "description": "The Abe government’s handling of coronavirus infections on a cruise ship is drawing criticism", "url": "https://www.thehindu.com/news/international/japans-diamond-princess-fiasco/article30951825.ece", "urlToImage": "https://www.thehindu.com/news/international/tkpnge/article30951815.ece/ALTERNATES/LANDSCAPE_615/0d3ec193", "publishedAt": "2020-02-29T14:50:08Z", "content": "For Shinzo Abes government, 2020 was meant to be the year the global spotlight on the Olympic Games revealed a resilient, even resurgent Japan. Instead, as the archipelago has emerged as one of the largest coronavirus-affected clusters outside China, its hand… [+4311 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Syed Raza Hassan", "title": "Pakistan confirms two more coronavirus cases, bringing total to four", "description": "Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country. \"We have received reports of two more positive cases of coronavirus, one h…", "url": "https://news.yahoo.com/pakistan-confirms-two-coronavirus-cases-143300750.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/VxvKiGNqyR1H0VE5HQ9jeQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/KRZnYB5ARiy0saKINSJhPw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/06d987bbe6cb1bcd69809d0b2f3b41ef", "publishedAt": "2020-02-29T14:33:00Z", "content": "By Syed Raza Hassan\r\nKARACHI, Pakistan (Reuters) - Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country.\r\n\"We have received repo… [+1345 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jack Hobbs", "title": "Designer face masks hit the runway at Paris Fashion Week", "description": "The new fashion trend this spring is … masks? Designer Marine Serre turned heads Friday at Paris Fashion Week with an unintentionally coronavirus-themed spring line: it featured designs with matching face masks, created well before the illness rocked the worl…", "url": "https://nypost.com/2020/02/29/designer-face-masks-hit-the-runway-at-paris-fashion-week/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/designer_facemasks.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T14:34:00Z", "content": "The new fashion trend this spring is … masks?\r\nDesigner Marine Serre turned heads Friday at Paris Fashion Week with an unintentionally coronavirus-themed spring line: it featured designs with matching face masks, created well before the illness rocked the wor… [+503 chars]"}, {"source": {"id": null, "name": "Investmentwatchblog.com"}, "author": "alexmark", "title": "Here’s Why I Don’t Really Trust the Official American Coronavirus Numbers", "description": null, "url": "https://www.investmentwatchblog.com/heres-why-i-dont-really-trust-the-official-american-coronavirus-numbers/", "urlToImage": null, "publishedAt": "2020-02-29T14:35:48Z", "content": "by Daisy Luther\r\nA lot of folks have distrusted the numbers coming out of China since the very beginning of the coronavirus outbreak. That uneasy feeling was justified when it was discovered that many patients werent being counted because they were never test… [+14300 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "newsfeeds@nzherald.co.nz", "title": "Australia records first coronavirus fatality", "description": "Australia has recorded its first coronavirus fatality as a man confirmed as COVID-19 positive has died in a Perth hospital. The as yet unnamed coronavirus victim was a 78-year-old from the infected cruise...", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12312930", "urlToImage": "https://www.nzherald.co.nz/resizer/P6_W2eVxuhp5tjJXtYjyD1k0bbw=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/CDPYFYYKVFAODEQ6VGVBGDWAWI.jpg", "publishedAt": "2020-02-29T14:31:39Z", "content": "Australia has recorded its first coronavirus fatality as a man confirmed as COVID-19 positive has died in a Perth hospital.\r\n The as yet unnamed coronavirus victim was a 78-year-old from the infected cruise ship Diamond Princess who died in the early hours of… [+3098 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Running with Miles", "title": "Hurry! The Apple AirPods Pro Back in Stock and On Sale", "description": "The Apple AirPods Pro are back in stock and on sale again! If you want them, better grab them quickly! The post Hurry! The Apple AirPods Pro Back in Stock and On Sale appeared first on Running with Miles.", "url": "https://runningwithmiles.boardingarea.com/apple-airpods-pro-in-stock-on-sale/", "urlToImage": "https://runningwithmiles.boardingarea.com/wp-content/uploads/2019/11/Screen-Shot-2019-11-23-at-9.27.25-PM.png", "publishedAt": "2020-02-29T14:19:01Z", "content": "The Apple AirPods Pro are back in stock and on sale again! If you want them, better grab them quickly!I dont think even Apple knew how popular their new AirPods Pro would be when they released them! Resellers have had them go in and out of stock for a while o… [+1270 chars]"}, {"source": {"id": null, "name": "Bitcoinist.com"}, "author": "Christine Vasileva", "title": "Did Stock Markets Lose Value Worth 694,573,873 Bitcoins this Week?", "description": "After the shock of the coronavirus, stock markets turned down, erasing $6 trillion of value within a week. Here is how this value compares with Bitcoin. Stock Markets Still Make Bitcoin Valuations Look Insignificant The stock markets, a centuries-old and high…", "url": "https://bitcoinist.com/stock-market-erased-33-times-total-bitcoin-supply/", "urlToImage": "https://bitcoinist.com/wp-content/uploads/2020/02/29-Feb-4-scaled-e1582987948501-1920x1315.jpg", "publishedAt": "2020-02-29T15:00:03Z", "content": "After the shock of the coronavirus, stock markets turned down, erasing $6 trillion of value within a week. Here is how this value compares with Bitcoin.\r\nStock Markets Still Make Bitcoin Valuations Look Insignificant\r\nThe stock markets, a centuries-old and hi… [+2771 chars]"}, {"source": {"id": null, "name": "Spectator.co.uk"}, "author": "Ross Clark", "title": "Could coronavirus really trigger the next crash?", "description": "It’s a bloodbath in the markets, but by how much could the real, global economy be affected by the coronavirus outbreak? A research note by Oxford Economics seeks to answer that question by comparing…", "url": "https://blogs.spectator.co.uk/2020/02/could-coronavirus-really-trigger-the-next-crash/", "urlToImage": "https://spectatorblogs.imgix.net/files/2020/02/Bumby-stocksDB-1.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=820&h=550", "publishedAt": "2020-02-29T14:30:08Z", "content": "It’s a bloodbath in the markets, but by how much could the real, global economy be affected by the coronavirus outbreak? A research note by Oxford Economics seeks to answer that question by comparing it with the experience of Japan following the 2011 earthqua… [+2517 chars]"}, {"source": {"id": null, "name": "Investmentwatchblog.com"}, "author": "alexmark", "title": "Wikipedia Deceptively Editing Polio Stats: The polio Wiki used to state that 95% of those exposed to the polio virus have ZERO symptoms. Wikipedia power editor Doc James Heilman changed the number to 72%, even though the source data used by the CDC remain", "description": null, "url": "https://www.investmentwatchblog.com/wikipedia-deceptively-editing-polio-stats-the-polio-wiki-used-to-state-that-95-of-those-exposed-to-the-polio-virus-have-zero-symptoms-wikipedia-power-editor-doc-james-heilman-changed-the-number-to-7/", "urlToImage": null, "publishedAt": "2020-02-29T14:36:32Z", "content": "by axolotl_peyotl\r\nevidence\r\nWhen I started researching polio, the Wikipedia article cited the original 95% number, which I reference in this OC:\r\nParalysis and the Politics of Polio\r\nWhy is this important? There is a massive propaganda effort surrounding cre… [+713 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "The Associated Press", "title": "France banning large gatherings to slow spread of virus", "description": "PARIS - France is banning all indoor public gatherings of more than 5,000 people to slow the spread of a coronavirus epidemic.", "url": "https://www.thestar.com/news/world/europe/2020/02/29/france-banning-large-gatherings-to-slow-spread-of-virus.html", "urlToImage": "https://images.thestar.com/6xW3Tlvyo3IfuM9xVt_UhSrzwm4=/1280x1024/smart/filters:cb(1582987268483)/https://www.thestar.com/content/dam/thestar/news/world/europe/2020/02/29/france-banning-large-gatherings-to-slow-spread-of-virus/PAR101-229_2020_122754.jpg", "publishedAt": "2020-02-29T14:38:02Z", "content": "PARIS - France is banning all indoor public gatherings of more than 5,000 people to slow the spread of a coronavirus epidemic.\r\nThe cancellation of large gatherings in confined spaces was announced by Health Minister Olivier Veran after special government mee… [+583 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MARI YAMAGUCHI Associated Press", "title": "Japan's leader announces $2.5B package to help fight virus", "description": "Japanese Prime Minister Shinzo Abe has announced a $2.5 billion emergency economic package to help fight the coronavirus as he seeks the public's support for his government's fight against the outbreak", "url": "https://abcnews.go.com/Health/wireStory/japans-leader-announces-25b-package-fight-virus-69304520", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_e17b768905014ebe8f3582172d530245_16x9_992.jpg", "publishedAt": "2020-02-29T14:43:49Z", "content": "TOKYO -- \r\nJapanese Prime Minister Shinzo Abe on Saturday announced a 270 billion yen ($2.5 billion) emergency economic package to help fight the coronavirus as he sought the public's support for his government's fight against the outbreak.\r\nAbe said at a new… [+2336 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "Made Yoni", "title": "Indonesia Repatriating Citizens Who Worked on Coronavirus-Stricken Cruise Ships", "description": "The Indonesian government announced that it plans to repatriate 68 of its citizens who are crew members aboard the Diamond Princess, a cruise ship docked in Yokohama, at the center of Japan’s coronavirus outbreak.\n\nThe crew members will return home by air Sun…", "url": "https://www.voanews.com/science-health/coronavirus-outbreak/indonesia-repatriating-citizens-who-worked-coronavirus-stricken", "urlToImage": "https://media.voltron.voanews.com/Drupal/01live-166/2020-02/ap_diamond.jpg", "publishedAt": "2020-02-29T14:59:31Z", "content": "WASHINGTON - The Indonesian government announced that it plans to repatriate 68 of its citizens who are crew members aboard the Diamond Princess, a cruise ship docked in Yokohama, at the center of Japans coronavirus outbreak.\r\nThe crew members will return hom… [+2938 chars]"}, {"source": {"id": null, "name": "Cityam.com"}, "author": "Michael Searles", "title": "Coronavirus UK: Three more people test positive as total number of cases hits 23", "description": "The number of people in the UK to have tested positive for coronavirus has increased to 23 after a further The post Coronavirus UK: Three more people test positive as total number of cases hits 23 appeared first on CityAM.", "url": "https://www.cityam.com/coronavirus-uk-three-more-people-test-positive-as-total-number-of-cases-hits-23/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2020/02/1201781443.jpg", "publishedAt": "2020-02-29T14:48:11Z", "content": "The number of people in the UK to have tested positive for coronavirus has increased to 23 after a further three cases were confirmed on Saturday.\r\nTwo of the patients had returned from Italy while the other had traveled back from Asia, according to England’s… [+883 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Britain reports number of coronavirus cases has risen to 23", "description": "\"As of 29 February at 9am (0900 GMT), a total of 10,483 people have been tested in the UK, of which 10,460 were confirmed negative and 23 positive,\" the department said in a statement. Prime Minister Boris Johnson said on Friday that slowing the spread of cor…", "url": "https://news.yahoo.com/britain-reports-number-coronavirus-cases-143820730.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rzp7J.9l0ZdW1ilCkD33QQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzUuMg--/https://s.yimg.com/uu/api/res/1.2/tkEdPihdczMA7SDjmZ6zog--~B/aD01NDc7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/a6abcfbf59faa8793a9aa296323c1ede", "publishedAt": "2020-02-29T14:38:20Z", "content": "(Reuters) - The number of people infected with coronavirus in the United Kingdom had risen to 23 on Saturday, after three more patients tested positive, Britain's health department said.\r\n\"As of 29 February at 9am (0900 GMT), a total of 10,483 people have bee… [+439 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Tim O'Donnell", "title": "10 things you need to know today: February 29, 2020", "description": "1. The United States signed a peace agreement with the Taliban in Doha, Qatar, on Saturday, which is poised to end an 18-year conflict between the sides in Afghanistan. Under the terms of the deal, the U.S. will phase its troops out of Afghanistan, first whit…", "url": "https://theweek.com/10things/899139/10-things-need-know-today-february-29-2020", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/gettyimages-1204138220.jpg?itok=PVjjt1Sj", "publishedAt": "2020-02-29T14:30:00Z", "content": "The United States signed a peace agreement with the Taliban in Doha, Qatar, on Saturday, which is poised to end an 18-year conflict between the sides in Afghanistan. Under the terms of the deal, the U.S. will phase its troops out of Afghanistan, first whittli… [+631 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Connor Perrett", "title": "At least two dozen US police departments have spread misinformation linking coronavirus to meth", "description": "Some US police departments have spread misinformation about the coronavirus on Facebook, claiming that COVID-19 is linked to methamphetamine in an attempt to get people to turn their illegal substances in to law enforcement, the Washington Post reported.", "url": "https://www.businessinsider.com.au/us-police-departments-spread-coronavirus-joke-linking-it-to-meth-2020-2", "urlToImage": "https://i.insider.com/5e5a76f1fee23d1c680301a4", "publishedAt": "2020-02-29T15:02:27Z", "content": "<ul><li>\r\nAt least two dozen police departments in the US have shared misinformation on Facebook linking the coronavirus to illegal substances, like Methamphetamine, according to BuzzFeed News.\r\n</li><li>\r\nAs first reported by The Washington Post, the posts u… [+4887 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Ryan Sharrow", "title": "Philadelphia-area companies had a painful week on Wall Street — and there's no telling what's next", "description": "Many of Greater Philadelphia's public companies had a week to forget, and there's no telling what's ahead. Local companies have shed millions in market value as investors remain spooked over fears of the coronavirus and the broad impact it could have on corpo…", "url": "https://www.bizjournals.com/philadelphia/news/2020/02/29/philadelphia-area-companies-had-a-painful-week-on.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_philadelphia+%28Philadelphia+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-02-29T15:11:33Z", "content": null}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Javier C Hernandez | NYT", "title": "China spins coronavirus crisis, hailing itself as a global leader", "description": "The propaganda push suggests the Chinese government might be worried about the lasting damage of the outbreak", "url": "https://www.business-standard.com/article/current-affairs/china-spins-coronavirus-crisis-hailing-itself-as-a-global-leader-120022900877_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-02/26/full/1582723526-6859.jpg", "publishedAt": "2020-02-29T14:25:00Z", "content": "The Chinese government silenced whistle-blowers, withheld crucial information and played down the threat posed by the new coronavirus, allowing an epidemic that has killed thousands to take hold across the country.\r\nNow the ruling Communist Party, facing a st… [+6862 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "France bans gatherings of more than 5,000 as thousands face testing in coronavirus-hit Iran", "description": "The list of countries touched by the virus has climbed to nearly 60. More than 85,000 people worldwide have contracted the virus, with deaths topping 2,900.", "url": "https://www.dailymail.co.uk/news/article-8059479/France-bans-gatherings-5-000-thousands-face-testing-coronavirus-hit-Iran.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/29/15/25361262-0-image-a-41_1582988989073.jpg", "publishedAt": "2020-02-29T15:02:42Z", "content": "France today said it will cancel all public 'gatherings of more than 5,000 people' in closed spaces, as it seeks to curb the spread of coronavirus amid a surge of cases in the country. \r\nThe decision followed a special meeting of ministers to discuss the viru… [+14700 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Emma Newburger", "title": "Coronavirus live updates: France bans large gatherings, US cases raise concern over local transmission", "description": "The French government banned public gatherings with more than 5,000 people on Saturday.", "url": "https://www.cnbc.com/2020/02/29/coronavirus-live-updates-france-bans-large-gatherings.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106369130-1580655448721gettyimages-1197805992.jpeg?v=1582986194", "publishedAt": "2020-02-29T14:35:39Z", "content": "A couple wearing a mask in front of the Eiffel Tower.\r\nThis is a live blog. Please check back for updates.\r\nAll times below are in Eastern Standard time.\r\n<ul><li>Total confirmed cases: More than 85,000</li><li>Total deaths: At least 2,933</li></ul>\r\n9:26 am:… [+2645 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "AP", "title": "China Reveals Deep Hit From Coronavirus Crisis, Further Destabilizing World Economy", "description": "Trump, meanwhile, denounced criticism of his response to the threat as a “hoax” cooked up by his political enemies.", "url": "https://www.huffpost.com/entry/coronavirus-china-hit-world-economy-impact_n_5e5a6f50c5b601022111585a", "urlToImage": "https://img.huffingtonpost.com/asset/5e5a733d230000ba0bdddc6c.jpeg?cache=r0yqv3pyri&ops=1778_1000", "publishedAt": "2020-02-29T14:22:32Z", "content": "TOKYO (AP) The coronavirus outbreaks impact on the world economy grew more alarming on Saturday, even after President Donald Trump denounced criticism of his response to the threat as a hoax cooked up by his political enemies.\r\nChinas manufacturing plunged in… [+7450 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "Shanghai lab that first sequenced coronavirus genome shut down", "description": "It was not clear whether the closure was related to the publishing of the sequencing data before the authorities", "url": "https://www.thehindu.com/sci-tech/health/shanghai-lab-that-first-sequenced-coronavirus-genome-shut-down/article30951570.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/hch5ob/article30951568.ece/ALTERNATES/LANDSCAPE_615/01TH-SCICHINA", "publishedAt": "2020-02-29T14:56:13Z", "content": "A Shanghai-based lab Shanghai Public Health Clinical Center &amp; School of Public Health at Fudan University which was the first to sequence the whole genome of the novel coronavirus (SARS-CoV-2) and publicly share the data on January 11 was shut down on Jan… [+2617 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Associated Press", "title": "Japan sporting events at empty stadiums amid virus outbreak", "description": "Japanese sporting events were held without spectators on Saturday in a move aimed at halting the spread of the new coronavirus. The Chiba Lotte Marines hosted the Rakuten Eagles with no spectators in the stands at Zozo Marine Stadium in Chiba Prefecture on Sa…", "url": "https://ca.sports.yahoo.com/news/japan-sporting-events-empty-stadiums-amid-virus-outbreak-065403127--spt.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/x8F.Nk4TUG5KO3WzUUq5UA--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/202002290147064599729", "publishedAt": "2020-02-29T14:30:25Z", "content": "TOKYO (AP) -- Japanese sporting events were held without spectators on Saturday in a move aimed at halting the spread of the new coronavirus.\r\nThe Chiba Lotte Marines hosted the Rakuten Eagles with no spectators in the stands at Zozo Marine Stadium in Chiba P… [+1834 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Syed Raza Hassan", "title": "Pakistan confirms two coronavirus cases, brings total to four", "description": "Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country.", "url": "https://in.reuters.com/article/china-health-pakistan-idINKBN20N0MA", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200229&t=2&i=1496977196&w=1200&r=LYNXMPEG1S0HL", "publishedAt": "2020-02-29T14:17:38Z", "content": "KARACHI, Pakistan (Reuters) - Pakistan confirmed two more cases of coronavirus on Saturday, bringing the total number of positive cases to four since Wednesday when the first two cases were reported in the country. \r\n“We have received reports of two more posi… [+342 chars]"}, {"source": {"id": null, "name": "Luxuo.com"}, "author": "Jonathan Ho", "title": "Romain Jerome, creators of Titanic DNA watch has declared bankruptcy", "description": "Romain Jerome watches (RJ) which came to life over 15 years ago as creators of pop culturally inspired funky timepieces has declared bankruptcy The post Romain Jerome, creators of Titanic DNA watch has declared bankruptcy appeared first on LUXUO.", "url": "https://www.luxuo.com/style/watches/romain-jerome-creators-of-titanic-dna-watch-has-declared-bankruptcy.html", "urlToImage": "https://cdn.luxuo.com/2020/02/Romain-Jerome-creators-of-Titanic-DNA-watch-has-declared-bankruptcy-7b.jpg", "publishedAt": "2020-02-29T14:13:45Z", "content": "Romain Jerome watches (RJ) which came to life over 15 years ago as creators of pop culturally inspired funky timepieces has declared bankruptcy\r\nRomain Jerome watches launched in 2004, but it made its biggest splash in 2006 coming to prominence with a foundat… [+3271 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jane Dalton, Jane Dalton", "title": "Pope Francis forced to cancel duties for third day running, 'suffering cold symptoms'", "description": "Pontiff falls ill as Italy battles coronavirus outbreak", "url": "https://www.independent.co.uk/news/world/europe/pope-francis-coronavirus-cancel-cold-vatican-mass-a9366321.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/29/13/Pope-0.jpg", "publishedAt": "2020-02-29T14:36:22Z", "content": "Pope Francis has cancelled official engagements for a third straight day as he continued to battle an apparent cold. \r\nThe 83-year-olds illness comes amid a coronavirus outbreak in Italy, which has already seen an estimated 888 cases the worst-hit country in … [+5165 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Ryan Sharrow", "title": "Philadelphia-area companies had a painful week on Wall Street — and there's no telling what's next", "description": "Many of Greater Philadelphia's public companies had a week to forget, and there's no telling what's ahead. Local companies have shed millions in market value as investors remain spooked over fears of the coronavirus and the broad impact it could have on corpo…", "url": "https://www.bizjournals.com/philadelphia/news/2020/02/29/philadelphia-area-companies-had-a-painful-week-on.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+industry_8+%28Industry+Manufacturing%29", "urlToImage": null, "publishedAt": "2020-02-29T15:11:33Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "US signs historic deal with Afghan Taliban", "description": "The agreement signed in Qatar could lead to the withdrawal of US troops from Afghanistan. But what justice does peace with the Taliban provide to the group's victims? Also in the programme: South Korea deploys the army to disinfect a city hit hard by the coro…", "url": "https://www.bbc.co.uk/programmes/w172wq56p7q34q1", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1200x675/p0856wmr.jpg", "publishedAt": "2020-02-29T14:17:00Z", "content": "The agreement signed in Qatar could lead to the withdrawal of US troops from Afghanistan. But what justice does peace with the Taliban provide to the group's victims?\r\nAlso in the programme: South Korea deploys the army to disinfect a city hit hard by the cor… [+176 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ariel Zilber For Dailymail.com", "title": "Coronavirus fears drop net worth of 500 richest people in the world by $444BILLION", "description": "The combined net worth of the world's 500 richest people, including Jeff Bezos and Bill Gates, fell by $444billion as health officials around the world struggle to contain the mysterious pathogen.", "url": "https://www.dailymail.co.uk/news/article-8059471/Coronavirus-fears-drop-net-worth-500-richest-people-world-444BILLION.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/29/14/25360136-0-image-a-4_1582985751427.jpg", "publishedAt": "2020-02-29T14:39:44Z", "content": "Fears of coronavirus which have sent global stock markets plummeting in recent days have also eaten into the fortunes of the worlds wealthiest moguls.\r\nThe combined net worth of the worlds 500 richest people fell by $444billion as health officials around the … [+2806 chars]"}]