[{"source": {"id": "wired", "name": "Wired"}, "author": "Kyle Wiens", "title": "The Right to Repair Will Help Us Endure Outbreaks", "description": "As the coronavirus disrupts the global supply chain, the ability to fix our stuff is key to our resilience.", "url": "https://www.wired.com/story/opinion-the-right-to-repair-will-help-us-endure-outbreaks/", "urlToImage": "https://media.wired.com/photos/5e6049d51648c80008ee60b3/191:100/w_1280,c_limit/OpEd-Right-to-Repair-452200019.jpg", "publishedAt": "2020-03-05T14:00:00Z", "content": "Ive been thinking a lot about resilience lately.\r\nCoronavirus is sweeping the globe, carrying with it supply chain disruptions and fear. My iFixit purchasing team has been trapped in Taiwan since January, waiting for the all clear to go back to work in our Ch… [+4340 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aleesha Khaliq, CNN", "title": "Australian paper prints blank pages to help tackle toilet paper shortage", "description": "An Australian newspaper has printed an extra eight pages to be used as toilet paper after coronavirus fears prompted customers to bulk buy supplies, leaving some supermarket shelves bare.", "url": "https://www.cnn.com/2020/03/05/world/coronavirus-australia-toilet-paper-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305113509-australia-toilet-paper-0305-super-tease.jpg", "publishedAt": "2020-03-05T14:10:45Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Carmen Reinicke), Carmen Reinicke", "title": "Bill Ackman says he's preparing his fund for the worst as coronavirus sends markets spinning", "description": "Reuters / Richard Brian Bill Ackman of Pershing Square Holdings told investors Tuesday that he's taken steps to protect the portfolio amid a volatile market induced by coronavirus panic. The firm's approach has been to \"acquire large notional hedges which hav…", "url": "https://www.businessinsider.com/bill-ackman-hedging-pershing-fund-prepare-coronavirus-stock-market-volatility-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/59b022c379bbfd0d288b884a-1920/rtx36ij5.jpg", "publishedAt": "2020-03-05T13:45:30Z", "content": "Reuters / Richard Brian\r\n<ul><li>Bill Ackman of Pershing Square Holdings told investors Tuesday that he's taken steps to protect the portfolio amid a volatile market induced by coronavirus panic. </li><li>The firm's approach has been to \"acquire large notiona… [+2816 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Karen Iorio Adelson", "title": "From The Strategist: Best face mask alternatives for not getting sick", "description": "Our friends at The Strategist give the best alternatives to using face masks, and tips for not getting sick. Whether from the flu, the common cold or the coronoa virus. They suggest Mrs. Meyer’s Clean Day Hand Soap Lemon Verbena and Purell Advanced Hand Sanit…", "url": "https://www.theverge.com/2020/3/5/21163243/face-masks-alternatives-tips-hand-soap-sanitizer-strategist", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zzkjHgAZoTkswYcpMUdGZsvW8z8=/0x309:4310x2566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19764655/30_face_masks_lede.jpg", "publishedAt": "2020-03-05T14:00:00Z", "content": "From our friends at The Strategist, the gold standard pandemic masks are out of stock, so what should you get? \r\nPhoto: Alberto PIZZOLI / AFP\r\nThis story is part of a group of stories called \r\nThe Verge is sharing our favorite recommendations for everyday thi… [+4629 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Bill Chappell", "title": "Coronavirus: Cruise Ship In Limbo Off California After Former Passenger Died", "description": "Officials believe a passenger was exposed to the novel coronavirus during a trip from San Francisco to Mexico in the middle of February. The ship just returned from Hawaii.", "url": "https://www.npr.org/sections/health-shots/2020/03/05/812456413/coronavirus-cruise-ship-in-limbo-off-california-after-former-passenger-died", "urlToImage": "https://media.npr.org/assets/img/2020/03/05/coronavirus-grand-princess_wide-4a9394df09e77d9fe41c9270575cbbc42df038d4.jpg?s=1400", "publishedAt": "2020-03-05T13:34:33Z", "content": "At least 100 people aboard the Grand Princess cruise ship will be tested for the coronavirus that causes COVID-19, after a former passenger died from the disease this week. The ship is seen here in a photo from 2001.\r\nLuis M. Alvarez /AP\r\nThe Grand Princess c… [+2279 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mélissa Godin", "title": "Here's How to Self-Quarantine If You Get Exposed to Coronavirus", "description": "An increasing number of people have been told to self-quarantine because they've been exposed to the new coronavirus. Here's how you're supposed to do that.", "url": "https://news.yahoo.com/heres-self-quarantine-exposed-coronavirus-140318984.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/I7TYVR53vUTrOy7_uhelBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuNzU-/https://s.yimg.com/uu/api/res/1.2/DM7ieI6ytaYJ_F.KtfpJkA--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/b06c27cc315d251f355183e7d6080a14", "publishedAt": "2020-03-05T14:03:18Z", "content": "As the new coronavirus COVID-19 continues to spread around the world, an increasing number of people have been told to self-quarantine. While some have tested positive for the virus, others have simply been exposed to it and have been advised to self-quaranti… [+4484 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Francesco Guarascio", "title": "Europe could face more drug shortages as coronavirus squeezes supplies", "description": "Europe is experiencing delays in supplies of medicines and face masks because of coronavirus disruptions, according to EU and industry officials, compounding already acute shortages of drugs on the continent. Many countries around the world rely on China, the…", "url": "https://news.yahoo.com/europe-could-face-more-drug-134948396.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/zLKI_1kWZVAfge3TASi_ZA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MzY-/https://s.yimg.com/uu/api/res/1.2/azJQ0H_x4kZ90ZVf._FSIA--~B/aD01ODU7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/c1195cbac5fcfa1d6f179df28a16b29b", "publishedAt": "2020-03-05T13:49:48Z", "content": "By Francesco Guarascio\r\nBRUSSELS (Reuters) - Europe is experiencing delays in supplies of medicines and face masks because of coronavirus disruptions, according to EU and industry officials, compounding already acute shortages of drugs on the continent.\r\nMany… [+2456 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Mussa Qawasma", "title": "Palestinians declare coronavirus emergency as Church of the Nativity closed", "description": "Palestinian President Mahmoud Abbas declared a 30-day state of emergency on Thursday and Bethlehem's Church of the Nativity was closed following the discovery of seven cases of coronavirus in the traditional birthplace of Jesus. The decree was announced by Pa…", "url": "https://news.yahoo.com/bethlehems-church-nativity-ordered-closed-131242083.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/VLy_6E3s2PjZm6cAnbCJYQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MTIuOA--/https://s.yimg.com/uu/api/res/1.2/FI3y.R47ZaKOtxdOmN2NBg--~B/aD01MDg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/15de5b2f6206c20e1a14b158c19b0231", "publishedAt": "2020-03-05T13:12:42Z", "content": "By Mussa Qawasma\r\nBETHLEHEM, West Bank (Reuters) - Palestinian President Mahmoud Abbas declared a 30-day state of emergency on Thursday and Bethlehem's Church of the Nativity was closed following the discovery of seven cases of coronavirus in the traditional … [+3370 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Competiello", "title": "'What if this is the thing that brings it down?': A Wall Street investment chief explains how the stock market's coronavirus-induced selloff could push the US into recession", "description": "Doug Ramsey, chief investment officer at Leuthold Group, thinks the coronavirus could be the variable that finally pushes the US into recession. He backs up his thesis with the notion of economic narratives, an increasing amount of recessionary precursors sta…", "url": "https://www.businessinsider.com/next-recession-how-coronavirus-could-be-final-straw-us-economy-2020-3", "urlToImage": "https://i.insider.com/5e5ec665fee23d03cb57c572?width=1200&format=jpeg", "publishedAt": "2020-03-05T13:15:00Z", "content": "\"What if this is the thing that brings it down?\"\r\nThat's what Doug Ramsey, chief investment officer at Leuthold Group, asked a group of Business Insider reporters as the S&amp;P 500 plunged more than 4%, adding to a grizzly selloff.\r\nThe thing that Ramsey is … [+1876 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mark Hanrahan", "title": "Hong Kong warns people not to kiss their pets after dog tests positive for COVID-19", "description": "Hong Kong authorities have warned residents against kissing their pets, after a dog belonging to a coronavirus patient in the city tested “weak positive” for COVID-19.", "url": "https://abcnews.go.com/International/coronavirus-hong-kong-warns-people-kiss-pets-dog/story?id=69406015", "urlToImage": "https://s.abcnews.com/images/International/dog-hong-kong-ap-ml-200305_hpMain_16x9_992.jpg", "publishedAt": "2020-03-05T13:48:26Z", "content": "Hong Kong authorities have warned residents against kissing their pets after a dog belonging to a coronavirus patient in the city tested weak positive for COVID-19, the official name for novel coronavirus.\r\nAfter conducting multiple tests on the dog over a pe… [+3136 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "These 4 policy tools have been used by central banks and organizations to fight the economic fallout from coronavirus", "description": "Governments, central banks, and organizations around the world are utilizing a range of policy tools to pad economies hit by the coronavirus. The G-7 announced Tuesday it would monitor the outbreak and act appropriately to keep economies from contracting, but…", "url": "https://www.businessinsider.com/policy-tools-stimulus-list-to-fight-negative-economic-impact-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5b2165f21ae66241008b51ec?width=1200&format=jpeg", "publishedAt": "2020-03-05T13:15:23Z", "content": null}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Boing Boing's Shop", "title": "Become a cybersecurity superhero with 60+ hours of training from ethical hacking professionals", "description": "Bug bounties are making some hackers rich — and the companies they’re hacking are more than happy to pay them. More than 600,000 white hat hackers are members of the bug bounty site HackerOne, a community connecting those hackers with companies paying them to…", "url": "https://boingboing.net/2020/03/05/become-a-cybersecurity-superhe.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/759534_9930_9.jpg?fit=750%2C422&ssl=1", "publishedAt": "2020-03-05T14:00:14Z", "content": "Bug bounties are making some hackers rich and the companies theyre hacking are more than happy to pay them. More than 600,000 white hat hackers are members of the bug bounty site HackerOne, a community connecting those hackers with companies paying them to fi… [+3634 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Jeffry Bartash", "title": "Economic Report: U.S. jobless claims dip at end of February, no sign so far of layoffs tied to coronavirus", "description": "The number of Americans applying for unemployment benefits fell slightly at the end of February, suggesting the economic damage from the coronavirus is still in the early stages and hasn’t caused companies to lay off any workers. Initial jobless claims slippe…", "url": "http://www.marketwatch.com/story/us-jobless-claims-dip-at-end-of-february-no-sign-so-far-of-layoffs-tied-to-coronavirus-2020-03-05", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HF200_Americ_ZG_20190306165611.jpg", "publishedAt": "2020-03-05T13:30:06Z", "content": "The numbers: The number of Americans applying for unemployment benefits fell slightly at the end of February, suggesting the economic damage from the coronavirus is still in the early stages and hasnt caused companies to lay off any workers. Initial jobless c… [+2539 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: Even a portfolio of 40% bonds won’t escape further coronavirus losses, MSCI says", "description": "MSCI, the index and portfolio analysis firm, has done its own scenario analysis, modeling what it called a “severe but plausible short-term downside scenario.” A 60/40 stock/bond portfolio could see another 7% retreat.", "url": "http://www.marketwatch.com/story/even-a-portfolio-of-40-bonds-wont-escape-further-coronavirus-losses-msci-says-2020-03-05-910308", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-03-05T14:00:08Z", "content": "MSCI, the index and portfolio analysis firm, has done its own scenario analysis, modeling what it called a severe but plausible short-term downside scenario. A 60/40 stock/bond portfolio could see another 7% retreat. See full story.\r\nHeres what Apple supplier… [+1133 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Mark DeCambre", "title": "Metals Stocks: Gold bounces higher as stocks react to spread of coronavirus", "description": "Gold futures head higher on Thursday, supported by weakness in the dollar, stocks and a slide in government bond yields due to worries about the outbreak of COVID-19.", "url": "http://www.marketwatch.com/story/gold-bounces-higher-as-stocks-react-to-spread-of-coronavirus-2020-03-05", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IA225_gold_0_ZG_20200213073600.jpg", "publishedAt": "2020-03-05T13:19:39Z", "content": "Gold futures were headed higher on Thursday, supported by weakness stocks and a slide in government bond yields due to worries about the COVID-19 epidemic. Bullion is attracting haven bids as California declared a state of emergency, and more cases of the epi… [+1017 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Ben Lovejoy", "title": "Opinion: Apple could set an example in encouraging working from home", "description": "One of the most impactful steps any company could take right now in limiting the spread of the coronavirus is to encourage working from home. According to the CDC, the two biggest transmission risks are close contact (defined as within six feet) and droplets …", "url": "https://9to5mac.com/2020/03/05/working-from-home/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/Working-from-home.jpg?quality=82&strip=all", "publishedAt": "2020-03-05T13:53:00Z", "content": "One of the most impactful steps any company could take right now in limiting the spread of the coronavirus is to encourage working from home.\r\nAccording to the CDC, the two biggest transmission risks are close contact (defined as within six feet) and droplets… [+5812 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jon Blistein", "title": "Slipknot Postpone Knotfest Japan Over Coronavirus Fears", "description": "Whitesnake also call off upcoming dates in the country", "url": "https://www.rollingstone.com/music/music-news/slipknot-knotfest-japan-canceled-whitesnake-coronavirus-962564/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/10548201e.jpg", "publishedAt": "2020-03-05T14:02:57Z", "content": "Slipknot have postponed Knotfest Japan in light of ongoing coronavirus concerns.\r\nKnotfest Japan was slated to take place March 20th and 21st in Chiba — just outside Tokyo — with Slipknot playing both nights alongside additional sets from Korn, Marilyn Manson… [+1841 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Yomi Kazeem", "title": "Algeria’s is now the epicenter of coronavirus in Africa as South Africa confirms first case", "description": "Algeria's coronavirus case count has doubled this week alone.", "url": "https://qz.com/africa/1813309/coronavirus-africa-algeria-south-africa-senegal-confirm-cases/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/Algeria.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-05T13:17:03Z", "content": "The number of confirmed coronavirus cases across Africa are starting to spike.\r\nThe discovery of nine new cases in Algeria yesterday (Mar. 5) means the country has now seen its cases more than double this week, taking its total to 17. It follows a flurry of n… [+2084 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "SPFL boss issues coronavirus warning", "description": "Scottish Professional Football League chief executive Neil Doncaster says they would struggle to complete the season if any club was affected by the coronavirus outbreak.", "url": "https://www.skysports.com/football/news/11781/11950268/spfl-boss-warns-that-coronavirus-could-have-potentially-dire-financial-consequences-in-scotland", "urlToImage": "https://e1.365dm.com/20/02/1600x900/skysports-kilmarnock-celtic_4928889.jpg", "publishedAt": "2020-03-05T14:04:00Z", "content": "Scottish Professional Football League chief executive Neil Doncaster says they would struggle to complete the season if any club was affected by the coronavirus outbreak.\r\nThe spread of the virus has had a major impact on the world of sport - and Doncaster ma… [+1287 chars]"}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Pierre Mallevays", "title": "Coronavirus Wipes Four Months of Gains off SLI", "description": "The Savigny Luxury Index went into meltdown this month, with no single company posting gains, as the coronavirus edged closer to becoming a global pandemic.", "url": "https://www.businessoffashion.com/articles/market-pulse/coronavirus-wipes-four-months-of-gains-off-sli", "urlToImage": null, "publishedAt": "2020-03-05T13:33:47Z", "content": null}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": "MB Business", "title": "Lower February inflation key to rate cut decision in March - Manila Bulletin", "description": "Lower February inflation key to rate cut decision in March Manila Bulletin Inflation slows below forecast as virus threat looms ABS-CBN News Slower February inflation gives fresh BSP cut a boost Philippine Star Monetary easing seen as BSP warns of COVID-19 im…", "url": "https://business.mb.com.ph/2020/03/05/lower-february-inflation-key-to-rate-cut-decision-in-march/", "urlToImage": "https://business.mb.com.ph/wp-content/uploads/2019/03/DIONKO_BEN_NEW-BSP-GOV.jpg", "publishedAt": "2020-03-05T14:07:16Z", "content": "By LEE C. CHIPONGIAN\r\nBangko Sentral ng Pilipinas (BSP) Governor Benjamin E. Diokno said the lower February inflation will be carefully deliberated on when they meet for the Monetary Boards next policy meeting.\r\nThe February inflation rate fell to 2.6 percent… [+2939 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Julia Wick", "title": "Essential California: State of emergency declared over coronavirus - Los Angeles Times", "description": "Essential California: State of emergency declared over coronavirus Los Angeles Times California reports first coronavirus death CBS Evening News California Gov. Newsom declares state of emergency after first coronavirus-related death Fox News Coronavirus: Cal…", "url": "https://www.latimes.com/california/newsletter/2020-03-05/coronavirus-cruise-emergency-newsletter", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/06f8bf7/2147483647/strip/true/crop/5184x2722+0+583/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2F0d%2F20aa9d484144a8e2961f00e40355%2Fepa-rex-californias-response-to-first-c-10569239a.JPG", "publishedAt": "2020-03-05T13:30:00Z", "content": "Good morning, and welcome to the Essential California newsletter\r\n. Its Thursday, March 5, and Im writing from Los Angeles.\r\nThe stories shaping California\r\nGet up to speed with our Essential California newsletter, sent six days a week.\r\nYou may occasionally … [+9917 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How are U.S. schools preparing for a coronavirus outbreak? - CBS This Morning", "description": "How are U.S. schools preparing for a coronavirus outbreak? CBS This Morning Coronavirus: Italy is shutting down schools nationwide Vox.com Coronavirus: Italy to close all schools as deaths rise - BBC News BBC News Factbox: Italy's Draconian New Measures to Ta…", "url": "https://www.youtube.com/watch?v=SLCXFVJGf1U", "urlToImage": null, "publishedAt": "2020-03-05T13:32:09Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Reuben Gregg Brewer)", "title": "Why Valero Energy Corporation Stock Plunged 21% in February", "description": "Valero Energy is dealing with weak market dynamics and the coronavirus isn't helping things at all.", "url": "https://www.fool.com/investing/2020/03/05/why-valero-energy-corporation-stock-plunged-21-in.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561624/17_06_14-a-man-looking-down-over-an-energy-processing-facility-_gettyimages-464201833.jpg", "publishedAt": "2020-03-05T13:20:00Z", "content": "What happened\r\nShares of Valero Energy Corporation(NYSE:VLO) fell a hefty 21% in February according to data from S&amp;P Global Market Intelligence. That left the shares down a painful 29% through the first two months of 2020. The S&amp;P 500 Index, for compa… [+2118 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Reuben Gregg Brewer)", "title": "Why Nucor Stock Fell 13% in February", "description": "Nucor's stock got smacked by concerns about the coronavirus. Here's why.", "url": "https://www.fool.com/investing/2020/03/05/why-nucor-stock-fell-13-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561628/17_08_02-a-steel-worker-in-a-foundry-with-molten-steel-pouring-from-a-vessel-_gettyimages-489756984.jpg", "publishedAt": "2020-03-05T13:52:00Z", "content": "What happened\r\nShares of U.S. steel giant Nucor (NYSE:NUE) declined just shy of 13% in February, according to data from S&amp;P Global Market Intelligence. Most of that drop happened at the same time that the S&amp;P 500 Index was swooning toward the end of t… [+2185 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Feleg Tesema", "title": "Global Textile & Apparel Industries Suffer $1.5 Billion Loss From Coronavirus", "description": "The Coronavirus outbreak has resulted in an estimated export loss of $1.5 billion in the textile and apparel industries, WWD reports. The UN has estimated that the slowdown of manufacturing in China could result in a total $50 billion loss in global chain exp…", "url": "https://www.highsnobiety.com/p/coronavirus-apparel-exports-impact-un-report/", "urlToImage": "https://static.highsnobiety.com/thumbor/YGkvjVIUOK98vAdnQx5yrXnMCxs=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2020/03/05132110/coronavirus-textile-new-1.jpg", "publishedAt": "2020-03-05T13:58:21Z", "content": "The Coronavirus outbreak has resulted in an estimated export loss of $1.5 billion in the textile and apparel industries, WWD reports. The UN has estimated that the slowdown of manufacturing in China could result in a total $50 billion loss in global chain exp… [+1627 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Graham Keeley", "title": "Coronavirus: Spain advises companies to send workers home", "description": "Staff should work from home if bosses believe there is a serious risk of infection.", "url": "https://www.aljazeera.com/news/2020/03/coronavirus-spain-advises-companies-send-workers-home-200305122238765.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/5/424eb864a5d743898697027a6e67d449_18.jpg", "publishedAt": "2020-03-05T14:04:33Z", "content": "Madrid, Spain - The Spanish government has advised companies to close and send staff to work at home if there were a \"serious\" risk to workers of contracting coronavirus, as authorities on Thursday reported the third Spanish death from COVID-19.\r\nYolanda Diaz… [+3476 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Sven Even Borgos", "title": "A revolution in vaccine development—but will we all benefit?", "description": "By manipulating the \"instruction manuals\" that control cell function in our bodies, we will soon be able to combat many diseases, including the new coronavirus outbreak. However, in the worst scenario, such innovations will only benefit the rich.", "url": "https://phys.org/news/2020-03-revolution-vaccine-developmentbut-benefit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/arevolutioni.jpg", "publishedAt": "2020-03-05T14:01:25Z", "content": "By manipulating the \"instruction manuals\" that control cell function in our bodies, we will soon be able to combat many diseases, including the new coronavirus outbreak. However, in the worst scenario, such innovations will only benefit the rich.\r\nRecently, i… [+6352 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health Experts Testify On Coronavirus Outbreak Before House | NBC News (Live Stream) - NBC News", "description": "Health Experts Testify On Coronavirus Outbreak Before House | NBC News (Live Stream) NBC News Coronavirus death toll climbs in US l ABC News ABC News Coronavirus outbreak: What do migrant workers do? Al Jazeera English View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=z-6JG8TKkGs", "urlToImage": "https://i.ytimg.com/vi/z-6JG8TKkGs/maxresdefault_live.jpg", "publishedAt": "2020-03-05T14:05:17Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Why Does Coronavirus Have a 29% Death Rate in Seattle? - CCN.com", "description": "Why Does Coronavirus Have a 29% Death Rate in Seattle? CCN.com Washington county recommends all 2.2M residents to work from home, tells over 60's to stay indoors Fox News Why Washington State? How Did It Start? Questions Answered on the US Coronavirus Outbrea…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiSWh0dHBzOi8vd3d3LmNjbi5jb20vd2h5LWRvZXMtY29yb25hdmlydXMtaGF2ZS1hLTI5LWRlYXRoLXJhdGUtaW4tc2VhdHRsZS_SAUlodHRwczovL3d3dy5jY24uY29tL3doeS1kb2VzLWNvcm9uYXZpcnVzLWhhdmUtYS0yOS1kZWF0aC1yYXRlLWluLXNlYXR0bGUv?oc=5", "urlToImage": null, "publishedAt": "2020-03-05T13:56:00Z", "content": null}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Christian Zibreg", "title": "Apple reportedly delays iPhone SE 2 launch over the coronavirus outbreak", "description": "The accumulated effects of the coronavirus COVID-19 reportedly make keeping to Apple's production schedule for the next iPhone SE difficult.", "url": "https://www.idownloadblog.com/2020/03/05/iphone-se-2-components-delay-coronavirus/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2013/09/Gold-iPhone-5s-side-and-back.png", "publishedAt": "2020-03-05T13:46:42Z", "content": "The coronavirus has impacted Apples supply chain in ways more than one, the latest example being the companys oft-rumored iPhone SE successor that, instead of arriving this spring, now apparently faces a delayed launch, a new supply chain report claimed Thurs… [+1808 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Elizabeth Kim", "title": "Coronavirus Updates: Two More Cases In NYC, De Blasio Says", "description": "There are now four confirmed cases in New York City. [ more › ]", "url": "https://gothamist.com/news/coronavirus-updates-two-more-cases-nyc-de-blasio-says", "urlToImage": "https://cms.prod.nypr.digital/images/301516/fill-1200x650/", "publishedAt": "2020-03-05T13:41:00Z", "content": "This is our daily update of breaking COVID-19 news for Thursday, March 5th 2020. Previous daily updates can be found here. Our guide to preparing for the spread of coronavirus is here, and if you have lingering questions about the virus, here is our regularly… [+1146 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Annalisa Merelli", "title": "Coronavirus lockdown ignites an old Italian debate. It’s about pasta, of course", "description": "Penne with ridges? Or penne that is smooth? Now fight.", "url": "https://qz.com/1811768/coronavirus-lockdown-ignites-an-old-italian-debate-its-about-pasta-of-course/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/RTS33FJE-e1583362432417.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-05T14:11:31Z", "content": "Few things could possibly distract Italiansa population prone to health concerns in the best of circumstancesfrom panicking about an actual infectious epidemic. But one of them is pasta. Better: A debate over pasta.\r\nFor several days now, parts of northern It… [+6197 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Jenny Anderson", "title": "With 290 million kids out of school, coronavirus is putting online learning to the test", "description": "Edtech is having its moment.", "url": "https://qz.com/1812638/millions-of-kids-testing-e-learning-after-coronavirus-school-closures/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/RTS344MO-e1583413689515.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-05T13:38:33Z", "content": "In late January, Priya Lakhani, founder of Century Tech, an AI-driven learning platform for schools, got a question from her team: Should they offer free access to Centurywhich typically costs tens of thousands of poundsto schools in China that had started to… [+9551 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Alexandria Hein", "title": "2 new NYC coronavirus patients in ICU, de Blasio says - Fox News", "description": "2 new NYC coronavirus patients in ICU, de Blasio says Fox News Five more New York coronavirus cases confirmed, bringing state total to 11 New York Post How coronavirus spread in New York: From a man to his family. Then a neighbor. Then friends. The Washington…", "url": "https://www.foxnews.com/health/2-new-nyc-coronavirus-patients-in-icu-de-blasio-says", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/eaa4e5c7-ab4c-417a-9c2e-da1886aa4611/e0e28c45-00a1-4196-b700-3d1e6886647d/1280x720/match/image.jpg", "publishedAt": "2020-03-05T13:56:26Z", "content": "New York City Mayor Bill de Blasio announced two new cases of coronavirus in New York City residents on Thursday and said that both patients are currently in the intensive care unit and have no connection to any of the other reported cases or travel history t… [+2308 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Vietnamese dancer’s ‘handwashing dance’ to prevent coronavirus goes viral", "description": "In the original video, which was posted by Dang a month ago, the artist along with a fellow dancer can be seen grooving to the beats of popular Vietnamese pop hit “Ghen\".", "url": "https://indianexpress.com/article/trending/trending-globally/vietnamese-dancers-handwashing-dance-to-prevent-coronavirus-goes-viral-6301136/", "urlToImage": "https://images.indianexpress.com/2020/03/unicef_759_twt.jpg?w=759", "publishedAt": "2020-03-05T13:36:08Z", "content": "By: Trends Desk | New Delhi | \r\nUpdated: March 5, 2020 7:09:10 pm\r\nSince being shared online, the video has been viewed over 60,000 times and prompted several reactions.Amid the ongoing coronavirus scare, a video of Vietnamese dancer’s “handwashing dance” has… [+2073 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Hugo Boss warns profit may miss forecasts on Coronavirus", "description": "Since late January, many of the company’s stores in mainland China, Hong Kong and Macau have been either closed or operated at limited hours.", "url": "https://indianexpress.com/article/lifestyle/fashion/hugo-boss-warns-profit-may-miss-forecasts-on-coronavirus-6300856/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus-AP-759.jpg?w=759", "publishedAt": "2020-03-05T13:40:42Z", "content": "By: Bloomberg | \r\nPublished: March 5, 2020 7:10:42 pm\r\nProfit may fall this year from 333 million euros it earned in 2020. (Representational Image)By Thomas Mulier and Richard Weiss\r\nGerman clothier Hugo Boss AG warned that the coronavirus will have a signifi… [+1481 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Roundtable: Coronavirus Is Best Case for Medicare for All", "description": "On Wednesday, House lawmakers passed an $8.3 billion emergency spending package for combating coronavirus, as the death toll from coronavirus has reached 11 in the United States. California recorded its first coronavirus death yesterday. The virus has also sp…", "url": "https://www.democracynow.org/2020/3/5/coronavirus", "urlToImage": "https://www.democracynow.org/images/story/90/51490/full_hd/SEG1-Coronavirus.jpg", "publishedAt": "2020-03-05T13:15:04Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nOn Wednesday, House lawmakers passed an $8.3 billion emergency spending package for combating coronavirus, as the death toll from coronavirus has reached 11 in the United States. California re… [+964 chars]"}, {"source": {"id": null, "name": "Pib.gov.in"}, "author": null, "title": "Mughal Gardens to be Closed for Public Viewing from March 7", "description": "Continuing the precautionary measures at Rashtrapati Bhavan in view of COVID-19 Novel Coronavirus, the Mughal Gardens will close for public from Saturday (March 7, 2020) to avoid any large gathering of people.", "url": "https://pib.gov.in/newsite/PrintRelease.aspx?relid=199895", "urlToImage": null, "publishedAt": "2020-03-05T13:27:00Z", "content": "Continuing the precautionary measures at Rashtrapati Bhavan in view of COVID-19 Novel Coronavirus, the Mughal Gardens will close for public from Saturday (March 7, 2020) to avoid any large gathering of people.\r\n*****\r\nVRRK/VJ"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italy to postpone March 29 referendum on number of lawmakers due to coronavirus: sources", "description": "The Italian government will postpone a referendum over legislation to cut the number of parliamentarians that was slated for March 29, due to the country's coronavirus outbreak, political sources said on Thursday.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-referendum-idUSKBN20S1SE", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-05T14:06:44Z", "content": "ROME (Reuters) - The Italian government will postpone a referendum over legislation to cut the number of parliamentarians that was slated for March 29, due to the country’s coronavirus outbreak, political sources said on Thursday. \r\nA new date for the referen… [+822 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "William Hartung, Contributor, William Hartung, Contributor https://www.forbes.com/sites/williamhartung/", "title": "To Save Lives, Shift Pentagon Spending to Public Health", "description": "A tiny fraction of the Pentagon budget could fund a robust, multi-year public health plan to deal with outbreaks like the coronavirus (COVID-19).", "url": "https://www.forbes.com/sites/williamhartung/2020/03/05/to-save-lives-shift-pentagon-spending-to-public-health/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1199257635%2F0x0.jpg", "publishedAt": "2020-03-05T14:07:18Z", "content": "The security of United States and the world depends on far more than throwing money at the Pentagon to deal with potential military challenges.  The spread of the coronavirus (COVID-19) underscores this fact.  \r\n          The Sustainable Defense Task Force, a… [+4415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Silvia Marchetti, CNN", "title": "Why the last man standing on the coronavirus cruise ship never gave up", "description": "His ship may have been to hell and back, becoming a floating coronavirus-infected prison for passengers quarantined at port in Japan, but when the captain of the Diamond Princess cruise ship became the last person aboard to finally step onto dry land, he look…", "url": "https://www.cnn.com/travel/article/diamond-princess-cruise-captain-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305125356-captain-arma-super-tease.jpg", "publishedAt": "2020-03-05T13:34:03Z", "content": "(CNN) His ship may have been to hell and back, becoming a floating coronavirus-infected prison for passengers quarantined at port in Japan, but when the captain of the Diamond Princess cruise ship became the last person aboard to finally step onto dry land, h… [+6994 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Jonathan Garber", "title": "Coronavirus fears hammer stocks - Fox Business", "description": "Thursday's selling comes a day after the Dow Jones Industrial Average posted its second-biggest point gain on record.", "url": "https://www.foxbusiness.com/markets/us-stocks-march-5-2020", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/1000-1.jpeg?ve=1&tl=1", "publishedAt": "2020-03-05T13:33:31Z", "content": "The rollercoaster ride for U.S. equity markets careened into another slide Thursday, with all three of the major averages under pressure from signs the new coronavirus is spreading across the continental U.S.\r\nThe Dow Jones Industrial Average slid by as many … [+5174 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Isabel Togoh, Forbes Staff, Isabel Togoh, Forbes Staff https://www.forbes.com/sites/isabeltogoh/", "title": "Covid-19 Could Cost Global Airlines $113 Billion", "description": "Global airlines revenues could plunge by $113 billion if the coronavirus continues to spread around the world, according to the International Air Transport Association.", "url": "https://www.forbes.com/sites/isabeltogoh/2020/03/05/covid-19-could-cost-global-airlines-113-billion/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F475232507%2F0x0.jpg", "publishedAt": "2020-03-05T13:23:40Z", "content": "Getty\r\nTopline: The global spread of Covid-19 could cost airlines up to $113 billion as the airline industry group International Air Transport Association scrapped its $29.3 billion estimate from last month. \r\n<ul><li>The International Air Transport Associati… [+1682 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Jake Kanter", "title": "Major British Broadcasters Draw Up Coronavirus Plans, Shows Like ‘Celebrity Race Across The World’ At Risk", "description": "EXCLUSIVE: Britain’s major broadcasters have spent recent days drawing up coronavirus plans, as the spread of the disease threatens to wreak havoc on production schedules and disrupt major events. Deadline understands the likes of the BBC, ITV, Channel 4 and …", "url": "https://deadline.com/2020/03/bbc-itv-channel-4-drawing-up-coronavirus-plans-1202874978/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/19992681-high_res-race-across-the-world.jpg?w=1024", "publishedAt": "2020-03-05T13:52:33Z", "content": "EXCLUSIVE: Britain’s major broadcasters have spent recent days drawing up coronavirus plans, as the spread of the disease threatens to wreak havoc on production schedules and disrupt major events.\r\nDeadline understands the likes of the BBC, ITV, Channel 4 and… [+4970 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Pamela N. Danziger, Contributor, Pamela N. Danziger, Contributor https://www.forbes.com/sites/pamdanziger/", "title": "Retailers Have Always Faced Unpredictable Changes Impacting Supply And Demand – Weather Shouldn’t Be One Them", "description": "The coronavirus outbreak shows how fragile the retail supply chain is. This should be a wakeup call for retailers to leverage more data, specifically weather insights, into their supply and demand forecasts.", "url": "https://www.forbes.com/sites/pamdanziger/2020/03/05/retailers-have-always-faced-unpredictable-changes-impacting-supply-and-demand--weather-shouldnt-be-one-them/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F826649254%2F0x0.jpg", "publishedAt": "2020-03-05T14:00:26Z", "content": "Store-level forecast is where the world is going, says Paul Walsh, IBM's global director of ... [+] consumer weather and climate strategy.\r\nGetty\r\nThe recent emergence of coronavirus in China that is rapidly spreading across the globe has shown just how fragi… [+6612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hadas Gold, CNN Business", "title": "Inside the WHO's fight to stop false information about coronavirus from spreading", "description": "As the coronavirus spreads further into Europe and the Americas, another infection is spreading: an epidemic of misinformation online. It's been dubbed the \"infodemic.\"", "url": "https://www.cnn.com/2020/03/05/tech/facebook-google-who-coronavirus-misinformation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200304100456-passengers-phone-0227-super-tease.jpg", "publishedAt": "2020-03-05T13:15:45Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "The Associated Press", "title": "World braces for months of trouble as coronavirus pushes west - OregonLive", "description": "World braces for months of trouble as coronavirus pushes west OregonLive Coronavirus confirmed cases and fatalities, state by state Fox News 6 ways the US government could help contain the new coronavirus Livescience.com Here's how nanoparticles could help us…", "url": "https://www.oregonlive.com/coronavirus/2020/03/world-braces-for-months-of-trouble-as-coronavirus-pushes-west.html", "urlToImage": "https://www.oregonlive.com/resizer/2CS20wIR2oEZbrJuBBXu733AIzM=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/C3R52MVV7VFTDJXSGIUF5T326M.jpg", "publishedAt": "2020-03-05T13:39:00Z", "content": "BANGKOK People around the world braced for months of disruptions from the new virus Thursday as its unrelenting spread brought ballooning infections, economic fallout and sweeping containment measures.\r\n\"Countries should be preparing for sustained community t… [+6446 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Discovery Of 2 Strains Of COVID-19 Coronavirus Hints At How It Evolved via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_82795d34252d5ee976eb53b6c2251f0b", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-05T14:10:18Z", "content": "New Jersey, Coronavirus, Phil Murphy\r\nAnother coronavirus case is being investigated in Philadelphia, while a presumptive positive case in New Jersey is being tested by the CDC."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Before pouncing on mispronouncing by your colleagues, read this via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_df3f6bf7dae7eb7864116522d7e6543a", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-05T14:10:18Z", "content": "New Jersey, Coronavirus, Phil Murphy\r\nAnother coronavirus case is being investigated in Philadelphia, while a presumptive positive case in New Jersey is being tested by the CDC."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Worksite Fall via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_234f34a06b1f0ae577155b78c4cd1a0b", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-05T14:10:18Z", "content": "New Jersey, Coronavirus, Phil Murphy\r\nAnother coronavirus case is being investigated in Philadelphia, while a presumptive positive case in New Jersey is being tested by the CDC."}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "Kiet Do", "title": "CA Prepping 'Surge Tents'...", "description": "CA Prepping 'Surge Tents'... (First column, 7th story, link ) Related stories: Empty stores, quarantined firefighters: Washington city at virus epicenter reels as death toll rises... ULTRA festival canceled in Miami... Test delays stoke anger... Trump blames …", "url": "https://sanfrancisco.cbslocal.com/2020/03/04/coronavirus-san-jose-good-samaritan-hospital-surge-tents-influx-cases-covid19/", "urlToImage": "https://sanfrancisco.cbslocal.com/wp-content/uploads/sites/15116056/2020/03/corona-tent.jpg?w=1500", "publishedAt": "2020-03-05T13:52:37Z", "content": "SAN JOSE (KPIX 5) — Good Samaritan Hospital in San Jose is prepping “surge tents” to handle a possible influx of coronavirus cases.\r\nThe tan-colored tents are currently erected on the southern border of the hospital’s property, facing Samartian Drive, directl… [+2515 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: United Airlines Cuts U.S., International Flights in Response to Coronavirus: A…", "description": "CORONAVIRUS UPDATE: United Airlines Cuts U.S., International Flights in Response to Coronavirus: Air carrier slicing domestic flying by 10%, international by 20% in April. JetBlue follows United, announces flight cuts because of coronavirus. China coronavirus…", "url": "https://pjmedia.com/instapundit/360439/", "urlToImage": null, "publishedAt": "2020-03-05T13:20:40Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Natalie Jarvey", "title": "Netflix Joins Apple in Skipping SXSW Amid Coronavirus Concerns", "description": "Netflix is joining other major technology and entertainment companies in canceling its plans for SXSW amid concerns about the spread of coronavirus, The Hollywood Reporter has confirmed.", "url": "https://www.billboard.com/articles/events/sxsw/9328749/netflix-joins-apple-in-skipping-sxsw-amid-coronavirus-concerns", "urlToImage": "https://static.billboard.com/files/media/sxsw-atmosphere-2019-billboard-1548.jpg", "publishedAt": "2020-03-05T13:33:14Z", "content": "Netflix is joining other major technology and entertainment companies in canceling its plans for SXSW amid concerns about the spread of coronavirus, The Hollywood Reporter has confirmed.\r\nThe streamer had planned to screen five films at the festival, includin… [+1397 chars]"}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Kristen Hare", "title": "It’s been a long week already. Here’s how local news has covered it.", "description": "From person-to-person coaching and intensive hands-on seminars to interactive online courses and media reporting, Poynter helps journalists sharpen skills and elevate storytelling throughout their careers.", "url": "https://www.poynter.org/reporting-editing/2020/its-been-a-long-week-already-heres-how-local-news-has-covered-it/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/RPY55A3SDFD2NMMFKADF3UJMUU.jpg", "publishedAt": "2020-03-05T13:45:20Z", "content": "I did not collect all the local Super Tuesday coverage, but here are quick samplings from: Vermont and VTDigger; Virginia and The Roanoke Times; North Carolina and The (Raleigh) News &amp; Observer; Alabama and al.com; Maine and the Portland Press Herald; Mas… [+1768 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Reuben Gregg Brewer)", "title": "Why Alliance Resource Partners Units Plummeted 25% in February", "description": "Coal miner Alliance Resource Partners got hit hard, and it wasn't really related to the market's COVID-19 concerns.", "url": "https://www.fool.com/investing/2020/03/05/why-alliance-resource-partners-units-plummeted-25.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561627/17_06_07-a-coal-miner-in-a-mine-_gettyimages-480624754.jpg", "publishedAt": "2020-03-05T13:25:00Z", "content": "What happened\r\nUnits of master limited partnershipAlliance Resource Partners(NASDAQ:ARLP) fell 25% in February, according to data from S&amp;P Global Market Intelligence. They were down by around 37% in the first two months of 2020. That's much worse than the… [+2578 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Reuben Gregg Brewer)", "title": "Why Chevron, Exxon, and ConocoPhillips All Fell by Double Digits in February", "description": "Investors in Chevron, Exxon, and ConocoPhillips have been taking it on the chin for a lot longer than one month. Here's what's been going on.", "url": "https://www.fool.com/investing/2020/03/05/why-chevron-exxon-and-conocophillips-all-fell-by-d.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561395/19_12_09-a-pair-of-hands-stained-with-oil-_gettyimages-821416626.jpg", "publishedAt": "2020-03-05T13:39:00Z", "content": "What happened\r\nShares of integrated energy giantChevron(NYSE:CVX) fell roughly 12% in February, according to data from S&amp;P Global Market Intelligence. Peer ExxonMobil's (NYSE:XOM) stock dropped even more, declining by 17%. Drilling-focused ConocoPhillips(… [+3225 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marshall Shepherd, Contributor, Marshall Shepherd, Contributor https://www.forbes.com/sites/marshallshepherd/", "title": "Why The Discipline Of Geography Is A Key Part Of The Coronavirus Fight", "description": "How the discipline of geography is helping in the fight against Coronavirus", "url": "https://www.forbes.com/sites/marshallshepherd/2020/03/05/why-the-discipline-of-geography-is-a-key-part-of-the-coronavirus-fight/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e61023d7d6f2600068eb9ed%2F0x0.jpg%3FcropX1%3D211%26cropX2%3D1016%26cropY1%3D126%26cropY2%3D579", "publishedAt": "2020-03-05T13:45:13Z", "content": "I am an atmospheric scientist with three degrees in meteorology. However, my tenured home at the University of Georgia is the Department of Geography. Like many of you reading this, I had a rather narrow understanding ofthe discipline when I left NASA to join… [+5480 chars]"}, {"source": {"id": null, "name": "Wfmz.com"}, "author": "Jamey Tucker", "title": "What the Tech? Sanitizing smartphones and laptops | What The Tech? - WFMZ Allentown", "description": "Everyone's talking about washing hands to stop the spread of the flu and the coronavirus, but what about the filthiest thing we touch every day?", "url": "https://www.wfmz.com/features/what-the-tech/what-the-tech-sanitizing-smartphones-and-laptops/article_de2d612e-5ee7-11ea-b034-437c9638d678.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wfmz.com/content/tncms/assets/v3/editorial/7/db/7dbde7f1-2554-5b76-bd04-987252b30214/5e610645cd031.image.jpg?resize=1120%2C630", "publishedAt": "2020-03-05T14:10:53Z", "content": "Everyone's talking about washing hands to stop the spread of the flu and the coronavirus, but what about the filthiest thing we touch every day? The thing that can transmit flu-carrying germs straight to clean hands? You know, smartphones and computers.\r\nClea… [+2692 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Google’s buzzy Anthos cloud technology is already being used by big banks — now it’s going into the telecom industry with a new AT&T partnership (GOOG, GOOGL)", "description": "On Thursday, Google Cloud announced a new strategy to go after telecommunications customers. Google Cloud is partnering with telecommunications companies like AT&T to build 5G products that can be used for retail, manufacturing, gaming, and other sectors. It …", "url": "https://www.businessinsider.com/google-cloud-anthos-for-telecom-att-2020-3", "urlToImage": "https://i.insider.com/5e39ec625bc79c451c2e3ec2?width=1200&format=jpeg", "publishedAt": "2020-03-05T14:00:00Z", "content": "In the past year, Google Cloud focused on bringing one of its newest products to finance customers, winning over customers like KeyBank and HSBC. Now, it's tackling another big industry: telecommunications.\r\nAbout a year ago, Google Cloud announced Anthos, wh… [+2947 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Davide Barbuscia and Parisa Hafezi", "title": "'Business is finished': Iranian merchants fear the worst as virus spreads - Yahoo Finance", "description": "Iranian merchants plying the busy Strait of Hormuz between Dubai and Iran fear their next trip home will be a one-way trip after the United Arab Emirates banned ferry services to prevent the spread of coronavirus.  Iran, which has emerged as an epicentre for …", "url": "https://finance.yahoo.com/news/business-finished-iranian-merchants-fear-135137445.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/LvRCPrpOYqSm4OeM0gjnKw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0094d59dc2886157c5b6f6ffef90ca4b", "publishedAt": "2020-03-05T13:51:00Z", "content": "By Davide Barbuscia and Parisa Hafezi\r\nDUBAI (Reuters) - Iranian merchants plying the busy Strait of Hormuz between Dubai and Iran fear their next trip home will be a one-way trip after the United Arab Emirates banned ferry services to prevent the spread of c… [+5518 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Four. There are now four coronavirus cases in NYC. Ah ha ha ha ha ha. Enjoy your subway commute New Yorkers [Sick]", "description": "Four. There are now four coronavirus cases in NYC. Ah ha ha ha ha ha. Enjoy your subway commute New Yorkers", "url": "https://www.fark.com/comments/10733329/Four-There-are-now-four-coronavirus-cases-in-NYC-Ah-ha-ha-ha-ha-ha-Enjoy-your-subway-commute-New-Yorkers", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/G/GU/fark_GUPcDNBruI9-ixxvomgzTNA0slo.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583730000&Signature=s%2Fmt9CoNuvCzOefNqB%2BoL8SXUkM%3D", "publishedAt": "2020-03-05T13:34:12Z", "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links. This is the number of comments. Click here to read them.\r\n… [+117 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Doctor calls for \"leadership\" amid coronavirus crisis", "description": "California health officials are rushing coronavirus testing kits to a cruise ship docked off-shore. A passenger who had disembarked within two weeks prior died on Wednesday, becoming the state’s first coronavirus-linked fatality. Governor Gavin Newsom declare…", "url": "https://www.cbsnews.com/video/doctor-calls-for-leadership-amid-coronavirus-crisis/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/05/864eddf4-fb3a-4eb5-9f1b-140533c2ab6f/thumbnail/1200x630/db9c0bdf68c3b46e1783abbd4da25ba7/0305-ctm-aguscornaviruquestions-agus-2041757-640x360.jpg", "publishedAt": "2020-03-05T13:22:31Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "South African health minister says health system will be tested by coronavirus", "description": "South Africa's health minister warned on Thursday that the country's health system would be tested by the coronavirus, after it earlier confirmed its first case.", "url": "https://www.reuters.com/article/us-health-coronavirus-safrica-minister-idUSKBN20S1Q9", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200305&t=2&i=1499114251&w=1200&r=LYNXMPEG2413E", "publishedAt": "2020-03-05T13:38:31Z", "content": "CAPE TOWN (Reuters) - South Africa’s health minister warned on Thursday that the country’s health system would be tested by the coronavirus, after it earlier confirmed its first case. \r\nHealth Minister Zweli Mkhize said citizens quarantined in China will be r… [+416 chars]"}, {"source": {"id": null, "name": "Kevinmd.com"}, "author": "Paul Sax, MD", "title": "An infectious disease doctor answers your COVID-19 and coronavirus questions", "description": "Being a specialist in infectious diseases right now is an interesting experience. Added to the usual challenges of our everyday practice — caring for people receiving transplants or chemotherapy, those with HIV, surgical infections, tropical diseases, and oth…", "url": "https://www.kevinmd.com/blog/2020/03/an-infectious-disease-doctor-answers-your-covid-19-and-coronavirus-questions.html", "urlToImage": "https://www.kevinmd.com/blog/wp-content/uploads/shutterstock_1621031059.jpg", "publishedAt": "2020-03-05T14:00:37Z", "content": "Being a specialist in infectious diseases right now is an interesting experience. Added to the usual challenges of our everyday practice caring for people receiving transplants or chemotherapy, those with HIV, surgical infections, tropical diseases, and other… [+5881 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: After James Bond delay, what next for Hollywood's new releases? - BBC News", "description": "Coronavirus: After James Bond delay, what next for Hollywood's new releases? BBC News ‘No Time To Die’ Release Date Moving To Fall In Hopes Global Theater Biz Back At Full Strength Deadline James Bond: 10 Things That Make Timothy Dalton A Better Bond Than Dan…", "url": "https://www.bbc.com/news/entertainment-arts-51750722", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/4407/production/_111151471_gettyimages-1203830489.jpg", "publishedAt": "2020-03-05T14:08:52Z", "content": "Image copyrightGetty Images\r\nDaniel Craig's swansong as James Bond has become the first major film to fall foul of the coronavirus outbreak, with the release of No Time To Die delayed by seven months until November.\r\nWith growing health concerns around the wo… [+6567 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Grace Hauck", "title": "Coronavirus is spreading in the US. Here's everything to know, from symptoms to how to protect yourself - USA TODAY", "description": "Coronavirus cases are increasing rapidly across the US. So, how did it start? And how should you prepare? Here's what you need to know about COVID-19.", "url": "https://www.usatoday.com/in-depth/news/health/2020/03/05/coronavirus-us-cases-symptoms-travel-deaths-prepare/4904568002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/04/USAT/395cbfe1-9bc3-4dc7-80dc-2bdae5222530-corona_US-promo_art-01.jpg?crop=1756,988,x1688,y307&width=1200", "publishedAt": "2020-03-05T13:40:00Z", "content": "The deadly coronavirus that began as a handful of infections in central China has rapidly become a worldwide outbreak, shutting down entire cities, threatening the health of thousands and testing the strength of the global economy.\r\nMore than96,800 cases of t… [+14782 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "William Ebbs", "title": "Africa Faces Coronavirus Catastrophe as Tourists Deliver Deadly Infection", "description": "Africa needs to restrict flights from hard-hit areas if it wants to avert a coronavirus catastrophe on the ill-prepared continent. The post Africa Faces Coronavirus Catastrophe as Tourists Deliver Deadly Infection appeared first on CCN.com", "url": "https://www.ccn.com/africa-faces-coronavirus-catastrophe-as-tourists-deliver-deadly-infection/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/Nigeria-Coronavirus-NTB.jpg", "publishedAt": "2020-03-05T13:30:36Z", "content": "<ul><li>The WHO advises against travel restrictions amid the coronavirus outbreak. But many countries are ignoring its advice.</li><li>Coronavirus cases are growing in Africa as international travelers bring the disease to Nigeria and other ill-prepared count… [+5741 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Francesco Guarascio", "title": "Europe could face more drug shortages as coronavirus squeezes supplies", "description": "Europe is experiencing delays in supplies of medicines and face masks because of coronavirus disruptions, according to EU and industry officials, compounding already acute shortages of drugs on the continent.", "url": "https://www.reuters.com/article/us-health-coronavirus-eu-idUSKBN20S1R2", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200305&t=2&i=1499117768&w=1200&r=LYNXMPEG2413O", "publishedAt": "2020-03-05T13:49:48Z", "content": "BRUSSELS (Reuters) - Europe is experiencing delays in supplies of medicines and face masks because of coronavirus disruptions, according to EU and industry officials, compounding already acute shortages of drugs on the continent. \r\nMany countries around the w… [+2444 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Coronavirus Reinforces Need for Workplace Contagious Disease Policy, says XpertHR", "description": "The COVID-19 coronavirus that's spreading around the world has made it clear that all employers need to have a written Contagious Disease Policy in place...", "url": "https://news.yahoo.com/coronavirus-reinforces-workplace-contagious-disease-133800441.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sr0uS0Hz3qP7Yruj3rD7Nw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTMyO2g9MzI-/https://s.yimg.com/uu/api/res/1.2/DffsUTGfc32kCnhDHIiAeg--~B/aD0xNjt3PTE2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/prnewswire.com/56aea466a4cbbaf1190fa34040917032", "publishedAt": "2020-03-05T13:38:00Z", "content": "Written Policies Can Help Prevent Spread of Disease and Guide Business Operations\r\nNEW PROVIDENCE, N.J., March 5, 2020 /PRNewswire/ -- The COVID-19 coronavirus that's spreading around the world has made it clear that all employers need to have a written Conta… [+3815 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Quick facts: How novel coronavirus (COVID-19) spreads from one person to the next - Gulf News", "description": "Quick facts: How novel coronavirus (COVID-19) spreads from one person to the next Gulf News Coronavirus or common flu: How do I find out? Times of India Coronavirus: How it is different from seasonal flu and common cold Hindustan Times How bad is coronavirus?…", "url": "https://www.youtube.com/watch?v=vYZDza0sYoM", "urlToImage": null, "publishedAt": "2020-03-05T13:33:09Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Silvia Aloisi", "title": "Kiss me? Are you mad? Coronavirus turns Italian life upside down", "description": "A day after their government ordered a limit on public gatherings and recommended that people avoid shaking hands to limit the spread of the coronavirus, normally sociable Italians have been grappling with new habits.", "url": "https://www.reuters.com/article/us-healthcare-coronavirus-italy-idUSKBN20S1RT", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-05T13:57:29Z", "content": "MILAN (Reuters) - A day after their government ordered a limit on public gatherings and recommended that people avoid shaking hands to limit the spread of the coronavirus, normally sociable Italians have been grappling with new habits. \r\nAt Iginio Massari, a … [+2781 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "NEVER LET A CRISIS GO TO WASTE: Pelosi’s ‘Dirty Little Secret?’ She Held Back Coronavirus Fund…", "description": "NEVER LET A CRISIS GO TO WASTE: Pelosi’s ‘Dirty Little Secret?’ She Held Back Coronavirus Funding Bill so DCCC Could Run Super Tuesday Ads Against GOP. Earlier: On PBS, David Brooks Sees ‘A Lot of Upside for the Democrats’ on Coronavirus.", "url": "https://pjmedia.com/instapundit/360419/", "urlToImage": null, "publishedAt": "2020-03-05T13:22:58Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Yaron Steinbuch", "title": "Coronavirus in Iran: Video shows body bags inside Qom hospital", "description": "Disturbing video has emerged of body bags strewn on the floors of a hospital in an Iranian city where the coronavirus was first detected in the hard-hit Islamic Republic.", "url": "https://nypost.com/2020/03/05/coronavirus-in-iran-video-shows-body-bags-inside-qom-hospital/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/cen-irancoronaburial-03.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-05T14:00:28Z", "content": "Disturbing video has emerged of body bags strewn on the floors of a hospital in an Iranian city where the coronavirus was first detected in the hard-hit Islamic Republic and the man who filmed it has been arrested, according to a report.\r\nThe footage, which w… [+1484 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "WELL, GOOD: Data show U.S. economy on solid footing as coronavirus fears mount. U.S. services se…", "description": "WELL, GOOD: Data show U.S. economy on solid footing as coronavirus fears mount. U.S. services sector activity jumped to a one-year high in February, suggesting strength in the economy before a recent escalation of recession fears ignited by the coronavirus ep…", "url": "https://pjmedia.com/instapundit/360443/", "urlToImage": null, "publishedAt": "2020-03-05T13:39:43Z", "content": "U.S. services sector activity jumped to a one-year high in February, suggesting strength in the economy before a recent escalation of recession fears ignited by the coronavirus epidemic that prompted an emergency interest rate cut from the Federal Reserve.\r\nT… [+242 chars]"}, {"source": {"id": null, "name": "Newyorker.com"}, "author": "Bill McKibben", "title": "What Can the Coronavirus Teach Us?", "description": "Bill McKibben writes about the fear and uncertainty surrounding the worldwide coronavirus outbreak and the lessons the epidemic may hold for how human beings relate to the climate crisis.", "url": "https://www.newyorker.com/news/annals-of-a-warming-planet/what-can-the-coronavirus-teach-us", "urlToImage": "https://media.newyorker.com/photos/5e5f27c715a1ec00087eae4b/16:9/w_1280,c_limit/McKibben-ClimateNewsletterCoronavirus.jpg", "publishedAt": "2020-03-05T13:13:00Z", "content": "Subscribers to The Climate Crisis newsletter received this piece in their in-boxes. Sign up to receive future installments.\r\nTheres nothing good about the novel coronavirusits killing many people, and shutting millions more inside, with fear as their main com… [+6844 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Shanthi Rexaline", "title": "Co-Diagnostics Says COVID-19 Test Kit Demand Surges In Recent Weeks", "description": "Co-Diagnostics Inc (NASDAQ: CODX) shares have been on a roll following the outbreak the COVID-19, the latest coronavirus strain that has stirred fears and anxiety. Shares received another boost Thursday following disclosure from the company that its COVID-19 …", "url": "https://finance.yahoo.com/news/co-diagnostics-says-covid-19-134009371.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/6LRzkHd6xHcVoVgbvDI8Cw--~B/aD00MDA7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/Benzinga/790672a4ca57fda6c6cf201f20ea7f3e", "publishedAt": "2020-03-05T13:40:09Z", "content": "Co-Diagnostics Inc (NASDAQ: CODX) shares have been on a roll following the outbreak the COVID-19, the latest coronavirus strain that has stirred fears and anxiety. Shares received another boost Thursday following disclosure from the company that its COVID-19 … [+1809 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "William Ebbs", "title": "Why Does Coronavirus Have a 29% Death Rate in Seattle?", "description": "So far, the coronavirus outbreak in King County looks like the most fatal in the world. It has an astronomical death rate of almost 30%. The post Why Does Coronavirus Have a 29% Death Rate in Seattle? appeared first on CCN.com", "url": "https://www.ccn.com/why-does-coronavirus-have-a-29-death-rate-in-seattle/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/Coronavirus-Seattle.jpg", "publishedAt": "2020-03-05T13:56:32Z", "content": null}, {"source": {"id": null, "name": "Spin.com"}, "author": "SPIN Staff", "title": "Slipknot Suspend Asia Tour Due to Corona Virus", "description": "Slipknot is the latest band to postpone their March tour dates in Asia due to the coronavirus. Aside from two Knotfest dates in Tokyo (March 20 and March 21), Slipknot were also slated to play Singapore Rock Fest (March 24), Hammersonic Festival (March 27) an…", "url": "https://www.spin.com/2020/03/slipknot-suspend-asia-tour-due-to-corona-virus/", "urlToImage": "https://s3-us-west-1.amazonaws.com/static-spin-com/files/2020/03/Slipknot-KevinWinter-1583415046.jpg", "publishedAt": "2020-03-05T14:06:13Z", "content": "Slipknot is the latest band to postpone their March tour dates in Asia due to the coronavirus. \r\nAside from two Knotfest dates in Tokyo (March 20 and March 21), Slipknot were also slated to play Singapore Rock Fest (March 24), Hammersonic Festival (March 27) … [+718 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "How are U.S. schools preparing for a coronavirus outbreak?", "description": "Schools around the world have shut down amid mounting coronavirus outbreaks. Although it appears children are less susceptible to the virus than adults, several schools in seven U.S. states have also temporarily closed as a precaution. Meg Oliver visits one m…", "url": "https://www.cbsnews.com/video/how-are-schools-preparing-for-coronavirus/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/05/b6f331ec-7e08-4041-b6e3-66127a6bf439/thumbnail/1200x630/cacebc1c38c7006a27ff1eeb6de2990a/0305-ctm-coronaschoolpreps-oliver-115841-2041768-640x360.jpg", "publishedAt": "2020-03-05T13:33:25Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Stephen Gandel", "title": "JPMorgan and other big banks seek coronavirus relief", "description": "Critics say banks are seeking to exploit the outbreak to weaken rules designed to ensure their financial stability.", "url": "https://www.cbsnews.com/news/coronavirus-jpmorgan-chase-and-other-big-banks-regulatory-relief/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/05/27b9143d-0248-4cd9-aea9-23c21c6b8171/thumbnail/1200x630/d72e5b95f2b8bb8159a0ea5f6bf0ad73/gettyimages-1169074323.jpg", "publishedAt": "2020-03-05T13:37:52Z", "content": "A lobbying group for the nation's largest banks wants the Federal Reserve to permanently relax a number of regulations put in place after the 2008 financial crisis. The reason: To help lenders deal with any economic fallout from the novel coronavirus, also kn… [+2901 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "6 ways the US government could help contain the new coronavirus - Livescience.com", "description": "6 ways the US government could help contain the new coronavirus Livescience.com Coronavirus precaution: 10 ways to make sure you do not catch the disease Economic Times CDC broadens standards to give more Americans coronavirus tests - Business Insider Busines…", "url": "https://www.livescience.com/contain-coronavirus-spread-in-us.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oEdh9vJFx94BDwvSWs3gFL-1200-80.jpg", "publishedAt": "2020-03-05T13:58:00Z", "content": "Fighting a new infectious disease is no easy feat for any government. But certain actions, or lack thereof, can make matters much worse. \r\nNow that the new coronavirus\r\n, known as SARS-CoV-2, is infecting people around the world, governments and health care s… [+6081 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "CONTAGION: Seattle feels like ‘ghost town,’ business owners say as they face life in coronavirus hot…", "description": "CONTAGION: Seattle feels like ‘ghost town,’ business owners say as they face life in coronavirus hot spot.", "url": "https://pjmedia.com/instapundit/360385/", "urlToImage": null, "publishedAt": "2020-03-05T13:36:20Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Apple supplier Foxconn's revenue hammered by coronavirus fallout", "description": "Apple's manufacturing partner Foxconn reported its biggest monthly drop in revenue in about seven years on Thursday as the coronavirus outbreak continued to play havoc with its business. The Taiwanese company, which assembles Apple's iPhones, saw revenue sink…", "url": "https://finance.yahoo.com/news/apple-supplier-foxconns-revenue-hammered-133644687.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ouQ0K8906DxEV0VqZYKnfw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/NDC.QBfAZe_PHQU4uP1ZOQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/f98e314ed7251099f1b1556b211023ea", "publishedAt": "2020-03-05T13:36:44Z", "content": "TAIPEI (Reuters) - Apple's manufacturing partner Foxconn &lt;2317.TW&gt; reported its biggest monthly drop in revenue in about seven years on Thursday as the coronavirus outbreak continued to play havoc with its business.\r\nThe Taiwanese company, which assembl… [+1794 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "World food prices dip in February, hurt by coronavirus - U.N.", "description": "The Food and Agriculture Organization (FAO) food priceindex, which measures monthly changes for a basket of cereals,oilseeds, dairy products, meat and sugar, averaged 180.5 points last month, down 1.0% on January. FAO also slightly upped its forecast for cere…", "url": "https://finance.yahoo.com/news/world-food-prices-dip-february-131504984.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/C1rv8Yx.iiHiPXzeHtGHUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NjkuNg--/https://s.yimg.com/uu/api/res/1.2/2FmQ5GnyflxN_MweZlEqmg--~B/aD00ODE7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/567875f82214d0039678d4ea80c68ba6", "publishedAt": "2020-03-05T13:15:04Z", "content": "ROME (Reuters) - World food prices slipped in February, ending four months of successive increases, with the spread of coronavirus dampening demand for some products, the United Nations food agency said on Thursday.\r\nThe Food and Agriculture Organization (FAO… [+1959 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Jesús Aguado", "title": "ECB tells banks to review continuity plans over coronavirus", "description": "The European Central Bank has asked euro zone banks to review their business continuity plans and the actions they can take to prepare for and minimize the potential adverse effects of the coronavirus, a letter seen by Reuters shows. In the letter dated Tuesd…", "url": "https://finance.yahoo.com/news/ecb-tells-banks-review-continuity-133422082.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NZHOYtXSOtXZof3BgC72Pg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzI-/https://s.yimg.com/uu/api/res/1.2/GTgH2KJ1jgwYJ5hBwGxjsQ--~B/aD01MjA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/6b3332f4915394de6b355e03750a0213", "publishedAt": "2020-03-05T13:34:22Z", "content": "By Jesús Aguado\r\nMADRID (Reuters) - The European Central Bank has asked euro zone banks to review their business continuity plans and the actions they can take to prepare for and minimize the potential adverse effects of the coronavirus, a letter seen by Reut… [+1430 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Quest Diagnostics to Launch Coronavirus Disease 2019 (COVID-19) Test", "description": "Quest Diagnostics (NYSE: DGX), the world's leading provider of diagnostic information services, today announced it will launch a coronavirus (COVID-19) test service. The new test service aids the presumptive detection of nucleic acid in respiratory specimens …", "url": "https://news.yahoo.com/quest-diagnostics-launch-coronavirus-disease-140500515.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/r.zr1PBTp3kZeOJycNG8Ow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTI1OA--/https://s.yimg.com/uu/api/res/1.2/0F4nhV4lS_KeBzRb8q4Fvg--~B/aD0xMjk7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/d8927199eaff6533f91f1696413b2a62", "publishedAt": "2020-03-05T14:05:00Z", "content": "Aim of new service is to supplement public health response in the United States\r\nSECAUCUS, N.J., March 5, 2020 /PRNewswire/ -- Quest Diagnostics (NYSE: DGX), the world's leading provider of diagnostic information services, today announced it will launch a cor… [+3325 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Outbreak Cases on the Rise - KJRH -TV | Tulsa | Channel 2", "description": "Coronavirus Outbreak Cases on the Rise KJRH -TV | Tulsa | Channel 2 Coronavirus spread continues across the world: Top developments Times of India Origin of Corona Virus : How did the Outbreak Spread in Wuhan and across the World | NewsX NewsX Cases Surge in …", "url": "https://www.youtube.com/watch?v=ZvAI0Wd0ODU", "urlToImage": "https://i.ytimg.com/vi/ZvAI0Wd0ODU/maxresdefault.jpg", "publishedAt": "2020-03-05T14:05:04Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Andy Chatterley, Contributor, Andy Chatterley, Contributor https://www.forbes.com/sites/andychatterley/", "title": "The New Going Viral", "description": "Inevitably, people will still want to watch the latest cinema releases, just not in an actual cinema but from the self-isolating comfort of their own home. And how will they do this? Step in from stage left, piracy.", "url": "https://www.forbes.com/sites/andychatterley/2020/03/05/the-new-going-viral/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F516089690%2F0x0.jpg", "publishedAt": "2020-03-05T13:36:49Z", "content": "The world is gripped by COVID-19 - the artist formerly known as the coronavirus - and whether you fall on the side of its not as bad as the flu or youre busily stockpiling for an impending zombie apocalypse, the one thing we can all agree on is that in three … [+4234 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Maggie Mulqueen", "title": "Curb your anxiety: What I'm telling patients about coping with coronavirus fears", "description": "A nurse walked into her session with me and said hospitals are overflowing with fearful individuals. She asked, 'Can’t you do something about all these anxious people?'", "url": "https://www.nbcnews.com/think/opinion/coronavirus-anxiety-running-so-high-all-my-therapy-patients-want-ncna1150126", "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2020_10/3256441/200304-coronavirus-anxiety-main-kh_6b61158fb11946860715851f37573c30.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-05T13:19:00Z", "content": "One of my patients, a nurse, walked into her therapy session on Monday and implored me to get these people out of my emergency room. She was clearly worn out from the increased volume of individuals visiting the hospital out of fear they have the coronavirus,… [+5988 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "CNN’s Sanjay Gupta left slack-jawed after hearing Trump say people with coronavirus should ‘go to work’", "description": "CNN’s Sanjay Gupta on Thursday appeared to be legitimately shocked after hearing President Donald Trump tell Fox News’ Sean Hannity that people who have coronavirus should be fine to continue going to work. After host John Berman played a clip of Trump tellin…", "url": "https://www.rawstory.com/2020/03/cnns-sanjay-gupta-left-slack-jawed-after-hearing-trump-say-people-with-coronavirus-should-go-to-work/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/gupta-3-2-1000x600.jpg", "publishedAt": "2020-03-05T13:50:00Z", "content": "President Donald Trump spoke with Fox News host Sean Hannity on Wednesday about a myriad of issues and rambling insults about Democrats. But one comment left some alleging the president was being reckless with the facts. \r\nThe World Health Organization has sa… [+402 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Peter Van Buren, TAC", "title": "Coronavirus: Trump-Deranged Media Making Us All Sick", "description": "The TDS press has lost all perspective when it comes to the president and frankly, it's making us all sick.", "url": "https://www.realclearpolitics.com/2020/03/05/coronavirus_trump-deranged_media_making_us_all_sick_503548.html", "urlToImage": "https://assets.realclear.com/images/50/502972_5_.jpg", "publishedAt": "2020-03-05T13:50:29Z", "content": "The TDS press has lost all perspective when it comes to the president and frankly, it's making us all sick.\r\nRead Full Article »"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Wright & Campbell, The Atlantic", "title": "The Coronavirus Is Exposing the Limits of Populism", "description": "Expertise matters. Institutions matter. There is such a thing as the global community. The system must be made to work again.", "url": "https://www.realclearpolitics.com/2020/03/05/the_coronavirus_is_exposing_the_limits_of_populism_503510.html", "urlToImage": "https://assets.realclear.com/images/50/503340_5_.jpg", "publishedAt": "2020-03-05T13:48:41Z", "content": "Expertise matters. Institutions matter. There is such a thing as the global community. The system must be made to work again.\r\nRead Full Article »"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Carolyn Cohn and Gianluca Semeraro", "title": "HSBC sends some London staff home after employee tests positive for coronavirus", "description": "LONDON/MILAN (Reuters) - HSBC has sent dozens of staff in London home after a worker tested positive for the coronavirus, the first known case at a major company in Europe's main financial hub. Italy's UniCredit also told some staff to go home after two new i…", "url": "https://finance.yahoo.com/news/hsbc-sends-london-staff-home-133446879.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/O1ACljNhAX4cOMnSaDRnCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjguOA--/https://s.yimg.com/uu/api/res/1.2/WeSXucGWl0tcr5ZFp9zd5w--~B/aD01NDM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/1103e474153e3931833cb7b61261b010", "publishedAt": "2020-03-05T13:34:46Z", "content": "By Carolyn Cohn and Gianluca Semeraro\r\nLONDON/MILAN (Reuters) - HSBC has sent dozens of staff in London home after a worker tested positive for the coronavirus, the first known case at a major company in Europe's main financial hub.\r\nItaly's UniCredit also to… [+2878 chars]"}, {"source": {"id": null, "name": "Mrunal.org"}, "author": "Mrunal", "title": "[Free] 17 Ethics Sample Case Studies from Disha’s epitome of Ethics, Integrity and Aptitude for UPSC Mains GS4 (Ethics), a book by Ajit Kumar Jha", "description": "Introduction Case Study for Ethics: Coronavirus disease (COVID-19) Case Study for Ethics: COP 25, Madrid: failed environmental ethics Case Study for Ethics: Nirbhaya convicts: Delayed Justice Case Study for Ethics: CAA vs right to equality Case Study for Ethi…", "url": "https://mrunal.org/2020/03/free-ethics-case-studies-upsc-disha.html", "urlToImage": "https://mrunal.org/wp-content/uploads/2020/03/disha-advertorial4-FB.png", "publishedAt": "2020-03-05T14:00:42Z", "content": "<ol><li>Introduction</li><li>Case Study for Ethics: Coronavirus disease (COVID-19)</li><li>Case Study for Ethics: COP 25, Madrid: failed environmental ethics</li><li>Case Study for Ethics: Nirbhaya convicts: Delayed Justice</li><li>Case Study for Ethics: CAA … [+18196 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "IDF troops banned from leaving Israel over coronavirus fears", "description": "No IDF soldiers will be able to leave Israel starting at noon on Friday in order to prevent the spread of the coronavirus, IDF Spokesman Brig.-Gen. Hidai Zilberman said on Thursday.", "url": "https://www.rt.com/newsline/482411-idf-troops-israel-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e61060f85f54022524b7e74.JPG", "publishedAt": "2020-03-05T13:45:00Z", "content": "No IDF soldiers will be able to leave Israel from noon on Friday in order to prevent the spread of the coronavirus, IDF spokesman Brig.-Gen. Hidai Zilberman said on Thursday. The decision was made by IDF Chief of Staff Lt.-Gen. Aviv Kochavi in accordance with… [+766 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Nicholas Rossolillo)", "title": "3 Top Growth Stocks to Buy in March", "description": "When markets are in retreat, buying growth companies is a great way to beat average stock returns.", "url": "https://www.fool.com/investing/2020/03/05/3-top-growth-stocks-to-buy-in-march.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561067/smartphone-millennials-getty-6217.jpg", "publishedAt": "2020-03-05T13:45:00Z", "content": "The last week of February 2020 was a bloodbath for stocks. Even the highest of growth companies around weren't spared as fear of pandemic gripped investors around the globe. As painful as the historic coronavirus-fueled stock market retreat was (it was one of… [+6400 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Сoronavirus is a product of US ‘biological attack’ aimed at Iran & China, IRCG chief claims", "description": "The coronavirus spreading across the world may in be a bioweapon unleashed by the United States, the head of Iran's Islamic Revolutionary Guard Corps (IRGC) has theorized, as Tehran struggles to contain the deadly illness. Read Full Article at RT.com", "url": "https://www.rt.com/news/482405-iran-coronavirus-us-biological-weapon/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e60f6b485f5401f502c67b4.JPG", "publishedAt": "2020-03-05T13:29:00Z", "content": "\"It is possible that this virus is a product of a biological attack by America which initially spread to China and then to Iran and the rest of the world,\" Hossein Salami said on Thursday, as reported by state media. He vowed that Iran would \"fight\" the virus… [+1340 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Mughal Gardens to be Closed For Public From March 7 in View of Coronavirus Outbreak, Says Rashtrapati Bha... - News18", "description": "Mughal Gardens to be Closed For Public From March 7 in View of Coronavirus Outbreak, Says Rashtrapati Bha... News18 Mughal Gardens at Rashtrapati Bhavan to be closed from March 7 over coronavirus Hindustan Times Mughal Gardens will be closed from March 7 to a…", "url": "https://www.news18.com/news/india/mughal-gardens-to-be-closed-for-public-from-march-7-in-view-of-coronavirus-outbreak-says-rashtrapati-bhavan-2527295.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2017/07/Mughal-garden.jpg", "publishedAt": "2020-03-05T14:03:42Z", "content": "The popular Mughal Gardens will be closed for public from Saturday in view of the coronavirus outbreak, Rashtrapati Bhavan said on Thursday. \"Continuing the precautionary measures at Rashtrapati Bhavan in view of COVID-19 Novel Coronavirus, the Mughal Gardens… [+628 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Running with Miles", "title": "The 2020 Jerusalem Marathon Postponed Due to Coronavirus", "description": "The 2020 Jerusalem Marathon has been postponed due to the coronavirus. Jerusalem joins a growing number of cities that have had to make changes due to coronavirus. The post The 2020 Jerusalem Marathon Postponed Due to Coronavirus appeared first on Running wit…", "url": "https://runningwithmiles.boardingarea.com/2020-jerusalem-marathon-postponed/", "urlToImage": "https://runningwithmiles.boardingarea.com/wp-content/uploads/2017/05/Jerusalemimage.jpg", "publishedAt": "2020-03-05T13:54:46Z", "content": "The 2020 Jerusalem Marathon has been postponed due to the coronavirus. Jerusalem joins a growing number of cities that have had to make changes due to coronavirus. Another big name marathon has just made a change for 2020 the Jerusalem Marathon. This was to h… [+2767 chars]"}]