[{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "School's out: Parents stressed by Italy coronavirus shutdown", "description": "Children being sent home from school and absent tourists leave Italy reeling from coronavirus.", "url": "https://www.bbc.co.uk/news/world-europe-51751031", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16E9E/production/_111145839_italyturinclassrtr2mar.jpg", "publishedAt": "2020-03-06T02:47:22Z", "content": "Image copyrightReutersImage caption\r\n A cleaner sanitises an empty classroom in Turin\r\nAt the San Cosimato playground in Rome, parents have that unmistakeable look of \"how on Earth am I going to entertain them?\"\r\nThe perennial problem has struck early this ye… [+4720 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Caitlin McGarry", "title": "Apple Cracks Down on Coronavirus Apps, Which Is Probably for the Best", "description": "As social networks race to curb the spread of misinformation about COVID-19 and Amazon tries to weed out price-gouging Purell listings, Apple is taking its own stance: rejecting coronavirus apps submitted by iOS app developers who aren’t affiliated with offic…", "url": "https://gizmodo.com/apple-cracks-down-on-coronavirus-apps-which-is-probabl-1842135199", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/p5ekjuphqxwyev9mzfvz.jpg", "publishedAt": "2020-03-06T02:42:00Z", "content": "As social networks race to curb the spread of misinformation about COVID-19 and Amazon tries to weed out price-gouging Purell listings, Apple is taking its own stance: rejecting coronavirus apps submitted by iOS app developers who arent affiliated with offici… [+2039 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jeremy Fuster", "title": "James Bond’s Box Office History Shows Why a ‘No Time to Die’ Release Move Was Necessary - Yahoo Entertainment", "description": "James Bond’s Box Office History Shows Why a ‘No Time to Die’ Release Move Was Necessary Yahoo Entertainment James Bond Flick 'No Time to Die' Delayed Over Coronavirus WIRED MGM to Take $30 Million-Plus Hit After Moving Bond Film 'No Time to Die' Hollywood Rep…", "url": "https://www.yahoo.com/entertainment/james-bond-box-office-history-021505500.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/21k09Fwnu8t3fp60Ejsmlw--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/659eb235c953d682236489795a9c94fb", "publishedAt": "2020-03-06T02:29:14Z", "content": "James Bond has faced plenty of villains, but his greatest foe yet might be the coronavirus, as the ongoing fight against the disease has caused the latest 007 film to be pushed from an early April release to November. A look at the spys box office history sho… [+2658 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Graham Slaughter", "title": "Canada confirms first 'community case' of COVID-19: Here's what that means - CTV News", "description": "Canada confirms first 'community case' of COVID-19: Here's what that means CTV News 8 more cases of COVID-19 virus identified in B.C., including 1 of unknown origin CBC.ca Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 les…", "url": "https://www.ctvnews.ca/health/coronavirus/canada-confirms-first-community-case-of-covid-19-here-s-what-that-means-1.4841249", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4841264.1583461677!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-06T02:30:00Z", "content": "TORONTO -- \r\nA woman in B.C. has tested positive for COVID-19 despite not having travelled recently and having no known contact with anyone infected with the virus.\r\nUntil now, all cases in Canada involved individuals who had recently travelled to countries s… [+3516 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "South Korea has tested 140,000 people for the coronavirus. That could explain why its death rate is just 0.6% — far lower than in China or the US.", "description": "South Korea has tested more than 140,000 people for the new coronavirus and confirmed more than 6,000 cases. Its fatality rate is around 0.6%. This suggests that, as many health experts have predicted, the virus' fatality rate seems to decrease as more cases …", "url": "https://www.businessinsider.com/south-korea-coronavirus-testing-death-rate-2020-3", "urlToImage": "https://i.insider.com/5e618241fee23d0e830c8fab?width=1200&format=jpeg", "publishedAt": "2020-03-06T03:10:00Z", "content": "The US and South Korea announced their first cases of the coronavirus on the same day: January 20. More than six weeks later, the US Centers for Disease Control and Prevention has tested around 1,500 people for the virus. South Korea, meanwhile, has tested ab… [+5878 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Local officials ask Apple and others to cancel conferences and avoid travel due to coronavirus", "description": "Santa Clara County has issued a new recommendation this evening designed to combat the spread of coronavirus. As first reported by The Verge, the county is recommending that big tech companies in Cupertino, Mountain View, Palo Alto, and San Jose avoid unneces…", "url": "https://9to5mac.com/2020/03/05/apple-cancel-events-coronavirus/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/08/Steve-Jobs-Theater-apple-event.jpg?quality=82&strip=all", "publishedAt": "2020-03-06T02:44:47Z", "content": "Santa Clara County has issued a new recommendation this evening designed to combat the spread of coronavirus. As first reported by The Verge, the county is recommending that big tech companies in Cupertino, Mountain View, Palo Alto, and San Jose avoid unneces… [+2016 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Matt Wilstein", "title": "Seth Meyers Rips ‘Dr. Trump’ for Spreading Coronavirus ‘Disinformation’", "description": "As the coronavirus outbreak continues to get worse, Seth Meyers accused President Trump of “trying to pretend the problem doesn’t exist, because he knows he’ll get blamed for it.” That also explains why he even tried blaming President Obama for the nationwide…", "url": "https://news.yahoo.com/seth-meyers-rips-dr-trump-025816981.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/wDNIjxD_dykvVW0jyBpApw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/nQ7YPDjlrE02Zinp4iE2kQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/297908e047856ad247c8a9e72a97a9cc", "publishedAt": "2020-03-06T02:58:16Z", "content": "As the coronavirus outbreak continues to get worse, Seth Meyers accused President Trump of trying to pretend the problem doesnt exist, because he knows hell get blamed for it. That also explains why he even tried blaming President Obama for the nationwide tes… [+1690 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Deaths in Singapore 'inevitable' as coronavirus spreads globally - minister", "description": "Praised by the World Health Organisation for its efforts to prevent the coronavirus from spreading, Singapore warned on Friday that deaths in the city state would become \"inevitable\" as a global pandemic emerges. Since erupting in China late last year, the ep…", "url": "https://news.yahoo.com/singapore-minister-says-coronavirus-outbreak-024052193.html", "urlToImage": null, "publishedAt": "2020-03-06T02:40:52Z", "content": null}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Boing Boing's Shop", "title": "Kickstart your digital marketing career with this 100-hour training bundle", "description": "What falls under the heading of digital marketing these days? Well, frankly...a heck of a lot. Once you start factoring in everything from search engines and social media to emails and the vast network of websites out there and before you know it, it’s easy f…", "url": "https://boingboing.net/2020/03/05/kickstart-your-digital-marketi.html", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-03-06T03:00:31Z", "content": "What falls under the heading of digital marketing these days? Well, frankly...a heck of a lot. Once you start factoring in everything from search engines and social media to emails and the vast network of websites out there and before you know it, its easy fo… [+3461 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Matthew Choi", "title": "Trump talks of accomplishments, coronavirus at Fox News town hall", "description": "The president says that on a variety of issues, he was dealt a bad hand and needs more time.", "url": "https://www.politico.com/news/2020/03/05/trump-fox-news-town-hall-122555", "urlToImage": "https://static.politico.com/37/9a/e2b6d7cb48768acccafeec097eb6/200305-donald-trump-ap-773.jpg", "publishedAt": "2020-03-06T02:45:08Z", "content": "But Trump was not totally free from scrutiny, being asked to answer for the administrations initial halting response to a coronavirus epidemic that is spreading throughout the world and the U.S. Instead of responding with concrete plans that might allay fears… [+4948 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Althea Legaspi", "title": "Ozzy Osbourne Cancels SXSW Appearances Amid Coronavirus Concerns", "description": "Trent Reznor and Atticus Ross also pulled out of the Austin festival on Thursday", "url": "https://www.rollingstone.com/music/music-news/ozzy-osbourne-cancels-sxsw-appearance-coronavirus-963271/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/10539788cr.jpg", "publishedAt": "2020-03-06T02:17:10Z", "content": "Ozzy Osbourne has canceled his plans to appear at South by Southwest Festival amid coronavirus concerns. The artist announced the news on Thursday in the wake of several others pulling out of events scheduled for the annual technology, film and music festival… [+1632 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": null, "title": "Coronavirus: How to keep your phone, laptop clean", "description": "With the number of coronavirus cases reported from across the world crossing 93,500, the responsibility to contain the COVID-19 lies with all citizens. However, there’s no reason to panic and one just needs to exercise caution by keeping up with basic hygiene…", "url": "https://www.gadgetsnow.com/slideshows/coronavirus-10-things-you-must-do-to-prevent-your-smartphone-laptop-from-spreading-infection/photolist/74498692.cms", "urlToImage": "https://static.toiimg.com/photo/74498692.cms", "publishedAt": "2020-03-06T02:26:38Z", "content": "With the number of coronavirus\r\n cases reported from across the world crossing 93,500, the responsibility to contain the COVID-19\r\n lies with all citizens. However, there’s no reason to panic and one just needs to exercise caution by keeping up with basic hyg… [+524 chars]"}, {"source": {"id": null, "name": "Nbcboston.com"}, "author": "Mike Pescaro", "title": "Mass. Health Officials Say Middlesex County Woman Presumed to Have Coronavirus - NBC10 Boston", "description": "Mass. Health Officials Say Middlesex County Woman Presumed to Have Coronavirus NBC10 Boston Third Person Tests Positive For Coronavirus In Massachusetts CBS Boston South Shore Health Says Patient Has Presumptive Coronavirus Case NBC10 Boston Mass. health offi…", "url": "https://www.nbcboston.com/news/local/mass-health-officials-say-middlesex-county-woman-presumed-to-have-coronavrius/2086542/", "urlToImage": "https://media.nbcboston.com/2019/09/TLMD-coronavirus-CDC.jpg?resize=850%2C478", "publishedAt": "2020-03-06T02:13:30Z", "content": "The Massachusetts Department of Public Health confirmed a third possible case of coronavirus in the state Thursday.\r\nA Middlesex County woman in her 60s has a presumptive case of COVID-19, the DPH said Thursday. The woman recently traveled to northern Italy.\r… [+799 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Arweave, which uses blockchain to perpetually host sites and apps, raises $8.3M seed from a16z, USV, and Coinbase Ventures, four months after raising $5M (Josh Constine/TechCrunch)", "description": "Josh Constine / TechCrunch : Arweave, which uses blockchain to perpetually host sites and apps, raises $8.3M seed from a16z, USV, and Coinbase Ventures, four months after raising $5M — The Chinese government has been removing criticism of its coronavirus resp…", "url": "https://www.techmeme.com/200305/p39", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Coronavirus-censorship.jpg?w=712", "publishedAt": "2020-03-06T02:35:01Z", "content": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 9:40 PM ET, March 5, 2020.\r\nThe most current version of the site as always is available at our home page.\r\nTo view an earlier snapshot click here\r\nand then modify the date in… [+7 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Singapore to Introduce New Cleanliness Rules Amid Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/singapore-to-amend-environmental-public-health-act", "urlToImage": null, "publishedAt": "2020-03-06T02:21:53Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Daniel Leussink", "title": "Coronavirus crisis threatens to silence Japan's tourist boom", "description": "The restaurants at the Exitmelsa shopping center in Tokyo's upscale Ginza district are usually packed with Chinese tourists. But on a recent weekday, many lunchtime tables were empty, a sign of the toll that the coronavirus is taking on tourism.", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-tourism-idUSKBN20T09C", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499357309&w=1200&r=LYNXMPEG25064", "publishedAt": "2020-03-06T02:38:13Z", "content": "TOKYO (Reuters) - The restaurants at the Exitmelsa shopping center in Tokyo’s upscale Ginza district are usually packed with Chinese tourists. But on a recent weekday, many lunchtime tables were empty, a sign of the toll that the coronavirus is taking on tour… [+4748 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "COVID-19, live updates: Australia closes first school after student contracts COVID-19", "description": "The U.N. health agency urged all countries to push this virus back, a call to action reinforced by figures showing about 17 times as many new infections outside China as in it.", "url": "https://www.thehindu.com/news/national/covid-19-live-updates-march-6-2020/article30997447.ece", "urlToImage": "https://www.thehindu.com/news/national/v1mmyq/article30997446.ece/ALTERNATES/LANDSCAPE_615/COVID-19", "publishedAt": "2020-03-06T02:47:08Z", "content": "The global march of the new virus triggered a vigorous appeal from the WHO for governments to pull out all the stops to slow the epidemic, as it drained colour from Indias spring festivities, closed Bethlehems Nativity Church and blocked Italians from visitin… [+4136 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan says virus travel restrictions not too late as South Korea protests", "description": "Japan's government defended new, tighter travel restrictions on visitors from China and South Korea, saying they were not too late to help slow the spread of the coronavirus outbreak, as Seoul protested the measures as \"excessive.\"", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-idUSKBN20T08B", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499355248&w=1200&r=LYNXMPEG2505L", "publishedAt": "2020-03-06T02:32:34Z", "content": "TOKYO (Reuters) - Japan’s government defended new, tighter travel restrictions on visitors from China and South Korea, saying they were not too late to help slow the spread of the coronavirus outbreak, as Seoul protested the measures as “excessive.” \r\n“The de… [+977 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Santa Clara County Asks Google, Apple and Others to Cancel Large In-Person Meetings and Conferences", "description": "Santa Clara County, which includes cities like Cupertino, Palo Alto, Mountain View, and San Jose, today issued new health guidelines (via The Verge ) recommending that companies minimize or cancel \"large in-person meetings and conferences.\" The updated guidan…", "url": "https://www.macrumors.com/2020/03/05/santa-clara-county-covid-19-cancel-conferences/", "urlToImage": "https://images.macrumors.com/article-new/2018/06/apple-park-drone-june-2018-2.jpg", "publishedAt": "2020-03-06T02:22:58Z", "content": "Santa Clara County, which includes cities like Cupertino, Palo Alto, Mountain View, and San Jose, today issued new health guidelines (via The Verge) recommending that companies minimize or cancel \"large in-person meetings and conferences.\"\r\nThe updated guidan… [+2294 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook recommends that all Bay Area employees work from home due to coronavirus fears (FB)", "description": "Facebook is \"strongly\" recommending that all Bay Area employees should work from home, starting on Friday, March 6. \"This decision is based on our desire to minimize the risk of spreading COVID-19. The health and safety of our teams, their loved ones and our …", "url": "https://www.businessinsider.com/coronavirus-facebook-recommends-all-bay-area-employees-work-from-home-2020-3", "urlToImage": "https://i.insider.com/5e5ee272fee23d1af1211a29?width=1200&format=jpeg", "publishedAt": "2020-03-06T02:59:27Z", "content": "Facebook is \"strongly\" recommending that all of its Bay Area employees work remotely as fears grow around the coronavirus outbreak.\r\nIn a statement sent late Thursday, a Facebook spokesperson told Business Insider: \"Based on guidance from Santa Clara County t… [+1532 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Gabrielle Chung", "title": "Ariana Grande Hilariously Responds to Meme About How She Washes Hands Amid Coronavirus Outbreak", "description": "Ariana Grande ‘s love of oversized hoodies has inspired its own meme — and now the singer is weighing in on the joke amid coronavirus concerns. It all started on Thursday when Paper magazine shared a video titled “Ariana Grande washing her hands” on their Ins…", "url": "https://people.com/music/ariana-grande-responds-meme-about-how-she-washes-hands-amid-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Farianna-grande-hand-washing.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T02:24:56Z", "content": "Ariana Grande‘s love of oversized hoodies has inspired its own meme — and now the singer is weighing in on the joke amid coronavirus concerns.\r\nIt all started on Thursday when Paper magazine shared a video titled “Ariana Grande washing her hands” on their Ins… [+2258 chars]"}, {"source": {"id": null, "name": "Wsoctv.com"}, "author": "WSOCTV.com News Staff", "title": "Wells Fargo restricts nonessential business air travel in U.S. due to coronavirus - WSOC Charlotte", "description": "Wells Fargo, one of Charlotte’s largest banking employer, is restricting non-essential business air travel in the U.S. to help minimize the potential spread of the coronavirus.", "url": "https://www.wsoctv.com/news/local/wells-fargo-restricts-nonessential-business-air-travel-us-due-coronavirus/M3GQKKCP3BAABMFSXATMZZZOKQ/", "urlToImage": "https://www.wsoctv.com/resizer/1TT7JCRbllSzwGoy_xEL-4ajG1o=/1200x628/d1hfln2sfez66z.cloudfront.net/03-06-2020/t_bfaba45b0e674c5793711c00fabf12c7_name_ORVZAM55ROKDNOE5FDJR6QZ5Z4.jpg", "publishedAt": "2020-03-06T03:01:20Z", "content": "CHARLOTTE — Wells Fargo, one of Charlottes largest banking employers, is restricting nonessential business air travel in the U.S. to help minimize the potential spread of the coronavirus.\r\nOur first priority remains keeping Wells Fargo employees and customers… [+828 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Saudi Arabia reopens Mecca, Medina holy sites after coronavirus closure: state TV", "description": "Saudi Arabia reopened two of the most holy religious sites in Islam, Al-Haram Mosque in Mecca and Al-Masjid al Nabawy in Medina, after they were closed for sterilization to halt the spread of the new coronavirus, state TV Al-Ekhbariya reported on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-saudi-mosque-idUSKBN20T0A8", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499359285&w=1200&r=LYNXMPEG2506P", "publishedAt": "2020-03-06T02:46:29Z", "content": "CAIRO (Reuters) - Saudi Arabia reopened two of the most holy religious sites in Islam, Al-Haram Mosque in Mecca and Al-Masjid al Nabawy in Medina, after they were closed for sterilization to halt the spread of the new coronavirus, state TV Al-Ekhbariya report… [+580 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Melody Gutierrez", "title": "Neighbors of first Californian to die from coronavirus anxiously await word. 'That's close to home'", "description": "Neighbors of first Californian to die from coronavirus anxiously await word.", "url": "https://www.latimes.com/california/story/2020-03-05/coronavirus-victim-neighbors", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/de62693/2147483647/strip/true/crop/3000x1575+0+132/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F21%2Fad%2F38dc955b4b90b2aac0a7ebe6ba4f%2Fvirus-outbreak-50990.jpg", "publishedAt": "2020-03-06T02:12:49Z", "content": "Police began blocking access to the home of Californias first fatality attributed to the coronavirus in Rocklin on Thursday as worried neighbors stood in their yards asking for information.\r\nThe 75-year-old man who died Wednesday had tested positive for COVID… [+2588 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Japan and South Korea in quarantine row - BBC News", "description": "Coronavirus: Japan and South Korea in quarantine row BBC News South Korea Blasts Japan’s ‘Irrational’ Decision to Quarantine Its Citizens Bloomberg Shinzo Abe, Japan’s Political Houdini, Can’t Escape Coronavirus Backlash The New York Times Latest: China’s vir…", "url": "https://www.bbc.co.uk/news/live/world-asia-51764135", "urlToImage": "https://m.files.bbci.co.uk/modules/bbc-morph-news-waf-page-meta/4.1.2/bbc_news_logo.png", "publishedAt": "2020-03-06T02:51:09Z", "content": "A celebrated Australian composer, Brett Dean, has been\r\ndiagnosed with coronavirus, his agency has confirmed.\r\nThe renowned violist and conductor is being treated in a\r\nhospital in Adelaide, South Australia.\r\nThe 58-year-old had been due to lead the Adelaide … [+534 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Wayne Rash, Contributor, Wayne Rash, Contributor https://www.forbes.com/sites/waynerash/", "title": "As A Coronavirus Response Working From Home May Not Work", "description": "Telling companies to simply have their employees work from home is easier said than done.", "url": "https://www.forbes.com/sites/waynerash/2020/03/05/as-a-coronavirus-response-working-from-home-may-not-work/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204257717%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D4925%26cropY1%3D703%26cropY2%3D2214", "publishedAt": "2020-03-06T02:12:15Z", "content": "Getty\r\nPublic health officials in King County, Washington, are recommending that employers in the county, which includes Seattle, allow their employees to work from home. In a statement issued on the King County public health blog, those officials also recomm… [+5865 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Matt Wilstein", "title": "Seth Meyers Rips ‘Dr. Trump’ for Spreading Coronavirus ‘Disinformation’", "description": "As the coronavirus outbreak continues to get worse, Seth Meyers accused President Trump of “trying to pretend the problem doesn’t exist, because he knows he’ll get blamed for it.” That also explains why he even tried blaming President Obama for the nationwide…", "url": "https://www.thedailybeast.com/seth-meyers-rips-dr-trump-for-spreading-coronavirus-disinformation", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583463333/SM_e5pw7y", "publishedAt": "2020-03-06T02:58:16Z", "content": "As the coronavirus outbreak continues to get worse, Seth Meyers accused President Trump of trying to pretend the problem doesnt exist, because he knows hell get blamed for it. That also explains why he even tried blaming President Obama for the nationwide tes… [+1416 chars]"}, {"source": {"id": null, "name": "Wkow.com"}, "author": "A. J. Bayatpour", "title": "Large event hosts monitoring Coronavirus updates; for now, it's business as usual - WKOW", "description": "Dane County is set to host a number of large gatherings in the coming months. Those hosting the events said Thursday they are discussing possible contingency plans should the new coronavirus strain spread in Southern Wisconsin. For now, they're proceeding as …", "url": "https://wkow.com/2020/03/05/large-event-hosts-monitoring-coronavirus-updates-for-now-its-business-as-usual/", "urlToImage": "https://quincy-network.s3.ca-central-1.amazonaws.com/wp-content/uploads/sites/8/2020/03/public-events.png", "publishedAt": "2020-03-06T02:11:55Z", "content": "MADISON (WKOW) -- Dane County is set to host a number of large gatherings in the coming months. Those hosting the events said Thursday they are discussing possible contingency plans should the new coronavirus strain spread in Southern Wisconsin. For now, they… [+2021 chars]"}, {"source": {"id": null, "name": "Aspentimes.com"}, "author": "Scott Condon", "title": "Report assess potential business impact of coronavirus on resorts such as Aspen - Aspen Times", "description": "The travel business faces a “one-two punch” from the coronavirus that threatens to cool what’s been a solid winter for Western mountain resorts, according to Inntopia, a company that examines occupancy rates and bookings for clients such as Aspen-Snowmass.The…", "url": "https://www.aspentimes.com/news/report-assess-potential-business-impact-of-coronavirus-on-resorts-such-as-aspen/", "urlToImage": "https://cdn.aspentimes.com/wp-content/uploads/sites/5/2020/03/AP20065810396342-1024x683.jpg", "publishedAt": "2020-03-06T02:58:04Z", "content": "The travel business faces a one-two punch from the coronavirus that threatens to cool whats been a solid winter for Western mountain resorts, according to Inntopia, a company that examines occupancy rates and bookings for clients such as Aspen-Snowmass.\r\nThe … [+4961 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Sourcing Allies Launches Coronavirus Support Services for North American and European Businesses That Manufacture in China", "description": "China sourcing company Sourcing Allies announces the launch of Coronavirus support services for Western businesses whose supply of China-manufactured goods has been affected because of the outbreak of the deadly virus. Their team of British, American, Swedish…", "url": "https://news.yahoo.com/sourcing-allies-launches-coronavirus-support-030000474.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8xYy.0HhzmaHS5etSdnlpA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTMyO2g9MzI-/https://s.yimg.com/uu/api/res/1.2/kV7mFQPMYw4sxNTTMJ_VIw--~B/aD0xNjt3PTE2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/prnewswire.com/0358426134d8304ee257e9b172fdec60", "publishedAt": "2020-03-06T03:00:00Z", "content": "Sourcing Allies' China-based sourcing experts, comprising of U.S., U.K., Swedish and Chinese nationals, will help businesses get fast and accurate information regarding their orders.\r\nBELLEVUE, Wash., March 5, 2020 /PRNewswire/ -- China sourcing company Sourc… [+2990 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jon Quast)", "title": "Starbucks Gives Investors a Surprise Update on China", "description": "Many stores are back open, but sales have plummeted.", "url": "https://www.fool.com/investing/2020/03/05/starbucks-updates-investors-on-china.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561856/starbucks-china.jpg", "publishedAt": "2020-03-06T03:11:00Z", "content": "In an unscheduled SEC filing on March 5, coffee-giant Starbucks(NASDAQ:SBUX) provided an update for its shareholders regarding its business in China. The coronavirus outbreak has been a major issue to the Chinese economy, where Starbucks has 13% of its total … [+1284 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "The coronavirus crisis", "description": "The Boston Globe is providing coverage of the coronavirus outbreak to keep you informed on the virus, track the latest developments on its spread, and educate you on how you can remain safe during this period.", "url": "https://www.bostonglobe.com/nation/special-reports/coronavirus/", "urlToImage": null, "publishedAt": "2020-03-06T02:41:23Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Singapore minister says coronavirus outbreak emerging as pandemic", "description": "The coronavirus spreading around the world from China is \"starting to look like a global pandemic,\" said Singapore minister Lawrence Wong, who co-heads the country's virus fighting taskforce.", "url": "https://www.reuters.com/article/us-health-coronavirus-singapore-idUSKBN20T0A0", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499357874&w=1200&r=LYNXMPEG2506L", "publishedAt": "2020-03-06T02:40:52Z", "content": "SINGAPORE (Reuters) - The coronavirus spreading around the world from China is “starting to look like a global pandemic,” said Singapore minister Lawrence Wong, who co-heads the country’s virus fighting taskforce. \r\nThe spread of the infection has been accele… [+333 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "THIS ISN’T ENCOURAGING: Coronavirus: ‘recovered’ patient dies as China reports discharged cases…", "description": "THIS ISN’T ENCOURAGING: Coronavirus: ‘recovered’ patient dies as China reports discharged cases falling ill again.", "url": "https://pjmedia.com/instapundit/360513/", "urlToImage": null, "publishedAt": "2020-03-06T02:52:23Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "11 coronavirus deaths in US, working hard to keep numbers low: Donald Trump", "description": "The coronavirus outbreak which first originated in China in December last year has infected over 95,000 people and resulted in more than 3,200 deaths worlwide.", "url": "https://www.moneycontrol.com/news/world/11-coronavirus-deaths-in-us-working-hard-to-keep-numbers-low-donald-trump-5008311.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Trump_WEF-770x433.jpg", "publishedAt": "2020-03-06T02:36:06Z", "content": "The US has seen 11 deaths and reported 129 coronavirus infection cases, President Donald Trump said on Thursday, asserting that his administration is working \"very hard\" to keep the numbers \"as low as possible\".\r\nThe coronavirus outbreak which first originate… [+2028 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Colorado reports first two cases of coronavirus", "description": "", "url": "http://www.cnn.com/world/live-news/coronavirus-outbreak-03-06-20-intl-hnk/index.html?eref=mrss_igoogle_cnn", "urlToImage": null, "publishedAt": "2020-03-06T02:14:29Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Anderson Cooper sounds off on Trump's coronavirus claims", "description": "CNN's Anderson Cooper scrutinizes several of President Donald Trump's claims about the coronavirus and the implications these statements could have.", "url": "https://www.cnn.com/videos/politics/2020/03/06/donald-trump-coronavirus-facts-kth-cooper-ac360-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200227204951-anderson-cooper-kth-coronavirus-02272020-super-tease.jpg", "publishedAt": "2020-03-06T02:45:16Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "China's Hubei province, excluding Wuhan, reports no new coronavirus cases - Livemint", "description": "China's Hubei province, excluding Wuhan, reports no new coronavirus cases Livemint What doctors treating Covid-19 in Wuhan say about coronavirus Times of India As coronavirus spreads rapidly, a word of caution from China President Hindustan Times China’s high…", "url": "https://www.livemint.com/news/world/china-s-hubei-province-excluding-wuhan-reports-no-new-coronavirus-cases-11583460942004.html", "urlToImage": "https://images.livemint.com/img/2020/03/06/600x338/2020-03-05T132407Z_1370090971_RC2PDF92TOZA_RTRMADP_3_HEALTH-CORONAVIRUS-CHINA_1583461334187_1583461365405.JPG", "publishedAt": "2020-03-06T02:28:18Z", "content": "Beijing: China's central province of Hubei, excluding the provincial capital Wuhan, reported zero new cases of coronavirus over 24 hours for the first time during the outbreak, as authorities continued to contain imported infections in other parts of the coun… [+1633 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "JC Torres", "title": "Apple is blocking COVID-19 apps that don’t come from health organizations", "description": "The situation with the COVID-19 virus is no joking matter and yet there are always people who would take advantage of the situation to make a profit. Others may be more well-intentioned but unwittingly help spread misinformation, which is all too easy in this…", "url": "https://www.slashgear.com/apple-is-blocking-covid-19-apps-that-dont-come-from-health-organizations-05612343/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/appstore-covid.jpg", "publishedAt": "2020-03-06T03:06:16Z", "content": "The situation with the COVID-19 virus is no joking matter and yet there are always people who would take advantage of the situation to make a profit. Others may be more well-intentioned but unwittingly help spread misinformation, which is all too easy in this… [+1833 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus crisis threatens to silence Japan's tourist boom", "description": "The restaurants at the Exitmelsa shopping center in Tokyo's upscale Ginza district are usually packed with Chinese tourists. For Japanese who have grown dependent on Chinese tourists for business, like waiter Kiyotake Watanabe, it marks a disconcerting trend.…", "url": "https://news.yahoo.com/coronavirus-crisis-threatens-silence-japans-023813122.html", "urlToImage": null, "publishedAt": "2020-03-06T02:38:13Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Steve Holland", "title": "Trump says U.S. economy could take hit from coronavirus", "description": "President Donald Trump said on Thursday the U.S. economy might take a hit from the coronavirus outbreak but predicted the challenge would eventually pass and defended his handling of the crisis. Trump appeared at his first town hall meeting of the 2020 electi…", "url": "https://news.yahoo.com/trump-says-u-economy-could-022004163.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/vxj0i0c8MvKtbUyFfIRt9g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/s37xDjzi4ycyCNG.CNiZEg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/73f5da3ea0f9e6d042986a2dd7cad601", "publishedAt": "2020-03-06T02:20:04Z", "content": "By Steve Holland\r\nSCRANTON, Pa. (Reuters) - President Donald Trump said on Thursday the U.S. economy might take a hit from the coronavirus outbreak but predicted the challenge would eventually pass and defended his handling of the crisis.\r\nTrump appeared at h… [+3238 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Market Headstart: Respite for bulls unlikely due to coronavirus spread; Yes Bank adds to fears", "description": "Sensex and Nifty ended with small gains on March 5, as investors remained cautious amid reports of rising coronavirus cases in India.", "url": "https://www.moneycontrol.com/news/business/markets/market-headstart-respite-for-bulls-unlikely-due-to-coronavirus-spread-yes-bank-adds-to-fears-5007691.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/Sensex1.Reuters-1-770x433.jpg", "publishedAt": "2020-03-06T03:09:23Z", "content": "It is unlikely that the Indian market will have any respite on March 6 as fears of rising coronavirus cases and its impact on the global economy are getting stronger day by day.\r\nAsian shares suffered losses on March 6 following another Wall Street rout as di… [+4744 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Tim Worstall", "title": "U.K. PMIs - Definitely A Boris Bounce", "description": "Before the election and Brexit, I was insisting that the UK economy was fundamentally strong but held back by the joint uncertainties.The implication of that was that once the election was decided - that in itself deciding the Brexit question - we would see a…", "url": "https://seekingalpha.com/article/4330165-u-k-pmis-definitely-boris-bounce", "urlToImage": "https://static2.seekingalpha.com/uploads/2020/3/4/970767-15833391333373046.png", "publishedAt": "2020-03-06T03:08:38Z", "content": "The essential case\r\nI have been saying for most of the past year that the UK economy was fundamentally strong. Employment was high, unemployment low, no sign of inflation, really, no reason why we shouldn't be seeing substantial growth. Except, of course, we … [+6160 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Change in temperature will not impact coronavirus spread: ICMR chief", "description": "Thirty people have tested positive for the virus so far with the latest being a man from Ghaziabad with a recent travel history to Iran.", "url": "https://www.moneycontrol.com/news/india/change-in-temperature-will-not-impact-coronavirus-spread-icmr-chief-5008361.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-770x433.png", "publishedAt": "2020-03-06T02:40:05Z", "content": "Amid a slight decline in temperature after rains lashed Delhi-NCR on Thursday, Indian Council of Medical Research director general Balram Bhargava said the change in weather will not have any impact on the spread of novel coronavirus.\r\nThirty people have test… [+836 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Donald Trump says US economy could take hit from coronavirus", "description": "Trump appeared at his first town hall meeting of the 2020 election season, an event conducted by Fox News Channel before an audience in Scranton, Pennsylvania, a battleground state that helped propel him to the White House in 2016.", "url": "https://www.moneycontrol.com/news/world/donald-trump-says-us-economy-could-take-hit-from-coronavirus-5008321.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/03/economy-770x433.jpg", "publishedAt": "2020-03-06T02:27:03Z", "content": "President Donald Trump said the U.S. economy might take a hit from the coronavirus outbreak but predicted the challenge would eventually pass and defended his handling of the crisis.\r\nTrump appeared at his first town hall meeting of the 2020 election season, … [+3192 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Oil prices slip amid demand concern, Opec+ deal", "description": "US West Texas Intermediate (WTI) was down 42 cents, or 0.9 per cent, at $45.48 per barrel.", "url": "https://economictimes.indiatimes.com/markets/commodities/news/crude-oil-slips-amid-demand-concern-fears-over-opec-deal-for-deeper-output-cuts/articleshow/74503467.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74503456,width-1070,height-580,imgsize-410884,overlay-etmarkets/photo.jpg", "publishedAt": "2020-03-06T02:37:12Z", "content": "SINGAPORE: Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-Opec crude producers not yet having agreed to cut output further to support prices.\r\nBrent crude fell 47 cents, … [+1200 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Hot Stocks: Bata India expected to see short-term bounce, 5% upside seen", "description": "As per the current scenario, it#39;s quite evident that the Indian market is not going to decouple with its global coronavirus- infected peers and further fall will not be ruled out.", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-bata-india-expected-to-see-short-term-bounce-5-upside-seen-5007121.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/03/Sensex_BSE_Nifty_NSE_Stock-market_stocks_1280x720-19-770x433.png", "publishedAt": "2020-03-06T02:46:35Z", "content": "Manali Bhatia\r\nNo respite for bulls and carnage on the Street has continued for this week as well.\r\nVolatility in the last few days has given sleepless nights to traders where bears have managed to hold the grip quite firmly and sharp selling pressure has bee… [+3913 chars]"}, {"source": {"id": "australian-financial-review", "name": "Australian Financial Review"}, "author": "John Davidson", "title": "Coronavirus has you working from home? This is the tech you'll need - The Australian Financial Review", "description": "Around the country, workplaces are gearing up to send their workers home. It's time for you to gear up, too.", "url": "https://www.afr.com/technology/coronavirus-has-you-working-from-home-this-is-the-tech-you-ll-need-20200305-p5472p", "urlToImage": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_82/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/562eff1a2868b6579c13dd45a1946fe15c4a493c", "publishedAt": "2020-03-06T02:44:00Z", "content": "The best way around the problem is to get yourself a broadband router such as the Synology RT2600ac or the Synology MR2200AC, that lets you plug a mobile phone or a 4G or 5G dongle into the router via a USB cable, and have your internet connection automatical… [+5954 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "A state-by-state breakdown of US cases", "description": "State governments are working to contain coronavirus cases in the US, as federal officials say more testing for the virus will likely see the number of positive cases increase.", "url": "http://www.cnn.com/2020/03/03/health/us-coronavirus-cases-state-by-state/index.html?eref=mrss_igoogle_cnn", "urlToImage": null, "publishedAt": "2020-03-06T02:20:17Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "China has made eating wild animals illegal after the outbreak. But ending the trade won't be easy", "description": "A strict ban on the consumption and farming of wild animals is being rolled out across China in the wake of the deadly coronavirus epidemic, which is believed to have started at a wildlife market in Wuhan.", "url": "http://www.cnn.com/2020/03/05/asia/china-coronavirus-wildlife-consumption-ban-intl-hnk/index.html?eref=mrss_igoogle_cnn", "urlToImage": null, "publishedAt": "2020-03-06T02:20:02Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Premier League stops traditional pre-game handshakes due to threat of spreading coronavirus", "description": "Players in England’s Premier League will forgo the traditional pre-game handshake between opponents as a measure to prevent the further spread of the coronavirus, the league said on Thursday. The post Premier League stops traditional pre-game handshakes due t…", "url": "https://www.firstpost.com/health/premier-league-stops-traditional-pre-game-handshakes-due-to-threat-of-spreading-coronavirus-8123481.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/02/Premier-League-social-Reuters.jpg", "publishedAt": "2020-03-06T03:05:31Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "David Yaffe-Bellan, Stanley Reed", "title": "Investors wrestle with coronavirus fears as stocks plunge again", "description": "The stock market has swung wildly in the past week as investors have struggled to get a bead on the economic damage the fast-spreading coronavirus might cause.", "url": "https://www.bostonglobe.com/business/2020/03/05/investors-wrestle-with-coronavirus-fears-stocks-plunge-again/cIkQe8KsuJNOP73kwIhGZL/story.html", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/EyVnL6iSkDmYHTUsPW0csVKPE9Q=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/JKKNJWS7IQI6VHCRLRJ4FX45YM.jpg", "publishedAt": "2020-03-06T02:23:43Z", "content": "After markets closed Thursday, Starbucks warned its quarterly sales in China, where it has a huge presence, would fall 50 percent, compared to last years a $400 million to $430 million hit to its revenue forecast.\r\nNews about the coronaviruss spread has been … [+4089 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18 Staff", "title": "Coronavirus Outbreak LIVE Updates: Virus Spreading 17 Times Faster Outside China, Warns WHO; Italy Death Toll Climbs to 148 - News18", "description": "Coronavirus Outbreak LIVE Updates: Virus Spreading 17 Times Faster Outside China, Warns WHO; Italy Death Toll Climbs to 148 News18 Coronavirus [LIVE]: Maharashtra CM Uddhav Thackeray to skip Arti at Ayodhya on Saturday Times Now View Full coverage on Google N…", "url": "https://www.news18.com/news/india/coronavirus-outbreak-live-updates-india-sore-throat-delhi-ncr-mumbai-kashmir-bangalore-n95-mask-cure-who-2527555.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Wagah_2.jpg", "publishedAt": "2020-03-06T02:53:17Z", "content": "The isolated Himalayan kingdom of Bhutan has reported its first case of the coronavirus after a US tourist tested positive, the prime minister said today. The 76-year-old man arrived in Bhutan from India on March 2, and was admitted to hospital on March 5 wit… [+2393 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Shu Zhang", "title": "Oil slips amid demand concern, fears over OPEC+ deal for deeper output cuts", "description": "Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-OPEC crude producers not yet having agreed to cut output further to support prices. Brent crude fell 47 cents, or 0.9%, to …", "url": "https://finance.yahoo.com/news/oil-slips-amid-demand-concern-023251442.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/o3mYkHj_qOxbvWYoqUlP1A--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/b27dd592da2e951aa169a0ac32706654", "publishedAt": "2020-03-06T02:32:51Z", "content": "By Shu Zhang\r\nSINGAPORE (Reuters) - Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-OPEC crude producers not yet having agreed to cut output further to support prices.\r\nBr… [+1263 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Stanley White", "title": "Asian stocks suffer, Treasury yields plumb new depths as virus spreads", "description": "Asian shares and U.S. stock futures fell on Friday following another Wall Street rout as disruptions to global business from the coronavirus beyond China worsened, stoking fears of a prolonged world economic slowdown. Yields on 10-year U.S. Treasuries fell to…", "url": "https://finance.yahoo.com/news/asian-stocks-suffer-treasury-yields-021919936.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3ATJ7KQTpvLA9b5EMq8eqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/FpJqc0X2UzG2FKRvJm0Bow--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/b5707c81c5c72f74d46e9bae1617c7a5", "publishedAt": "2020-03-06T02:19:19Z", "content": "By Stanley White\r\nTOKYO (Reuters) - Asian shares and U.S. stock futures fell on Friday following another Wall Street rout as disruptions to global business from the coronavirus beyond China worsened, stoking fears of a prolonged world economic slowdown.\r\nMSCI… [+3876 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Gold set for best week in over eight years on coronavirus fears", "description": "Spot gold climbed 0.2% to $1,672.80 per ounce by 0118 GMT, having risen about 2% in the previous session. The Bank of Japan may take steps this month to ensure companies hit by the outbreak do not face a financial squeeze before the March end of the current f…", "url": "https://finance.yahoo.com/news/gold-set-best-week-over-030021893.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/WCeELvtnh26MufNZDCLwxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjAuOA--/https://s.yimg.com/uu/api/res/1.2/cpalmqfPLw2jvQFow5haAQ--~B/aD01Mzg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/234c38ba7ccae656289bd59650b7bff0", "publishedAt": "2020-03-06T03:00:21Z", "content": "(Reuters) - Gold prices inched higher on Friday and were poised for their biggest weekly gain since October 2011, as mounting worries over the economic fallout from the fast-spreading coronavirus drove investors towards the safe-haven metal.\r\nFUNDAMENTALS\r\nSp… [+1916 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Damien Wilde", "title": "How to livestream the Oppo Find X2 and Oppo Smartwatch launch [Video]", "description": "Oppo is set to unveil the follow-up to its legendary pop-up Find X at a launch event in London, but you can livestream the entire thing from the comfort of your home. more… The post How to livestream the Oppo Find X2 and Oppo Smartwatch launch [Video] appeare…", "url": "https://9to5google.com/2020/03/05/oppo-find-x2-livestream/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/03/Oppo-Find-X2-livestream.jpg?quality=82&strip=all", "publishedAt": "2020-03-06T03:00:45Z", "content": "Oppo is set to unveil the follow-up to its legendary pop-up Find X at a launch event in London, but you can livestream the entire thing from the comfort of your home.\r\nDespite many other firms canceling launches because of coronavirus concerns, Oppo is still … [+1498 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 lessons - Global News", "description": "Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 lessons Global News View Full coverage on Google News", "url": "https://www.youtube.com/watch?v=XUI6DIswmFk", "urlToImage": null, "publishedAt": "2020-03-06T02:58:06Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Caitlin McGarry", "title": "Apple Cracks Down On Coronavirus Apps, Which Is Probably For The Best", "description": "As social networks race to curb the spread of misinformation about COVID-19 and Amazon tries to weed out price-gouging Purell listings, Apple is taking its own stance: rejecting coronavirus apps submitted by iOS app developers who aren’t affiliated with offic…", "url": "https://www.gizmodo.com.au/2020/03/apple-cracks-down-on-coronavirus-apps-which-is-probably-for-the-best/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/p5ekjuphqxwyev9mzfvz.jpg", "publishedAt": "2020-03-06T03:00:00Z", "content": "As social networks race to curb the spread of misinformation about COVID-19 and Amazon tries to weed out price-gouging Purell listings, Apple is taking its own stance: rejecting coronavirus apps submitted by iOS app developers who arent affiliated with offici… [+2039 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "B.C. records first-known community transmission case of coronavirus - The Globe and Mail", "description": "B.C. records first-known community transmission case of coronavirus The Globe and Mail Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 lessons Global News John Horgan to announce BC’s response plan to novel coronavirus toda…", "url": "https://www.theglobeandmail.com/canada/article-bc-records-first-known-community-transmission-case-of-coronavirus/", "urlToImage": "https://www.theglobeandmail.com/resizer/nCdhtyUzuIpqzZJLt9173F1AiRA=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/T6V56CS3TZBFZKT5X55QHZCWIQ.jpg", "publishedAt": "2020-03-06T02:49:52Z", "content": "On Friday, health columnist André Picard will take reader questions during a live Facebook Q&amp;A. Email your coronavirus questions to audience@globeandmail.com.\r\nProvincial Health Officer Bonnie Henry, seen here on Jan. 28, 2020 along with British Columbia … [+4696 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Steve M.", "title": "Trump Will Do Happy Talk Until He Has A Domestic Enemy To Blame", "description": "Ross Douthat is right: It's a testament to the power of partisan psychology that a virus seemingly tailor-mutated to confirm populist priors about the perils of globalized supply chains originating in Red China is being minimized by certain right-wingers beca…", "url": "https://crooksandliars.com/2020/03/trump-will-do-happy-talk-until-he-has", "urlToImage": "https://crooksandliars.com/files/mediaposters/2020/03/44480.jpg", "publishedAt": "2020-03-06T03:00:01Z", "content": "Ross Douthat is right:\r\nIt's a testament to the power of partisan psychology that a virus seemingly tailor-mutated to confirm populist priors about the perils of globalized supply chains originating in Red China is being minimized by certain right-wingers bec… [+5311 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Trump Is Greatest Obstacle on Coronavirus Message", "description": "\"As leading public health experts from across the government have tried to provide clear and consistent information about the deadly coronavirus, they have found their messages undercut, drowned out and muddled by President Trump’s push to downplay the outbre…", "url": "https://politicalwire.com/2020/03/05/trump-is-greatest-obstacle-on-coronavirus-message/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-06T02:16:00Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Gold set for best week in over eight years on coronavirus fears", "description": "Spot gold climbed 0.2% to $1,672.80 per ounce by 0118 GMT, having risen about 2% in the previous session. The metal has gained about 5.5% so far this week.", "url": "https://www.moneycontrol.com/news/business/markets/gold-set-for-best-week-in-over-eight-years-on-coronavirus-fears-5008401.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/GOLD-770x433.jpg", "publishedAt": "2020-03-06T03:10:02Z", "content": "Gold prices inched higher on Friday and were poised for their biggest weekly gain since October 2011, as mounting worries over the economic fallout from the fast-spreading coronavirus drove investors towards the safe-haven metal.\r\nFUNDAMENTALS\r\nSpot gold clim… [+1915 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Danny Segura, John Morgan", "title": "China's Li Jingliang didn't let coronavirus outbreak affect preparation for UFC 248 bout with Neil Magny", "description": "China's Li Jingliang opens up about his preparation for UFC 248 in the wake of the worldwide coronavirus outbreak.", "url": "https://mmajunkie.usatoday.com/2020/03/li-jingliang-coronavirus-ufc-248-neil-magny-china", "urlToImage": "https://usatmmajunkie.files.wordpress.com/2020/03/li-jingliang-ufc-248-pre-video.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-03-06T02:15:45Z", "content": "LAS VEGAS Things went fairly well for Li Jingliang in the wake of a crisis in his home country.\r\nIn preparation for his UFC 248 bout with Neil Magny (21-7 MMA, 14-6 UFC), Jingliang (17-5 MMA, 9-3 UFC) said he wasn’t too affected by the recent outbreak of coro… [+2113 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "'Doomed from the Start.' Experts Say the Trump Administration's Coronavirus Response Was Never Going to Work (TIME)", "description": "TIME : ‘Doomed from the Start.’ Experts Say the Trump Administration's Coronavirus Response Was Never Going to Work — The Trump Administration's strategy to combat COVID-19, the novel coronavirus, began with a relatively simple focus: keep it out of the Unite…", "url": "https://www.memeorandum.com/200305/p154", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/GettyImages-1210430952.jpg?quality=85&w=1024&h=512&crop=1", "publishedAt": "2020-03-06T02:25:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "The Trump administration's greatest obstacle to sending a clear message on coronavirus may be Trump himself (Toluse Olorunnipa/Washington Post)", "description": "Toluse Olorunnipa / Washington Post : The Trump administration's greatest obstacle to sending a clear message on coronavirus may be Trump himself — As leading public health experts from across the government have tried to provide clear and consistent informat…", "url": "https://www.memeorandum.com/200305/p161", "urlToImage": "https://www.washingtonpost.com/resizer/wvao25PNRTcm_DAVihIyr_he-cM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CHWFOFS43UI6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-06T03:05:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Maryland coronavirus: Hogan confirms three cases in Montgomery County (Washington Post)", "description": "Washington Post : Maryland coronavirus: Hogan confirms three cases in Montgomery County — Maryland Gov. Larry Hogan said Thursday that three people from Montgomery County have been diagnosed with coronavirus: a husband and wife in their 70s and a woman who is…", "url": "https://www.memeorandum.com/200305/p158", "urlToImage": "https://www.washingtonpost.com/resizer/MFo9TBsQmRhhr_XXjyWrzWWFueQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3JD6HLSIKMI6VPDYRIMPPL6O44.jpg", "publishedAt": "2020-03-06T02:50:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Handshake? No thanks: How coronavirus has changed global habits - Livemint", "description": "Say no to a handshake, refuse every peck on the cheek and definitely avoid hugging. Instead, try a direct gaze, or maybe a hand gesture", "url": "https://www.livemint.com/news/world/handshake-no-thanks-how-coronavirus-has-changed-global-habits-11583462467031.html", "urlToImage": "https://images.livemint.com/img/2020/03/06/600x338/ba42ee8e0053442490cd1efe7913a679-ba42ee8e0053442490cd1efe7913a679-0_1583462609285_1583462636817.jpg", "publishedAt": "2020-03-06T02:48:59Z", "content": "Say no to a handshake, refuse every peck on the cheek and definitely avoid hugging. Instead, try a direct gaze, or maybe a hand gesture.Around the world people are changing their habits at work, home and in worship to reduce the risk of contracting the new co… [+4876 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Matthew Chapman", "title": "Republican Gov. Mike Parson mocked after boasting he’s had ‘nearly 17 people’ tested for coronavirus", "description": "On Thursday, Gov. Mike Parson (R-MO) took to Twitter to assure the public of his efforts to prevent coronavirus outbreaks in his state: Missouri specific:• ZERO confirmed cases• Nearly 17 people have been tested• Testing CAN be done in Missouri• Prisons, nurs…", "url": "https://www.rawstory.com/2020/03/republican-gov-mike-parson-mocked-after-boasting-hes-had-nearly-17-people-tested-for-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/Mike-Parson.jpg", "publishedAt": "2020-03-06T02:48:31Z", "content": "On Thursday, Gov. Mike Parson (R-MO) took to Twitter to assure the public of his efforts to prevent coronavirus outbreaks in his state:\r\nMissouri specific:ZERO confirmed casesNearly 17 people have been testedTesting CAN be done in MissouriPrisons, nursing hom… [+2660 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Coronavirus outbreak already at pandemic levels, Israeli health official warns", "description": "Health Ministry's Asher Shalmon says situation around the world points to an emerging 'full-blown international event,' says vaccine a year away despite claims", "url": "https://www.timesofisrael.com/coronavirus-outbreak-already-at-pandemic-levels-israeli-health-official-warns/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/AP_20066053085477-1024x640.jpg", "publishedAt": "2020-03-06T02:37:16Z", "content": "The novel coronavirus spreading across the world is already at a pandemic stage, a top Israeli health official said Thursday, though world health authorities have held off from declaring a global outbreak.\r\nAlthough officially the World Health Organization di… [+3997 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "BOJ to ease monetary policy in March to counter coronavirus fears - Reuters Poll", "description": "Bank of Japan (BOJ) will ease monetary policy this month to calm markets and counter recession fears triggered by coronavirus outbreak, a majority of", "url": "https://www.fxstreet.com/news/boj-to-ease-monetary-policy-in-march-to-counter-coronavirus-fears-reuters-poll-202003060233", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/CentralBanks/BOJ/Haruhiko_Kuroda1_2015_Large.jpg", "publishedAt": "2020-03-06T02:33:16Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "Singapore officials: Coronavirus starting look like a global pandemic", "description": "Coronavirus is beginning to look like a global pandemic, Singapore government's virus-fighting task force said on Friday. A pandemic is an epidemic of", "url": "https://www.fxstreet.com/news/singapore-officials-coronavirus-starting-look-like-a-global-pandemic-202003060253", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/Singapore/singapore-panorama-29874334_Large.jpg", "publishedAt": "2020-03-06T02:53:24Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Ewdison Then", "title": "iPhone 9/iPhone SE production may be in trouble after all", "description": "It is already expected that Apple may have some production and supply issues for the 2020 iPhones and iPads later this year but most probably expect that the cheaper iPhones won’t be so troubled. They were, after all, finalized before the COVID-19 broke out, …", "url": "https://www.slashgear.com/iphone-9-iphone-se-production-may-be-in-trouble-after-all-05612340/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/iphone-8-iphone-8-plus-2017-9.jpg", "publishedAt": "2020-03-06T02:34:50Z", "content": "It is already expected that Apple may have some production and supply issues for the 2020 iPhones and iPads later this year but most probably expect that the cheaper iPhones won’t be so troubled. They were, after all, finalized before the COVID-19 broke out, … [+1865 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Trump’s Coronavirus Plan Was Never Going to Work", "description": "Time: \"Since January, epidemiologists, former U.S. public health officials and experts have been warning, publicly and privately, that the administration’s insistence that containment was—and should remain—the primary way to confront an emerging infectious di…", "url": "https://politicalwire.com/2020/03/05/trumps-coronavirus-plan-was-never-going-to-work/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-06T03:09:28Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "Ryerson Holding (RYI) Q4 2019 Earnings Call Transcript", "description": "RYI earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/03/05/ryerson-holding-ryi-q4-2019-earnings-call-transcri.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-03-06T03:01:51Z", "content": "Image source: The Motley Fool.\r\nRyerson Holding (NYSE:RYI)Q4 2019 Earnings CallMar 05, 2020, 10:00 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nLadies and gentlemen,… [+38127 chars]"}, {"source": {"id": null, "name": "Pajiba.com"}, "author": "Ursula Scully", "title": "The Coronavirus Delays Its First Celebrity Wedding", "description": "Why Are Rich People So Mean? (Wired) Britney Spears' son is spilling the tea about his grandpops. (Celebitchy) Scamming Pizza Hut Was My Family Tradition. (Food & Wine) Earlier today, Kristy wrote about Katy Perry announcing her pregnancy via a...", "url": "https://www.pajiba.com/pajiba_love/katy-perry-and-orlando-bloom-delay-their-wedding-over-coronavirus-concerns.php", "urlToImage": "https://www.pajiba.com/assets_c/2020/03/GettyImages-83716776-thumb-700xauto-222987.jpg", "publishedAt": "2020-03-06T03:00:00Z", "content": "Why Are Rich People So Mean? ( Wired ) Britney Spears' son is spilling the tea about his grandpops. ( Celebitchy ) Scamming Pizza Hut Was My Family Tradition. ( Food & Wine ) Earlier today, Kristy wrote about Katy Perry announcing her pregnancy via a music vi… [+2491 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "China's Hubei, excluding Wuhan, reports no new coronavirus cases", "description": "BEIJING: China's central province of Hubei, excluding the provincial capital Wuhan, reported zero new cases of coronavirus over 24 hours for the first time during the outbreak, as authorities continued to contain imported infections in other parts of the coun…", "url": "https://www.bangkokpost.com/world/1873009/chinas-hubei-excluding-wuhan-reports-no-new-coronavirus-cases", "urlToImage": "https://static.bangkokpost.com/media/content/20200306/c1_1873009_700.jpg", "publishedAt": "2020-03-06T02:27:00Z", "content": "BEIJING: China's central province of Hubei, excluding the provincial capital Wuhan, reported zero new cases of coronavirus over 24 hours for the first time during the outbreak, as authorities continued to contain imported infections in other parts of the coun… [+1402 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Aqil Haziq Mahmud", "title": "'Theoretical possibility' that COVID-19 can spread from pets to humans: MOH", "description": "SINGAPORE: There is a \"theoretical possibility\" that COVID-19 could spread from animals to humans, the Ministry of Health (MOH) said on Friday (Mar 6), although it assessed that pets are not a \"serious vector\" of transmission. MOH's director of medical servic…", "url": "https://www.channelnewsasia.com/news/singapore/coronavirus-pets-spread-possibility-singapore-moh-covid-19-12508030", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/8170294/16x9/991/557/87226d2747a00110f69177f55b55ce44/Rf/yishun-cat---2451240.png", "publishedAt": "2020-03-06T02:30:38Z", "content": "SINGAPORE: There is a \"theoretical possibility\" that COVID-19 could spread from animals to humans, the Ministry of Health (MOH) said on Friday (Mar 6), although it assessed that pets are not a \"serious vector\" of transmission.\r\nMOH's director of medical servi… [+1526 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "CAI International, Inc.(CAI) Q4 2019 Earnings Call Transcript", "description": "CAI earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/03/05/cai-international-inccai-q4-2019-earnings-call-tra.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-03-06T03:01:45Z", "content": "Image source: The Motley Fool.\r\nCAI International, Inc.  (NYSE:CAI)Q4 2019 Earnings CallMar 05, 2020, 5:00 p.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nLadies and ge… [+21949 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Oil slips amid demand concern, fears over OPEC+ deal for deeper output cuts", "description": "Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-OPEC crude producers not yet having agreed to cut output further to support prices. Brent crude fell 47 cents, or 0.9%, to …", "url": "https://news.yahoo.com/oil-slips-amid-demand-concern-023251442.html", "urlToImage": null, "publishedAt": "2020-03-06T02:32:51Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Morning Digest: Modi's Brussels visit put off over COVID-19; Manmohan Singh writes on Delhi violence, coronavirus, and economy; and more", "description": "A select list of stories to read before you start your day", "url": "https://www.thehindu.com/news/morning-digest-march-06-2020/article30997067.ece", "urlToImage": "https://www.thehindu.com/news/th2pbs/article30992260.ece/ALTERNATES/LANDSCAPE_615/INDIAVIRUSOUTBREAK", "publishedAt": "2020-03-06T02:25:36Z", "content": "Owing to the recent global COVID-19 outbreak, Prime Minister Narendra Modis visit to Brussels has been rescheduled, the Ministry of External Affairs said on Thursday. This, with India reporting another confirmed novel coronavirus case from Ghaziabad, taking t… [+2860 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Japan says virus travel restrictions not too late as South Korea protests", "description": "Japan's government defended new, tighter travel restrictions on visitors from China and South Korea, saying they were not too late to help slow the spread of the coronavirus outbreak, as Seoul protested the measures as \"excessive.\" \"The decision was the resul…", "url": "https://news.yahoo.com/japan-says-virus-travel-restrictions-023234807.html", "urlToImage": null, "publishedAt": "2020-03-06T02:32:34Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Shu Zhang", "title": "Oil slips amid demand concern, fears over OPEC+ deal for deeper output cuts", "description": "Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-OPEC crude producers not yet having agreed to cut output further to support prices. Brent crude fell 47 cents, or 0.9%, to …", "url": "https://finance.yahoo.com/news/oil-slips-amid-demand-concern-030018216.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QnF2ku5WlPShCyzAvUT7Gg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/_s1xJIx..Ps9Qw47XfN.cQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/dc149ef60f6512e6e241b96ab1c8540b", "publishedAt": "2020-03-06T03:00:18Z", "content": "By Shu Zhang\r\nSINGAPORE (Reuters) - Oil slid on Friday as worries about demand for fuel being sapped by the global coronavirus outbreak were heightened by concern over non-OPEC crude producers not yet having agreed to cut output further to support prices.\r\nBr… [+1263 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Pregnant women scared to give birth in virus-hit China", "description": "BEIJING: Scared of the deadly new coronavirus that has swept China, pregnant women and new mothers are giving birth alone, keeping their newborns inside and switching to pricier private hospitals to avoid the risk of infection.", "url": "https://www.bangkokpost.com/world/1873019/pregnant-women-scared-to-give-birth-in-virus-hit-china", "urlToImage": "https://static.bangkokpost.com/media/content/20200306/c1_3553894_700.jpg", "publishedAt": "2020-03-06T02:45:00Z", "content": "BEIJING: Scared of the deadly new coronavirus that has swept China, pregnant women and new mothers are giving birth alone, keeping their newborns inside and switching to pricier private hospitals to avoid the risk of infection.\r\nOne new mother, surnamed Xie, … [+4090 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Japan says virus travel restrictions not too late as S Korea protests", "description": "Japan's government defended new, tighter travel restrictions on visitors from China and South Korea, saying they were not too late to help slow the spread of the coronavirus outbreak, as Seoul protested the measures as &quot;excessive.&quot; &quot;The decisio…", "url": "https://japantoday.com/category/national/Japan-says-virus-travel-restrictions-not-too-late-as-South-Korea-protests", "urlToImage": null, "publishedAt": "2020-03-06T02:45:01Z", "content": "Japan's government defended new, tighter travel restrictions on visitors from China and South Korea, saying they were not too late to help slow the spread of the coronavirus outbreak, as Seoul protested the measures as \"excessive.\"\r\n\"The decision was the resu… [+2659 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Michelle Grattan, Professorial Fellow, University of Canberra", "title": "VIDEO: Michelle Grattan on the escalation of coronavirus and the economy", "description": "Michelle Grattan talks with Assistant Professor Caroline Fisher about the week in politics, including coronavirus, the Biosecurity Act and panic-buying, as well as the Australian economy.", "url": "http://theconversation.com/video-michelle-grattan-on-the-escalation-of-coronavirus-and-the-economy-133158", "urlToImage": "https://images.theconversation.com/files/319010/original/file-20200306-106553-9yl2h3.jpg?ixlib=rb-1.1.0&rect=8%2C0%2C5778%2C2889&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-03-06T02:54:09Z", "content": "Michelle Grattan talks with Assistant Professor Caroline Fisher about the week in politics, including coronavirus, the Biosecurity Act and panic-buying, as well as the Australian economy, surplus packages, and the likelihood of a technical recession. Michelle… [+217 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "Nine passengers from 'coronavirus ship' released from hospital", "description": "Two Israelis who were aboard the Diamond Princess remain in hospital in Japan and it is unclear when they will be released.", "url": "http://www.israelnationalnews.com/News/News.aspx/276909", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/943/943187.jpg", "publishedAt": "2020-03-06T02:27:00Z", "content": "Nine Israelis who were aboard the Diamond Princess cruise ship in Japan were released from the Sheba Hospital on Thursday after recovering from the coronavirus and concluding their isolation period.\r\nAnother woman, from Mevaseret Zion, will remain in Sheba un… [+918 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Leslie Patton", "title": "Starbucks Says China Getting Back to Normal After Steep Fall", "description": "(Bloomberg) -- Starbucks Corp. saw its business in China crater in recent months — but assured investors it’s quickly getting back to normal.The coronavirus outbreak will curb profit this quarter by as much 18 cents a share, the Seattle-based company said in …", "url": "https://finance.yahoo.com/news/starbucks-says-china-getting-back-222429752.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2oI35TM4Gbk7mHRiMNAZZQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/8a3d78932e94aa31add147d425247c16", "publishedAt": "2020-03-06T02:31:30Z", "content": "(Bloomberg) -- Starbucks Corp. saw its business in China crater in recent months but assured investors its quickly getting back to normal.\r\nThe coronavirus outbreak will curb profit this quarter by as much 18 cents a share, the Seattle-based company said in a… [+2059 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aila Slisco", "title": "CNBC's Rick Santelli Suggests Infecting 'Everybody' With Coronavirus Because It Could Help Economy", "description": "CNBC's Rick Santelli lamented the impact that the COVID-19 coronavirus was having on global financial markets Thursday, suggesting that \"maybe we'd be better off if we just gave it to everybody\" to help markets.", "url": "https://www.newsweek.com/cnbcs-rick-santelli-suggests-infecting-everybody-coronavirus-because-it-could-help-economy-1490837", "urlToImage": "https://d.newsweek.com/en/full/1571818/rick-santelli.jpg", "publishedAt": "2020-03-06T03:11:13Z", "content": "CNBC's Rick Santelli suggested that infecting \"everybody\" with COVID-19 coronavirus would make people \"better off\" because it might help lessen damage to financial markets, despite the virus likely killing millions of people in such a scenario.\r\nSantelli made… [+2654 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Coronavirus cases surge in U.S.; helicopter flies test kits to cruise ship", "description": "The coronavirus outbreak spread further across the United States on Thursday, cropping up in at least four new states and San Francisco as Congress quickly approved more than $8 billion to fight the outbreak and Americans faced increasing disruptions to their…", "url": "https://japantoday.com/category/world/update-7-coronavirus-cases-surge-in-u.s.-helicopter-flies-test-kits-to-cruise-ship", "urlToImage": null, "publishedAt": "2020-03-06T02:32:33Z", "content": "The coronavirus outbreak spread further across the United States on Thursday, cropping up in at least four new states and San Francisco as Congress quickly approved more than $8 billion to fight the outbreak and Americans faced increasing disruptions to their… [+5123 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "David O Royal", "title": "COVID 19: Iran cancels Jumaat prayers in major cities amid outbreak", "description": "Friday prayers in Iran have been cancelled across all provincial capitals amid the country’s growing coronavirus outbreak, state television said. The report Wednesday comes as Tehran and other areas cancelled Friday prayers last week over the outbreak. Iran e…", "url": "https://www.vanguardngr.com/2020/03/covid-19-iran-cancels-jumaat-prayers-in-major-cities-amid-outbreak/", "urlToImage": null, "publishedAt": "2020-03-06T03:00:56Z", "content": "A relatively few number of Muslims pray at the Grand Mosque, in the Muslim holy city of Mecca, Saudi Arabia, Wednesday, March 4, 2020. On Wednesday, Saudi Arabia’s Deputy Health Minister Abdel-Fattah Mashat was quoted on the state-linked news site Al-Yaum say… [+1901 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Roger Bate", "title": "No Meds for You: Coronavirus Could Wreak Havoc On Our Pharmaceuticals", "description": "Roger Bate Security, Americas Watch out for the second crisis. We all know that many Chinese factories are idle in an attempt to prevent the spread of COVID – 19. This is already affecting global stock markets in the expectation it will undermine corporate pr…", "url": "https://nationalinterest.org/blog/buzz/no-meds-you-coronavirus-could-wreak-havoc-our-pharmaceuticals-130142", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/2020-03-05T215730Z_1431793705_RC2XDF9W5181_RTRMADP_3_HEALTH-CORONAVIRUS-NEW-YORK.jpg", "publishedAt": "2020-03-06T02:30:00Z", "content": "We all know that many Chinese factories are idle in an attempt to prevent the spread of COVID19. This is already affecting global stock markets in the expectation it will undermine corporate profits, but we may soon have a deadly problem to rival the deaths f… [+4351 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bob Mason", "title": "European Equities: More Pain to Come as the Coronavirus Continues to Grip the Markets", "description": "The European majors are set for another tumble at the open. It’s time for EU member states to open the coffers…", "url": "https://finance.yahoo.com/news/european-equities-more-pain-come-022106821.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/_ih0haAm0AIvTxcEm6RViw--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/a8ebf0be197daf86ccbddfd91f33feda", "publishedAt": "2020-03-06T02:21:06Z", "content": "Friday, 6th March\r\nGerman Factory Orders (MoM) (Jan)\r\nThe Majors\r\nIt was back into the red for the European majors on Thursday, with the CAC40 sliding by 1.90% to lead the way down. The DAX30 and EuroStoxx600 werent far behind with losses of 1.51% and 1.43% r… [+3414 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "South Korea reports 196 new COVID-19 infections as death toll rises", "description": "SEOUL: South Korea reported 196 new coronavirus cases on Friday (Mar 6), bringing the country's total to 6,284, the Korea Centers for Disease Control and Prevention said. The agency added that seven more deaths from the virus were reported, bringing the total…", "url": "https://www.channelnewsasia.com/news/asia/south-korea-reports-196-new-covid19-infections-coronavirus-12507960", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12507054/16x9/991/557/1170f623768671a09fa2681793162ead/dQ/a-medical-worker-sprays-disinfectant-on-a-basket-containing-medical-waste-at-keimyung-university-dongsan-medical-center-where-patients-of-the-novel-coronavirus-disease-of-covid-19-receive-treatment-in-1.jpg", "publishedAt": "2020-03-06T02:22:43Z", "content": "SEOUL: South Korea reported 196 new coronavirus cases on Friday (Mar 6), bringing the country's total to 6,284, the Korea Centers for Disease Control and Prevention said.\r\nThe agency added that seven more deaths from the virus were reported, bringing the tota… [+1187 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "By Kevin Freking, Associated Press", "title": "Trump defends ‘Crazy Bernie’ and ‘Sleepy Joe’ slurs levelled at rivals", "description": "US President Donald Trump has defended his administration’s response to the coronavirus and his confrontational style of name-calling political opponents during a televised question and answer session.", "url": "https://www.independent.ie/world-news/trump-defends-crazy-bernie-and-sleepy-joe-slurs-levelled-at-rivals-39020468.html", "urlToImage": "https://www.independent.ie/world-news/0728c/39020466.ece/AUTOCROP/w1240h700/ipanews_c6ed72a3-b7e0-4cae-a120-0a926b08b8c5_1", "publishedAt": "2020-03-06T02:50:58Z", "content": "US President Donald Trump has defended his administrations response to the coronavirus and his confrontational style of name-calling political opponents during a televised question and answer session.\r\nMr Trump, who regularly calls his top Democratic presiden… [+1317 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Aria Bendix)", "title": "South Korea has tested 140,000 people for the coronavirus. That could explain why its death rate is just 0.6% — far lower than in China or the US.", "description": "Experts have suggested that coronavirus death rates could decrease as more mild cases are confirmed.", "url": "https://news.yahoo.com/south-korea-tested-140-000-031000719.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/05bVj_Dozx.Hw0khe29IcA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/R3nj8MYUNaQdu05IGh6NLw--~B/aD0xMjAyO3c9MTYwMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/e9926cac468831d6420da2b8e51b3434", "publishedAt": "2020-03-06T03:10:00Z", "content": "South Korean soldiers wearing protective gear walk on a street in front of Daegu's city hall after the rapid rise in confirmed cases of the coronavirus on March 2, 2020.\r\nREUTERS/Kim Kyung-Hoon\r\nThe US and South Korea announced their first cases of the corona… [+6106 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nasrin Sultana", "title": "Sell-off likely in stock markets, all eyes on Yes Bank and SBI shares - Livemint", "description": "Sell-off likely in stock markets, all eyes on Yes Bank and SBI shares Livemint What changed for the market while you were sleeping? Top 10 things to know Moneycontrol.com CNBC-TV18's top stocks to watch out for on March 6 CNBCTV18 SGX Nifty down 350 points, D…", "url": "https://www.livemint.com/market/stock-market-news/sell-off-likely-in-stock-markets-all-eyes-on-yes-bank-and-sbi-shares-11583461404502.html", "urlToImage": "https://images.livemint.com/img/2020/03/06/600x338/6a02bdd6-2a2f-11ea-9153-6b83aae7730f_1577640965206_1583461750321.jpg", "publishedAt": "2020-03-06T02:34:36Z", "content": "Indian equity markets are likely to be under pressure on Friday tracking Asian peers. SGX Nifty slipped around 2.8% in the early deals suggesting a weak start for domestic markets.Bank stocks will be in focus today. The Reserve Bank on Thursday imposed a mora… [+3474 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "US Treasury yields hit fresh record low", "description": "The US treasury yields continue to slide as fears about the fallout from the virus outbreak is forcing investors to rotate money out of risk assets an", "url": "https://www.fxstreet.com/news/us-treasury-yields-hit-fresh-record-low-202003060248", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/America/UnitedStatesofAmerica/new-york-city-skyline-midtown-and-empire-state-building-46283650_Large.jpg", "publishedAt": "2020-03-06T02:48:02Z", "content": "<ul><li>US yields slip to fresh lifetime lows as investors sell risk on coronavirus fears. </li><li>Coronavirus is beginning to look like global pandemic, Singapore officials said.</li></ul>The US treasury yields continue to slide as fears about the fallout f… [+1136 chars]"}, {"source": {"id": null, "name": "Intelnews.org"}, "author": "Joseph Fitsanakis", "title": "US Pentagon insists it can continue to function despite COVID-19 outbreak", "description": "The United States Department of Defense has insisted that it can continue to function uninterrupted, despite claims by some media outlets that American military readiness may soon begin to degrade as a result of the coronavirus (COVID-19) outbreak.", "url": "https://intelnews.org/2020/03/05/01-2732/", "urlToImage": "https://intelligencenews.files.wordpress.com/2015/11/first-post-h5.jpg", "publishedAt": "2020-03-06T02:58:22Z", "content": "March 5, 2020by Joseph FitsanakisLeave a comment\r\nThe United States Department of Defense has insisted that it can continue to function uninterrupted, despite claims by some media outlets that American military readiness may soon begin to degrade as a result … [+1903 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Mcgrath For Dailymail.com", "title": "MGM to lose more than $30M after delaying release of No Time To Die due to coronavirus outbreak", "description": "'The marketing outlay already was significant with just four weeks to go before the release, including a $4.5 million Super Bowl spot that ran in February,' THR.com reported.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8081135/MGM-lose-30M-delaying-release-No-Time-Die-coronavirus-outbreak.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/06/02/25608108-0-image-a-12_1583462679472.jpg", "publishedAt": "2020-03-06T02:45:00Z", "content": "The release of the upcoming James Bond movie No Time To Die has been pushed back seven months to November because of the coronavirus.\r\nAnd on Thursday, The Hollywood Reporter said that MGM, the studio behind the Bond films, could lose upwards of $30 million d… [+3291 chars]"}]