[{"source": {"id": null, "name": "Kotaku.com"}, "author": "Brian Ashcraft", "title": "Japanese Idol Group Charging Fans Who Don't Wear Sickness Masks Because Of Coronavirus", "description": "Numerous events scheduled for the next few weeks have been canceled in Japan and abroad. Idol group 2o Love to Sweet Bullet isn’t rescheduling upcoming events, but rather charging extra for fans who don’t wear masks. Read more...", "url": "https://kotaku.com/japanese-idol-group-charging-fans-who-dont-wear-sicknes-1841904108", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ibqqgq0ihtewzkqwpwzi.png", "publishedAt": "2020-02-25T12:00:00Z", "content": "Kotaku EastEast is your slice of Asian internet culture, bringing you the latest talking points from Japan, Korea, China and beyond. Tune in every morning from 4am to 8am.\r\nNumerous events scheduled for the next few weeks have been canceled in Japan and abroa… [+1473 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Tucker Carlson Blames ‘Diversity’ And ‘Wokeness’ For Coronavirus", "description": "The Fox News host turned to racism as the outbreak continued to spread.", "url": "https://www.huffpost.com/entry/tucker-carlson-coronavirus-diversity_n_5e54f265c5b65e0f11c64b34", "urlToImage": "https://img.huffingtonpost.com/asset/5e54f45e23000000090bf1a2.png?cache=edviF2PDyU&ops=1200_630", "publishedAt": "2020-02-25T11:50:41Z", "content": "Tucker Carlson has found another way to sicken the airwaves.\r\nThe Fox News host on Monday appeared to blame the spread of coronavirus on diversity and the “cult” of wokeness. (Listen to the clip below.)\r\nIn a “Tucker Carlson Tonight” segment about the expandi… [+671 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "'Iran deputy health minister has coronavirus'", "description": "Iran's deputy health minister has been infected with the new coronavirus, a ministry official said on Tuesday, amid a major outbreak in the Islamic republic. Iraj Harirchi coughed occasionally and appeared to be sweating during a press conference on Monday wi…", "url": "https://timesofindia.indiatimes.com/world/middle-east/iran-deputy-health-minister-has-coronavirus-adviser/articleshow/74302671.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74302672,width-1070,height-580,imgsize-343572,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-25T12:03:11Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Inside Italy's coronavirus 'red zone' - Guardian News", "description": "Inside Italy's coronavirus 'red zone' Guardian News Italy sees virus cases rise 45%; 11 dead Washington Post Coronavirus outbreak: Italian officials confirm seven deaths Al Jazeera English EU orders quarantine for staff who traveled to northern Italy Reuters …", "url": "https://www.youtube.com/watch?v=sPkZZkU6jvg", "urlToImage": "https://i.ytimg.com/vi/sPkZZkU6jvg/maxresdefault.jpg", "publishedAt": "2020-02-25T12:02:44Z", "content": "Schoolteacher Marzio Toniolo describes life under lockdown in San Fiorano, one of the northern Italian towns under quarantine as coronavirus cases rise.  Around 50,000 residents of 11 towns across Lombardy, where the outbreak emerged suddenly on Friday, and V… [+823 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Danny Vena)", "title": "3 Things Investors Should Remember as Coronavirus Tanks the Market", "description": "As the virus edges closer to a global pandemic, investors should avoid giving in to fear and panic.", "url": "https://www.fool.com/investing/2020/02/25/3-things-investors-must-remember-as-coronavirus-ta.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559602/woman-at-a-table-grabbing-her-head.jpg", "publishedAt": "2020-02-25T12:00:00Z", "content": "It's hard to ignore the daily headlines about the coronavirus outbreak, with the disease now officially called COVID-19. The latest dour news reports the virus now has a foothold in South Korea, Iran, and Italy, and the most recent count is staggering. Accord… [+3367 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: British couple David and Sally Abel say they are recovering well from the disease - The Telegraph", "description": "Coronavirus: British couple David and Sally Abel say they are recovering well from the disease The Telegraph Fourth passenger on coronavirus-plagued Diamond Princess cruise dies New York Post Philippine citizens infected with coronavirus on cruise ship rises …", "url": "https://www.youtube.com/watch?v=zTyX-YJPPgw", "urlToImage": "https://i.ytimg.com/vi/zTyX-YJPPgw/maxresdefault.jpg", "publishedAt": "2020-02-25T12:05:34Z", "content": "David and Sally Abel, who were diagnosed with coronavirus on board the Diamond Princess cruise ship in Japan have said they are recovering well from the disease.\r\nAddressing the world via his YouTube channel, David Abel explained that he and his wife are bein… [+387 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Virus 'literally knocking at the door', WHO warns countries", "description": "The World Health Organization (WHO) called on countries on Tuesday to boost their readiness against coronavirus, saying the virus is \"literally knocking at the door\".", "url": "https://www.reuters.com/article/us-china-health-who-idUSKCN20J1GD", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-25T11:17:30Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) called on countries on Tuesday to boost their readiness against coronavirus, saying the virus is “literally knocking at the door”. \r\nWHO spokesman Christian Lindmeier, speaking at a news briefing in Genev… [+562 chars]"}, {"source": {"id": null, "name": "Nakedcapitalism.com"}, "author": "Lambert Strether", "title": "Links 2/25/2020", "description": "Our popular daily links, including bumblebees, hippopotamuses, private equity, pandemic bonds, #COVID-19 (presymptomatic transmission, lessons learned, China, Korea, Japan, Italy), Bolivia and lithium, Haiti, Chile, Grenfell Tower, Bloomberg, Sanders, Assange…", "url": "https://www.nakedcapitalism.com/2020/02/links-2-25-2020.html", "urlToImage": "https://www.nakedcapitalism.com/wp-content/uploads/2020/02/china_satellite.png", "publishedAt": "2020-02-25T11:55:34Z", "content": "Bumblebees remember objects they see and recognize them by touch Agence France Presse\r\nColombia has a hippopotamus problem thanks to Pablo Escobar AP\r\nThree charts on private equity FT Alphaville\r\nWorld Bank’s pandemic bonds sink as coronavirus spreads FT\r\n#C… [+7281 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Caitlin Ostroff", "title": "YIELDS STILL SLIDING", "description": "YIELDS STILL SLIDING (Main headline, 2nd story, link ) Related stories: STOCKS STABILIZE? Drudge Report Feed needs your support! Become a Patron", "url": "https://www.wsj.com/articles/bond-markets-signal-investors-jitters-on-global-growth-11582629020", "urlToImage": "https://images.wsj.net/im-157438/social", "publishedAt": "2020-02-25T11:52:37Z", "content": "Bond markets raised fresh alarms Tuesday, with the yield on the 10-year Treasury on track to breach historic lows as investors moved funds into the safest assets amid fears that the coronavirus outbreak may hamper global economic growth.\r\nThe yield on the ben… [+183 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kenneth Rapoza, Contributor, Kenneth Rapoza, Contributor https://www.forbes.com/sites/kenrapoza/", "title": "Coronavirus Update: Italy Mortality Rate Similar To China’s", "description": "China mortality rates not underwhelming. They might even be accurate.", "url": "https://www.forbes.com/sites/kenrapoza/2020/02/25/coronavirus-update-italy-mortality-rate-similar-to-chinas/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1202997362%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D5568%26cropY1%3D0%26cropY2%3D3712", "publishedAt": "2020-02-25T12:00:00Z", "content": "Italy is now the \"epicenter\" of the nasty Covid-19 virus in Europe. (Photo by Antonio Masiello/Getty ... [+] Images)\r\nGetty Images\r\nYou have to trust someone on the coronavirus outbreak. And very few are comfortable with Chinas official numbers, now approachi… [+11384 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Niall McCarthy, Contributor, Niall McCarthy, Contributor https://www.forbes.com/sites/niallmccarthy/", "title": "Coronavirus Recoveries Have Overtaken New Cases But The Risk Of A Global Pandemic Remains Real [Infographic]", "description": "Even though recoveries outpaced new coronavirus infections for the first time on February 19th, new outbreaks in South Korea, Italy and Iran suggest the world is approaching a tipping point in its attempt to contain it.", "url": "https://www.forbes.com/sites/niallmccarthy/2020/02/25/coronavirus-recoveries-have-overtaken-new-cases-but-the-risk-of-a-global-pandemic-remains-real-infographic/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e54fa0bd378190007f43bf2%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D1200%26cropY1%3D0%26cropY2%3D675", "publishedAt": "2020-02-25T11:30:58Z", "content": "The World Health Organization has played down fears of a global COVID-19 pandemic despite the emergence of new outbreaks in Italy and Iran. Dr. Tedros Adhanom Ghebreyesus, the WHO's director general, stated that \"using the word pandemic now does not fit the f… [+4262 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus threatens to become a global economic pandemic | DW News - DW News", "description": "Coronavirus threatens to become a global economic pandemic | DW News DW News Stock market news live: Wall Street dives on coronavirus panic, stocks have worst day in 2 years Yahoo Finance European stocks decline as coronavirus fears persist CNBC Why coronavir…", "url": "https://www.youtube.com/watch?v=5BVVV2QHadw", "urlToImage": "https://i.ytimg.com/vi/5BVVV2QHadw/hqdefault.jpg", "publishedAt": "2020-02-25T11:28:08Z", "content": "The new coronavirus has reached Europe and is spreading. Stock markets plunged when the virus hit Italy, which is the EU's third-largest economy. The disease-cluster is in Italy's Lombardy region, the country's economic heartland. Northern Italy's economy is … [+1057 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jeffrey Sparshott", "title": "Newsletter: Markets Wake Up to Coronavirus", "description": "Your daily economics newsletter from The Wall Street Journal.", "url": "https://blogs.wsj.com/economics/2020/02/25/newsletter-markets-wake-up-to-coronavirus/", "urlToImage": "https://images.wsj.net/im-157432", "publishedAt": "2020-02-25T11:40:29Z", "content": "Feb 25, 2020 6:40 am ET\r\n This is the web version of the WSJs newsletter on the economy. You can sign up for daily delivery here. Dont Look Down Fear of the coronavirus, rather than the virus itself, is hitting the world’s economies. Based on health impacts a… [+77 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "UAE bans Iran flights over COVID-19; at least 15 dead in Iran", "description": "The UAE, home to long-haul carriers Emirates and Etihad, remains a key international transit route for Iran’s 80 million people", "url": "https://www.thehindu.com/news/international/uae-bans-iran-flights-over-covid-19-at-least-15-dead-in-iran/article30913608.ece", "urlToImage": "https://www.thehindu.com/news/international/3w51bk/article30913607.ece/ALTERNATES/LANDSCAPE_615/25THAPAPTOPIXIRANVIRUSOUTBREAKMIDEAST", "publishedAt": "2020-02-25T12:05:51Z", "content": "The United Arab Emirates on Tuesday banned all flights to and from Iran over the outbreak of the novel coronavirus (COVID-19), just a day after its spread from the Islamic Republic was announced across multiple Mideast nations. Iran meanwhile raised the offic… [+6047 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Amir Havasi", "title": "Coronavirus claims three more lives in Iran", "description": "Coronavirus claimed three more lives in Iran, taking the country's overall death toll to 15, as President Hassan Rouhani called for calm Tuesday and teams were deployed to disinfect public spaces. The Islamic republic has been hit by the deadliest coronavirus…", "url": "https://news.yahoo.com/coronavirus-claims-three-more-lives-iran-113947732.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UvzzZIwHvn0XPqAyKpK2tQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/hMW2WhSkXztzQAAhMV1lmA--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/51a3af75a8c09d12e2ca35e8fc4794fb73ff3ac1.jpg", "publishedAt": "2020-02-25T11:39:47Z", "content": "Tehran (AFP) - Coronavirus claimed three more lives in Iran, taking the country's overall death toll to 15, as President Hassan Rouhani called for calm Tuesday and teams were deployed to disinfect public spaces.\r\nThe Islamic republic has been hit by the deadl… [+3953 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "Iran’s deputy health minister tests positive for coronavirus - Hindustan Times", "description": "Iran’s deputy health minister tests positive for coronavirus Hindustan Times Coronavirus: Iran's legislator claims 50 deaths, local news agency reports Al Jazeera English Iran's Deputy Health Minister Iraj Harirchi Tests Positive for Coronavirus News18 Corona…", "url": "https://www.hindustantimes.com/world-news/coronavirus-outbreak-updates-iran-s-deputy-health-minister-tests-positive-for-covid-19/story-xC227eGNJqvb97Y4DZbLJM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/02/25/Pictures/iraj-harirchi-ali-rabiei_a28634e8-57da-11ea-9f40-2bfe36999fc5.jpg", "publishedAt": "2020-02-25T11:53:17Z", "content": "Iran’s deputy health minister confirmed on Tuesday that he has tested positive for the new coronavirus, amid a major outbreak in the Islamic republic.\r\nIraj Harirchi coughed occasionally and wiped sweat from his brow repeatedly during a news conference in Teh… [+2765 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "On the far side of the moon, Chinese lander and rover begin 15th lunar day", "description": "China's Chang'e 4 mission has entered its 15th lunar day of work on the far side of the moon, with both the lander and Yutu 2 rover still in good condition.", "url": "https://www.space.com/china-far-side-moon-rover-chang-e-4-15th-lunar-day.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZW7E5nH59Zm5fFYqXpb8HS-1200-80.jpg", "publishedAt": "2020-02-25T12:06:15Z", "content": "China's Chang'e 4 mission\r\n has entered its 15th lunar day of work on the far side of the moon, with both the Chang'e 4 lander and the Yutu 2 rover still in good condition. \r\nThe mission made a historic, first-ever landing on the lunar far side in January 201… [+2745 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Steve Watson", "title": "‘They’d Let You Die Before They Admitted Diversity Is Not Our Strength’", "description": "\"Identity politics trumped public health and not for the first time.\"", "url": "https://www.infowars.com/theyd-let-you-die-before-they-admitted-diversity-is-not-our-strength/", "urlToImage": "https://assets.infowars.com/2020/02/coronavirus-tucker-carlson-diversity.jpg", "publishedAt": "2020-02-25T11:37:35Z", "content": "Is globalism and open borders going to get millions killed in a global pandemic?\r\nFor weeks now, our managerial class couldn’t care less. Instead, their focus was on fears of a potential “racist” backlash against Chinese people being unfairly “stigmatized” fo… [+6419 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Tenerife resort with 1,000 tourists on LOCKDOWN after guest tests positive for coronavirus (VIDEO)", "description": "Hundreds of tourists have been cordoned off in a tourist resort in Tenerife, Spain, and have been told to stay in their rooms, after an Italian tourist staying at a four-star hotel in Adeje tested positive for the coronavirus. Read Full Article at RT.com", "url": "https://www.rt.com/news/481633-tenerife-resort-lockdown-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e5501a485f54059092e0025.jpg", "publishedAt": "2020-02-25T11:38:21Z", "content": "The Italian man is believed to be a resident of the Lombardy region, which has witnessed the majority of Italy’s coronavirus cases. His is the third case of coronavirus in Spain and has been admitted to hospital, where he’s been placed in isolation. \r\nEyewitn… [+1085 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Steve Watson", "title": "The Extreme Panic The Coronavirus Is Causing Elsewhere On The Globe Could Soon Be Coming To The U.S.", "description": "Fear is rising all over the planet, and many believe that it is just a matter of time before the same things that are happening elsewhere start happening here.", "url": "https://www.infowars.com/the-extreme-panic-the-coronavirus-is-causing-elsewhere-on-the-globe-could-soon-be-coming-to-the-u-s/", "urlToImage": "https://assets.infowars.com/2020/02/GettyImages-1203058967.jpg", "publishedAt": "2020-02-25T11:48:35Z", "content": "U.S. government officials are doing their best to keep the general population calm, but everyone can see what is happening in the rest of the world.  \r\nThere are now empty store shelves in Italy just like there are in China.\r\nPeople are waiting in extremely l… [+6913 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "JONATHAN LEMIRE", "title": "Trump defends $2.5B coronavirus request; Dems say it's low", "description": "President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat. “We just asked for $2.5 billion on ge…", "url": "https://news.yahoo.com/trump-defends-2-5b-coronavirus-112639218.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/wfZzstqIBrrZEEtSeC8nzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/AUw6C94J_I2hVV2cZA8_JA--~B/aD0yNjY2O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/7516c4d8b8a504f06c4fd6f594f1e0d2", "publishedAt": "2020-02-25T11:26:39Z", "content": "NEW DELHI (AP) President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat.\r\nWe just asked for $2.… [+2942 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Wladimiro Pantaleone and Francesca Piscioneri", "title": "Italy reports coronavirus case in Sicily, first south of Rome", "description": "PALERMO/ROME (Reuters) - Italian authorities on Tuesday reported a woman had tested positive for coronavirus in Sicily, the first case south of Rome, as the country battles to prevent the outbreak spreading from its origin in the northern regions of Lombardy …", "url": "https://news.yahoo.com/italy-reports-coronavirus-case-sicily-111503970.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/URseWGUAVHXckYvE.sWMnA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDQuOA--/https://s.yimg.com/uu/api/res/1.2/WCtIFQs8r4umL1jVlcAw7g--~B/aD01Mjg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/73a87a194f9948136b942b1fdcb07a51", "publishedAt": "2020-02-25T11:15:03Z", "content": "By Wladimiro Pantaleone and Francesca Piscioneri\r\nPALERMO/ROME (Reuters) - Italian authorities on Tuesday reported a woman had tested positive for coronavirus in Sicily, the first case south of Rome, as the country battles to prevent the outbreak spreading fr… [+3838 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jack de Menezes, Jack de Menezes", "title": "Coronavirus outbreak leaves Olympics with three-month window to decide if Tokyo 2020 can go ahead, says longest-serving member", "description": "Former IOC president Dick Pound believes a decision on staging the 2020 Olympic Games in Tokyo will need to be made by the end of May as the coronavirus outbreak threatens to reach pandemic levels", "url": "https://www.independent.co.uk/sport/olympics/coronavirus-news-olympics-tokyo-2020-japan-deaths-outbreak-a9356831.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/25/12/olympics-tokyo-coronavirus.jpg", "publishedAt": "2020-02-25T11:49:00Z", "content": "The deadly coronavirus outbreak has left a three-month window to decide whether the Tokyo 2020Olympics can go ahead or not, the longest-serving member of the International Olympic Committee (IOC) has warned.\r\nFormer IOC vice-president and ex-president of the … [+4221 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "Pupils in Cornwall told to self-isolate after ski trip to coronavirus-hit Lombardy region of Italy", "description": "Students at Truro's Penair School turned up for classes this morning but were sent home following their excursion to Ponte di Legno in Lombardy over the half-term last week.", "url": "https://www.dailymail.co.uk/health/article-8041915/Pupils-Cornwall-told-self-isolate-ski-trip-coronavirus-hit-Lombardy-region-Italy.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/11/25167408-0-image-a-27_1582629738991.jpg", "publishedAt": "2020-02-25T12:03:02Z", "content": "Someone who is infected with the coronavirus can spread it with just a simple cough or a sneeze, scientists say.\r\nOver 2,700 people with the virus are now confirmed to have died and more than 80,000 have been infected. But experts predict the true number of p… [+12063 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Power Hedge", "title": "Golden Ocean: Surprisingly Good Performance Given Shipping Headwinds", "description": "Golden Ocean saw greatly improved financial results, mostly caused by higher Capesize rates.The company successfully refinanced a large debt tranche at attractive terms, making us optimistic other shippers can do the same.The coronavirus has had a large effec…", "url": "https://seekingalpha.com/article/4326840-golden-ocean-surprisingly-good-performance-given-shipping-headwinds", "urlToImage": "https://static3.seekingalpha.com/images/marketing_images/ships_cargo/cargo_container_ship_sea_ocean_2.jpeg", "publishedAt": "2020-02-25T12:04:41Z", "content": "On Tuesday, February 18, 2020, dry bulk shipping giant Golden Ocean Group Limited (NASDAQ:GOGL) announced its fourth quarter 2019 earnings results. At first glance, these results appeared to be very good as the company beat the expectations of its analysts on… [+10174 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Speights)", "title": "Forget the Selloff: Guardant Health Just Delivered Great Q4 Results", "description": "The liquid biopsy pioneer delivered better-than-expected top- and bottom-line results in Q4. And its future looks as bright as ever.", "url": "https://www.fool.com/investing/2020/02/25/forget-the-selloff-guardant-health-just-delivered.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559581/test-tubes-with-dropper-of-blood.jpg", "publishedAt": "2020-02-25T12:05:00Z", "content": "Sure, Guardant Health(NASDAQ:GH) stock fell on Monday in the midst of the overall market plunge. And yes, its shares dropped even more in after-hours trading following the company's announcement of its 2019 fourth-quarter and full-year results.\r\nBut my recomm… [+3741 chars]"}, {"source": {"id": null, "name": "Thedailymash.co.uk"}, "author": "The Daily Mash", "title": "How to survive a pandemic according to TV and films", "description": "THE coronavirus pandemic is imminent, but anyone who’s seen any movie or TV show about surviving deadly infections will be fine.", "url": "https://www.thedailymash.co.uk/news/health/how-to-survive-a-pandemic-according-to-tv-and-films-20200225193821", "urlToImage": "https://cdn.thedailymash.co.uk/wp-content/uploads/20200225111836/zombie-apocalypse-667x385.jpg", "publishedAt": "2020-02-25T11:30:56Z", "content": "THE coronavirus pandemic is imminent, but anyone whos seen any movie or TV show about pandemics will be fine. Follow these tips:\r\nVirus victims become zombies\r\n99 per cent of viruses cause zombieism, with the sole exception being Tom Hanks in Philadelphia. On… [+1494 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Rouhani urges Iranians not to panic over outbreak", "description": "Hassan Rouhani says Iran can contain the outbreak, which has killed 16 people in the country.", "url": "https://www.bbc.co.uk/news/world-middle-east-51628484", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/B2D6/production/_111028754_mediaitem111028750.jpg", "publishedAt": "2020-02-25T11:29:41Z", "content": "Image copyrightAFPImage caption\r\n Iran's president has urged people to comply with the health ministry's directives\r\nIran's president has urged people not to panic as it struggles to contain an outbreak of the new coronavirus disease.\r\nHassan Rouhani expresse… [+1988 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "South Korea#39;s Moon says situation \"very grave\" as mass virus tests get going", "description": "South Korea#39;s tally of cases of coronavirus cases rose to 977, fuelling fears the outbreak, which is thought to have begun in the central Chinese city of Wuhan in December, is developing into a pandemic.", "url": "https://www.moneycontrol.com/news/trends/health-trends/south-koreas-moon-says-situation-very-grave-as-mass-virus-tests-get-going-4976141.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/Coronavirus-China-Reuters-1-770x435.jpg", "publishedAt": "2020-02-25T11:45:14Z", "content": "South Korean health authorities said on Tuesday they aim to test more than 200,000 members of a church at the centre of a surge of new coronavirus cases as President Moon Jae-in said the situation was \"very grave\".\r\nSouth Korea's tally of cases of coronavirus… [+3496 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Breitbart London, Breitbart London", "title": "1,000 Tourists Quarantined in Canary Islands Hotel After Coronavirus Confirmed", "description": "A tourist hotel on the Canary Island of Tenerife was placed in quarantine Tuesday after one man tested positive for Coronavirus.", "url": "https://www.breitbart.com/europe/2020/02/25/1000-tourists-quarantined-in-canary-islands-hotel-after-coronavirus-confirmed/", "urlToImage": "https://media.breitbart.com/media/2020/02/GettyImages-1201647513-640x335.jpeg", "publishedAt": "2020-02-25T11:49:32Z", "content": "MADRID (AP) – A tourist hotel on the Canary Island hotel of Tenerife was placed in quarantine Tuesday after an Italian doctor staying there tested positive for the new virus from China that has infected thousands worldwide.\r\nThe press office for the town of A… [+1739 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "COVID-19: Are we prepared for a pandemic? - Down To Earth Magazine", "description": "COVID-19: Are we prepared for a pandemic? Down To Earth Magazine Steep decline in Coronavirus cases in China: WHO expert Economic Times China probably saved hundreds of thousands of coronavirus cases: WHO Moneycontrol.com ‘Time is everything’: How the world i…", "url": "https://www.downtoearth.org.in/news/health/covid-19-are-we-prepared-for-a-pandemic--69443", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-02-25/0.55155500_1582615103_emergency_hospital_during_influenza_epidemic.jpg", "publishedAt": "2020-02-25T11:23:45Z", "content": "No. The world has not even made a startA pandemic is an epidemic occurring worldwide, or over a wide area, crossing international boundaries and usually affecting a large number of people,” says a World Health Organization (WHO) bulletin. The novel coronaviru… [+11220 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: Borders remain open as Italian cases rise 45%", "description": "The number of cases in Italy continues to climb as the first cases in Spain and Switzerland have been reported. Iran and China have both been slammed by Secretary of State Mike Pompeo. Get the latest developments here.", "url": "https://www.dw.com/en/coronavirus-updates-borders-remain-open-as-italian-cases-rise-45/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona as the US has cast doubt on Iran's honesty over the outbreak</li><li>60 new cases in South Korea</li></ul>All times in Universa… [+14712 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Ben Brown", "title": "Dow Shivers as Coronavirus Threatens Upto 70% of World’s Population", "description": "Investors still nervous as Harvard professor reveals a terrifying prediction about the global spread of COVID-19 The post Dow Shivers as Coronavirus Threatens Upto 70% of World’s Population appeared first on CCN.com", "url": "https://www.ccn.com/dow-coronavirus-threaten-global-population/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/Stock-market-NTB-Wall-Street.jpg", "publishedAt": "2020-02-25T12:00:32Z", "content": "<ul><li>Dow Jones Industrial Average (DJIA) futures bounce back after yesterdays brutal 1,000 point plunge.</li><li>Harvard professor says the coronavirus likely cant be contained and could infect more than half the world population.</li><li>The impact on glo… [+2991 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: First cases in Austria, Croatia, and southern Italy", "description": "As Italy prepares to host a European summit over the crisis, more cases have erupted across the bloc. Iran, which has the highest death toll outside China, has seen infections spike. Get the latest developments here.", "url": "https://www.dw.com/en/coronavirus-updates-first-cases-in-austria-croatia-and-southern-italy/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona</li><li>60 new cases in South Korea</li></ul>All times in Universal Coordinated Time (UTC/GMT)\r\n11:57 Austria confirms first tw… [+8839 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "JONATHAN LEMIRE", "title": "Trump defends $2.5B coronavirus request; Dems say it’s low", "description": "NEW DELHI (AP) — President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat. “We just asked for $…", "url": "https://www.seattletimes.com/business/trump-defends-2-5b-coronavirus-request-dems-say-its-low/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-0463fb7ca88b47860819fe56495b2ebcVirus_Outbreak_South_Korea_37385-1200x630.jpg", "publishedAt": "2020-02-25T11:26:41Z", "content": "NEW DELHI (AP) President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat.\r\nWe just asked for $2.… [+2942 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "First Case of Coronavirus Confirmed in Croatia", "description": "As of Tuesday, the COVID-19 outbreak has already left over 80,000 people infected worldwide, with the death toll of 2,699. Recovery rates are also on the rise, with 27,671 patients now having been discharged from hospitals around the globe.", "url": "https://sputniknews.com/europe/202002251078400561-first-case-of-coronavirus-confirmed-in-croatia/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107230/85/1072308589.png", "publishedAt": "2020-02-25T11:46:36Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Roxanne Cooper", "title": "As suicide rates climb, crisis centers expand", "description": "PHOENIX — On a recent Wednesday at 9:47 a.m., two police cars pulled up to Recovery Response Center, a one-story stucco building on a main highway in Peoria, 13 miles from downtown Phoenix.A lanky, sandy-haired man compliantly walked with two officers through…", "url": "https://www.rawstory.com/2020/02/as-suicide-rates-climb-crisis-centers-expand/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/1594862-origin_1.jpg", "publishedAt": "2020-02-25T11:34:25Z", "content": "Production on the latest film in the \"Mission: Impossible\" series starring Tom Cruise has been stopped in Italy following the outbreak of coronavirus cases, US media reported Monday.\r\nAccording to entertainment specialist The Wrap, the seventh instalment of t… [+409 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Tokyo Olympics 2020: Indian boxers training for Olympic qualifiers to continue camp in Italy despite coronavirus fears", "description": "Indian boxers training in Italy for next month's Olympic qualifiers were given the option of flying out early due to the novel Coronavirus threat in that country but the team has decided to stay put as its training base in Assisi is \"far\" from the epicentre o…", "url": "https://www.firstpost.com/sports/tokyo-olympics-2020-indian-boxers-training-for-olympic-qualifiers-to-continue-camp-in-italy-despite-coronavirus-fears-8084771.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/10/Boxing-1024-.jpg", "publishedAt": "2020-02-25T11:28:05Z", "content": "New Delhi: Indian boxers training in Italy for next month's Olympic qualifiers were given the option of flying out early due to the novel Coronavirus threat in that country but the team has decided to stay put as its training base in Assisi is \"far\" from the … [+2384 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Agence France-Presse", "title": "‘Mission: Impossible VII’ halts Italy filming over virus: report", "description": "Production on the latest film in the “Mission: Impossible” series starring Tom Cruise has been stopped in Italy following the outbreak of coronavirus cases, US media reported Monday. According to entertainment specialist The Wrap, the seventh instalment of th…", "url": "https://www.rawstory.com/2020/02/mission-impossible-vii-halts-italy-filming-over-virus-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2015/07/tomcruise-800x430.gif", "publishedAt": "2020-02-25T11:23:55Z", "content": "Production on the latest film in the “Mission: Impossible” series starring Tom Cruise has been stopped in Italy following the outbreak of coronavirus cases, US media reported Monday.\r\nAccording to entertainment specialist The Wrap, the seventh instalment of t… [+1255 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Iranian Deputy Health Minister Diagnosed With Coronavirus - Reports", "description": "Tehran previously stated that at least 43 people had been diagnosed with the dangerous disease. The majority of confirmed cases in the country come from the city of Qom - a centre of traditional pilgrimage for Shia Muslims.", "url": "https://sputniknews.com/middleeast/202002251078400582-iranian-deputy-health-minister-diagnosed-with-coronavirus---reports/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107230/85/1072308589.png", "publishedAt": "2020-02-25T11:50:12Z", "content": null}, {"source": {"id": null, "name": "Coindesk.com"}, "author": "Omkar Godbole", "title": "Bitcoin Faces Further Losses if Bulls Can’t Disrupt Bearish Chart Pattern", "description": "Bitcoin has formed a bearish head-and-shoulders pattern with neckline support at $9,400.", "url": "https://www.coindesk.com/bitcoin-faces-further-losses-if-bulls-cant-disrupt-bearish-chart-pattern", "urlToImage": "https://static.coindesk.com/static/images/meta-logo-53ae7f214a3e90249423b9f31135bdb7.png", "publishedAt": "2020-02-25T11:21:20Z", "content": "<ul><li>Bitcoin has formed a bearish head-and-shoulders (H+S) pattern with neckline support at $9,400. </li><li>An H+S breakdown would imply a short-term bearish reversal and expose deeper support near $9,070. </li><li>A move above $10,128 is needed to revive… [+2926 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "The Associated Press", "title": "Iran reports 15 deaths from COVID-19 as case numbers rise", "description": "The novel coronavirus has infected more than 80,000 people globally, causing around 2,700 deaths. The majority of the cases have been in China — but there is growing concern as case numbers rise in countries like South Korea, Iran and Italy.", "url": "https://www.cbc.ca/news/world/coronavirus-covid-19-1.5474869", "urlToImage": "https://i.cbc.ca/1.5474872.1582631267!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/iran-virus-outbreak.jpg", "publishedAt": "2020-02-25T11:50:58Z", "content": "The latest: \r\n<ul><li>Global cases top 80,000 with the vast majority of cases in China, where the health commission has reported 77,658 cases on the mainland with 2,663 deaths.</li><li>Iran reports 95 coronavirus cases and 15 deaths, disputes lawmaker from Qo… [+8396 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: Iran deputy health minister tests positive for virus", "description": "As Italy prepares to host a European summit over the crisis, more cases have erupted across the bloc. Iran, which has the highest death toll outside China, has seen infections spike. Get the latest developments here.", "url": "https://www.dw.com/en/coronavirus-updates-iran-deputy-health-minister-tests-positive-for-virus/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona</li><li>60 new cases in South Korea</li></ul>All times in Universal Coordinated Time (UTC/GMT)\r\n13:30 Oman identifies two more … [+9781 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: US criticizes Iran and China over the its handling of the outbreak", "description": "The number of cases in Italy continues to climb as the first cases in Spain and Switzerland have been reported. Iran and China have both been slammed by Secretary of State Mike Pompeo. Get the latest developments here.", "url": "https://www.dw.com/en/coronavirus-updates-us-criticizes-iran-and-china-over-the-its-handling-of-the-outbreak/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona as the US has cast doubt on Iran's honesty over the outbreak</li><li>60 new cases in South Korea</li></ul>All times in Universa… [+14856 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Jon Gambrell", "title": "UAE bans Iran flights over virus; at least 15 dead in Iran", "description": "The United Arab Emirates on Tuesday banned all flights to and from Iran over the outbreak of the new coronavirus, just a day after its spread from the Islamic Republic was announced across multiple Mideast nations. Iran meanwhile raised the official death tol…", "url": "https://www.bostonglobe.com/2020/02/25/business/uae-bans-iran-flights-over-virus-least-15-dead-iran/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/_NuUXXqS4aeFNKuAfBfb2mq443Q=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/UJCKGPV76NAO3IEAQNIOBG4AKA.jpg", "publishedAt": "2020-02-25T11:35:49Z", "content": "The Emirates' General Civil Aviation Authority made the announcement via the country's state-run WAM news agency, just hours after Dubai International Airport, the world's busiest for international travel, said there would be restrictions on flights there.\r\nA… [+5293 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Korean flight attendant who was in Israel, Los Angeles diagnosed with COVID-19", "description": "Local media says Korean Air cabin crew member flew to Jewish state along with 200 pilgrims, many of whom also caught the virus, then visited US before entering quarantine", "url": "https://www.timesofisrael.com/liveblog-february-25-2020/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/02/000_1P80SF-1024x640.jpg", "publishedAt": "2020-02-25T12:09:26Z", "content": "Iran’s deputy health minister has been infected with the new coronavirus, a ministry official says, amid a major outbreak in the Islamic Republic.\r\n“The coronavirus test for Mr. Harirchi, the deputy health minister who was on the front lines combating the cor… [+536 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Surajit Dasgupta", "title": "Sensex falls for third day in a row, experts warn of more weakness - Livemint", "description": "Sensex falls for third day in a row, experts warn of more weakness Livemint Markets Live: Sensex falls 100 pts, Nifty below 11,800; auto, pharma indices top losers Economic Times Sensex Ends Mildly Lower, Nifty Below 11800; RIL & HDFC Bank Top Draggers | Clos…", "url": "https://www.livemint.com/market/stock-market-news/sensex-falls-for-third-day-in-a-row-experts-warn-of-more-weakness-11582628861844.html", "urlToImage": "https://images.livemint.com/img/2020/02/25/600x338/traders3-kCCH--621x414@LiveMint_1582628898310.jpg", "publishedAt": "2020-02-25T11:13:07Z", "content": "Indian markets gave up early gains today to end lower for the third day in a row as concerns over the coronavirus outbreak hit risk sentiment across the globe. The Sensex ended 82 points lower at 40,281 while the broader Nifty settled 0.27% lower at 11,797. I… [+3522 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "Even Donald Trump Jr fears his dad’s administration will bungle coronavirus response — and doom 2020 election: report", "description": "Increased fears about a massive coronavirus outbreak in the United States have led some of President Donald Trump’s allies to worry about how it will impact the American economy during an election year. Politico reports that even Donald Trump Jr. is starting …", "url": "https://www.rawstory.com/2020/02/even-donald-trump-jr-fears-his-dads-administration-will-bungle-coronavirus-response-and-doom-2020-election-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/03/Grabien-587401.jpg", "publishedAt": "2020-02-25T11:31:26Z", "content": "Increased fears about a massive coronavirus outbreak in the United States have led some of President Donald Trump’s allies to worry about how it will impact the American economy during an election year.\r\nPolitico reports that even Donald Trump Jr. is starting… [+1040 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Harold Maass", "title": "10 things you need to know today: February 25, 2020", "description": "1. U.S. stocks plummeted on Monday as coronavirus cases surged outside of China, fueling concerns of a pandemic that could cause enduring damage to the global economy. The Dow Jones Industrial Average closed down by 1,032 points, or 3.6 percent, the index's s…", "url": "https://theweek.com/10things/897945/10-things-need-know-today-february-25-2020", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/gettyimages-1202998717.jpg?itok=Iqf8AgDZ", "publishedAt": "2020-02-25T11:49:00Z", "content": "U.S. stocks plummeted on Monday as coronavirus cases surged outside of China, fueling concerns of a pandemic that could cause enduring damage to the global economy. The Dow Jones Industrial Average closed down by 1,032 points, or 3.6 percent, the index's shar… [+545 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Eren Sengezer", "title": "Coronavirus update: Croatia and Austria report first confirmed cases", "description": "Austrian province of Tyrol has reported two confirmed cases of coronavirus infections and Croatian Prime Minister Plenkovic announced that they also h", "url": "https://www.fxstreet.com/news/coronavirus-update-croatia-and-austria-report-first-confirmed-cases-202002251157", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/China/coronavirus3_Large.jpg", "publishedAt": "2020-02-25T11:57:47Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Audrey Conklin", "title": "Expedia to cut 3,000 jobs: Report - Fox Business", "description": "Expedia Chairman Barry Diller said the company's employee culture had become \"all life and no work\" in a Feb. 13 earnings calls.", "url": "https://www.foxbusiness.com/technology/expedia-job-cuts-2020", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/Expedia-job-1.jpg?ve=1&tl=1", "publishedAt": "2020-02-25T11:46:52Z", "content": "Expedia plans to cut about 3,000 jobs, or 12 percent of its workforce, to \"streamline and focus\" is efforts, the online travel shopping company told staff in an internal email.\r\nThe decision comes amid plans by the company to save costs, with Expedia’s \"Trave… [+3905 chars]"}, {"source": {"id": null, "name": "Imore.com"}, "author": "Stephen Warwick", "title": "32 Apple stores reopen in China as special business hours come to an end", "description": "Four Beijing and Shanghai stores will return to normal working hours next week. What you need to know Apple has reopened 32 of its stores in China. Only 10 stores in the country remain closed indefinitely due to the coronavirus outbreak. Four stores in the co…", "url": "https://www.imore.com/32-apple-stores-reopen-china-special-business-hours-come-end", "urlToImage": "https://www.imore.com/sites/imore.com/files/styles/large/public/field/image/2020/02/xidan-joy-city.jpg?itok=fnlzofdF", "publishedAt": "2020-02-25T11:51:27Z", "content": "Apple has reopened 32 of its stores in China following a period of extended closures in the country due to the coronavirus outbreak.\r\nYesterday, it was reported by Bloomberg that 29 stores in the country had reopened since Apple's decision to close its entire… [+389 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Bill Bostock)", "title": "Iran's deputy health minister has tested positive for the coronavirus, as the country struggles with one of the worst outbreaks beyond China", "description": "Iraj Harirchi announced Tuesday that he was infected. Iran has emerged as one of the worst coronavirus hotspots outside of Asia.", "url": "https://news.yahoo.com/irans-deputy-health-minister-tested-120839156.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/tA9.SjqyTkjDxB1FDDpD.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjAuNzgyMzk2MDg4MDE5Ng--/https://s.yimg.com/uu/api/res/1.2/fULYV6VWiUaGC2iDjo20tQ--~B/aD02MTQ7dz04MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/EN/business_insider_articles_888/d42cd65d6837da6206521a8282d3b780", "publishedAt": "2020-02-25T12:08:39Z", "content": "Deputy health minister Iraj Harirchi.\r\nTwitter/Fars\r\nIran's deputy health minister, and department spokesman, says he has tested positive for the coronavirus, as the country emerges as one of the worst-hit places outside of Asia. \r\nIn a video posted to Twitte… [+1236 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Julie Delahaye)", "title": "Coronavirus travel advice - what to do if your holiday destination is affected", "description": "Coronavirus travel advice for Brits who have holidays booked in affected destinations such as Thailand, Italy and Tenerife", "url": "https://www.mirror.co.uk/travel/news/coronavirus-travel-advice-what-your-21571373", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21572375.ece/ALTERNATES/s1200/0_Tourists-wear-protective-face-masks-at-Venice-Carnival.jpg", "publishedAt": "2020-02-25T11:31:41Z", "content": "Coronavirus outbreaks are continuing to hit destinations around the world, with people testing positive for the virus in the likes of Thailand, Italy and Tenerife. \r\nFor Brits who have holidays planned in the next few weeks, it's casting doubts as to whether … [+4112 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Brady Strachan", "title": "'Unacceptable': Realtors' Instagram posts on China and coronavirus provoke outrage", "description": "When Kelowna home buyer Barb Chung looked at her Instagram feed over the weekend, she found two Kelowna, B.C., Realtors posting Internet memes poking fun at China and Chinese customers and fears about the coronavirus.", "url": "https://www.cbc.ca/news/canada/british-columbia/kelowna-realtor-meme-outrage-china-coronavirus-1.5474296", "urlToImage": "https://i.cbc.ca/1.5463875.1581690347!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/realtor-sign.JPG", "publishedAt": "2020-02-25T12:00:00Z", "content": "When Kelowna home buyer Barb Chung looked at her Instagram feed over the weekend, she found two Kelowna, B.C., Realtors posting Internet memes poking fun at China, Chinese real estate customers and fears about the Coronavirus.\r\nThe posts were made by accounts… [+2435 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "Trump defends $2.5B coronavirus request; Dems say it’s low", "description": "NEW DELHI (AP) — President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat.", "url": "https://www.bostonherald.com/2020/02/25/trump-defends-2-5b-coronavirus-request-dems-say-its-low/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/02/Virus_Outbreak_South_Korea_37385-1.jpg?w=1024&h=682", "publishedAt": "2020-02-25T11:28:07Z", "content": "JONATHAN LEMIRE\r\nNEW DELHI (AP) — President Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat.\r\n“W… [+2969 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Zoe Low, Zoe Low", "title": "Number of coronavirus cases in Hong Kong could surge to more than 1,000 in next two weeks, scientist claims", "description": "The number of coronavirus cases in Hong Kong could balloon to more than 1,000 within the next two weeks if the government does not effectively manage the epidemic, a local scientist has claimed.Dr Sean Yuan Hsiang-yu, an assistant professor at City University…", "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3052296/number-coronavirus-cases-hong-kong-could-surge", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/25/4d98d556-57b9-11ea-b438-8452af50d521_image_hires_191408.jpg?itok=bUtZ19Zi&v=1582629253", "publishedAt": "2020-02-25T12:00:16Z", "content": null}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "David Meyer", "title": "Europe’s coronavirus response is very different from China’s", "description": "The Covid-19 outbreak in northern Italy has so far elicited an official response far more modest than Beijing's heavy-handed restrictions.", "url": "https://fortune.com/2020/02/25/europe-china-coronavirus-responses-ceo-daily/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/02/GettyImages-1203052760-1.jpg?resize=1200,600", "publishedAt": "2020-02-25T11:36:40Z", "content": null}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Jenna Mahale, Roisin Lanigan", "title": "Seoul Fashion Week has been cancelled", "description": "It's the latest global fashion event affected by Coronavirus.", "url": "https://i-d.vice.com/en_uk/article/v74ypj/seoul-fashion-week-cancelled-coronavirus-aw20", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e5501911f4f12009ded9e6c/lede/1582630410480-seoul-fashion-week.jpeg?crop=1xw:0.3748xh;0xw,0.024xh&resize=1200:*", "publishedAt": "2020-02-25T11:51:57Z", "content": "In sad, vaguely dystopian news today, Seoul Fashion Weeks AW20 presentations will no longer be going ahead, following a rising number of Coronavirus cases in South Korea. Currently, South Korea has over 977 cases of the virus, the largest number after China. … [+1451 chars]"}, {"source": {"id": null, "name": "Worldsoccertalk.com"}, "author": "AFP", "title": "Japan suspends football over virus as Olympics loom", "description": "Tokyo (AFP) – Japan suspended its football league on Tuesday, making it the latest sporting victim of the deadly coronavirus with just five months to go before the Tokyo Olympics. All J-League and cup games...", "url": "https://worldsoccertalk.com/2020/02/25/japan-suspends-football-over-virus-as-olympics-loom/", "urlToImage": "https://worldsoccertalk.com/wp-content/uploads/2020/02/eefed372e2c45490fdb36eebeaba7f9be4dd9559.jpg", "publishedAt": "2020-02-25T11:50:10Z", "content": "Tokyo (AFP) – Japan suspended its football league on Tuesday, making it the latest sporting victim of the deadly coronavirus with just five months to go before the Tokyo Olympics.All J-League and cup games were postponed until mid-March as Japan joined China … [+2229 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "'Where's Abe?' critics ask, as coronavirus spreads in Japan", "description": "As Japan struggles to stem the spread of a coronavirus within its borders, critics are asking, \"Where's Abe?\"", "url": "https://www.channelnewsasia.com/news/asia/where-s-abe-critics-ask-as-coronavirus-spreads-in-japan-12469246", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12469244/16x9/991/557/e13c01a8065213753583410a7ae94bde/tL/japanese-prime-minister-shinzo-abe-listens-to-iaea-director-general-rafael-grossi-at-the-prime-minister-s-official-residence-in-tokyo-4.jpg", "publishedAt": "2020-02-25T11:14:44Z", "content": "TOKYO: As Japan struggles to stem the spread of a coronavirus within its borders, critics are asking, \"Where's Abe?\"\r\nShinzo Abe, 65, Japan's longest serving prime minister, has failed to take the helm as the public face of the response to the virus, critics … [+4790 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Sophia Tesfaye", "title": "Bernie Sanders' big Nevada win causes cable news freakout — because it reveals a big truth", "description": "Talking heads see Sanders as an outrageous or dangerous \"socialist.\" Ordinary people mostly agree with his ideas", "url": "https://www.salon.com/2020/02/25/bernie-sanders-big-nevada-win-causes-cable-news-freakout--because-it-reveals-a-big-truth/", "urlToImage": "https://media.salon.com/2020/02/bernie-sanders-0224203.jpg", "publishedAt": "2020-02-25T12:00:01Z", "content": "For the third straight Democratic presidential contest — the first three of the 2020 election — Sen. Bernie Sanders won the most votes of any candidate in a still crowded field. And for the third straight election, a strong majority of voters indicated a pref… [+5724 chars]"}, {"source": {"id": null, "name": "Luxurylaunches.com"}, "author": "Ekta Joshi", "title": "The Corona effect – Sotheby’s relocates its Modern and Contemporary Art sale from Hong Kong to New York", "description": "Coronavirus has hit the world like a storm, especially the countries in Asia. Apart from China, the region... The post The Corona effect – Sotheby’s relocates its Modern and Contemporary Art sale from Hong Kong to New York appeared first on Luxurylaunches.", "url": "https://luxurylaunches.com/auctions/the-corona-effect-sothebys-relocates-its-modern-and-contemporary-art-sale-from-hong-kong-to-new-york.php", "urlToImage": "https://luxurylaunches.com/wp-content/uploads/2020/02/Corona-Hong-Kong-Sothebys.jpg", "publishedAt": "2020-02-25T12:01:08Z", "content": "Coronavirus has hit the world like a storm, especially the countries in Asia. Apart from China, the region around Hong Kong has also been affected by the outbreak with over 24 affected cases confirmed in the state so far. This has deterred art houses from sch… [+1000 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Gerard Couzens, Rosaleen Fenton)", "title": "''Scared'' Brit holidaymaker's quarantine hell inside Tenerife Coronavirus hotel", "description": "EXCLUSIVE: Two friends staying at the H10 Costa Adeje Palace in Adeje have told of their shock at finding out about the alert and having ''no food or anything'' as police stand guard outside the hotel", "url": "https://www.mirror.co.uk/news/uk-news/scared-brit-holidaymakers-quarantine-hell-21572026", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21572495.ece/ALTERNATES/s1200/2_THP_CHP_250220SLUG_8532JPG.jpg", "publishedAt": "2020-02-25T11:45:06Z", "content": "Two Brit holidaymakers trapped inside the Tenerife hotel at the centre of a Coronavirus outbreak have spoken of their ordeal. \r\nJayney Brown, who is on holiday with friend Elaine Whitewick, said they first they found out about the alert was when a letter was … [+4696 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Yoel Minkoff", "title": "Coronavirus fears are putting IPOs on hold", "description": "<ul><li>The <a href=\"https://www.marketwatch.com/story/companies-put-ipos-on-ice-as-coronavirus-fears-rock-markets-2020-02-24?mod=home-page\" target=\"_blank\">latest casualty</a> from the coronavirus outbreak may be the IPO market.</li><li>Carlyle has delayed t…", "url": "https://seekingalpha.com/news/3545113-coronavirus-fears-are-putting-ipos-on-hold", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-25T11:14:06Z", "content": "The latest casualty from the coronavirus outbreak may be the IPO market.\r\nCarlyle has delayed the initial public offering of its German specialty chemicals group Atotech (ATC), concerned that the virus would negatively impact the valuation, while Russia's lar… [+300 chars]"}, {"source": {"id": null, "name": "Iasbaba.com"}, "author": "IASbaba", "title": "Coronavirus & Impact on Economy – The Big Picture – RSTV IAS UPSC", "description": "Coronavirus & Impact on Economy Archives Topic: General Studies 2: Effect of policies and politics of developed and developing countries on India’s interests, Indian diaspora. Issues relating to development and management of Social Sector/Services relating to…", "url": "https://iasbaba.com/2020/02/coronavirus-impact-on-economy-the-big-picture-rstv-ias-upsc/", "urlToImage": "https://env-8632093.cloudjiffy.net/wp-content/uploads/2020/02/China-so-important-to-the-global-economy.png", "publishedAt": "2020-02-25T11:43:46Z", "content": "Topic: General Studies 2:\r\n<ul><li>Effect of policies and politics of developed and developing countries on Indias interests, Indian diaspora.</li><li>Issues relating to development and management of Social Sector/Services relating to Health.</li></ul>\r\nIn Ne… [+8133 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Mahathir in driver’s seat again to pick new Malaysia leader", "description": "While the outcome of the power struggle is unclear, the events mark another twist in the decades-long rivalry between Mahathir and Anwar Ibrahim. The distrust between them dates back to the 1990s, when Anwar was ousted from Mahathir’s cabinet and arrested for…", "url": "https://indianexpress.com/article/world/mahathir-in-drivers-seat-again-to-pick-new-malaysia-leader-6286207/", "urlToImage": "https://images.indianexpress.com/2018/06/mahathir-mohamad-7590.jpg?w=759", "publishedAt": "2020-02-25T11:19:31Z", "content": "By: Bloomberg | \r\nPublished: February 25, 2020 4:49:31 pm\r\nAs has long been the case in Malaysia over the years, all eyes are on Mahathir.After a wild day that saw the collapse of Malaysias ruling coalition, one thing is clear: Mahathir Mohamad holds the key … [+4392 chars]"}, {"source": {"id": null, "name": "Womensystems.com"}, "author": "orraz", "title": "Breaking: Dow Drops 960 Points At Open Over Fears Of Coronavirus", "description": "The Dow Jones erased all gains for 2020 at its open on Monday over fears of the spread of the coronavirus.", "url": "http://www.womensystems.com/2020/02/breaking-dow-drops-960-points-at-open.html", "urlToImage": "https://lh5.googleusercontent.com/proxy/PXiuHmOB5bv0I5OcYlw5weMQJdyXwHq_8cqTRmEMUOWXaA_IyLhX2mh8SVYL472y41faFYGEws5-mcfQYTDeuQ-d0FOjyPZm8Ttl6-0K8wPBBHRBFc_AcSpzqg=w1200-h630-p-k-no-nu", "publishedAt": "2020-02-25T11:26:01Z", "content": "Start typing and press Enter to search"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Watch live: Trump holds press conference after whirlwind India trip", "description": "President Trump's two-day India trip has been filled with pageantry.", "url": "https://www.cbsnews.com/news/donald-trump-holds-press-conference-in-india-watch-live-stream-today-02-25-2020/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/24/b550f26e-4477-4c59-8379-4000d009bc15/thumbnail/1200x630/82b2244ecd23493917f315a2ba4dc098/2020-02-24t083524z-19692763-rc2w6f99q7ow-rtrmadp-3-india-usa-trump.jpg", "publishedAt": "2020-02-25T11:24:14Z", "content": "President Trump is capping off his whirlwind trip to India with a press conference Tuesday. While there, Mr. Trump has touted America's ties with the country and his relationship with its prime minister, Narendra Modi.\r\n\"In America and in India, we know that … [+1890 chars]"}, {"source": {"id": null, "name": "Newstatesman.com"}, "author": "Michael Barrett", "title": "Why the UK must now brace for a coronavirus epidemic", "description": "The discovery of hundreds of cases in Italy has heightened the risk to Britain. \" data-adaptive-image-768-img=\" \" data-adaptive-image-1024-img=\" \" data-adaptive-image-max-img=\" \"> There is a scene in the 2017 film Darkest Hour where, deep in his Whitehall bun…", "url": "https://www.newstatesman.com/2020/02/why-uk-must-now-brace-coronavirus-epidemic", "urlToImage": "https://www.newstatesman.com/sites/default/files/styles/homesection_image/public/blogs_2020/02/gettyimages-1202992402.jpg?itok=O8TS1Zmm", "publishedAt": "2020-02-25T11:38:39Z", "content": "There is a scene in the 2017 film Darkest Hour where, deep in his Whitehall bunker, Gary Oldmans Churchill and his war cabinet await, despondently, an inevitable German invasion. This moment recurred to me following reports last Thursday of the first cases of… [+4594 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Isabel Togoh, Forbes Staff, Isabel Togoh, Forbes Staff https://www.forbes.com/sites/isabeltogoh/", "title": "Coronavirus Rattles Asian Markets As 1,000 Guests Are On Lockdown In Tenerife Hotel Linked To Illness", "description": "Markets in Asia continued to fall on Tuesday, while South Korea is aiming to test more than 200,000 members of a church sect for the Covid-19 virus.", "url": "https://www.forbes.com/sites/isabeltogoh/2020/02/25/coronavirus-rattles-asian-markets-as-1000-guests-are-on-lockdown-in-tenerife-hotel-linked-to-illness/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208545801%2F0x0.jpg", "publishedAt": "2020-02-25T11:53:58Z", "content": "South Korean President Moon Jae-in (L) talks to a president of Daegu Medical Center, You Wan-sik (R) ... [+] at the Daegu Medical Center on February 25, 2020 in Daegu, South Korea\r\nSouth Korean Presidential Blue House via Getty Images\r\nTopline: Markets in Asi… [+4090 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "David Jackson", "title": "A first hand account from Italy of the coronavirus lockdown", "description": "<ul><li>This personal account, just received, provides a picture of what's happening in northern Italy. It's from a woman who lives in Brescia, a city in Lombardy, at the foot of the Alps. Brescia has a population of 200,000, and is the second largest city in…", "url": "https://seekingalpha.com/news/3545116-first-hand-account-from-italy-of-coronavirus-lockdown", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-25T11:21:47Z", "content": "This personal account, just received, provides a picture of what's happening in northern Italy. It's from a woman who lives in Brescia, a city in Lombardy, at the foot of the Alps. Brescia has a population of 200,000, and is the second largest city in the reg… [+1698 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Trump says stock markets will crash if he loses election", "description": "US President Donald Trump said on Tuesday the U.S. stock market will crash if he loses the election this year.", "url": "https://www.channelnewsasia.com/news/business/trump-says-stock-markets-will-crash-if-he-loses-election-12469426", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12469424/16x9/991/557/62e822baf47db2307325c664715f24cf/OS/u-s--president-donald-trump-visits-india-4.jpg", "publishedAt": "2020-02-25T11:25:54Z", "content": "NEW DELHI: US President Donald Trump said on Tuesday (Feb 25) the US stock market will crash if he loses the election this year.\r\nDuring a trip to India, Trump told business leaders stocks will jump higher if he is re-elected, but \"if I dont win youre going t… [+540 chars]"}, {"source": {"id": null, "name": "Thejournal.ie"}, "author": "Garreth MacNamee", "title": "Iran's deputy health minister has been diagnosed with the coronavirus", "description": "Clusters of the illness have been reported across Iran.", "url": "https://www.thejournal.ie/iran-deputy-health-minister-coronavirus-5021091-Feb2020/", "urlToImage": "https://img2.thejournal.ie/article/5021091/river/?height=400&version=5021099", "publishedAt": "2020-02-25T12:06:03Z", "content": "IRANS DEPUTY HEALTH minister has been infected with the coronavirus, a ministry official confirmed, amid a major outbreak in the country.\r\nThe coronavirus test for Mr Iraj Harirchi, the deputy health minister who was on the front lines combating the coronavir… [+938 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Brian Ashcraft", "title": "Japanese Idol Group Charging Fans Who Don't Wear Sickness Masks Because Of Coronavirus", "description": "Numerous events scheduled for the next few weeks have been cancelled in Japan and abroad. Idol group 2o Love to Sweet Bullet isn’t rescheduling upcoming events, but rather charging extra for fans who don’t wear masks. More »", "url": "https://www.kotaku.com.au/2020/02/japanese-idol-group-charging-fans-who-dont-wear-sickness-masks-because-of-coronavirus/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ibqqgq0ihtewzkqwpwzi.jpg", "publishedAt": "2020-02-25T12:00:00Z", "content": "Numerous events scheduled for the next few weeks have been cancelled in Japan and abroad. Idol group 2o Love to Sweet Bullet isnt rescheduling upcoming events, but rather charging extra for fans who dont wear masks.\r\n2o Love to Sweet Bullet isnt a mainstream … [+1310 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Reuters", "title": "‘Where’s Abe?’ critics ask, as coronavirus spreads in Japan", "description": "They slam him for failing to take the helm as the public face of the response to the virus.", "url": "https://www.freemalaysiatoday.com/category/world/2020/02/25/wheres-abe-critics-ask-as-coronavirus-spreads-in-japan/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/AP20056275686278.jpg", "publishedAt": "2020-02-25T12:03:36Z", "content": "Prime Minister Shinzo Abe has failed to take the helm as the public face of the response to the virus, say critics. (AP pic)\r\nTOKYO: As Japan struggles to stem the spread of a coronavirus within its borders, critics are asking, “Where’s Abe?”\r\nShinzo Abe, 65,… [+4820 chars]"}, {"source": {"id": null, "name": "Dailyfx.com"}, "author": "Justin McQueen", "title": "Japanese Yen Forecast: Safe-Haven Battle May See USD/JPY Extend Drop", "description": "Global equities plunge however, spill-over into currency markets have been tame. Japanese Yen may play catch-up.", "url": "https://www.dailyfx.com/forex/market_alert/2020/02/25/Japanese-Yen-Forecast-Safe-Haven-Battle-May-See-USDJPY-Extend-Drop.html", "urlToImage": "https://a.c-dn.net/b/2JC8R3/headline_YEN_02.JPG", "publishedAt": "2020-02-25T12:00:00Z", "content": "USD/JPYAnalysis and Talking Points\r\n<ul><li>Equity Market Fallout, FX Reaction Tame</li><li>Japanese Yen Safe-Haven Qualities Returned? </li><li>Japanese Yen Undervalued?</li></ul>Equity Market Fallout, FX Reaction Tame\r\nYesterday, equity markets posted its l… [+2497 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By REUTERS", "title": "Italy probes 'insane' prices for coronavirus masks, sanitizers", "description": "Italy has seen the biggest outbreak of the disease in Europe, with more than 260 cases and seven deaths reported, most in the prosperous north of the country. ;", "url": "https://www.jpost.com/International/Italy-probes-insane-prices-for-coronavirus-masks-sanitizers-618724", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/453040", "publishedAt": "2020-02-25T11:28:39Z", "content": null}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By REUTERS", "title": "Fearing coronavirus, Hong Kong's 'coffin home' dwellers stay indoors", "description": "\"As soon as I finish my tea and grocery shopping, I come home and become a recluse and just watch TV. I can't do anything.\" ;", "url": "https://www.jpost.com/International/Fearing-coronavirus-Hong-Kongs-coffin-home-dwellers-stay-indoors-618718", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/454241", "publishedAt": "2020-02-25T11:17:53Z", "content": null}, {"source": {"id": null, "name": "Patentlyapple.com"}, "author": "Jack Purcher", "title": "Foxconn has added new incentives to attract Workers to Apple Plant for iPhone Production", "description": "On Friday Patently Apple posted a report titled \"Foxconn gradually resumes iPhone Production in Zhengzhou, announces US$746 bonuses to attract workers to begin Immediately.\" Today a new report on the same topic has surfaced adding a few additional details.", "url": "https://www.patentlyapple.com/patently-apple/2020/02/foxconn-has-added-new-incentives-to-attract-workers-to-apple-plant-for-iphone-production.html", "urlToImage": "https://www.patentlyapple.com/.a/6a0120a5580826970c025d9b3589e2200c-600wi", "publishedAt": "2020-02-25T11:42:17Z", "content": "On Friday Patently Apple posted a report titled \"Foxconn gradually resumes iPhone Production in Zhengzhou, announces US$746 bonuses to attract workers to begin Immediately.\" Today Digitimes reports on the same topic adding a few additional details.\r\nToday Dig… [+1072 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Doug Banks", "title": "Five things you need to know, and even tech jobs can be hard to find", "description": "Good morning, everyone. He's guilty. They're calming down. And here are the five things you need to know in Boston business news to get your workday started. Bad day for the markets Public companies in Massachusetts lost about $33 billion in market value yest…", "url": "https://www.bizjournals.com/boston/news/2020/02/25/five-things-you-need-to-know-and-even-tech-jobs.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_boston+%28Boston+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-02-25T11:20:28Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Sandra Abma", "title": "Support networks form for Ottawa's self-isolated returnees from China", "description": "Hundreds of volunteers are coming to the aid of people who chose to to quarantine themselves after time in China to try to stop the spread of coronavirus to Ottawa.", "url": "https://www.cbc.ca/news/canada/ottawa/coronavirus-ottawa-chinese-quarantine-isolation-volunteers-1.5474602", "urlToImage": "https://i.cbc.ca/1.5474712.1582631238!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/wei-wang.jpg", "publishedAt": "2020-02-25T11:52:04Z", "content": "On Feb. 9,  Yuxin \"Stella\" Zhang, 24 landed in Ottawa to start the next chapter in her life.\r\nInstead of heading to her new federal government job, the Chinese research scientist went straight into 14 days of self-imposed quarantine.  \r\nAlthough she showed no… [+1766 chars]"}, {"source": {"id": null, "name": "Brobible.com"}, "author": "thewatercoolesthq", "title": "Everyone Remain Calm", "description": "The following is one story you'll find in today's edition of The Water Coolest's free daily email newsletter.", "url": "https://brobible.com/success/article/everyone-remain-calm/", "urlToImage": "https://brobible.files.wordpress.com/2020/02/dollar-2387088_1920.jpg?quality=90&w=650", "publishedAt": "2020-02-25T12:00:06Z", "content": "The following is one story you’ll find in today’s edition of The Water Coolest’s free daily email newsletter. The Water Coolest is a daily business news and professional advice email newsletter geared towards bros (read: expect a hearty helping of unfiltered … [+2591 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Reuters", "title": "Judge bars US govt from moving virus patients to California city", "description": "113,000 residents filed a legal action against the proposal, calling it Trump's  'political weapon'.", "url": "https://www.freemalaysiatoday.com/category/world/2020/02/25/judge-bars-us-govt-from-moving-virus-patients-to-california-city/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/AP20055752245673.jpg", "publishedAt": "2020-02-25T11:22:58Z", "content": "113,000 Costa Mesa residents filed a legal action against the proposal, calling it Trump’s ‘political weapon’. (AP pic)\r\nCOSTA MESA: A US judge barred the government from relocating coronavirus patients to southern California for another week on Monday and or… [+2030 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Laura Zhou, Laura Zhou", "title": "Chinese cities quarantine travellers from South Korea amid spike in coronavirus cases", "description": "Chinese cities are stepping up restrictions on travellers from South Korea after its neighbour recorded a significant jump in coronavirus cases.Authorities in Weihai, a coastal city in the eastern province of Shandong, announced on Tuesday that people travell…", "url": "https://www.scmp.com/news/china/society/article/3052306/chinese-cities-quarantine-travellers-south-korea-amid-spike", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/25/3832e916-57b6-11ea-b438-8452af50d521_image_hires_200140.JPG?itok=HFBzm-_T&v=1582632105", "publishedAt": "2020-02-25T12:01:47Z", "content": null}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Wendy Wu, Wendy Wu", "title": "China ‘resisting calling off’ EU summit in March as coronavirus threatens delay", "description": "China is scrambling to hold its annual leadership summit with the European Union as scheduled, a source has said, as the coronavirus continues to disrupt its diplomatic and political agenda.The battle to contain the outbreak led to the postponement of Vice-Pr…", "url": "https://www.scmp.com/news/china/diplomacy/article/3052309/china-resisting-calling-eu-summit-march-coronavirus-threatens", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/25/9448ff3a-57aa-11ea-b438-8452af50d521_image_hires_200904.JPG?itok=GNYxZva9&v=1582632548", "publishedAt": "2020-02-25T12:09:10Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Technical View: Nifty fails to hold 11,800, forms bearish candle again", "description": "Traders are advised to remain neutral and focus on stock specific opportunities, Mazhar Mohammad said.", "url": "https://www.moneycontrol.com/news/business/markets/technical-view-nifty-fails-to-hold-11800-forms-bearish-candle-again-4975981.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/08/Sensex_Nifty_BSE_Stock-Market_traders-770x433.jpg", "publishedAt": "2020-02-25T11:27:06Z", "content": "The Nifty50 opened higher as an attempt to rebound after 2 percent correction seen in the previous session, but turned volatile for the rest of the session and finally settled moderately lower on February 25. Traders/investors remained concerned over the spre… [+2902 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Justin Sink and Jordan Fabian", "title": "Trump Says Markets Are Down Over Bernie Sanders Worries", "description": "(Bloomberg) -- President Donald Trump said Democratic presidential front runner Bernie Sanders is advocating “totally unaffordable” policies that are “not go...", "url": "https://news.yahoo.com/trump-says-markets-down-over-115256533.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-25T11:52:56Z", "content": "(Bloomberg) -- President Donald Trump said Democratic presidential front runner Bernie Sanders is advocating totally unaffordable policies that are not going to work during a meeting with business leaders Tuesday at the U.S. embassy in New Delhi.\r\nWhen we win… [+2725 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JONATHAN LEMIRE Associated Press", "title": "Trump defends $2.5B coronavirus request; Dems say it's low", "description": "President Donald Trump says the urgent $2.5 billion funding request he sent lawmakers will help prepare the U.S. in the event of a coronavirus outbreak", "url": "https://abcnews.go.com/Health/wireStory/trump-defends-25b-coronavirus-request-dems-low-69196018", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_b87d15a2184a44c9b6db5325c138f426_16x9_992.jpg", "publishedAt": "2020-02-25T11:28:17Z", "content": "NEW DELHI -- \r\nPresident Donald Trump said Tuesday that the urgent $2.5 billion plan for coronavirus he sent to lawmakers will prepare the nation in case of an outbreak in the U.S. and help other nations unprepared to handle the threat.\r\nWe just asked for $2.… [+2944 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Wall Street Breakfast", "title": "Wall Street Breakfast: Finding A Floor After Monday's Bloodbath", "description": "", "url": "https://seekingalpha.com/article/4326831-wall-street-breakfast-finding-floor-after-mondays-bloodbath", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-25T11:54:17Z", "content": "Congress asked for coronavirus funding\r\n The more than $1B the White House is allocating for vaccine development is part of a broader $2.5B request to combat the coronavirus outbreak. The rest of the money would be used for therapeutics and the stockpiling of… [+4810 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "SA Marketplace Roundtable Podcast", "title": "The Data-Driven Approach To Finding Investment Ideas (Podcast)", "description": "Andres Cardenal joins the Seeking Alpha Marketplace Roundtable podcast to discuss his investing methods.Cardenal's Data Driven Investor service uses a combination of quantitative and qualitative tools while paying close attention to the macro variables.The Si…", "url": "https://seekingalpha.com/article/4326719-data-driven-approach-to-finding-investment-ideas-podcast", "urlToImage": "https://static1.seekingalpha.com/images/marketing_images/numbers_words_signs/signs/data_analysis.jpeg", "publishedAt": "2020-02-25T11:30:00Z", "content": "Listen and subscribe to the Marketplace Roundtable on these podcast platforms:\r\nByNathaniel E. Baker\r\nAndres Cardenal rejoins the Seeking Alpha Marketplace Roundtable podcast to discuss his investment strategy as featured in the Data Driven Investor research … [+2355 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By REUTERS", "title": "Shoppers snap up yoga mats, games, condoms as coronavirus keeps them home", "description": "Nintendo's Ring Fit Adventure game for the Switch console, which combines exercise and role-playing, has been a star performer. ;", "url": "https://www.jpost.com/International/Shoppers-snap-up-yoga-mats-games-condoms-as-coronavirus-keeps-them-home-618725", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/454244", "publishedAt": "2020-02-25T11:35:07Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Mcevoy For Mailonline", "title": "Juventus' clash with Inter Milan 'to be played behind closed doors' following coronavirus outbreak", "description": "According to Italian news outlet ANSA, the country's FA's request to have games played in empty stadiums has been accepted by the government as virus continues to spread.", "url": "https://www.dailymail.co.uk/sport/football/article-8041913/Juventus-clash-Inter-Milan-played-closed-doors-following-coronavirus-outbreak.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/11/25167574-0-image-a-9_1582629528215.jpg", "publishedAt": "2020-02-25T11:29:54Z", "content": "Serie A chiefs will allow Juventus' title clash with Inter Milan to be played behind closed doors as the coronavirus continues to wreak havoc in Italy, according to reports.\r\nItalian prime minister Giuseppe Conte postponed four Serie A fixtures at the weekend… [+1682 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Steve Goldstein", "title": "Lumber Liquidators reports earnings ahead of estimates", "description": "Lumber Liquidators Holdings said it swung to a fourth-quarter profit of $16.4 million, or 57 cents a share, as sales rose to $273.9 million from $268.9 million. The retailer of hard-surface flooring said comparable-store sales rose 0.4% as adjusted EPS was 56…", "url": "https://www.marketwatch.com/story/lumber-liquidators-reports-earnings-ahead-of-estimates-2020-02-25", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-02-25T11:18:28Z", "content": "Lumber Liquidators Holdings \r\nLL, -18.37%\r\nsaid it swung to a fourth-quarter profit of $16.4 million, or 57 cents a share, as sales rose to $273.9 million from $268.9 million. The retailer of hard-surface flooring said comparable-store sales rose 0.4% as adju… [+682 chars]"}, {"source": {"id": null, "name": "Spectator.co.uk"}, "author": "Steerpike", "title": "Could coronavirus kill off the Six Nations?", "description": "Could the Six Nations rugby tournament be the first high profile victim of the coronavirus? England supporters are expecting to decamp to Rome’s Stadio Olimpico in just over two weeks time for the…", "url": "https://blogs.spectator.co.uk/2020/02/could-coronavirus-kill-off-the-six-nations/", "urlToImage": "https://spectatorblogs.imgix.net/files/2020/02/GettyImages-1202478860.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=486", "publishedAt": "2020-02-25T11:15:48Z", "content": "Could the Six Nations rugby tournament be the first high profile victim of the coronavirus? England supporters are expecting to decamp to Rome’s Stadio Olimpico in just over two weeks time for the final round match against Italy.\r\nBut the chances of the game … [+892 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: First cases in Austria, Croatia, Tenerife and southern Italy", "description": "As Italy prepares to host a European summit over the crisis, more cases have erupted across the bloc. Iran, which has the highest death toll outside China, has seen infections spike. Get the latest developments here. Italy to host European summit seeking to c…", "url": "https://www.dw.com/en/coronavirus-updates-first-cases-in-austria-croatia-tenerife-and-southern-italy/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona</li><li>60 new cases in South Korea</li></ul>All times in Universal Coordinated Time (UTC/GMT)\r\n13:30 Oman identifies two more … [+9781 chars]"}, {"source": {"id": null, "name": "Adage.com"}, "author": "Judann Pollack", "title": "Nike honors Kobe in memorial tribute and coronavirus sinks stocks: Tuesday Wake-Up Call", "description": "Also, what you need to know about tonight's debate; The Trade Desk translates programmatic into English and Reddit's got some ambitious ad plans.", "url": "https://adage.com/article/news/nike-honors-kobe-memorial-tribute-and-coronavirus-sinks-stocks-tuesday-wake-call/2239376", "urlToImage": "https://s3-prod.adage.com/s3fs-public/styles/800x600/public/20200224_kobe_memorial_3x2.jpg", "publishedAt": "2020-02-25T11:28:46Z", "content": "Just brieflyAsk them anything: Reddit has hired R/GA as the first agency-of-record in its 15-year history and plans a major ad campaign to hit in June. The idea, Roxy Young, Reddit's VP of marketing says, is to \"take a platform like Reddit and think about dif… [+1507 chars]"}, {"source": {"id": null, "name": "Www.gov.uk"}, "author": "Public Health England", "title": "Guidance for social or community care and residential settings on COVID-19", "description": "Guidance for social or community care and residential settings in providing advice about the novel coronavirus, COVID-19.", "url": "https://www.gov.uk/government/publications/guidance-for-social-or-community-care-and-residential-settings-on-covid-19", "urlToImage": "https://assets.publishing.service.gov.uk/static/opengraph-image-a1f7d89ffd0782738b1aeb0da37842d8bd0addbd724b8e58c3edbc7287cc11de.png", "publishedAt": "2020-02-25T11:35:51Z", "content": null}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: US casts doubt on Iranian integrity over the outbreak", "description": "As Italy prepares to host a European summit over the crisis, more cases have erupted across the bloc. Iran, which has the highest death toll outside China, has seen infections spike. Get the latest developments here. Italy to host European summit seeking to c…", "url": "https://www.dw.com/en/coronavirus-updates-us-criticizes-iran-and-china-over-the-their-handling-of-the-outbreak/a-52516885", "urlToImage": "https://www.dw.com/image/52519636_304.jpg", "publishedAt": "2020-02-25T11:54:00Z", "content": "<ul><li>Italy to host European summit seeking to contain the spread</li><li>Iran's deputy health minister tests positive for Corona as the US has cast doubt on Iran's honesty over the outbreak</li><li>60 new cases in South Korea</li></ul>All times in Universa… [+12270 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Alicia Adamczyk", "title": "Suze Orman's advice to investors on the market's drop: \"Rejoice\"", "description": "Personal finance expert Suze Orman says investors shouldn't be spooked by a one-day drop in the market. Instead, think of it as a buying opportunity.", "url": "https://www.cnbc.com/2020/02/25/suze-ormans-advice-to-investors-on-the-markets-drop-rejoice.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106158911-1569962717275suzeormanhorizontal.jpg?v=1570047915", "publishedAt": "2020-02-25T11:51:00Z", "content": "The Dow closed 1,000 points down Monday, but personal finance expert Suze Orman isn't worried. In fact, she says investors should \"rejoice.\"\r\nAppearing on CNBC's \"Closing Bell\" on Monday, the New York Times best-selling author says the market's drop due in la… [+2244 chars]"}]