[{"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "What's a Pandemic? Your Coronavirus Questions, Answered", "description": "Dr. Seema Yasmin, director of the Stanford Health Communication Initiative, shares how to protect yourself and others in this alarming time.", "url": "https://www.wired.com/story/whats-a-pandemic/", "urlToImage": "https://media.wired.com/photos/5e617d55dd088e00081102a7/191:100/w_1280,c_limit/Science_pandemic-still-3.jpg", "publishedAt": "2020-03-06T18:44:31Z", "content": "The SARS-CoV-2 virus, a novel coronavirus, has exploded out of China and spread the disease Covid-19 around the world. Symptoms include fever, cough, and sore throat, and can lead to death in vulnerable populations, particularly the elderly. The World Health … [+3080 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Aron Garst", "title": "The coronavirus’ human impact on esports", "description": "Major esports events from games like CSGO, Overwatch, PUBG, League of Legends, Dota 2, and more have been disrupted as the coronavirus outbreak continues to spread through the worlds of competitive gaming.", "url": "https://www.theverge.com/2020/3/6/21167652/coronavirus-esports-impact-league-of-legends-pubg-csgo-iem-katowice", "urlToImage": "https://cdn.vox-cdn.com/thumbor/56JDNjUW4EE5Hdl2h0_Jh7D9NZU=/0x412:5760x3428/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19772405/1142509437.jpg.jpg", "publishedAt": "2020-03-06T19:01:49Z", "content": "LoL Park full of fans on April 13th, 2019. | Photo by Timo Verdeil/ESPAT Media via Getty Images Fans, players, and broadcasters are all dealing with the fallout Ashley Kang was getting ready for another day covering the League of Legends Champions Korea (LCK)… [+10277 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nicole Dieker", "title": "How to Politely Avoid a Handshake", "description": "Most of us are probably familiar with the standard coronavirus prevention advice: Wash your hands, avoid touching your face, regularly sanitize common surfaces like door handles, and wash your hands again. Read more...", "url": "https://lifehacker.com/how-to-politely-avoid-a-handshake-1842154501", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yyxmcqges653rqsv9swy.jpg", "publishedAt": "2020-03-06T18:30:00Z", "content": "Most of us are probably familiar with the standard coronavirus prevention advice: Wash your hands, avoid touching your face, regularly sanitize common surfaces like door handles, and wash your hands again. \r\nAnd, if you can, avoid handshakes.\r\nWhy? Because yo… [+2268 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "UK government calls sport coronavirus meeting", "description": "Sports governing bodies and broadcasters are called to a government meeting on Monday to discuss the staging of events behind closed doors if the coronavirus outbreak worsens and mass gatherings are banned.", "url": "https://www.bbc.co.uk/sport/51777154", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/11D24/production/_111169927_gettyimages-1204935216.jpg", "publishedAt": "2020-03-06T18:39:36Z", "content": "Fans have been wearing face masks to football matches in England this week\r\nSports governing bodies and broadcasters have been called to a government meeting on Monday to discuss the staging of events behind closed doors if the coronavirus outbreak worsens an… [+682 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Adrianna Rodriguez, Jayne O'Donnell, Ken Alltucker", "title": "How can I get tested for coronavirus? What you should know about test kits - USA TODAY", "description": "How can I get tested for coronavirus? What you should know about test kits USA TODAY Trump's mismanagement helped fuel coronavirus crisis POLITICO Anyone Who Wants a Coronavirus Test Can Have One, Trump Says. Not Quite, Says His Administration. The New York T…", "url": "https://www.usatoday.com/story/news/health/2020/03/06/coronavirus-test-kit-how-can-get-tested-us-covid-19-virus/4973697002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/06/USAT/20bfb925-cd0c-491d-89dc-86c9dcf711d5-AFP_AFP_1PN9U6.JPG?crop=5936,3339,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-06T18:28:28Z", "content": "As coronavirus continues its spread across the U.S., public health officials are racing to make more test kits available and laboratories are working around the clock to test for the virus that has killed more than a dozen people in the U.S. and infected more… [+6246 chars]"}, {"source": {"id": null, "name": "Q13fox.com"}, "author": "https://www.facebook.com/Q13FOX", "title": "Emerald City Comic Con postponed over coronavirus concerns - Q13 News Seattle", "description": "Emerald City Comic Con postponed over coronavirus concerns Q13 News Seattle Seattle's iconic ComicCon postponed amid COVID-19 outbreak KOMO News The Comic Con at the Epicenter of the U.S. Coronavirus Outbreak Finally Got Canceled VICE Emerald City Comic Con p…", "url": "https://q13fox.com/2020/03/06/emerald-city-comic-con-postponed-over-coronavirus-concerns/", "urlToImage": "https://tribkcpq.files.wordpress.com/2020/03/comic-con.jpeg?quality=85&strip=all&w=1200", "publishedAt": "2020-03-06T19:03:53Z", "content": "SEATTLE -- Emerald City Comic Con, which was expected to bring upwards of 100,000 people to the Convention Center in downtown Seattle next weekend, has been postponed over novel coronavirus fears.\r\nThe event, one of the largest pop culture and comic events in… [+1482 chars]"}, {"source": {"id": null, "name": "Twitter.com"}, "author": "The New York Times", "title": "Join Farhad Manjoo in a chat about the coronavirus and the importance of science", "description": null, "url": "https://twitter.com/fmanjoo/status/1236005342946799616", "urlToImage": null, "publishedAt": "2020-03-06T19:08:54Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Factbox: How we die: coronavirus in perspective", "description": "As the new coronavirus spreads and worldwide deaths linked to it top 3,400, global alarm is growing and has caused everything from consumer runs on face masks to mass school closures.", "url": "https://www.reuters.com/article/us-health-coronavirus-mortality-factbox-idUSKBN20T2K0", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499676424&w=1200&r=LYNXMPEG251T4", "publishedAt": "2020-03-06T18:14:26Z", "content": "LONDON (Reuters) - As the new coronavirus spreads and worldwide deaths linked to it top 3,400, global alarm is growing and has caused everything from consumer runs on face masks to mass school closures. \r\nYet while few would deny the outbreak’s official statu… [+1859 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Katy Perry & Ariana Grande React To Coronavirus Spread - HollywoodLife", "description": "Katy Perry & Ariana Grande React To Coronavirus Spread HollywoodLife Katy Perry Reveals Why She Was 'Nervous' to Announce Pregnancy - and Shares Sweet Nickname for Baby PEOPLE.com Russell Brand Opens Up About 'Heartbreak' Following Katy Perry Pregnancy News m…", "url": "https://www.youtube.com/watch?v=hwrk9bWV6ZQ", "urlToImage": null, "publishedAt": "2020-03-06T18:37:56Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Encouraging Employees in Silicon Valley to Work From Home Amid Coronavirus Outbreak", "description": "As the coronavirus continues to spread in Santa Clara County where many of Apple's corporate offices are located, Apple is now encouraging employees in the area to work from home today if they are able to, according to Bloomberg 's Mark Gurman. Apple has aske…", "url": "https://www.macrumors.com/2020/03/06/apple-silicon-valley-coronavirus-telecommute/", "urlToImage": "https://images.macrumors.com/article-new/2018/04/apple-park-416-security.jpg", "publishedAt": "2020-03-06T19:02:09Z", "content": "As the coronavirus continues to spread in Santa Clara County where many of Apple's corporate offices are located, Apple is now encouraging employees in the area to work from home today if they are able to, according to Bloomberg's Mark Gurman.\r\nApple has aske… [+1251 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Sonnemaker", "title": "Google, Facebook, and Twitter will follow Microsoft's lead in paying hourly workers while office staff works remotely during the coronavirus outbreak (GOOG, GOOGL, FB, TWTR, MSFT)", "description": "Google, Facebook, and Twitter are planning to keep paying hourly workers even as staffing needs decline, according to Axios. The coronavirus outbreak has led many companies adopt remote work policies, raising concerns about what will happen to food service, j…", "url": "https://www.businessinsider.com/google-facebook-twitter-pay-hourly-workers-offices-remote-2020-3", "urlToImage": "https://i.insider.com/5df3bfd2fd9db22ac3669e0b?width=1200&format=jpeg", "publishedAt": "2020-03-06T18:59:29Z", "content": "Google, Facebook, and Twitter said they will continue to pay hourly workers even if remote work policies and office closures in the wake of the coronavirus outbreak reduce staffing needs, Axios reported on Thursday evening.\r\nAs COVID-19, the disease caused by… [+2124 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "Dow tanks 450 points as coronavirus risks drag stocks deeper into correction territory", "description": "Stocks dropped for the second day in a row as coronavirus volatility dragged risk-asset prices deeper into correction territory. All major US indices declined as the outbreak's infection count passed 100,000 and investors continued running to safe havens. The…", "url": "https://www.businessinsider.com/stock-market-news-today-indexes-drop-coronavirus-fear-volatility-correction-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5e6288adfee23d310f513b96-2400/2020-03-05t214714z535755400rc2xdf9un7wrrtrmadp3usa-stocks.jpg", "publishedAt": "2020-03-06T18:37:22Z", "content": "Andrew Kelly/Reuters\r\n<ul><li>Stocks dropped for the second day in a row as coronavirus volatility dragged risk-asset prices deeper into correction territory.</li><li>All major US indices declined as the outbreak's infection count passed 100,000 and investors… [+1979 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Melania Trump tweets about her excitement for a new White House tennis court as the country battles the coronavirus", "description": "First Lady Melania Trump tweeted about the construction of new White House tennis courts on Thursday, sparking backlash. \"I am excited to share the progress of the Tennis Pavillion at @WhiteHouse,\" she tweeted alongside photos of herself in a hard hat at the …", "url": "https://www.businessinsider.com/melania-trump-tweets-about-white-house-tennis-court-coronavirus-spreads-2020-3", "urlToImage": "https://i.insider.com/5e62882bfee23d46a76d7cc4?width=1200&format=jpeg", "publishedAt": "2020-03-06T18:34:05Z", "content": "First Lady Melania Trump tweeted about the construction of a new private White House tennis pavilion on Thursday as concern spreads that the Trump administration isn't doing enough to contain the coronavirus. \r\n\"I am excited to share the progress of the Tenni… [+1614 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Dave Jamieson", "title": "Democrats Propose Emergency Paid Sick Days To Address Coronavirus", "description": "Republicans may find it uncomfortable to vote against guaranteeing two weeks of needed leave during an outbreak.", "url": "https://www.huffpost.com/entry/democrats-emergency-paid-sick-days-coronavirus_n_5e628a0dc5b605572804a142", "urlToImage": "https://img.huffingtonpost.com/asset/5e628ad1230000c715dde2d1.jpeg?cache=BqLjRSrStf&ops=1200_630", "publishedAt": "2020-03-06T18:59:17Z", "content": "Members of Congress introduced a bill Friday that would assure U.S. workers can take paid sick leave, if needed, during the coronavirus outbreak.\r\nThe legislation proposed by Democrats would require employers to grant workers 14 paid sick days to be used in t… [+5619 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shira Feder", "title": "Gig economy workers say they'll have to work through the coronavirus outbreak even if they get sick: \"We can't risk losing a day's income\"", "description": "The CDC has issued guidelines on how to avoid spreading coronavirus, warning everyone to stay home if they feel sick. But for a lot of Americans, this isn't possible. Research shows that hourly employees in the US are likely to come into work while sick, due …", "url": "https://www.businessinsider.com/the-gig-economy-with-lack-of-sick-leave-spreading-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e6294ccfee23d564f157ce2?width=1200&format=jpeg", "publishedAt": "2020-03-06T18:23:00Z", "content": "During the 2009 swine flu outbreak, Lauren Rinaldi was 26, working as a server in Philadelphia. It was the busiest time of year, when restaurants were packed with locals and tourists and there were tips to be made. She didn't feel well, but she decided to pus… [+6708 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Shoshana Dubnow", "title": "Coronavirus keeping American couple from their adopted daughter in China", "description": "Noah and Ivy Cleveland got an email from Holt International in early February that said they were no longer able to travel to China to adopt due to the novel coronavirus.", "url": "https://abcnews.go.com/Politics/coronavirus-keeping-american-couple-adopted-daughter-china/story?id=69422438", "urlToImage": "https://s.abcnews.com/images/Health/cleveland-family-ht-jef-200305_hpMain_16x9_992.jpg", "publishedAt": "2020-03-06T18:41:53Z", "content": "Noah and Ivy Cleveland were packed and ready to go for weeks before a Feb. 7 flight to Guangzhou, China, they hoped would change their lives.\r\nThey had been excited about making the trip for nine months -- ever since their adoption agency told them they'd bee… [+5083 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "UBS is divvying up teams in Switzerland and having them switch off who comes into the office as part of its coronavirus response (UBS)", "description": "UBS, the Swiss bank headquarterd in Zurich, has begun implementing a split-operations policy in Switzerland this week as part of its coronavirus response. The firm has already implemented a similar policy for its employees across the Asia Pacific region. Visi…", "url": "https://www.businessinsider.com/amid-coronavirus-ubs-implementing-split-operations-in-switzerland-mirroring-apac-2020-3", "urlToImage": "https://i.insider.com/5e629080fee23d3d5b284ba8?width=1200&format=jpeg", "publishedAt": "2020-03-06T18:49:40Z", "content": "UBS has started implementing a split-operations policy in Switzerland this week as financial services firms around the world race to deal with the global spread of coronavirus.\r\nThe bank, headquartered in Zurich, Switzerland, has already implemented a split-o… [+1529 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Matt Patches", "title": "ECCC 2020 postponed to summer after major comics publishers pull out", "description": "DC Comics and Dark Horse were among the big names to pull out of Emerald City Comic Con, which takes place annually in Seattle, Washington, where COVID-19 has caused nine deaths. The convention will move to summer 2020. Here are full details on", "url": "https://www.polygon.com/comics/2020/3/4/21164601/eccc-2020-coronavirus-postponed-washington-state-dc-dark-horse", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PH4fqUwoRfCZNz2ndu773Ubs88M=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19767064/GettyImages_467872218.jpg", "publishedAt": "2020-03-06T19:08:24Z", "content": "Emerald City Comic Con, which has taken place annually in Seattle, Washington since 2003, is the latest event to be disrupted by the outbreak of coronavirus. Set to run from March 12 - 15, major publishers are pulling out of the event last minute due to conce… [+4197 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Patrick Klepek, Rob Zacny", "title": "Hand Shakes, High-Fives Banned at ‘League of Legends’ Event, Due to Coronavirus", "description": "Organizers are finding it increasingly hard to hold gatherings with lots of people, and weird compromises are being made.", "url": "https://www.vice.com/en_us/article/dyg5xq/hand-shakes-high-fives-banned-at-league-of-legends-event-coronavirus", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e62932ce6e585009769cb49/lede/1583518509383-jbareham_191158_ply0958_decade_lolengends0.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-03-06T18:23:53Z", "content": "The Game Developers Conference was cancelled last week. Its looking increasingly likely E3 is also on shaky ground, and other geek-related events are scrambling to figure out a path forward. Besides conventions, the other gaming events most impacted by the sp… [+1221 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Harry Cheadle, Kate Lowenstein", "title": "Flight Attendants Fear for Their Jobs as Coronavirus Panic Takes Hold", "description": "They're also washing their hands with gin?", "url": "https://www.vice.com/en_us/article/z3bgya/flight-attendants-fear-for-their-jobs-as-coronavirus-panic-takes-hold", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e62969c4ad1c600973e3268/lede/1583521150853-Flight-Attendant.jpeg?crop=1xw:0.7341xh;0xw,0.0396xh&resize=1200:*", "publishedAt": "2020-03-06T19:05:33Z", "content": "The only thing spreading faster than the coronavirus is fear about the coronavirus. With the federal government seemingly unable to produce the promised number of tests for COVID-19, popularly known as the coronavirus, it's unclear exactly how many infected p… [+7026 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Benjamin Mayo", "title": "Apple recommending Apple Park employees to work from home today due to coronavirus concerns", "description": "According to a report from Business Insider, Apple is telling employees at its Cupertino campuses, Apple Park and Infinite Loop, that they are recommended to work from home today as an “additional precaution” ( via Mark Gurman ). Further details on the policy…", "url": "https://9to5mac.com/2020/03/06/apple-reportedly-recommending-apple-park-employees-to-work-from-home-due-to-coronavirus-concerns/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2018/05/apple-park1.jpg?quality=82&strip=all", "publishedAt": "2020-03-06T18:42:22Z", "content": "According to a report from Business Insider, Apple is telling employees at its Cupertino campuses, Apple Park and Infinite Loop, that it recommends working from home today as an “additional precaution” (via Mark Gurman).\r\nFurther details on the policy are not… [+1358 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Ciara Linnane", "title": "The Ratings Game: Costco, BJ’s and Kroger sales boosted by demand for coronavirus-related items", "description": "A steep increase in demand for hand sanitizer, cleaning and disinfecting materials, canned and dry grocery items and other products associated with the coronavirus that causes COVID-19 spurred a surge in sales at CostCo Wholesale Corp. in the last week of Feb…", "url": "http://www.marketwatch.com/story/costco-bjs-and-kroger-sales-boosted-by-demand-for-coronavirus-related-items-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB671_Costco_ZG_20200306134039.jpg", "publishedAt": "2020-03-06T18:49:19Z", "content": "A steep surge in demand for hand sanitizer, cleaning and disinfecting materials, canned and dry grocery items and other products associated with the coronavirus that causes COVID-19 spurred a surge in sales at CostCo Wholesale Corp. in the last week of Februa… [+4582 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Rebecca Heilweil", "title": "Facebook and Twitter are struggling to get coronavirus disinformation details from the government", "description": "The State Department seems unusually secretive in its reports on coronavirus disinformation.", "url": "https://www.vox.com/recode/2020/3/6/21166982/coronavirus-conspiracy-theories-state-department-social-media-russia", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6B8Ir7_51vrDbCnqzOCzLvFX0Ts=/0x0:6601x3456/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19772600/1205321210.jpg.jpg", "publishedAt": "2020-03-06T18:40:00Z", "content": "State Department officials are claiming that disinformation related to the coronavirus including some pushed by Russia is rampant across popular social media platforms. But the government seems cagey about reporting the details to the companies involved. \r\nAc… [+8201 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Isadora Baum", "title": "Here’s How Trader Joe’s Is Keeping Their Grocery Stores Safe Amidst Coronavirus Fears", "description": "You can still get samples, but the process will look a little different. READ MORE...", "url": "http://feedproxy.google.com/~r/apartmenttherapy/thekitchn/~3/1nZkCEDE30k/trader-joes-coronavirus-samples-23012883", "urlToImage": null, "publishedAt": "2020-03-06T18:45:00Z", "content": null}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Anthony DeBarros, Josh Zumbrun", "title": "The Wall Street Journal: Trump administration grants tariff relief for face masks, other coronavirus-related gear", "description": "The Trump administration has granted exclusions from import tariffs for more than 100 medical items imported from China, including face masks, examination gloves and sanitizing wipes.", "url": "http://www.marketwatch.com/story/trump-administration-grants-tariff-relief-for-face-masks-other-coronavirus-related-gear-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HZ264_corona_ZG_20200129131719.jpg", "publishedAt": "2020-03-06T19:03:09Z", "content": "WASHINGTONThe Trump administration has granted exclusions from import tariffs for more than 100 medical items imported from China, including face masks, examination gloves and sanitizing wipes.\r\nThe exclusions were approved for 27 companies, all of which file… [+794 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Associated Press", "title": "Vatican halts Mexico abuse prevention mission, cites virus", "description": "Mexico's bishops said Friday the Vatican had suspended a clerical sex abuse fact-finding and assistance mission to Mexico due to the spreading coronaviru...", "url": "https://news.yahoo.com/vatican-suspends-investigative-mission-mexico-184047484.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-06T18:40:47Z", "content": "MEXICO CITY (AP) Mexico's bishops said Friday the Vatican had suspended a clerical sex abuse fact-finding and assistance mission to Mexico due to the spreading coronavirus in Italy and now the Vatican.\r\nThe Mexican Episcopal Conference said in a statement the… [+3190 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jill Colvin / AP", "title": "Trump Laces Into Elizabeth Warren as He Claims Sexism Did Not Play a Role in Her Election Exit", "description": "President Trump laced into Elizabeth Warren Friday, insisting that sexism wasn't to blame for the end of the senator's presidential bid.", "url": "https://time.com/5798092/trump-warren-sexism-presidential-campaign/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/trump-warren-sexism-presidential-campaign.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-06T18:16:24Z", "content": "(WASHINGTON) — “Lack of talent.” Unlikable. “Mean.”\r\nPresident Donald Trump laced into former Democratic candidate Elizabeth Warren on Friday, insisting that sexism wasn’t to blame for the end of the Massachusetts senator’s presidential campaign, even as he u… [+1817 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Government summons sports bosses to talks", "description": "Sports authorities and broadcasters have been summoned by the government for discussions on coronavirus contingency plans.", "url": "https://www.skysports.com/other-sports/news/11095/11951272/coronavirus-sports-bosses-and-broadcasters-summoned-to-discuss-contingency-plans", "urlToImage": "https://e2.365dm.com/20/03/1600x900/skysports-stadio-olimpico-rome_4938846.jpg", "publishedAt": "2020-03-06T18:57:00Z", "content": "Sports authorities and broadcasters have been summoned by the government for discussions on coronavirus contingency plans. \r\nThe meetings will be held in London on Monday and will cover various possibilities in case the virus spreads further.\r\nMinisters will … [+652 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "EU holds emergency meeting over coronavirus outbreak", "description": "Coronavirus cases continue to rise sharply across Europe, with the Vatican, Serbia and Slovakia reporting their first infections on Friday.", "url": "https://www.aljazeera.com/news/2020/03/eu-holds-emergency-meeting-coronavirus-outbreak-200306190156889.html", "urlToImage": "https://www.aljazeera.com/mritems/images/2020/3/6/image-20200306190158953.jpg", "publishedAt": "2020-03-06T19:01:56Z", "content": "Coronavirus cases continue to rise sharply across Europe.\r\nThe Vatican, Serbia and Slovakia reported their first infections on Friday.\r\nAlmost 1,000 new cases were confirmed in Italy in one day.\r\nEuropean Union officials held an emergency meeting in Brussels,… [+99 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Peter Helman", "title": "Tool Concertgoers May Have Been Exposed To Coronavirus", "description": "Tool fans in New Zealand may have been exposed to coronavirus. The New Zealand Herald reports that the fourth person in the country to be diagnosed with COVID-19 attended Tool's show at the Sparks Arena in Auckland last Friday.  The man has been in self-isola…", "url": "https://www.stereogum.com/2075976/tool-concertgoers-may-have-been-exposed-to-coronavirus/news/", "urlToImage": "https://static.stereogum.com/uploads/2020/03/GettyImages-692366642-1583518805-608x405.jpg", "publishedAt": "2020-03-06T18:34:40Z", "content": "Tool fans in New Zealand may have been exposed to coronavirus. The New Zealand Herald reports that the fourth person in the country to be diagnosed with COVID-19 attended Tool’s show at the Sparks Arena in Auckland last Friday. \r\nThe man has been in self-isol… [+807 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump said Warren's campaign failed because she's 'mean' and lacks talent, and not because of sexism", "description": "President Donald Trump rejected the notion sexism had something to do with Sen. Elizabeth Warren's lack of success in the 2020 campaign season. Warren dropped out of the 2020 race on Thursday. \"I think lack of talent was her problem. She had a tremendous lack…", "url": "https://www.businessinsider.com/trump-said-warrens-campaign-failed-because-shes-mean-not-sexism-2020-3", "urlToImage": "https://i.insider.com/5e628f92fee23d3bcb5a9a33?width=1200&format=jpeg", "publishedAt": "2020-03-06T18:20:25Z", "content": "President Donald Trump on Friday said that Sen. Elizabeth Warren's campaign did not fail because of sexism, but because she's \"mean\" and lacks \"talent.\" \r\n\"I think lack of talent was her problem. She had a tremendous lack of talent,\" Trump told reporters as h… [+2646 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Alaska Air, Hawaiian Holdings, and Other Airline Stocks Just Popped", "description": "There are rumors that the White House is mulling a coronavirus bailout of the airline industry.", "url": "https://www.fool.com/investing/2020/03/06/why-alaska-air-hawaiian-holdings-airline-stocks.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561966/collage-of-an-airplane-coronaviruses-and-a-world-map.jpg", "publishedAt": "2020-03-06T18:50:05Z", "content": "What happened\r\nAll of a sudden, things are coming up roses for airline stocks -- yes, in the midst of the novel coronavirus crisis, and largely because of it.\r\nAs of 12:30 p.m. EST, shares of Alaska Air(NYSE:ALK) are up 4.3%, Hawaiian Holdings(NASDAQ:HA) stoc… [+1874 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Ballard)", "title": "Why Levi Strauss Stock Dropped 13% in February", "description": "Investors are worried about how the coronavirus outbreak could impact sales of jeans.", "url": "https://www.fool.com/investing/2020/03/06/why-levi-strauss-stock-dropped-13-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561964/jeans-store-denim.jpg", "publishedAt": "2020-03-06T18:32:00Z", "content": "What happened\r\nFears of a global epidemic related to COVID-19 sent the broader market down last month, with companies that do business in China getting hit particularly hard. There have been more than 80,000 cases reported in China and more than 100,000 world… [+1192 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Ballard)", "title": "Why Intel Stock Dropped 13% in February", "description": "Investors worry about Intel's ability to sell chips amid the coronavirus outbreak.", "url": "https://www.fool.com/investing/2020/03/06/why-intel-stock-dropped-13-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561984/computer-processor.jpg", "publishedAt": "2020-03-06T19:05:00Z", "content": "What happened\r\nShares of Intel(NASDAQ:INTC) lost 13.2% last month, according to data provided by S&amp;P Global Market Intelligence. Intel delivered strong quarterly earnings results at the end of January, but the broad market sell-off caused by the outbreak … [+1635 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Emily Alford", "title": "Rich People Have Always Been Assholes During Plagues", "description": "When the first waves of plague swept medieval Europe, the disease killed both the rich and the poor indiscriminately. In July 1348, King Edward III of England’s 12-year-old daughter died on her way to Spain to marry King Pedro of Castile. And though he was st…", "url": "https://jezebel.com/rich-people-have-always-been-assholes-during-plagues-1842126456", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/d4ex2jrfrhyqi1hlqyme.jpg", "publishedAt": "2020-03-06T18:45:00Z", "content": "When the first waves of plague swept medieval Europe, the disease killed both the rich and the poor indiscriminately. In July 1348, King Edward III of Englands 12-year-old daughter died on her way to Spain to marry King Pedro of Castile. And though he was sti… [+7495 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Royston Yang)", "title": "This Cruise Company's Stock Is Plunging, but Is It a Bargain?", "description": "With the coronavirus outbreak severely disrupting the cruise industry, should Royal Caribbean start to show up on investors' radar?", "url": "https://www.fool.com/investing/2020/03/06/cruise-ship-company-stock-plunging-coronavirus.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561871/cruise-ship-2.jpg", "publishedAt": "2020-03-06T18:45:17Z", "content": "As the novel coronavirus outbreak getting worse, it is creating a problem that is going to be on the minds of investors for quite a while. Many companies have reported supply chain issues that have held up manufacturing or forced store closures as authorities… [+3815 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Balance of Power: Jobs Report, Coronavirus Fears, 2020(Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-06/balance-of-power-jobs-report-coronavirus-fears-2020-podcast", "urlToImage": null, "publishedAt": "2020-03-06T19:10:24Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Donna Fuscaldo)", "title": "Microsoft, Facebook, Google, Pledge to Pay Workers if Coronavirus Slowdown Emerges", "description": "Tech companies are stepping up as the coronavirus spreads in the U.S., agreeing to pay hourly workers normal wages amid business interruptions.", "url": "https://www.fool.com/investing/2020/03/06/microsoft-facebook-google-pledge-to-pay-workers-if.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561992/microsoft-office-mf.jpg", "publishedAt": "2020-03-06T19:09:00Z", "content": "Microsoft(NASDAQ:MSFT), Facebook(NASDAQ:FB), Twitter(NYSE:TWTR), and Alphabet's Google (NASDAQ:GOOG)(NASDAQ:GOOGL) are bracing for an onslaught of business disruptions as the novel-coronavirus spreads in the U.S. \r\nMicrosoft's actions to close offices for dee… [+1395 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Chris Evangelista", "title": "‘No Time to Die’ Release Date Delay Could Result in a $30-$50 Million Loss for MGM", "description": "No Time to Die was set to open next month, but fears of the coronavirus outbreak lead to MGM bumping the movie to November. And while that ultimately might have been the right decision, it’s going to cost the studio. Sources state that the No Time to Die rele…", "url": "https://www.slashfilm.com/no-time-to-die-release-date-delay/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/No-Time-to-Die-Release-Date-Delay-.jpg", "publishedAt": "2020-03-06T18:30:16Z", "content": "No Time to Die was set to open next month, but fears of the coronavirus outbreak lead to MGM bumping the movie to November. And while that ultimately might have been the right decision, it’s going to cost the studio. Sources state that the No Time to Die rele… [+2238 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "''This Is Real Devastation': Trump Tours Tornado Damage In Tennessee | NBC News - NBC News", "description": "''This Is Real Devastation': Trump Tours Tornado Damage In Tennessee | NBC News NBC News Trump on Coronavirus Outbreak: 'I Like That' People Are Now 'Staying In the U.S., Spending Money In The U.S.' Newsweek 'I like that': Trump says he's pleased coronavirus …", "url": "https://www.youtube.com/watch?v=IlKv_5rdDTw", "urlToImage": null, "publishedAt": "2020-03-06T19:03:22Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Evan Selleck", "title": "Apple is ‘encouraging employees’ at Apple Park to work from home today due to coronavirus concerns", "description": "Apple has reportedly encouraged its employees at Apple Park to work from home today if they are able due to coronavirus concerns.", "url": "https://www.idownloadblog.com/2020/03/06/apple-park-employees-work-from-home/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2018/09/Apple-Park-hero-005-730x480.jpg", "publishedAt": "2020-03-06T19:01:46Z", "content": "The global outbreak of the new coronavirus continues to have a major impact, especially to companies and their normal day-to-day routines.\r\nFor example, Apple has encouraged employees at the Apple Park campus to work from home today. Thats according to a twee… [+1683 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sarah Buhr", "title": "Delivery startups set up contactless delivery options as coronavirus fears grow in US", "description": "Postmates  announced today it would be adding a \"non-contact delivery option,\" for those concerned about COVID-19 exposure from workers bringing them food.  Instacart  set up something similar earlier this week, announcing sales were 10x higher this week over…", "url": "https://finance.yahoo.com/news/delivery-startups-set-contactless-delivery-183219349.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/mEUE7X6nS5sGkXcDzNwdvg--~B/aD0xMzk1O3c9MTg1OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/45436d2f8d7cbac7091cfdc427d681b0", "publishedAt": "2020-03-06T18:32:19Z", "content": "Postmates announced today it would be adding a \"non-contact delivery option,\" for those concerned about COVID-19 exposure from workers bringing them food. Instacart set up something similar earlier this week, announcing sales were 10x higher this week over la… [+2165 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Davide Scigliuzzo", "title": "Banks Promised $7 Billion for a Casino Deal. Then the Coronavirus Hit", "description": "Banks that agreed to provide over $7 billion of loans for Eldorado Resorts Inc.’s acquisition of Caesars Entertainment Corp. face an uphill battle to offload the debt to investors as fears over the coronavirus outbreak wreak havoc across the travel and leisur…", "url": "https://www.bloomberg.com/news/articles/2020-03-06/banks-promised-7-billion-for-a-casino-deal-then-the-virus-hit", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iuLpy0xbzhDs/v1/1200x800.jpg", "publishedAt": "2020-03-06T18:34:49Z", "content": "Banks that agreed to provide over $7 billion of loans for \r\nEldorado Resorts Inc.’s acquisition of \r\nCaesars Entertainment Corp. face an uphill battle to offload the debt to investors as fears over the coronavirus outbreak wreak havoc across the travel and le… [+3870 chars]"}, {"source": {"id": null, "name": "Gq.com"}, "author": "Laura Bassett", "title": "How Trump’s Authoritarian Coronavirus Response Puts America at Risk—Especially His Own Supporters", "description": "President Donald Trump has been more concerned with the CDC showing him in a good light, as coronavirus cases surge across America and the globe.", "url": "https://www.gq.com/story/trump-authoritarian-coronavirus", "urlToImage": "https://media.gq.com/photos/5e628b626ad6c200080c3f99/16:9/w_1280,c_limit/Trump_mao2.jpg", "publishedAt": "2020-03-06T18:19:22Z", "content": "As the deadly coronavirus sweeps across the planet, holding entire cities and packed cruise ships hostage and claiming thousands of lives, many blame Chinas authoritarian government for exacerbating the spread of a global pandemic that originated there by con… [+3397 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Matt Maranian", "title": "\"The Fuddy Duddy Walk,\" is the ‘60s dance craze that never was", "description": "Jack Nitzsche was a legend in his own time; an arranger, producer, songwriter, and Academy Award-winning composer. His disparate discography includes collaborations with Phil Spector, the iconic 1966 Batman theme, titles by The Rolling Stones, Doris Day, Ike …", "url": "https://boingboing.net/2020/03/06/the-fuddy-duddy-walk-is-t.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/Fuddy-Duddy-Walk.jpg?fit=1000%2C1000&ssl=1", "publishedAt": "2020-03-06T18:38:36Z", "content": "Jack Nitzsche was a legend in his own time; an arranger, producer, songwriter, and Academy Award-winning composer. His disparate discography includes collaborations with Phil Spector, the iconic 1966 Batman theme, titles by The Rolling Stones, Doris Day, Ike … [+2855 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France says it now has 613 confirmed cases of coronavirus", "description": "France has 613 confirmed cases of coronavirus, the head of the public health service, Jerome Salomon, said on Friday, which is an increase of 190 compared to a day earlier.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-idUSKBN20T2MX", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499686373&w=1200&r=LYNXMPEG251U2", "publishedAt": "2020-03-06T19:03:38Z", "content": "PARIS (Reuters) - France has 613 confirmed cases of coronavirus, the head of the public health service, Jerome Salomon, said on Friday, which is an increase of 190 compared to a day earlier. \r\nDuring a press briefing, he added the death toll from the disease … [+123 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Kate Abnett", "title": "Climate change or coronavirus? 'Pick your evil', protesters say", "description": "Protesters at a rally led by climate activist Greta Thunberg on Friday denounced governments for taking urgent action against the coronavirus outbreak but failing to treat global warming as an emergency.", "url": "https://www.reuters.com/article/us-climate-change-gretathunberg-idUSKBN20T2NP", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499688414&w=1200&r=LYNXMPEG251UG", "publishedAt": "2020-03-06T19:11:13Z", "content": "BRUSSELS (Reuters) - Protesters at a rally led by climate activist Greta Thunberg on Friday denounced governments for taking urgent action against the coronavirus outbreak but failing to treat global warming as an emergency. \r\nSeveral thousand people braved t… [+2118 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Natasha Mascarenhas", "title": "Citing concern over COVID-19, Y Combinator moves demo day online", "description": "Startup accelerator Y Combinator has moved its famed demo day online, citing a “growing concern over COVID-19,” or coronavirus. “While we won’t be able to recreate every aspect of Demo Day, we’ll try our best to create an amazing experience for our founders a…", "url": "https://finance.yahoo.com/news/citing-concern-over-covid-19-183352608.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/3.GizAAXJ58QbNLUpIa5VQ--~B/aD03ODE7dz0xMzkwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/4bbc0ffa18d943dfcf191a05a158b80e", "publishedAt": "2020-03-06T18:33:52Z", "content": "Startup accelerator Y Combinator has moved its famed demo day online, citing a growing concern over COVID-19, or coronavirus. The demo day has historically drawn crowds of Silicon Valley elite, journalists, and both national and international venture capitali… [+2215 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anthony Ha", "title": "Daily Crunch: Jack Dorsey defends his work as Twitter CEO", "description": "Twitter's CEO defends himself from activist investors, Google takes additional coronavirus precautions and a fizzy drink maker raises $30 million. Twitter CEO Jack Dorsey spoke yesterday at a Morgan Stanley conference, where he delivered remarks (also shared …", "url": "https://finance.yahoo.com/news/daily-crunch-jack-dorsey-defends-184828870.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/8rUCZ5BmVbbLWHmCVGBbDQ--~B/aD01NjI7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/0513a02a64e437762909559ad7ffff4f", "publishedAt": "2020-03-06T18:48:28Z", "content": "Twitter's CEO defends himself from activist investors, Google takes additional coronavirus precautions and a fizzy drink maker raises $30 million. Here's your Daily Crunch for March 6, 2020.\r\n1. Twitter CEOs weak argument why investors shouldnt fire him\r\nTwit… [+3237 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "anthonypauldalessandro", "title": "‘The Lovebirds’ Cast & Director Are Skipping SXSW, But Pic Will Still Play Fest", "description": "This just in. The Lovebirds will still make its world premiere at SXSW on Saturday, March 14 at the Paramount Theatre, but director Michael Showalter and stars Kumail Nanjiani and Issa Rae are pulling out of coronavirus fears. The pic opens on April 3.", "url": "https://deadline.com/2020/03/the-lovebirds-kumail-nanjiani-issa-rae-skip-sxsw-coronavirus-1202876191/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/01/the-lovebirds.jpg?w=1024", "publishedAt": "2020-03-06T18:38:48Z", "content": "This just in. The Lovebirds will still make its world premiere at SXSW on Saturday, March 14 at the Paramount Theatre, but director Michael Showalter and stars Kumail Nanjiani and Issa Rae are pulling out of coronavirus fears. The pic opens on April 3.\r\nI und… [+110 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Jonathan Noble", "title": "FIA sets up \"crisis cell\" to monitor coronavirus situation", "description": "The FIA has set up a \"crisis cell\" to oversee its reaction to the developing coronavirus outbreak, amid further threats to motor racing events", "url": "https://www.autosport.com/f1/news/148570/fia-sets-up-crisis-cell-to-monitor-coronavirus", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/2.183/dir/108/image/108a34127539ba4cf4065acc90e50f70.jpg", "publishedAt": "2020-03-06T19:09:33Z", "content": "The FIA has set up a \"crisis cell\" to oversee its reaction to the developing coronavirus outbreak, amid further threats to motor racing events.\r\nWhile motor racing's governing body has long stated it was monitoring the situation, it has stepped up its efforts… [+1438 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " 18 Pictures That Perfectly Capture The Coronavirus Panic via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_bd298a51ccb8b5519ef70290eac6e230", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T18:40:10Z", "content": "Indiana, Indianapolis, Coronavirus, Medicine\r\nINDIANAPOLIS, Ind. Everyone is preparing for the new coronavirus: hospitals, airports and offices. To me, it's not a matter of if it comes but..."}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Joe Wallen", "title": "Coronavirus cases are being missed in Kashmir because of inadequate testing, claim doctors", "description": "Doctors in Indian administered Kashmir believe the authorities could have facilitated the spread of deadly coronavirus by refusing to carry out tests.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-cases-missed-kashmir-inadequate-testing-claim-doctors/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/06/TELEMMGLPICT000227107081-xlarge_trans_NvBQzQNjv4Bq9efUTdtp0deNY3K7C-RsKc_ysv3fV3c0KgeEKVY-86o.jpeg?imwidth=1200", "publishedAt": "2020-03-06T18:17:19Z", "content": "Doctors in Indian administered Kashmir believe the authorities could have facilitated the spread of deadly coronavirus by refusing to carry out tests.\r\nDr Tsering Angchuk, the Medical Superintendent in Sonam Norboo Memorial Hospital (SNM) in the city of Leh, … [+4360 chars]"}, {"source": {"id": null, "name": "Khou.com"}, "author": null, "title": "Two more presumptive travel-related coronavirus cases reported in Fort Bend County - KHOU.com", "description": "Two more presumptive travel-related coronavirus cases reported in Fort Bend County KHOU.com 2 more presumptive cases of coronavirus announced in Fort Bend County, bringing Houston area total to 8 KPRC Click2Houston More COVID-19 Reports as Houston Mayor Tries…", "url": "https://www.khou.com/article/news/health/coronavirus/houston-woman-who-traveled-to-egypt-becomes-sixth-local-coronavirus-case/285-192b8879-08b6-4ec0-8a0f-a0487ead1453", "urlToImage": "https://media.khou.com/assets/KHOU/images/9fb8b50e-1200-40d0-a401-23ec53beb4b8/9fb8b50e-1200-40d0-a401-23ec53beb4b8_1140x641.jpg", "publishedAt": "2020-03-06T18:45:17Z", "content": "HOUSTON Three more Houston-area cases of coronavirus were reported Friday. \r\nTwo women in Fort Bend County are considered presumptive positive and neither required hospitalization.\r\nA Houston woman who tested positive was also added to the list Friday. \r\nAll … [+2649 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "Carnival Cruises Offering Guests $200 in Credit Not to Cancel Trips Amid Coronavirus Concerns", "description": "Carnival Cruises is offering guests a financial incentive not to abandon their trips amid growing coronavirus concerns and news of another major cruise ship quarantine. In a letter obtained by PEOPLE that was issued to its customers, the cruise line informed …", "url": "https://people.com/travel/carnival-cruises-offering-guests-200-in-credit-not-to-cancel-trips-amid-coronavirus-concerns/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2019%2F03%2Fcarnival-victory-1.jpg%3Fcrop%3D0px%2C145px%2C2700px%2C1419px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T18:21:32Z", "content": "Carnival Cruises is offering guests a financial incentive not to abandon their trips amid growing coronavirus concerns and news of another major cruise ship quarantine.\r\nIn a letter obtained by PEOPLE that was issued to its customers, the cruise line informed… [+4659 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Kenya Open on European Tour postponed due to virus concerns", "description": "The European Tour is losing another tournament this year because of the new coronavirus", "url": "https://www.foxsports.com/golf/story/kenya-open-on-european-tour-postponed-due-to-virus-concerns-030620", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-06T18:45:47Z", "content": "VIRGINIA WATER, England (AP) — The European Tour lost another tournament on its schedule this year because of the new coronavirus, saying the Kenya government has suspended all international meetings and conferences until a further review in a month.\r\nThe tou… [+936 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Justin Conklin, Forbes Staff, Justin Conklin, Forbes Staff https://www.forbes.com/sites/justinconklin/", "title": "Seven Surprising Economic Upsides To Coronavirus", "description": "Sure, manufacturers of surgical masks and hand sanitizers are doing well amid the coronavirus panic, but did you know that online educators are raking it in too?", "url": "https://www.forbes.com/sites/justinconklin/2020/03/06/seven-surprising-economic-upsides-to-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e6049e344b78400068c05e2%2F0x0.jpg", "publishedAt": "2020-03-06T18:53:12Z", "content": "Coronavirus is in the U.S. and its spreading fast. There are now confirmed cases across America including multiple fatalities in Washington State, and outbreaks in New York City, Florida and Texas. Most of the economic impact so far has been predictable and n… [+565 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Olympic torch ceremony downsized over coronavirus - South China Morning Post", "description": "Olympic torch ceremony downsized over coronavirus South China Morning Post 11-year-old Syrian table tennis player Hend Zaza qualifies for Olympics CNN International IOC approves new Tokyo 2020 qualification system for sport climbing Insidethegames.biz Olympic…", "url": "https://www.youtube.com/watch?v=ZIccp00GNoA", "urlToImage": null, "publishedAt": "2020-03-06T18:44:17Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Minister reassures public over food supplies", "description": "Retailers have \"robust plans\" in place to ensure people can buy the supplies they need, George Eustice says.", "url": "https://www.bbc.co.uk/news/uk-51775980", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2202/production/_111160780_gettyimages-1198919016.jpg", "publishedAt": "2020-03-06T18:41:43Z", "content": "Image copyrightGetty Images\r\nSupermarkets have taken \"the necessary steps\" to ensure shelves remain stocked following the coronavirus outbreak, the environment secretary has said.\r\nGeorge Eustice, who held talks with supermarket and trade bosses on Friday, sa… [+2808 chars]"}, {"source": {"id": null, "name": "Tribune242.com"}, "author": null, "title": "IAN FERGUSON: How businesses can combat coronavirus - Bahamas Tribune", "description": "The coronavirus (Covid-19) crisis has reached a critical new phase where businesses need to seriously consider the economic impact the pandemic will have on their bottom line. While the world focuses on containing and mitigating the disease itself, c", "url": "http://www.tribune242.com/news/2020/mar/06/ian-ferguson-how-businesses-can-combat-coronavirus/", "urlToImage": null, "publishedAt": "2020-03-06T18:56:47Z", "content": "The coronavirus (Covid-19) crisis has reached a critical new phase where businesses need to seriously consider the economic impact the pandemic will have on their bottom line. While the world focuses on containing and mitigating the disease itself, companies … [+3033 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Trump’s Mislaid Blame on Obama for Virus Test", "description": "President Donald Trump and his officials are falsely asserting that they’ve accelerated coronavirus testing by easing a restrictive policy introduced by the Obama administration.", "url": "https://www.snopes.com/ap/2020/03/06/trumps-mislaid-blame-on-obama-for-virus-test/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/800.jpeg?fit=800,532", "publishedAt": "2020-03-06T18:30:45Z", "content": "WASHINGTON (AP) President Donald Trump and his officials are falsely asserting that theyve accelerated coronavirus testing by easing a restrictive policy introduced by the Obama administration.\r\nTrump also appeared to suggest that people with the infectious d… [+4386 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Joshua Pollard, Contributor, Joshua Pollard, Contributor https://www.forbes.com/sites/joshuapollard/", "title": "The Coronavirus Could Have An Unintended Effect On Your Real Estate Portfolio", "description": "The coronavirus will have an unintended constructive impact on the real estate market if interest rates remain low and normalcy returns quickly. If consumer confidence stalls residential real estate is likely to fare better than commercial, but it could be un…", "url": "https://www.forbes.com/sites/joshuapollard/2020/03/06/the-coronavirus-could-have-an-unintended-effect-on-your-real-estate-portfolio/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204950246%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D6048%26cropY1%3D388%26cropY2%3D3789", "publishedAt": "2020-03-06T18:58:03Z", "content": "Lower interest rates and commodity prices have traditionally been beneficial for real estate\r\nThe global financial volatility associated with the coronavirus, properly known as SARS-CoV-2 which causes COVID-19, has shocked interest rates to their lowest level… [+8968 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kenneth Rapoza, Contributor, Kenneth Rapoza, Contributor https://www.forbes.com/sites/kenrapoza/", "title": "Caught By Surprise: Lack Of Coronavirus Testing Gives U.S. Highest Reported Mortality Rate", "description": "The low number of cases coupled with the high number of deaths in Washington has U.S. death rates higher than average. But an $8 billion aid package seeks to crush COVID-19.", "url": "https://www.forbes.com/sites/kenrapoza/2020/03/06/caught-by-surprise-lack-of-coronavirus-testing-gives-us-highest-reported-mortality-rate/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1210787100%2F0x0.jpg", "publishedAt": "2020-03-06T19:05:44Z", "content": "President Donald Trump, with HHS Secretary Alex Azar after signing an $8.3 billion aid bill to ... [+] combat the coronavirus on March 6, 2020. On Friday, the World Health Organization urged governments to unleash their full power against COVID-19. (Photo by … [+7503 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus: The Race to Respond", "description": "As the coronavirus spreads across the country and around the world, “CBS This Morning’s” special, “Coronavirus: The Race to Respond,” addresses critical information on how the virus is being tracked and treated. Reporters in multiple countries share the lates…", "url": "https://www.cbsnews.com/video/coronavirus-the-race-to-respond/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/06/3ae08e7b-4fcd-450f-8a2c-36661b5916c9/thumbnail/1200x630/0307b1637eaef1d23aa7777f2abe1b58/0306-coronavirus-special-full-2042725-640x360.jpg", "publishedAt": "2020-03-06T18:34:23Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Investmentnews.com"}, "author": null, "title": "Coronavirus will test your firm's tech - InvestmentNews", "description": "Clients don’t need to be sick to feel the impact of the epidemic and that goes beyond market volatility.", "url": "https://www.investmentnews.com/coronavirus-tests-tech-readiness-189551", "urlToImage": "https://s32566.pcdn.co/wp-content/uploads/2020/02/coronavirus-A-illo_opt.jpg", "publishedAt": "2020-03-06T18:42:10Z", "content": "One of the great virtues of modern, cloud-based adviser tech is the ability to continue running a business in the event of an emergency. But until now, most of us probably thought of natural disasters, like fires and floods that might threaten localized data,… [+2777 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kellyanne Conway discusses stocks dropping sharply amid coronavirus fears - Fox News", "description": "Kellyanne Conway discusses stocks dropping sharply amid coronavirus fears Fox News Trump says he'll cut entitlements like Social Security and Medicare if reelected to shrink trillions in n.. Business Insider UK Trump on entitlements: “We’ll be cutting” those …", "url": "https://www.youtube.com/watch?v=Ug4PnFV0sEA", "urlToImage": "https://i.ytimg.com/vi/Ug4PnFV0sEA/maxresdefault.jpg", "publishedAt": "2020-03-06T18:35:24Z", "content": "Counselor to the President Kellyanne Conway says Trump rebalances reciprocal trade deals that benefit American economy despite coronavirus. #FoxNews\r\nFOX News operates the FOX News Channel (FNC), FOX Business Network (FBN), FOX News Radio, FOX News Headlines … [+1650 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Cindy Jacobs: I Declare the Coronavirus “Illegal” in God’s Name", "description": "As everyone knows, viruses are scared of two things: Satan and laws.", "url": "https://friendlyatheist.patheos.com/2020/03/06/cindy-jacobs-i-declare-the-coronavirus-illegal-in-gods-name/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/03/CindyIllegalVirus-768x429.png", "publishedAt": "2020-03-06T18:30:07Z", "content": "Cindy Jacobs, co-founder of Generals International and a self-described faith healer who can turn metal into bone, make a grown woman grow taller, and control the weather, has a new way to stop the spread of coronavirus.\r\nShe just declared it illegal.\r\nSo the… [+1434 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Mairead McArdle, Mairead McArdle", "title": "University of Washington Becomes First U.S. College to Cancel Classes Due to Coronavirus", "description": "The University of Washington in Seattle said Friday that it will move all classes online after a university staff member was diagnosed with the coronavirus this week.", "url": "https://www.nationalreview.com/news/university-of-washington-becomes-first-u-s-college-to-cancel-classes-due-to-coronavirus/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/03/univewashington.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-06T18:51:37Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anjalee Khemlani", "title": "Coronavirus response: Breaking down the $8.3 billion emergency spending bill Trump signed", "description": "U.S. President Donald Trump signed an $8.3 billion spending bill which passed through both houses of Congress this week that will help fund the U.S. response to the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/coronavirus-response-emergency-spending-bill-183621630.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/lAQ5Fy.w5q3sIhjM_hSVhQ--~B/aD0xNDQwO3c9MTQ0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-03/b52aa330-5fd3-11ea-9b3b-c238ed31e09b", "publishedAt": "2020-03-06T18:40:50Z", "content": "U.S. President Donald Trump signed an $8.3 billion spending billon Friday that will help fund the U.S. response to the coronavirus outbreak.\r\nAs the president signed the bill, he told reporters: I asked for two and a half and I got 8.3 [billion dollars]  and … [+2803 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "George Bailey, Contributor, George Bailey, Contributor https://www.forbes.com/sites/georgebailey1/", "title": "Coronavirus And The Remaking Of Global Supply Chains", "description": "Treat the impact on supply chains not as an aberration, but as an expected occurrence in a world where political disruptions, health issues, technology advances, and climate change are all happening at the same time.", "url": "https://www.forbes.com/sites/georgebailey1/2020/03/06/coronavirus-and-the-remaking-of-global-supply-chains/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fi.forbesimg.com%2Fmedia%2Famp%2Fimages%2Fforbes-logo-dark.png", "publishedAt": "2020-03-06T18:59:13Z", "content": "Treat the impact on supply chains not as an aberration, but as an expected occurrence in a world where political disruptions, health issues, technology advances, and climate change are all happening at the same time. \r\nVirtually every global company has indic… [+4994 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nHannah Boland", "title": "Tech workers sent home in London as coronavirus fears spiral - Telegraph.co.uk", "description": "Thousands of tech workers in London have been told to work from home over fears they were at risk of contracting the coronavirus.", "url": "https://www.telegraph.co.uk/technology/2020/03/06/tech-workers-sent-home-london-coronavirus-fears-spiral/", "urlToImage": "https://www.telegraph.co.uk/content/dam/women/2020/03/06/TELEMMGLPICT000226085167-xlarge_trans_NvBQzQNjv4BqgsaO8O78rhmZrDxTlQBjdO0Jyi0jPPD6Zx1hiwTPhlc.jpeg?imwidth=1200", "publishedAt": "2020-03-06T18:35:00Z", "content": "Thousands of tech workers in London have been told to work from home over fears they were at risk of contracting the coronavirus. \r\nFacebook announced it would be closing three of its offices in the city after one of its workers, who normally works in Singapo… [+1900 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rick Helfenbein, Contributor, Rick Helfenbein, Contributor http://www.forbes.com/sites/rickhelfenbein/", "title": "In The Era Of The Coronavirus – Retail Stock-Outs Have Arrived", "description": "Like all the naturally competitive baby boomers in New York City, I’ll eat rice – especially if someone is trying to take it away from me.", "url": "https://www.forbes.com/sites/rickhelfenbein/2020/03/06/in-the-era-of-the-coronavirus--retail-stock-outs-have-arrived/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e6294a6e1e61700075909f9%2F0x0.jpg", "publishedAt": "2020-03-06T18:33:27Z", "content": "rice \r\nAuthor photo\r\nTruth be told, I dont like rice. I never liked rice.\r\nHowever, like all the naturally competitive baby boomers in New York City, Ill eat it especially if someone is trying to take it away from me.\r\nAs the coronavirus fear factor is descen… [+3251 chars]"}, {"source": {"id": null, "name": "Spin.com"}, "author": "Daniel Kohn", "title": "Tool Fan in New Zealand in Isolation After Coronavirus Diagnosis", "description": "A man who attended Tool show in Auckland, New Zealand last Friday is now the country's fourth reported case of having the coronavirus. According to the New Zealand Herald, the unnamed man has been in self-isolation since Wednesday. He also doesn't need hospit…", "url": "https://www.spin.com/2020/03/tool-fan-in-new-zealand-in-isolation-after-coronavirus-diagnosis/", "urlToImage": "https://s3-us-west-1.amazonaws.com/static-spin-com/files/2020/01/tool-jeopardy-fear-inoculum-alex-trebek-1579104826.jpg", "publishedAt": "2020-03-06T18:56:47Z", "content": "A man who attended Tool show in Auckland, New Zealand last Friday is now the country’s fourth reported case of having the coronavirus.\r\nAccording to the New Zealand Herald, the unnamed man has been in self-isolation since Wednesday. He also doesn’t need hospi… [+586 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Jude Terror", "title": "ECCC Canceled for Coronavirus, ReedPOP Will Try Again in Summer", "description": "Following many of its exhibitors pulling out, ReedPOP has officially canceled Emerald City Comic Con, which was set to take place next week in Seattle, one of the epicenters of outbreaks of COVID-19, the disease caused by a novel strain of coronavirus. ECCC h…", "url": "https://www.bleedingcool.com/2020/03/06/eccc-canceled-coronavirus/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/eccclogo.jpg", "publishedAt": "2020-03-06T18:37:41Z", "content": "Following manyofitsexhibitorspullingout, ReedPOP has officially canceled Emerald City Comic Con, which was set to take place next week in Seattle, one of the epicenters of outbreaks of COVID-19, the disease caused by a novel strain of coronavirus. ECCC had re… [+3524 chars]"}, {"source": {"id": null, "name": "Mobilesyrup.com"}, "author": "Brad Bennett", "title": "Collision tech conference in Toronto cancelled due to coronavirus", "description": "Collision, a popular tech-focused conference that takes place in Toronto, has cancelled its 2020 in-person event over coronavirus-related concerns. That said, there will still be an online component to the event. The conference was slated to take place from J…", "url": "https://mobilesyrup.com/2020/03/06/collision-tech-conference-toronto-cancelled-coronavirus/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2020/03/collision-from-home.jpg", "publishedAt": "2020-03-06T18:31:43Z", "content": "Collision, a popular tech-focused conference that takes place in Toronto, has cancelled its 2020 in-person event over coronavirus-related concerns. That said, there will still be an online component to the event.\r\nThe conference was slated to take place from … [+846 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo News Video", "title": "Kellyanne Conway claims coronavirus 'is being contained'", "description": "At the White House, White House counselor Kellyanne Conway claims coronavirus “is being contained.”", "url": "https://news.yahoo.com/kellyanne-conway-claims-coronavirus-being-190655212.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1zNqxxcBPOovNI4ZKVDq9Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/9VPyYux2u5e9zeaOF8Ppkw--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e629f5002816b02378166e1/5e629f55f5f0a60001cd5eaa_1280x720_FES_v1.jpg", "publishedAt": "2020-03-06T19:06:55Z", "content": "At the White House, White House counselor Kellyanne Conway claims coronavirus is being contained."}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Coronavirus | Assam on edge over U.S. tourist", "description": "He spent 7 days in State and tested positive after reaching Bhutan", "url": "https://www.thehindu.com/news/national/other-states/coronavirus-assam-on-edge-over-us-tourist/article31003761.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/hqacje/article31003760.ece/ALTERNATES/LANDSCAPE_615/TH06ASSAM", "publishedAt": "2020-03-06T18:22:07Z", "content": "A 76-year-old tourist from the United States tested positive for coronavirus (COVID-19) in Bhutan on Thursday night, triggering alarm in Assam where he spent a considerable time before visiting the Himalayan country.\r\nThe Bhutan government confirmed the COVID… [+2628 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Kathryn VanArendonk", "title": "Why Is Pandemic Fiction So Comforting Right Now?", "description": "The coronavirus crisis is terrifying. Contagion is a surprisingly soothing way to grapple with that fear.", "url": "http://www.vulture.com/2020/03/contagion-coronavirus-pandemic-fiction.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2020/03/06/6-contagion.w1200.h630.jpg", "publishedAt": "2020-03-06T18:34:12Z", "content": "In the last few months, as news of a novel coronavirus became widespread, lots of people decided to watch a movie about a pandemic. Specifically, they watched Contagion, the 2011 Steven Soderbergh movie about a viral outbreak that kills millions of people aro… [+7060 chars]"}, {"source": {"id": null, "name": "Kxan.com"}, "author": "Chris Davis", "title": "Tech conference cancels gathering due to coronavirus as Austin leaders seek SXSW solutions - KXAN.com", "description": "Leaders in Austin’s tech industry will meet this weekend to work out potential solutions to detect and protect against the new coronavirus during South by Southwest (SXSW), which starts March…", "url": "https://www.kxan.com/news/coronavirus/tech-conference-cancels-gathering-due-to-coronavirus-as-austin-leaders-seek-sxsw-solutions/", "urlToImage": "https://www.kxan.com/wp-content/uploads/sites/40/2020/03/generic-coronavirus-cdc-1.jpg?w=650&h=370&crop=1&resize=1280,720", "publishedAt": "2020-03-06T19:00:00Z", "content": "AUSTIN (KXAN) Leaders in Austin’s tech industry will meet this weekend to work out potential solutions to detect and protect against the new coronavirus during South by Southwest (SXSW), which starts March 13.\r\nThe Hack Coronavirus event, hosted at the downto… [+1048 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "ENDORSED: Spock’s Vulcan salute should replace handshakes in coronavirus era….", "description": "ENDORSED: Spock’s Vulcan salute should replace handshakes in coronavirus era.", "url": "https://pjmedia.com/instapundit/360506/", "urlToImage": null, "publishedAt": "2020-03-06T19:00:32Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Stacey Ritzen", "title": "O.J. Simpson gets dragged over coronavirus tweet", "description": "He’s stocking up on supplies—except for gloves. The post O.J. Simpson gets dragged over coronavirus tweet appeared first on The Daily Dot.", "url": "https://www.dailydot.com/uncategorized/o-j-simpson-tweet-coronavirus-supplies/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/oj-simpson.jpg", "publishedAt": "2020-03-06T18:30:35Z", "content": "Coronavirus fever! Have you caught it yet? (Too soon??) Well, it seems as if O.J. Simpson has come down with itthe fever, not the virus, unfortunatelyas evidenced by a photo the former NFL runningback posted to his recently established Twitter account.\r\nIn th… [+3832 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Davide Scigliuzzo", "title": "Banks Promised $7 Billion for a Casino Deal. Then the Coronavirus Hit", "description": "(Bloomberg) -- Banks that agreed to provide over $7 billion of loans for Eldorado Resorts Inc.’s acquisition of Caesars Entertainment Corp. face an uphill battle to offload the debt to investors as fears over the coronavirus outbreak wreak havoc across the tr…", "url": "https://finance.yahoo.com/news/banks-promised-7-billion-casino-183449644.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-06T18:34:49Z", "content": "(Bloomberg) -- Banks that agreed to provide over $7 billion of loans for Eldorado Resorts Inc.s acquisition of Caesars Entertainment Corp. face an uphill battle to offload the debt to investors as fears over the coronavirus outbreak wreak havoc across the tra… [+4073 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Emerald City Comic Con postponed due to coronavirus concerns - Seattle Times", "description": "Emerald City Comic Con postponed due to coronavirus concerns Seattle Times Emerald City Comic Con 2020 has been postponed KUOW News and Information Emerald City Comic Con Is Officially Delayed Due to Coronavirus Worries Gizmodo Seattle's iconic ComicCon postp…", "url": "https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2VudGVydGFpbm1lbnQvZXZlbnRzL2VtZXJhbGQtY2l0eS1jb21pYy1jb24tYmVpbmctcG9zdHBvbmVkLXVudGlsLXN1bW1lci0yMDIwLWR1ZS10by1jb3JvbmF2aXJ1cy1jb25jZXJucy_SAY0BaHR0cHM6Ly93d3cuc2VhdHRsZXRpbWVzLmNvbS9lbnRlcnRhaW5tZW50L2V2ZW50cy9lbWVyYWxkLWNpdHktY29taWMtY29uLWJlaW5nLXBvc3Rwb25lZC11bnRpbC1zdW1tZXItMjAyMC1kdWUtdG8tY29yb25hdmlydXMtY29uY2VybnMvP2FtcD0x?oc=5", "urlToImage": null, "publishedAt": "2020-03-06T18:41:00Z", "content": null}, {"source": {"id": null, "name": "Hyperallergic.com"}, "author": "Dessane Lopez Cassell", "title": "Visiting the 2020 Armory Show Amid Ominous Headlines", "description": "From art about environmental recklessness to Caribbean post-coloniality, Armory kicked off the spring art fair season in spite of growing coronavirus concerns.", "url": "http://hyperallergic.com/546471/2020-armory-show/", "urlToImage": "https://hyperallergic.com/wp-content/uploads/2020/03/Amir-H-Fallah_Denny-Dimin-1-e1583514006441.jpg", "publishedAt": "2020-03-06T18:32:13Z", "content": "Amir H. Fallah’s work on view in the Denny Dimin booth as part of Focus at Pier 90, curated by Jamillah James (all photos by Dessane Lopez Cassell for Hyperallergic, unless otherwise stated)\r\nTis the season: with Thursdays public opening of the Armory Show, s… [+4520 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Duprey)", "title": "Macau Regulators Tell Casinos Layoffs Are Not an Option", "description": "Despite the dramatic drop in gambling revenue, casinos will have to keep their staffing levels intact.", "url": "https://www.fool.com/investing/2020/03/06/macau-regulators-tell-casinos-layoffs-are-not-an-o.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561960/baccarat-player-or-banker-are-the-only-outcomes-getty.jpg", "publishedAt": "2020-03-06T18:26:00Z", "content": "Gambling regulators in Macao are calling on casino operators to maintain staffing levels during the slowdown caused by the coronavirus outbreak. One junket operator laid off 200 workers, or 25% of its workforce, after a mandatory 15-day closure of casinos cau… [+1246 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "National Guard helicopters deliver coronavirus tests to 3,500 on stricken cruise ship wandering endlessly off the coast of California. The vital tests will soon determine who will be the early zombies attempting to bring it to Davey Jones's locker [Misc]", "description": "National Guard helicopters deliver coronavirus tests to 3,500 on stricken cruise ship wandering endlessly off the coast of California. The vital tests will soon determine who will be the early zombies attempting to bring it to Davey Jones's locker", "url": "https://www.fark.com/comments/10734615/National-Guard-helicopters-deliver-coronavirus-tests-to-3500-on-stricken-cruise-ship-wandering-endlessly-off-coast-of-California-The-vital-tests-will-soon-determine-who-will-be-early-zombies-attempting-to-bring-it-to-Davey-Joness-locker", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/h/hS/fark_hS2bfdxqbNAuiXFya0oowdlbKRM.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583730000&Signature=KXFCi2mCDZhtCCoqf5dQyi75FNo%3D", "publishedAt": "2020-03-06T18:59:20Z", "content": "... the Grand Princess, a ship carrying thousands of people, is stuck off the coast of San Francisco after a former passenger who had disembarked died of Covid-19, the disease that this coronavirus causes. According to Gov. Gavin Newsom of California, 11 pass… [+1930 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Shira Feder)", "title": "Gig economy workers say they'll have to work through the coronavirus outbreak even if they get sick: \"We can't risk losing a day's income\"", "description": "Restaurant employees are taking to Twitter to talk about how their lack of sick days may contribute to the spread of coronavirus.", "url": "https://news.yahoo.com/gig-economy-workers-theyll-coronavirus-182300646.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_IpkeEgxAzSHooyg4oFnnw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/7vlXRhms486M_QpLcW4YNw--~B/aD0yMjY3O3c9MzAyMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/db204360525ab47ea089325758fb7785", "publishedAt": "2020-03-06T18:23:00Z", "content": "waitress\r\nFlickr/Donald Lee Pardue\r\n<ul><li>The CDC has issued guidelines on how to avoid spreading coronavirus, warning everyone to stay home if they feel sick. But for a lot of Americans, this isn't possible.\r\n</li><li>Research shows that hourly employees i… [+7374 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Khristopher J. Brooks", "title": "Coronavirus could cost airlines more than $100 billion", "description": "\"We could discount prices tomorrow and it wouldn't do any good,\" said one airline executive as travel demand wanes.", "url": "https://www.cbsnews.com/news/coronavirus-outbreak-airline-industry-us-economy/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/01/17/7870b63a-1c09-413b-a994-f6c671c80b85/thumbnail/1200x630/135b0735f9f93d888cf7ae4460a9782e/gettyimages-1173445290.jpg", "publishedAt": "2020-03-06T18:46:53Z", "content": "Although the global coronavirus outbreak has yet to seriously damage the wider U.S. economy, it's bearing down fast on the airline industry. \r\nTravelers are booking fewer flights, analysts say, hurting sales at JetBlue Airways, Southwest Airlines, United Airl… [+3010 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Yasemin Saplakoglu", "title": "How fast can the coronavirus mutate? - Livescience.com", "description": "How fast can the coronavirus mutate? Livescience.com Covid-19 potential drug identified by German researchers. Pharmaceutical Technology Coronavirus: how did humans get it? ThePrint Coronavirus outbreak | Potential drug target against COVID-19 infection ident…", "url": "https://www.livescience.com/coronavirus-mutations.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/acpY57pmbootp8kn58UzjJ-1200-80.jpg", "publishedAt": "2020-03-06T19:09:00Z", "content": "The new coronavirus, like all other viruses, mutates\r\n, or undergoes small changes in its genome. A recently published study suggested that the new coronavirus, SARS-CoV-2, had already mutated into one more and one less aggressive strain. But experts aren't c… [+5953 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Kate Abnett", "title": "Climate change or coronavirus? 'Pick your evil', protesters say", "description": "Protesters at a rally led by climate activist Greta Thunberg on Friday denounced governments for taking urgent action against the coronavirus outbreak but failing to treat global warming as an emergency. Several thousand people braved the rain in Brussels wit…", "url": "https://news.yahoo.com/climate-change-coronavirus-pick-evil-191052210.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/N7QHjDK6NfMs8WcbGNp4Pw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MjguOA--/https://s.yimg.com/uu/api/res/1.2/M8pfyYmefz40sr9Zwt.jiQ--~B/aD01MTg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/9a9260095491d1907d6dfdf5024d4d61", "publishedAt": "2020-03-06T19:10:52Z", "content": "By Kate Abnett\r\nBRUSSELS (Reuters) - Protesters at a rally led by climate activist Greta Thunberg on Friday denounced governments for taking urgent action against the coronavirus outbreak but failing to treat global warming as an emergency.\r\nSeveral thousand … [+2122 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.N. cancels key meetings ahead of climate summit due to coronavirus", "description": "The United Nations has canceled meetings in Bonn, Germany, and elsewhere planned in the run-up to a crucial U.N. climate summit to be held in Glasgow in November due to the coronavirus outbreak, an official said on Friday.", "url": "https://www.reuters.com/article/us-un-climatechange-idUSKBN20T2LJ", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499677971&w=1200&r=LYNXMPEG251T7", "publishedAt": "2020-03-06T18:39:44Z", "content": "WASHINGTON (Reuters) - The United Nations has canceled meetings in Bonn, Germany, and elsewhere planned in the run-up to a crucial U.N. climate summit to be held in Glasgow in November due to the coronavirus outbreak, an official said on Friday. \r\n“This excep… [+592 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "WHO: Global coronavirus cases surpass 100,000", "description": "The number of COVID-19 cases around the world surpassed 100,000 Friday, according to the World Health Organization. The pneumonia-like virus killed nearly 3,400 people worldwide.", "url": "https://www.sfgate.com/bayarea/article/WHO-Global-coronavirus-cases-surpasses-100-000-15110795.php", "urlToImage": "https://s.hdnux.com/photos/01/11/00/31/19138140/3/rawImage.jpg", "publishedAt": "2020-03-06T19:11:21Z", "content": "<ul><li>A view of St. Peter's Square at the Vatican, Friday, March 6, 2020. A Vatican spokesman has confirmed the first case of coronavirus at the city-state. Vatican spokesman Matteo Bruni said Friday that non-emergency medical services at the Vatican have b… [+5370 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Ben Warren", "title": "Pompeo Slams China’s ‘Imperfect Coronavirus Data’ For Putting US ‘Behind the Curve’", "description": "Says working with Beijing 'incredibly frustrating'", "url": "https://www.infowars.com/pompeo-slams-chinas-imperfect-coronavirus-data-for-putting-us-behind-the-curve/", "urlToImage": "https://assets.infowars.com/2020/03/PompeoPointGetty3620.jpg", "publishedAt": "2020-03-06T18:57:03Z", "content": "The novel coronavirus disease was first detected in Wuhan in China’s Hubei province in late December 2019 and has since spread worldwide.\r\nThe number of people infected globally has surpassed 98,700, with more than 3,300 fatalities. Over 55,400 people have re… [+2422 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Zoe Tidman, Zoe Tidman", "title": "Coronavirus: Funerals 'could be streamed online' if outbreak becomes pandemic", "description": "Web broadcasts apparently possible at 'many crematoria'", "url": "https://www.independent.co.uk/news/uk/home-news/coronavirus-funeral-stream-pandemic-uk-nafd-a9383736.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/06/17/gettyimages-1205294826.jpg", "publishedAt": "2020-03-06T19:09:27Z", "content": "People may have to watch their loved ones' funerals online if coronavirus develops into a pandemic, experts have suggested. \r\nIf services are no longer able to take place as normal, webcasting might be a viable option, according to the National Association of… [+1887 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CHANGE: U. of Washington Cancels In-Person Classes, Becoming First Major U.S. Institution to Do So …", "description": "CHANGE: U. of Washington Cancels In-Person Classes, Becoming First Major U.S. Institution to Do So Amid Coronavirus Fears.", "url": "https://pjmedia.com/instapundit/360569/", "urlToImage": null, "publishedAt": "2020-03-06T18:56:16Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How to protect yourself from the coronavirus - TRT World", "description": "How to protect yourself from the coronavirus TRT World Drinking alcohol will not protect you from COVID-19: WHO The Siasat Daily Coronavirus Outbreak: Global Death Toll Increases To 3,400 As Confirmed Cases Of Infection Surge To Over 99,600 Swarajya 'This is …", "url": "https://www.youtube.com/watch?v=lax9tRV1q9U", "urlToImage": "https://i.ytimg.com/vi/lax9tRV1q9U/hqdefault.jpg", "publishedAt": "2020-03-06T18:21:51Z", "content": null}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Caroline Haskins", "title": "People On Nextdoor Are Freaking Out About The Coronavirus", "description": "People on the local social media site are spreading falsehoods linking the virus to homelessness, eating meat, and tea tree oil. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/carolinehaskins1/people-nextdoor-freaking-out-coronavirus-covid", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/6/18/campaign_images/751e8489bea6/people-on-nextdoor-are-freaking-out-about-the-cor-2-118-1583520698-3_dblbig.jpg", "publishedAt": "2020-03-06T18:56:46Z", "content": "According to some people on Nextdoor, the coronavirus has spread because people arent vegan, people are homeless, they aren't taking the proper homemade supplements, and they arent sanitizing their hands with tea tree oil.\r\nGood afternoon Neighbors, Im not th… [+3784 chars]"}, {"source": {"id": null, "name": "Hip2save.com"}, "author": "Jenna R", "title": "Princess Cruise Line Revises Cancellation Policy in Wake of Coronavirus", "description": "After weeks of coronavirus concerns, Princess Cruise Line has developed a temporary cancellation policy that allows cruises to be rescheduled.", "url": "https://hip2save.com/2020/03/06/princess-cruise-line-revises-cancellation-policy-in-wake-of-coronavirus/", "urlToImage": "https://hip2save.com/wp-content/uploads/2020/03/diamond-princess.jpg", "publishedAt": "2020-03-06T18:18:39Z", "content": "Having second thoughts about an upcoming cruise? \r\nPrincess Cruise Line has developed a temporary cancellation policy that provides the flexibility to reschedule any currently booked cruise that sails between now and May 31, 2020.\r\nThe cruise line will also b… [+583 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Aaron Colen", "title": "February job growth numbers far exceed projections, unemployment drops to 50-year low", "description": "Job growth in February far exceeded expectations, and the unemployment rate dropped to 3.5%, which is tied for the lowest level in 50 years, CNBC reported. Job growth The U.S. economy added 273,000 jobs in February, surpassing a prediction of 175,000 new jobs…", "url": "https://www.theblaze.com/news/february-job-growth-numbers-far-exceed-projections-unemployment-drops-to-50-year-low", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg1NDQ5Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0MTczNTEzMn0.HUkTNcdV6IlPeY7Vnc6fuhm2F5CsUAn7CBGb48TPNfE/img.jpg?width=1200&coordinates=0%2C5%2C0%2C5&height=600", "publishedAt": "2020-03-06T18:27:06Z", "content": "Job growth in February far exceeded expectations, and the unemployment rate dropped to 3.5%, which is tied for the lowest level in 50 years, CNBC reported.\r\nJob growth\r\nThe U.S. economy added 273,000 jobs in February, surpassing a prediction of 175,000 new jo… [+2035 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bonnie Kristian", "title": "Superdelegates might doom Bernie Sanders — again", "description": "By this time in the last presidential race, Hillary Clinton had won 672 delegates in the Democratic primaries and caucuses, and Sen. Bernie Sanders (I-Vt.) had won 477. A 40 percent lead with most state contests still to go might not seem insurmountable — exc…", "url": "https://news.yahoo.com/superdelegates-might-doom-bernie-sanders-185524160.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NCwsQi34vMh9c1_WpJ_SMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/BgfhKneu_wUtIJAbVLhncQ--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/15e3edee278c0cd032fdb195994c55e1", "publishedAt": "2020-03-06T18:55:24Z", "content": "By this time in the last presidential race, Hillary Clinton had won 672 delegates in the Democratic primaries and caucuses, and Sen. Bernie Sanders (I-Vt.) had won 477. A 40 percent lead with most state contests still to go might not seem insurmountable excep… [+4807 chars]"}]