[{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "salarshani@businessinsider.com (Sarah Al-Arshani), Sarah Al-Arshani", "title": "Another Princess Cruises ship not allowed to dock until it administers tests for coronavirus", "description": "Yet another Princess Cruises line ship is testing crew members for the new coronavirus, the Associated Press reported. The Caribbean Princess is not allowed to dock in Fort Lauderdale until the CDC clears it. Two of the crew members were transferred from the …", "url": "https://www.businessinsider.com/princess-cruises-ship-not-allowed-dock-coronavirus-florida-2020-3", "urlToImage": "https://i.insider.com/5e6716ece4f9fe49025489b3?width=1200&format=jpeg", "publishedAt": "2020-03-10T06:30:03Z", "content": "The Caribbean Princess cruise ship will not be allowed to dock until crew members on board are tested for the novel coronavirus, the Associated Press reported. \r\nTwo crew members were transferred from another Princess Cruises ship, the Grand Princess, which i… [+1858 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosie Perper", "title": "Italy, now under lockdown, has been hit hard by the coronavirus outbreak. It also has one of the world's oldest populations with 60% over age 40.", "description": "As of Monday, 463 out of 9,172 people infected with coronavirus in Italy have died. It has a national death rate that is higher than the global average. The new figures make the country home to the largest number of infections outside China. Experts estimate …", "url": "https://www.businessinsider.com/italy-coronavirus-old-population-cases-death-rate-2020-3", "urlToImage": "https://i.insider.com/5e670b9654f25c43ed613055?width=1200&format=jpeg", "publishedAt": "2020-03-10T07:02:10Z", "content": "Italy has one of the oldest populations in the world, with a median age of about 46 years old. Nearly 60% of the population is aged 40 and over, about 23% of which is over 65 — heightening the population's risk with regards to the novel coronavirus currently … [+2996 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Ruth Reader", "title": "In coronavirus’s wake, gig workers are demanding paid sick leave", "description": "When people who take gigs for companies such as Uber, Lyft, and Instacart can’t work, they don’t get paid. And working could be dangerous. As the coronavirus spreads, many people are having to consider remote ways of working. But for contingent workers—such a…", "url": "https://www.fastcompany.com/90472535/coronavirus-paid-sick-leave", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-gig-workers-are-demanding-paid-sick-leave-in-the-face-of-coronavirus.jpg", "publishedAt": "2020-03-10T07:00:45Z", "content": "As the coronavirus spreads, many people are having to consider remote ways of working. But for contingent workers—such as those who drive your Uber or deliver your groceries—the virus’s impact is particularly fraught with peril.\r\nThese people can’t work at ho… [+8124 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lynn Elber / AP", "title": "Jeopardy! and Wheel of Fortune Resume Taping – Without Studio Audiences", "description": "\"Jeopardy!” and “Wheel of Fortune” will tape without studio audiences in response to the ongoing virus outbreak.", "url": "https://time.com/5799993/jeopardy-wheel-of-fortune-tape-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/jeopardy-coronavirus.jpg?quality=85&crop=1px%2C31px%2C682px%2C357px&resize=1200%2C628&strip", "publishedAt": "2020-03-10T06:33:12Z", "content": "(LOS ANGELES) — “Jeopardy!” and “Wheel of Fortune” will tape without studio audiences in response to the ongoing virus outbreak.\r\nA person close to the shows tells The Associated Press Monday that the move is being taken out of an abundance of caution given t… [+1042 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Giorgio Armani Donates €1.25 Million EUR to Fight the Coronavirus in Italy", "description": "As the country that's been hit the hardest by the coronavirus in Europe, Italy has now put a staggering 16 million people in quarantine, the number of confirmed cases soaring to 9,172 as of Sunday with total deaths reaching 463. Public amenities and museums h…", "url": "https://hypebeast.com/2020/3/giorgio-armani-1-25-million-euro-coronavirus-italy-donation", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fgiorgio-armani-1-23-million-euro-coronavirus-italy-donation-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-10T06:29:24Z", "content": "As the country that’s been hit the hardest by the coronavirus in Europe, Italy has now put a staggering 16 million people in quarantine, the number of confirmed cases soaring to 9,172 as of Sunday with total deaths reaching 463. Public amenities and museums h… [+842 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "First COVID-19 death recorded in Canada", "description": "Canada has recorded more than 70 confirmed coronavirus infections", "url": "https://www.thehindu.com/news/international/first-covid-19-death-recorded-in-canada/article31030081.ece", "urlToImage": "https://www.thehindu.com/news/international/ma8nsc/article31030080.ece/ALTERNATES/LANDSCAPE_615/HEALTH-CORONAVIRUSCANADA", "publishedAt": "2020-03-10T06:51:58Z", "content": "Canada has recorded its first death from COVID-19, health officials in the westernmost province of British Columbia announced on March 9.\r\nThe victim, a man living at an elderly care facility, \"was infected with COVID-19 (and) passed away last night,\" the pro… [+664 chars]"}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Tyler Cowen", "title": "Solve for the reporting equilibrium?", "description": "The district governments of the metropolis that comprises Wuhan — the epicenter of the coronavirus outbreak in China — have announced plans to give cash rewards to local residential areas that have successfully curbed the spread of COVID-19. The incentive rul…", "url": "https://marginalrevolution.com/marginalrevolution/2020/03/solve-for-the-reporting-equilibrium.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-03-10T06:19:59Z", "content": "The district governments of the metropolis that comprises Wuhan the epicenter of the coronavirus outbreak in China have announced plans to give cash rewards to local residential areas that have successfully curbed the spread of COVID-19.\r\nThe incentive rules … [+374 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Malta halts all passenger travel with Italy", "description": "Malta has stopped all travel links with Italy after confirming its fourth coronavirus case since Saturday.", "url": "https://www.reuters.com/article/us-health-coronavirus-malta-italy-idUSKBN20X0OG", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T06:53:18Z", "content": "VALLETTA (Reuters) - Malta has stopped all travel links with Italy after confirming its fourth coronavirus case since Saturday. \r\nPrime Minister Robert Abela told a news conference that all flights between Malta and Italy are being suspended immediately and a… [+399 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Poland's president will not hold big election rallies due to coronavirus", "description": "Polish President Andrzej Duda has said he will not organize large election campaign meetings in a bid to stop the spread of coronavirus, which has infected 17 people in the country.", "url": "https://www.reuters.com/article/us-health-coronavirus-poland-president-idUSKBN20X0O8", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501130767&w=1200&r=LYNXMPEG290GA", "publishedAt": "2020-03-10T06:51:28Z", "content": "WARSAW (Reuters) - Polish President Andrzej Duda has said he will not organize large election campaign meetings in a bid to stop the spread of coronavirus, which has infected 17 people in the country. \r\nPoles are due to vote in May in a presidential election … [+975 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Russia tells people not to use public transport at rush hour amid virus fears - RIA", "description": "Russia's consumer safety watchdog recommended on Tuesday that people avoid public transport, shopping malls and other public places at rush hour as a precaution against the coronavirus, the RIA news agency reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-russia-transport-idUSKBN20X0QA", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T07:09:49Z", "content": "MOSCOW (Reuters) - Russia’s consumer safety watchdog recommended on Tuesday that people avoid public transport, shopping malls and other public places at rush hour as a precaution against the coronavirus, the RIA news agency reported. \r\n“Refrain from visiting… [+242 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Disney’s ‘Mulan’ Makes Honorable And Inspired World Premiere While Remaining Cautious Of Coronavirus", "description": "On Monday night, Disney had the world premiere of their forthcoming live-action version of the classic animated feature Mulan in Los Angeles and while some were expecting it to follow the lead of major festivals and events closing due to coronavirus fears, th…", "url": "https://deadline.com/2020/03/disney-mulan-premiere-liu-yifei-donnie-yen-jason-scott-lee-gong-li-jet-li-tzi-ma-coronavirus-1202878166/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/liu-yifei-e1583821159262.jpg?w=1000", "publishedAt": "2020-03-10T06:57:15Z", "content": "On Monday night, Disney had the world premiere of their forthcoming live-action version of the classic animated feature Mulanin Los Angeles and while some were expecting it to follow the lead of major festivals and events closing due to coronavirus fears, the… [+2280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Japanese government criticized for coronavirus response", "description": "A state of emergency was declared in Hokkaido, Japan, weeks after the Sapporo Snow Festival had two million visitors. CNN's Blake Essig speaks with experts who are critical of the Japanese government's handling of the coronavirus outbreak.", "url": "https://www.cnn.com/videos/world/2020/03/10/japan-coronavirus-covid-19-no-problemism-hokkaido-snow-festival-intl-hnk-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200310141031-japan-coronavirus-super-tease.jpg", "publishedAt": "2020-03-10T07:08:43Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Happy Holi 2020: Make a splash into the festival of colours with these hilarious memes", "description": "Happy Holi 2020: A symbol of the triumph of good over evil, Holi marks the onset of spring and is also celebrated to express gratitude for a good harvest. Although the fear of coronavirus has dampened spirits, people have taken to social media to spread the f…", "url": "https://indianexpress.com/article/trending/trending-in-india/happy-holi-2020-best-memes-and-jokes-6307816/", "urlToImage": "https://images.indianexpress.com/2020/03/happy-holi-memes-759.jpg?w=759", "publishedAt": "2020-03-10T07:01:18Z", "content": "By: Trends Desk | New Delhi | \r\nPublished: March 10, 2020 12:31:18 pm\r\nHere are some jokes and memes that will leave you in splits on Holi!Holi is here, and people are all set to splash a bucket full of colours and sprinkle each other with (hopefully) natural… [+2584 chars]"}, {"source": {"id": null, "name": "Propertywire.com"}, "author": "Ryan Bembridge", "title": "Coronavirus – could it 'infect' your business? - Property Wire", "description": "Andre Kappelhoff is the founder of Viking PR and an established property PR professional with 15+ years’ experience in representing UK and international developers, housebuilders, estate agents and property service companies Since the World Health Organizatio…", "url": "https://www.propertywire.com/blog/coronavirus-could-it-infect-your-business", "urlToImage": "https://www.propertywire.com/wp-content/uploads/2020/03/Andre-Kappelhoff-Viking-PR.jpg", "publishedAt": "2020-03-10T06:25:00Z", "content": "Andre Kappelhoff is the founder of Viking PR and an established property PR professional with 15+ years experience in representing UK and international developers, housebuilders, estate agents and property service companies\r\nSince the World Health Organizatio… [+4830 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Tamara Thiessen, Contributor, Tamara Thiessen, Contributor https://www.forbes.com/sites/tamarathiessen/", "title": "What Travelers Should Know As Whole Of Italy Now In Coronavirus Lockdown", "description": "With the whole of Italy now in lockdown due to the coronavirus, all but non-essential travel in the country is now banned for nearly a month from Tuesday March 10 to April 3. Many flights to and from Italy continue but travelers must fill out a form proving v…", "url": "https://www.forbes.com/sites/tamarathiessen/2020/03/10/what-travelers-should-know-as-whole-of-italy-now-in-coronavirus-lockdown/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206312900%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D3045%26cropY1%3D65%26cropY2%3D1778", "publishedAt": "2020-03-10T07:02:13Z", "content": "MILAN, ITALY - MARCH 09: With the whole of Italy now in lockdown due to the coronavirus, all but ... [+] non-essential travel in the country is now banned for nearly a month from Tuesday March 10 to April 3. Many flights to and from Italy continue but travele… [+7847 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sarah Hansen, Forbes Staff, Sarah Hansen, Forbes Staff https://www.forbes.com/sites/sarahhansen/", "title": "Coronavirus Is A Health Crisis, So Why Is The Stock Market Tanking?", "description": "Here’s how a health crisis created financial chaos.", "url": "https://www.forbes.com/sites/sarahhansen/2020/03/10/coronavirus-is-a-health-crisis-so-why-is-the-stock-market-tanking/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206288243%2F0x0.jpg%3FcropX1%3D561%26cropX2%3D4071%26cropY1%3D247%26cropY2%3D2222", "publishedAt": "2020-03-10T07:00:00Z", "content": "Heres how a health crisis created financial chaos. \r\nAFP via Getty Images\r\nAfter weeks of wild stock market swings, trading was stopped within ten minutes of the open on Monday after the S&amp;P dropped 7%, triggering a built-in circuit breaker. \r\nThe circuit… [+7358 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Will Horton, Contributor, Will Horton, Contributor https://www.forbes.com/sites/willhorton1/", "title": "Why Airplanes Flying Without Any Passengers Are An Early Sign Of Coronavirus Recovery", "description": "Scoot will fly two round-trips a week to Nanjing and another two to Guangzhou in southern China, using its passenger aircraft as freighters.", "url": "https://www.forbes.com/sites/willhorton1/2020/03/10/why-airplanes-flying-without-any-passengers-are-an-early-sign-of-coronavirus-recovery/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1197528029%2F0x0.jpg", "publishedAt": "2020-03-10T06:57:14Z", "content": "A Boeing 787-9 from Scoot, the low-cost airline owned by Singapore Airlines, has seats for 375 passengers. Yet when a Scoot 787-9 takes off from Singapore on March 11 bound for Nanjing in eastern China, it will have zero passengers onboard.\r\nThe flight will s… [+5176 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Amherst closes NCAA women's basketball regional to fans", "description": "For the second consecutive weekend, there won't be any fans at Amherst's NCAA Tournament games on campus because of the coronavirus outbreak", "url": "https://www.foxsports.com/wnba/story/amherst-closes-ncaa-women-s-basketball-regional-to-fans-031020", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-10T06:53:11Z", "content": "For the second consecutive weekend, there won’t be any fans at Amherst’s NCAA Tournament games on campus because of the coronavirus outbreak.\r\nThe school is hosting Division III Sweet 16 games, with the Mammoths playing George Fox on Friday night. Mary Hardin… [+4633 chars]"}, {"source": {"id": null, "name": "Cruxnow.com"}, "author": null, "title": "Businesses near Vatican reeling as coronavirus fears turn area into ghost town - Crux: Covering all things Catholic", "description": "The economic threat caused by a coronavirus-induced collapse in tourism is particularly existential for businesses operating near the Vatican, which are heavily dependent on the all-but-gone tourist trade, with many facing staggering losses that could force t…", "url": "https://cruxnow.com/vatican/2020/03/businesses-near-vatican-reeling-as-coronavirus-fears-turn-area-into-ghost-town/", "urlToImage": "https://cruxnow.com/wp-content/uploads/2020/03/WhatsApp-Image-2020-03-09-at-15.40.04.jpeg", "publishedAt": "2020-03-10T06:57:54Z", "content": "ROME For business owners, restaurant managers and small souvenir shops in Italy, the coronavirus outbreak has been nothing short of crippling, with the World Economic Forum recently declaring that Italy is already in the midst of a recession related to the di… [+8177 chars]"}, {"source": {"id": null, "name": "Insidehighered.com"}, "author": "Scott Jaschik", "title": "ETS Plans TOEFL at Home in Coronavirus-Affected Countries", "description": "The Educational Testing Service is planning a Test of English as a Foreign Language that can be taken from home for those in countries where the coronavirus has made in-person testing impossible. \"We are targeting this solution to be introduced by the end of …", "url": "https://www.insidehighered.com/quicktakes/2020/03/10/ets-plans-toefl-home-coronavirus-affected-countries", "urlToImage": "https://www.insidehighered.com/sites/all/themes/ihecustom/images/facebook_icon_large.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "The Educational Testing Service is planning a Test of English as a Foreign Language that can be taken from home for those in countries where the coronavirus has made in-person testing impossible.\r\n\"We are targeting this solution to be introduced by the end of… [+853 chars]"}, {"source": {"id": null, "name": "Insidehighered.com"}, "author": "Paul Fain", "title": "Roundup of coronavirus news from Mon., March 9", "description": "Disruptions due to the coronavirus outbreak continued to ripple across higher education Monday, with more cancellations of in-person courses and meetings. Known cases of COVID-19, the respiratory illness caused by the new coronavirus, topped 700 in the U.S. M…", "url": "https://www.insidehighered.com/news/2020/03/10/roundup-coronavirus-news-mon-march-9", "urlToImage": "https://www.insidehighered.com/sites/default/server_files/media/iStock-458945699.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "Disruptions due to the coronavirus outbreak continued to ripple across higher education Monday, with more cancellations of in-person courses and meetings.\r\nKnown cases of COVID-19, the respiratory illness caused by the new coronavirus, topped 700 in the U.S. … [+10025 chars]"}, {"source": {"id": null, "name": "Insidehighered.com"}, "author": "IHE Staff", "title": "Call for reader questions about coronavirus and its impact on higher education", "description": "The new coronavirus continues to cause a wide range of disruptions across higher education. Inside Higher Ed seeks questions from readers that our reporters and editors will try to tackle. Please send questions to covid19@insidehighered.com or post them in th…", "url": "https://www.insidehighered.com/news/2020/03/10/call-reader-questions-about-coronavirus-and-its-impact-higher-education", "urlToImage": "https://www.insidehighered.com/sites/all/themes/ihecustom/images/facebook_icon_large.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "The new coronavirus continues to cause a wide range of disruptions across higher education. Inside Higher Ed seeks questions from readers that our reporters and editors will try to tackle.\r\nPlease send questions to [email protected] or post them in the commen… [+192 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "#39;Govt measures will help economic recovery once global worries settle down#39;", "description": "It can be derived that though Coronavirus has an impact on the global economy", "url": "https://www.moneycontrol.com/news/business/markets/govt-measures-will-help-economic-recovery-once-global-worries-settle-down-5014401.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/11/BSE_Sensex-e1542611342127-770x433.jpg", "publishedAt": "2020-03-10T07:00:45Z", "content": "Though Coronavirus has an impact on the global economy, the various measures taken by the governments can help in the revival of the economy as soon as the global sentiment settles down, said Gaurav Garg, Head of Research at CapitalVia Global Research Investm… [+5034 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "All temporary hospitals in coronavirus epicenter Wuhan now shut down – Chinese state media", "description": "China has closed all of the temporary hospitals built in Wuhan – the epicenter of the coronavirus epidemic – to house patients who caught the deadly virus, state media has reported. Read Full Article at RT.com", "url": "https://www.rt.com/news/482707-china-coronavirus-wuhan-hospital-shut/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e6740c5203027716511f7d7.JPG", "publishedAt": "2020-03-10T07:10:00Z", "content": "Photographs published by CCTV show medical personnel who worked at one of the facilities celebrating and waving Chinese flags following the closure of their hospital.\r\nThe impromptu hospitals closed their doors on the same day that Chinese President Xi Jinpin… [+504 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "White House says US President Trump not tested for coronavirus - Hindustan Times", "description": "White House says US President Trump not tested for coronavirus Hindustan Times Coronavirus: A problem unlike anything else Trump has faced BBC News Concern over Trump coming within two degrees of separation from coronavirus Times of India Trump is Scared of M…", "url": "https://www.hindustantimes.com/world-news/white-house-says-us-president-trump-not-tested-for-coronavirus/story-s51dtptJvMRndJXaBNavlM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/10/Pictures/briefing-administration-president-washington-response-flanked-coronavirus_d492e440-6293-11ea-a22d-086e24190356.jpg", "publishedAt": "2020-03-10T06:33:31Z", "content": "President Donald Trump remains in excellent health and has not been tested for coronavirus, the White House has said, even though he was in contact with multiple lawmakers who have since gone into self-imposed quarantine due to their proximity to someone with… [+2465 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "James Asquith, Contributor, James Asquith, Contributor https://www.forbes.com/sites/jamesasquith/", "title": "The Oil Price Collapse Will Do Very Little To Help Struggling Airlines Suffering From A Coronavirus Demand Slump", "description": "With the sharpest drop off in oil prices since the Gulf War in 1991 airlines are mostly hedged on fuel except for U.S. carriers. American Airlines hedges none of it's fuel and meanwhile Cathay Pacific has now grounded 75% of its fleet.", "url": "https://www.forbes.com/sites/jamesasquith/2020/03/10/the-oil-price-collapse-will-do-very-little-to-help-struggling-airlines-suffering-from-a-coronavirus-demand-slump/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67376fe1e61700080e6027%2F0x0.jpg", "publishedAt": "2020-03-10T07:07:11Z", "content": "To begin with, as an important note, a plethora of unqualified people on social media are continuously stating strong opinions which come across as facts, so it is imperative to stick to facts or else clearly state opinion on this topic. Beyond that, many oth… [+8058 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "China’s Xi pays first visit to virus epicentre Wuhan - Hindustan Times", "description": "China’s Xi pays first visit to virus epicentre Wuhan Hindustan Times Coronavirus: High Blood pressure is major death risk, says top Chinese doctor Livemint Xi Jinping makes first visit to coronavirus-hit Wuhan city since virus outbreak Moneycontrol Opinion | …", "url": "https://www.hindustantimes.com/world-news/china-s-xi-pays-first-visit-to-virus-epicentre-wuhan/story-oFGwkhvBOfxv096wgKYeeK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/10/Pictures/people-meeting-president-beijing-jinping-speaks-during_0d8190cc-6298-11ea-a22d-086e24190356.jpg", "publishedAt": "2020-03-10T06:33:36Z", "content": "Chinese President Xi Jinping arrived in Wuhan on Tuesday for his first visit to the epicentre of the coronavirus epidemic since the crisis erupted in January -- a major sign that officials believe the outbreak is under control.\r\nXi’s unannounced visit comes a… [+3342 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "No Author", "title": "New White House chief of staff quarantined after coronavirus exposure", "description": "Mark Meadows, U.S. President Donald Trump’s incoming White House chief of staff, has quarantined himself after coming into contact with someone who tested positive for...", "url": "https://www.japantimes.co.jp/news/2020/03/10/world/white-house-chief-staff-mark-meadows-quarantined-coronavirus/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/03/f-coronadc-a-20200311-870x580.jpg", "publishedAt": "2020-03-10T06:21:48Z", "content": "WASHINGTON – Mark Meadows, U.S. President Donald Trump’s incoming White House chief of staff, has quarantined himself after coming into contact with someone who tested positive for the new virus that causes COVID-19, according to a person familiar with the ma… [+1753 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18 Staff", "title": "Coronavirus Outbreak LIVE Updates: 46 Cases in India as Pune Couple Tests Positive; Global Death Toll Crosses 4,000 - News18", "description": "Coronavirus Outbreak LIVE Updates: 46 Cases in India as Pune Couple Tests Positive; Global Death Toll Crosses 4,000 News18 Coronavirus outbreak live updates: 6 new confirmed cases in Kerala, 3 in K'taka; global virus toll at over 4,000 Times of India Coronavi…", "url": "https://www.news18.com/news/india/coronavirus-outbreak-live-updates-holi-bangalore-pune-cure-n95-mask-2531881.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/Untitled-design-84.png", "publishedAt": "2020-03-10T06:29:11Z", "content": "The global death toll from the new coronavirus passed 4,000 on Tuesday as China reported 17 new deaths. The toll reached 4,011 in the outbreak that has spread to over 100 countries with more than 110,000 cases of infection.The novel coronavirus has led to cra… [+1140 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Tetsushi Kajimoto and Daniel Leussink", "title": "Japan to unveil coronavirus package, not yet eyeing extra budget", "description": "Japan will unveil a second package of steps later on Tuesday to offset the impact of the coronavirus outbreak, focusing on support for small businesses, Finance Minister Taro Aso said, as concerns mount about risks to the country's fragile economy. The govern…", "url": "https://finance.yahoo.com/news/japan-unveil-coronavirus-package-not-065923283.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5BqvSrN5sLvQr5rKM1qOnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/xWGsP5.Q0k3i2T6WJxDNMw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/a336842a633c8ff721a3f1a3c02997a8", "publishedAt": "2020-03-10T06:59:23Z", "content": "By Tetsushi Kajimoto and Daniel Leussink\r\nTOKYO (Reuters) - Japan will unveil a second package of steps later on Tuesday to offset the impact of the coronavirus outbreak, focusing on support for small businesses, Finance Minister Taro Aso said, as concerns mo… [+2828 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Coronavirus | Serie A, all sport in Italy halted", "description": "Italy’s National Olympic Committee (CONI), which has authority over all national sports federations, had recommended “sporting activities at all levels” be suspended until April 3 to help contain the Covid-19 outbreak", "url": "https://www.thehindu.com/sport/football/coronavirus-serie-a-all-sport-in-italy-halted/article31029967.ece", "urlToImage": "https://www.thehindu.com/sport/football/xh55bd/article31029965.ece/ALTERNATES/LANDSCAPE_615/SERIAKB", "publishedAt": "2020-03-10T06:28:49Z", "content": "Italian Prime Minister Giuseppe Conte announced the suspension until April 3 of all sporting events in the country, including the top-flight Serie A football league, as Italy grapples with the coronavirus crisis.\r\nThe final Serie A game before government anno… [+3347 chars]"}, {"source": {"id": null, "name": "Citytoday.news"}, "author": "CTBUREAU_NGB", "title": "Covid-19 threat very real, but controllable: WHO chief Ghebreyesus - citytoday", "description": "Covid-19 threat very real, but controllable: WHO chief Ghebreyesus citytoday WHO: Coronavirus mortality rate more than flu's Times of India Threat of coronavirus pandemic now 'very real': World Health Organization Livemint Threat of coronavirus pandemic now '…", "url": "https://citytoday.news/covid-19-threat-very-real-but-controllable-who-chief-ghebreyesus/", "urlToImage": null, "publishedAt": "2020-03-10T07:08:55Z", "content": "Prime News, International, Health, Geneva (Switzerland), March 10:- World Health Organisation (WHO) has said that the threat of the novel coronavirus outbreak becoming a global pandemic was now very real after the deadly virus has spread in over 100 countries… [+571 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Mukesh Ambani loses Asia’s richest crown to Jack Ma in $5.8 billion rout", "description": "Mukesh Ambani is no longer Asia’s richest man, relinquishing the title to Jack Ma after oil prices collapsed along with global stocks.", "url": "https://indianexpress.com/article/business/mukesh-ambani-loses-asias-richest-crown-to-jack-ma-in-5-8-billion-rout-6307877/", "urlToImage": "https://images.indianexpress.com/2019/11/mukesh-ambani-bloomberg-759.jpg?w=759", "publishedAt": "2020-03-10T06:36:31Z", "content": "By: Bloomberg | \r\nPublished: March 10, 2020 12:06:31 pm\r\nMukesh Ambani’s shares plunged 12% on Monday, the most since 2009, extending this years decline to 26%Mukesh Ambani is no longer Asias richest man, relinquishing the title to Jack Ma after oil prices co… [+4077 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Trump has not been tested for coronavirus: White House", "description": "White House Press Secretary Stephanie Grisham said on March 9 that testing was not necessary because President Trump is not showing symptoms and the lawmakers aren#39;t confirmed to be infected.", "url": "https://www.moneycontrol.com/news/world/trump-has-not-been-tested-for-coronavirus-white-house-5018921.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Donald-Trump-770x433.jpg", "publishedAt": "2020-03-10T06:35:05Z", "content": "President Donald Trump remains in excellent health and has not been tested for coronavirus, the White House has said, even though he was in contact with multiple lawmakers who have since gone into self-imposed quarantine due to their proximity to someone with… [+2555 chars]"}, {"source": {"id": null, "name": "Insidehighered.com"}, "author": "Emma Whitford", "title": "Coronavirus caused American Council on Education to cancel annual meeting. Are other higher ed conferences next?", "description": "The American Council on Education announced Monday that it has canceled its annual meeting, citing the “ongoing and growing threat posed by the novel coronavirus.” The meeting had been scheduled to take place this weekend in San Diego. ACE’s decision could sw…", "url": "https://www.insidehighered.com/news/2020/03/10/coronavirus-caused-american-council-education-cancel-annual-meeting-are-other-higher", "urlToImage": "https://www.insidehighered.com/sites/default/server_files/media/iStock-1175031702.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "The American Council on Education announced Monday that it has canceled its annual meeting, citing the ongoing and growing threat posed by the novel coronavirus. The meeting had been scheduled to take place this weekend in San Diego.\r\nACEs decision could sway… [+3824 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "James Beattie", "title": "Coronavirus: Pharmacies on the frontline", "description": "As Irish pharmacies struggle to meet the demand for antibacterial hand gel, the Irish Pharmacy Union is reassuring patients that there is no need to order extra quantities of medicines.", "url": "https://www.rte.ie/news/2020/0309/1121249-coronavirus-pharmacies-on-the-frontline/", "urlToImage": "https://img.rasset.ie/0013dad9-1600.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "As Irish pharmacies struggle to meet the demand for antibacterial hand gel, the Irish Pharmacy Union is reassuring patients that there is no need to order extra quantities of medicines.\r\nIn a statement, the IPU said: \"Doing so will disrupt existing stock leve… [+1133 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Trading in VIX options froze after open: CBOE", "description": "When activity in options resumed, the VIX surged to its highest level since December 2008. The volatility spike occurred as global stock markets were melting down on fears about the spreading coronavirus and crashing oil prices.", "url": "https://www.moneycontrol.com/news/business/markets/trading-in-vix-options-froze-after-open-cboe-5018911.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/CBOE-770x433.jpg", "publishedAt": "2020-03-10T06:18:02Z", "content": "Trading in options on Wall Street's fear gauge was impossible in the first minutes of Monday's session due to an absence of prices from the market makers on whom trading depends, a representative of index operator CBOE Global Markets Inc said.\r\nCBOE Senior Tr… [+2093 chars]"}, {"source": {"id": null, "name": "Pinkbike.com"}, "author": null, "title": "Lousã Portugal World Cup Cancelled", "description": "Breaking news from those on the ground in Portugal says the first round of the 2020 World Cup has been canceled due to concerns over the COVID-19 coronavirus. We are still waiting for the official word.", "url": "https://www.pinkbike.com/news/lous-portugal-world-cup-cancelledpostponed.html", "urlToImage": "https://ep1.pinkbike.org/p4pb17547790/p4pb17547790.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "There have been an increasing number of events and gatherings being canceled worldwide in recent days along with restrictions being placed on travel by various governments, agencies, and organizations. Here's what we do know: According to a letter published b… [+3535 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "Todd Bishop", "title": "Coronavirus crackdown? Public officials consider mandatory cancellation of major Seattle events", "description": "Public officials are weighing the mandatory cancellation of large public gatherings in the Seattle region, including major sports events, as part of a broader escalation of efforts to curb the spread of the novel coronavirus. More information could be announc…", "url": "https://www.geekwire.com/2020/coronavirus-crackdown-public-officials-consider-mandatory-cancellation-major-seattle-events/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2020/03/49632494103_9b45215232_c.jpg", "publishedAt": "2020-03-10T06:58:26Z", "content": "Amid concerns about the spread of coronavirus at large public gatherings, the Seattle Sounders played their opening match Saturday night at CenturyLink Field in front of an announced crowd of more than 33,000 fans. (Photo: Lindsey Wasson / Sounders FC Communi… [+4407 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "RTÉ News", "title": "Stay at home: Italy's coronavirus quarantine rules", "description": "Italians have been told to stay at home and avoid all non-essential travel as quarantine measures were extended to the whole country to stop the spread of the coronavirus.", "url": "https://www.rte.ie/news/coronavirus/2020/0310/1121285-italy-quarantine-rules/", "urlToImage": "https://img.rasset.ie/0013db32-1600.jpg", "publishedAt": "2020-03-10T06:42:02Z", "content": "Italians have been told to stay at home and avoid all non-essential travel as quarantine measures were extended to the whole country to stop the spread of the coronavirus. \r\nHere are the main points of a government decree signed on Monday night that brings th… [+2112 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Asha Barbaschow", "title": "IBM Summit supercomputer joins fight against COVID-19", "description": "Oak Ridge National Laboratory says early research on existing drug compounds via supercomputing could combat coronavirus.", "url": "https://www.zdnet.com/article/ibm-summit-supercomputer-joins-fight-against-covid-19/", "urlToImage": "https://zdnet2.cbsistatic.com/hub/i/r/2020/02/26/4789c612-1629-4729-8328-3865532a8dc9/thumbnail/770x578/c41cf0ade842b4effda1f0bddae3c98a/coronavirus.jpg", "publishedAt": "2020-03-10T06:21:58Z", "content": "IBM Summit, titleholder of the world's most powerful supercomputer, has joined the fight against the COVID-19 outbreak.\r\nHoused within the United States Department of Energy's Oak Ridge National Laboratory (ORNL), after being built in IBM's Canberra Lab, IBM … [+3452 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Cameron Wilson", "title": "Tinder Users Are Setting Their Locations To Wuhan To Get Coronavirus News (And Pick Up)", "description": "\"Setting my tinder to Wuhan so I can get the real scoop on what's going on,\" one user wrote. View Entire Post ›", "url": "https://www.buzzfeed.com/cameronwilson/coronavirus-tinder-wuhan-china-dating-app-covid-19", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/10/6/campaign_images/59b87a52998e/tinder-users-are-setting-their-locations-to-wuhan-2-4107-1583820613-0_dblbig.jpg", "publishedAt": "2020-03-10T06:12:31Z", "content": "As COVID-19 spreads rapidly around the world, people are eager to keep up with developments at its epicentre in Wuhan, China.\r\nBut government censorship, partisan media and misinformation have led many to feel the public isn't seeing a full picture of life in… [+3762 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "AFP, AFP, Fatima Khanani, AFP, AFP, AFP, AFP, AFP", "title": "First coronavirus death recorded in Canada", "description": "Virus has killed more than 4,000 people and infected over 110,000 worldwide since it emerged late last year The post First coronavirus death recorded in Canada appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2173060/3-first-coronavirus-death-recorded-canada/", "urlToImage": "https://c.tribune.com.pk/2020/03/2173060-coronavirusx-1583820301-984-640x480.png", "publishedAt": "2020-03-10T06:16:30Z", "content": "PHOTO: REUTERS/FILE \r\nMONTREAL: Canada has recorded its first death from the new coronavirus, health officials in the westernmost province of British Columbia announced Monday.\r\nThe victim, a man living at an elderly care facility, “was infected with COVID-19… [+1148 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Scandinavia's Busiest Airport Compares Coronavirus Outbreak With World War II", "description": "Copenhagen Airport has seen a “unprecedented” 33 percent decline compared with expected figures and is under “strong pressure”, as its CEO has admitted.", "url": "https://sputniknews.com/business/202003101078524922-scandinavias-busiest-airport-compares-coronavirus-outbreak-with-world-war-ii/", "urlToImage": "https://cdn1.img.sputniknews.com/images/102227/20/1022272082.jpg", "publishedAt": "2020-03-10T06:30:43Z", "content": "Copenhagen Airport has seen a unprecedented 33 percent decline compared with expected figures and is under strong pressure, as its CEO has admitted.Kastrup, Copenhagen's airport, is currently experiencing a dramatic drop in the number of passengers flying bot… [+3026 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Holi 2020: Indians celebrate festival of colour amid coronavirus scare - Times of India", "description": "Holi 2020: Indians celebrate festival of colour amid coronavirus scare Times of India India Holi festival: Celebrations overshadowed by virus outbreak Al Jazeera English Holi 2020: India celebrates festival of colours amid coronavirus fears; govt warns agains…", "url": "https://timesofindia.indiatimes.com/videos/news/holi-2020-indians-celebrate-festival-of-colour-amid-coronavirus-scare/videoshow/74561459.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-74561459,imgsize-1329697.cms", "publishedAt": "2020-03-10T06:32:56Z", "content": "Mar 10, 2020, 11:57AM ISTSource: Mirror NowEven though coronavirus scare has impacted the sale of merchandise for Holi across the country, people celebrate the festival of colour with much enthusiasm. While people in Amritsar celebrate Holi with flowers inste… [+282 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Reuters", "title": "Donald Trump vows 'major' steps to aid US economy amid coronavirus rise", "description": "Donald Trump on Monday said he would  be taking &quot;major&quot; steps to gird the economy against the impact of the spreading coronavirus outbreak and will discuss a payroll tax cut with congressional Republicans on Tuesday.", "url": "https://www.telegraph.co.uk/business/2020/03/10/donald-trump-vows-major-steps-aid-us-economy-amid-coronavirus/", "urlToImage": "https://www.telegraph.co.uk/content/dam/business/2020/03/10/TELEMMGLPICT000227411128-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "publishedAt": "2020-03-10T06:14:51Z", "content": "Donald Trump on Monday said he would  be taking \"major\" steps to gird the economy against the impact of the spreading coronavirus outbreak and will discuss a payroll tax cut with congressional Republicans on Tuesday.\r\n\"We'll be discussing a possible payroll t… [+5401 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Moscow Stock Exchange Opens Amid Tumbling Ruble - Video", "description": "Oil prices had their biggest one-day drop in three decades after global oil producers failed to agree on deeper production cuts to offset weak demand caused by the coronavirus.", "url": "https://sputniknews.com/russia/202003101078524851-moscow-stock-exchange-opens-amid-tumbling-ruble---video/", "urlToImage": "https://cdn2.img.sputniknews.com/images/104020/70/1040207013.jpg", "publishedAt": "2020-03-10T06:58:35Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Moon and Hollie Silverman, CNN", "title": "A couple still aboard the Grand Princess cruise ship is suing Princess Cruise Lines for $1 million over its handling of coronavirus", "description": "The Florida couple accuses the cruise line of gross negligence in allowing them to be exposed to coronavirus on the ship.", "url": "https://www.cnn.com/2020/03/10/us/grand-princess-passengers-lawsuit-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200310011529-grand-princess-cruise-california-0309-super-tease.jpg", "publishedAt": "2020-03-10T06:55:41Z", "content": "(CNN)A Florida couple still aboard the Grand Princess cruise ship docked in Oakland, California, has filed a lawsuit against the ship's operator Princess Cruise Lines, accusing the company of gross negligence in allowing them to be exposed to coronavirus on t… [+2832 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Vandana Janeja", "title": "How AI Connects The Dots To Warn About Disease Threats", "description": "Canadian artificial intelligence firm BlueDot has been in the news in recent weeks for warning about the new coronavirus days ahead of the official alerts from the Centers for Disease Control and Prevention and the World Health Organization. The company was a…", "url": "https://www.gizmodo.com.au/2020/03/how-ai-connects-the-dots-to-warn-about-disease-threats/", "urlToImage": "https://edge.alluremedia.com.au/m/g/2020/03/coronavirus-ai.png", "publishedAt": "2020-03-10T07:00:28Z", "content": "Canadian artificial intelligence firm BlueDot has been in the news in recent weeks for warning about the new coronavirus days ahead of the official alerts from the Centers for Disease Control and Prevention and the World Health Organization. The company was a… [+6865 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": "Ross A. Lincoln", "title": "2020 Coachella and Stagecoach Festivals May Be Delayed or Canceled Due to Coronavirus Worries", "description": "Concerns about the spread of coronavirus have already disrupted some of the biggest events in entertainment, and the year’s biggest music festivals might be next. Billboard reported Monday that the promoter behind the Coachella and Stagecoach music festivals …", "url": "http://www.thewrap.com/2020-coachella-and-stagecoach-festivals-may-be-delayed-or-canceled-due-to-coronavirus-worries/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2020/03/GettyImages-1138337658-1.jpg", "publishedAt": "2020-03-10T06:17:36Z", "content": "Concerns about the spread of coronavirus have already disrupted some of the biggest events in entertainment, and the year’s biggest music festivals might be next.\r\nBillboard reported Monday that the promoter behind the Coachella and Stagecoach music festivals… [+15757 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus latest: All European Union states have COVID-19", "description": "The whole of Italy is on lockdown and COVID-19 has been confirmed in every EU member state. Follow DW for the latest coronavirus updates.", "url": "https://www.dw.com/en/coronavirus-latest-all-european-union-states-have-covid-19/a-52698747", "urlToImage": "https://www.dw.com/image/52700408_304.jpg", "publishedAt": "2020-03-10T06:25:00Z", "content": "<ul><li>Over 114,00 cases of coronavirus, or COVID-19, have been confirmed worldwide</li><li>Italy has imposed travel restrictions on the entire country to stop the spread of the disease</li><li>Two leading German research institutes have predicted that the c… [+18456 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Manoj", "title": "Twitter, Elliott in deal for Jack Dorsey to stay CEO and add directors", "description": "In reaching the agreement with Twitter, Elliott keeps a close eye on Jack Dorsey while also giving the company more time to formulate long-term plans and repair missteps, people familiar with Elliott's thinking said.", "url": "https://indianexpress.com/article/technology/tech-news-technology/twitter-elliott-jack-dorsey-6307771/", "urlToImage": "https://images.indianexpress.com/2020/01/jack-dorsey_759.jpg?w=759", "publishedAt": "2020-03-10T06:41:26Z", "content": "By: Reuters | \r\nUpdated: March 10, 2020 12:15:49 pm\r\nTwitter Inc on Monday reached an agreement with Elliott Management that lets Jack Dorsey stay as chief executive. (File)Twitter Inc on Monday reached an agreement with Elliott Management that lets Jack Dors… [+4620 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "AFP, Fatima Khanani, AFP, AFP, AFP, AFP, AFP", "title": "South Korea reports fewer than 150 new coronavirus cases", "description": "Rise in infections took its total to 7,513 The post South Korea reports fewer than 150 new coronavirus cases appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2173062/3-south-korea-reports-fewer-150-new-coronavirus-cases/", "urlToImage": "https://c.tribune.com.pk/2020/03/2173062-covidskorea-1583820751-290-640x480.png", "publishedAt": "2020-03-10T06:15:43Z", "content": "PHOTO: AFP \r\nSEOUL: South Korea, one of the worst-affected countries in the coronavirus epidemic outside China, on Tuesday reported fewer than 150 new cases for the first time in two weeks.\r\nA total of 131 infections were confirmed on Monday, the Korea Center… [+1961 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Peter Weber", "title": "Michigan GOP mayor in Obama-Trump county endorses Joe Biden, regrets 2016 vote for Trump", "description": "Michigan and its 125 deluges is the big prize in Tuesday's Democratic presidential primaries, the first pitting former Vice President Joe Biden and Sen. Bernie Sanders (I-Vt.) head to head in what's essentially a two-man race. Sanders and Biden are both conte…", "url": "https://news.yahoo.com/michigan-gop-mayor-obama-trump-061800490.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/JHMWiIN_2iNyp6TWU.5VoQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eqPTe8i9EcdAo0frMjv5gg--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/cc690d311e142c455e797ba8231789c3", "publishedAt": "2020-03-10T06:18:00Z", "content": "Michigan and its 125 deluges is the big prize in Tuesday's Democratic presidential primaries, the first pitting former Vice President Joe Biden and Sen. Bernie Sanders (I-Vt.) head to head in what's essentially a two-man race. Sanders and Biden are both conte… [+1775 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Orders sink for Italy's luxury suppliers as virus spreads - sources", "description": "Global luxury brands including Gucci and Louis Vuitton are scaling back orders with Italian suppliers, as the spread of the coronavirus from key market China to major manufacturing hub Italy hits business across the sector, industry sources said. Italy, home …", "url": "https://finance.yahoo.com/news/orders-sink-italys-luxury-suppliers-062504706.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Gec_U9aQhdZ1ZVgLrWkWcg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/ykW_4CvqX5DHGnrgtHRiUw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/96ec0d67c6173a600430ad2c2b458ed1", "publishedAt": "2020-03-10T06:25:04Z", "content": "FLORENCE/VENICE/MILAN (Reuters) - By Silvia Ognibene, Riccardo Bastianello, Silvia Aloisi\r\nGlobal luxury brands including Gucci and Louis Vuitton are scaling back orders with Italian suppliers, as the spread of the coronavirus from key market China to major m… [+5355 chars]"}, {"source": {"id": null, "name": "Euobserver.com"}, "author": "EUobserver", "title": "[Ticker] EU leaders' teleconference to discuss coronavirus", "description": "EU leaders are set to hold a teleconference to discuss a joint-response on the coronavirus outbreak. \"Following consultations I will hold a EUCO [European Council] members conference call shortly on COVID-19 to coordinate EU efforts,\" Council president Charle…", "url": "https://euobserver.com/tickers/147679", "urlToImage": "https://s3.eu-central-1.amazonaws.com/euobs-media/6e5f90e3e78121ba09aefe7419b47a16-480x.jpg", "publishedAt": "2020-03-10T06:18:01Z", "content": "Today, 07:16The European Commission has a new strategy for Africa. The proposal, whose details have yet to be worked out, spans broad issues like climate, energy, digital transformation, jobs, peace, governance, and migration."}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "One chart shows how many coronavirus tests per capita have been completed in 8 countries. (Business Insider)", "description": "Business Insider : One chart shows how many coronavirus tests per capita have been completed in 8 countries. The US is woefully behind. — As the coronavirus spreads globally — more than 100 countries have reported cases — governments are ramping up testing. —…", "url": "https://www.memeorandum.com/200310/p5", "urlToImage": "https://i.insider.com/5e66cb7484159f30620b44b8?width=1200&format=jpeg", "publishedAt": "2020-03-10T07:00:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Digitimes.com"}, "author": "Willis Ke", "title": "Yageo, Walsin post significant revenue decreases for February", "description": "Passive components makers Yageo and Walsin Technology both posted sequential and annual falls for February 2020 revenues due to significant contraction in output of MLCCs and chip resistors at plants in China amid the coronavirus outbreak.", "url": "https://www.digitimes.com/news/a20200310PD207.html", "urlToImage": "https://www.digitimes.com/newsshow/20200310PD207_files/2_r.jpg", "publishedAt": "2020-03-10T06:29:33Z", "content": "Coronavirus impact special report: Mobile devicesThe coronavirus outbreak has disrupted production and weakened consumer confidence, with all ICT sectors bracing for major declines in shipments. Digitimes Research has conducted analyses on three mobile device… [+79 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Three new local Covid-19 cases", "description": "The Public Health Ministry on Tuesday announced three new local cases of coronavirus disease 2019 (Covid-19) infection - two them Thais in contact with people returning from Italy.", "url": "https://www.bangkokpost.com/thailand/general/1875709/three-new-local-covid-19-cases", "urlToImage": "https://static.bangkokpost.com/media/content/20200310/c1_1875709_700.jpg", "publishedAt": "2020-03-10T07:09:00Z", "content": "The Public Health Ministry on Tuesday announced three new local cases of coronavirus disease 2019 (Covid-19) infection - two them Thais in contact with people returning from Italy.\r\nDr Yongyos Thammawut, deputy permanent secretary for health, said one was a 4… [+1567 chars]"}, {"source": {"id": null, "name": "43rumors.com"}, "author": "Andreapazzo", "title": "For now the 2020 NAB Show is proceeding as planned while Adobe pulls out", "description": "Here is the latest statement from the NABshow organization: NAB Show Status The health and safety of our show community remains our top priority. As of now, we are moving forward with NAB Show, while continuing to evaluate the national… The post For now the 2…", "url": "https://www.43rumors.com/for-now-the-2020-nab-show-is-proceeding-as-planned-while-adobe-pulls-out/", "urlToImage": "https://www.43rumors.com/wp-content/uploads/2020/03/NABshow.png", "publishedAt": "2020-03-10T07:03:10Z", "content": "NAB Show Status\r\nThe health and safety of our show community remains our top priority. As of now, we are moving forward with NAB Show, while continuing to evaluate the national and international situation carefully.\r\nIn light of confirmed cases of COVID-19 co… [+3352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "Qantas cuts almost a quarter of all flights and says its CEO will stop taking a salary", "description": "Qantas has announced sweeping cost-cutting measures in light of the worsening novel coronavirus crisis, including slashing almost a quarter of all flights for the next six months and significantly reducing executive pay.", "url": "https://www.cnn.com/2020/03/10/business/qantas-cuts-flights-coronavirus-ceo-pay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309231340-qantas-plane-file-super-tease.jpg", "publishedAt": "2020-03-10T06:46:41Z", "content": "Hong Kong (CNN Business)Qantas has announced sweeping cost-cutting measures in light of the worsening novel coronavirus crisis, including slashing almost a quarter of all flights for the next six months and significantly reducing executive pay.\r\nFor the rest … [+2946 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Ireland 'gutted' by postponement of Six Nations game against France", "description": "Ireland coach Andy Farrell said his players were left \"gutted\" after Saturday's Six Nations game against France in Paris was postponed because of the coronavirus outbreak.", "url": "https://www.channelnewsasia.com/news/sport/ireland--gutted--by-postponement-of-six-nations-game-against-france-12521604", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12521602/16x9/991/557/4def10af5d7028ac6501cd1c58cb49c2/dT/file-photo--six-nations-launch-1.jpg", "publishedAt": "2020-03-10T06:30:41Z", "content": "REUTERS: Ireland coach Andy Farrell said his players were left \"gutted\" after Saturday's Six Nations game against France in Paris was postponed because of the coronavirus outbreak.\r\nThe match is the third fixture in this year's tournament to be put off amid f… [+1466 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Yohay Elam", "title": "Forex Today: Dollar dominates after the coronavirus crash amid Trump's tax promises, Chinese hopes", "description": "Here is what you need to know on Monday, March 10: After Monday's coronavirus-correlated bloodbath in markets, Asian stocks and S&P futures are up, yi", "url": "https://www.fxstreet.com/news/forex-today-dollar-dominates-after-the-coronavirus-crash-amid-trumps-tax-promises-chinese-hopes-202003100645", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Events/Coronavirus/coronavirus2_Large.jpg", "publishedAt": "2020-03-10T06:45:38Z", "content": "Here is what you need to know on Tuesday, March 10:\r\nAfter Monday's coronavirus-correlated bloodbath in markets, Asian stocks and S&amp;P futures are up, yields are on the rise, and the dollar bounced from its lows. USD/JPY tops 104 in a 2% leap, while EUR/US… [+2209 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Yohay Elam", "title": "Gold Price Analysis: Topping these two hurdles crucial to next coronavirus-related rally above $1,700", "description": "Gold surged above $1,700 in but was later slapped back down amid extreme volatility conditions. Coronavirus fears were dominant on Monday but markets", "url": "https://www.fxstreet.com/news/gold-price-analysis-topping-these-two-hurdles-crucial-to-next-coronavirus-related-rally-above-1-700-202003100706", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Commodities/Metals/Gold/aurum-37842316_Large.jpg", "publishedAt": "2020-03-10T07:06:15Z", "content": "Gold surged above $1,700 in but was later slapped back down amid extreme volatility conditions. Coronavirus fears were dominant on Monday but markets are bouncing on Tuesday in what looks like a dead-cat bounce. Where next for XAU/USD? Two resistance lines ca… [+1605 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "Germany’s Altmaier: Main priority is to slow the spread of the coronavirus to avoid recession", "description": "Speaking on public television, the German Economy Minister Peter Altmaier said government’s main priority is to slow the spread of the coronavirus in", "url": "https://www.fxstreet.com/news/germanys-altmaier-main-priority-is-to-slow-the-spread-of-the-coronavirus-to-avoid-recession-202003100700", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Europe/Eurozone_countries/Germany/Angela_Merkel_2008_Large.jpg", "publishedAt": "2020-03-10T07:00:13Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Delfin Dioquino", "title": "PBA to discuss plans for new season amid coronavirus outbreak", "description": "MANILA, Philippines – The PBA is set to hold an emergency meeting to discuss plans for the new season as the number of novel coronavirus cases in the country continues to rise. League commissioner Willie Marcial said he will confer with the board of governors…", "url": "https://www.rappler.com/sports/by-sport/basketball/pba/253983-discuss-plans-new-season-coronavirus-outbreak", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/2399BA13929448AC991C78637AA8BE5D/marcio-lassiter.jpg", "publishedAt": "2020-03-10T06:21:28Z", "content": null}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Rappler.com", "title": "Nationwide earthquake drill canceled due to coronavirus outbreak", "description": "MANILA, Philippines – The The National Disaster Risk Reduction and Management Council (NDRRMC) has canceled the first quarter nationwide simultaneous earthquake drill (NSED) that was supposed to be held on Thursday, March 12. The NDRRMC announced this in a me…", "url": "https://www.rappler.com/move-ph/253991-nationwide-earthquake-drill-2020-canceled-coronavirus-outbreak", "urlToImage": "https://assets.rappler.com/979C2513CDE44C5F8389D41BEE78D4D6/img/0BD77FAFBB86435EB4AAFC176C6FB130/Corazon-elem-school-Batasan-QC-June-20-2019-3.jpg", "publishedAt": "2020-03-10T07:02:29Z", "content": null}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Rappler.com", "title": "FALSE: ‘Entire family’ in Pasig infected by novel coronavirus", "description": "Claim: “An entire family” in Santolan, Pasig, is “confirmed to be infected” with the 2019 novel coronavirus, according to what looked like a breaking news graphic from GMA News. A graphic bearing GMA’s logo reads: “JUST IN: Isang buong pamilya kumpirmadong in…", "url": "https://www.rappler.com/newsbreak/fact-check/253981-entire-family-pasig-infected-novel-coronavirus", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/6AC22214D7AD48ECB42AC3475D734FFD/false-2.jpg", "publishedAt": "2020-03-10T06:15:42Z", "content": null}, {"source": {"id": null, "name": "F1technical.net"}, "author": "Balazs Szabo", "title": "Pirelli expects no hurdles in its activities", "description": "Formula One’s sole tyre manufacturer Pirelli expects that it will not face any major issues with its race activities in the coming weeks despite the current situation regarding the coronavirus outbreak.", "url": "https://www.f1technical.net/news/22353", "urlToImage": "http://f1tcdn.net/images/news/2020/raikkonen.jpg", "publishedAt": "2020-03-10T07:00:00Z", "content": "By Balazs Szabo on 10 Mar 2020, 09:00\r\nFormula Ones sole tyre manufacturer Pirelli expects that it will not face any major issues with its race activities in the coming weeks despite the current situation regarding the coronavirus outbreak.\r\nAfter the number … [+1633 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Table tennis - World Tour Japan Open postponed over coronavirus", "description": "TOKYO: The International Table Tennis Federation (ITTF) said on Tuesday it was postponing next month's ITTF World Tour Japan Open because of concerns about the coronavirus outbreak. The tournament had been scheduled for April 21-26 in the Southern Japanese ci…", "url": "https://www.channelnewsasia.com/news/sport/table-tennis---world-tour-japan-open-postponed-over-coronavirus-12521566", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/8696096/16x9/991/557/a8d6d3290493335c3da84e6260e34509/tf/sports.png", "publishedAt": "2020-03-10T06:15:21Z", "content": "TOKYO: The International Table Tennis Federation (ITTF) said on Tuesday it was postponing next month's ITTF World Tour Japan Open because of concerns about the coronavirus outbreak.\r\nThe tournament had been scheduled for April 21-26 in the Southern Japanese c… [+322 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "nCoV Monitor 1.5 - Chinese Novel Coronavirus situation. (Free)", "description": "Stay informed on the Chinese Novel Coronavirus situation. nCoV Monitor provides the latest and the most elaborate information summary on Wuhan Coronavirus outbreak and the interactive map of disease’ spreading. All statistics and rates are collected from trus…", "url": "http://feedproxy.google.com/~r/macupdate/~3/1WcdTsIDLpE/1583824269", "urlToImage": null, "publishedAt": "2020-03-10T07:11:09Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Japan's Abe pressures BOJ to ease ahead of next week's rate review", "description": "Japanese Prime Minister Shinzo Abe said the government will work closely with the Bank of Japan to stabilise markets, piling pressure on the central bank to ramp up stimulus next week to fend off risks to the economy from the coronavirus outbreak. The remarks…", "url": "https://news.yahoo.com/japans-abe-pressures-boj-ease-070318944.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2020-03-10T07:03:18Z", "content": "By Leika Kihara and Kaori Kaneko\r\nTOKYO (Reuters) - Japanese Prime Minister Shinzo Abe said the government will work closely with the Bank of Japan to stabilise markets, piling pressure on the central bank to ramp up stimulus next week to fend off risks to th… [+3541 chars]"}, {"source": {"id": null, "name": "Euobserver.com"}, "author": "Elena Sánchez Nicolás", "title": "[Analysis] First 100 days: Digital and Green Deal policies hit by crises", "description": "The first 100 days of Ursula von der Leyen's commission were supposed to be about the digital and environmental transitions. However, that agenda has been hit by first the coronavirus, and now the Greek border situation.", "url": "https://euobserver.com/institutional/147678", "urlToImage": "https://s3.eu-central-1.amazonaws.com/euobs-media/edf9d27a51ce09dc1fe47618f5df75dc-480x.jpg", "publishedAt": "2020-03-10T06:17:49Z", "content": "\"We have the duty to act and the power to lead,\" the president of the European Commission, Germany's Ursula von der Leyen, told MEPs before her team of commissioners took office late last year.At the core of von der Leyen's pre-election campaign was her commi… [+5495 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anjani Trivedi", "title": "Roads to Nowhere Won’t Lead China Out of Crisis", "description": "(Bloomberg Opinion) -- With the coronavirus shutting down large parts of China, plans for big infrastructure spending to stimulate the economy are rising. Bu...", "url": "https://finance.yahoo.com/news/roads-nowhere-won-t-lead-061314938.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-10T06:13:14Z", "content": "(Bloomberg Opinion) -- With the coronavirus shutting down large parts of China, plans for big infrastructure spending to stimulate the economy are rising. But what will be built, and for whom?  \r\nThe scale seems striking. Several provinces have cumulatively a… [+6031 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Iain Marlow and Samson Ellis", "title": "Coronavirus Outbreak Becomes New Battleground For China-Taiwan Rivalry", "description": "(Bloomberg) -- The weeks-long ordeal of more than 1,000 Taiwanese stuck at the center of China’s coronavirus outbreak shows how the global crisis has evolved...", "url": "https://news.yahoo.com/coronavirus-outbreak-becomes-battleground-china-063838802.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-10T06:38:38Z", "content": "(Bloomberg) --\r\nThe weeks-long ordeal of more than 1,000 Taiwanese stuck at the center of Chinas coronavirus outbreak shows how the global crisis has evolved into another battleground between Beijing and Taipei.\r\nTaiwan on Tuesday was set to airlift almost 50… [+5423 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "58 Indians Evacuated from Iran Arrive in New Delhi, All Test Negative for Coronavirus", "description": "New Delhi (Sputnik): Over 2,000 Indians are living in Iran, a country that has recorded about 240 deaths from coronavirus so far: 43 in the last 24 hours alone. Indian nationals had sought New Delhi’s intervention to evacuate them from the country, where over…", "url": "https://sputniknews.com/india/202003101078524867-58-indians-evacuated-from-iran-arrive-in-new-delhi-all-test-negative-for-coronavirus/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107826/72/1078267218.jpg", "publishedAt": "2020-03-10T07:10:51Z", "content": "New Delhi (Sputnik): Over 2,000 Indians are living in Iran, a country that has recorded about 240 deaths from coronavirus so far: 43 in the last 24 hours alone. Indian nationals had sought New Delhis intervention to evacuate them from the country, where over … [+1674 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "Asian stocks steady after plunge on virus, oil crash", "description": "BEIJING (AP) — Asian stock markets rebounded Tuesday from record-setting declines after U.S. futures rose following President Donald Trump's announcement he would ask Congress for a tax cut and other measures to ease the pain of the spreading coronavirus outb…", "url": "https://www.bostonherald.com/2020/03/10/asian-stocks-steady-after-plunge-on-virus-oil-crash/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/China_Financial_Markets_26221-1.jpg?w=1024&h=683", "publishedAt": "2020-03-10T06:43:15Z", "content": "By JOE McDONALD\r\nBEIJING (AP) — Asian stock markets rebounded Tuesday from record-setting declines after U.S. futures rose following President Donald Trump’s announcement he would ask Congress for a tax cut and other measures to ease the pain of the spreading… [+5816 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Claire Zillman, reporter", "title": "Coronavirus cases are pushing Italy’s hospitals to the brink", "description": "Doctors see the government lockdown on travel as the only hope to avoid utter catastrophe", "url": "https://fortune.com/2020/03/10/coronavirus-italy-cases-hospitals/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/03/GettyImages-1206312844.jpg?resize=1200,600", "publishedAt": "2020-03-10T07:00:55Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Oil Prices Bounce Back 7 Percent a Day After Global Markets Crash", "description": "Crude prices slumped by over 30 percent on Monday in their biggest fall since the 1991 Gulf War, after the OPEC+ alliance failed to agree on a deal to introduce new production cuts last week.", "url": "https://sputniknews.com/business/202003101078524794-oil-prices-bounce-back-7-percent-a-day-after-global-markets-crash/", "urlToImage": "https://cdn1.img.sputniknews.com/images/104985/87/1049858732.jpg", "publishedAt": "2020-03-10T06:37:16Z", "content": "Crude prices slumped by over 30 percent on Monday in their biggest fall since the 1991 Gulf War, after the OPEC+ alliance failed to agree on a deal to introduce new production cuts last week.Brent crude futures gained $2.51, or 7.3 percent, to reach $36.87 pe… [+1226 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Huileng Tan", "title": "Beijing objects to term 'Wuhan coronavirus,' and says it may not have originated in China", "description": "China's foreign ministry on Monday objected to the expression \"Wuhan coronavirus\" — saying the name will \"stigmatize\" the country — following recent claims from Beijing that the virus may not have originated in China at all.", "url": "https://www.cnbc.com/2020/03/10/china-objects-to-term-wuhan-coronavirus-used-by-mike-pompeo.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106431314-1583711744272gettyimages-1210970558.jpeg?v=1583801073", "publishedAt": "2020-03-10T07:04:00Z", "content": "China's foreign ministry on Monday objected to the expression \"Wuhan coronavirus\"  saying the name will \"stigmatize\" the country following remarks from U.S. Secretary of State Mike Pompeo.\r\nThe objection marks the latest from Beijing leaders and the country's… [+7023 chars]"}, {"source": {"id": null, "name": "Euractiv.com"}, "author": "Samuel Stolton", "title": "Ireland’s St Patrick’s parades cancelled over COVID-19 concerns", "description": "St Patrick's day festivities have been cancelled all over the Republic of Ireland, amid rising concerns over the spread of the Coronavirus outbreak, Irish Prime Minister Leo Varadkar announced on Monday (9 March).", "url": "http://www.euractiv.com/section/health-consumers/news/irelands-st-patricks-parades-cancelled-over-covid-19-concerns/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2020/03/w_55891226-800x450.jpg", "publishedAt": "2020-03-10T06:37:22Z", "content": "St Patrick’s day festivities have been cancelled all over the Republic of Ireland, amid rising concerns over the spread of the Coronavirus outbreak, Irish Prime Minister Leo Varadkar announced on Monday (9 March).\r\nAs part of the measures, four mass gathering… [+2751 chars]"}, {"source": {"id": null, "name": "Euractiv.com"}, "author": "Georgi Gotev", "title": "As stock markets collapse, IMF calls for support for the coronavirus-infected economy", "description": "The International Monetary Fund called on governments worldwide Monday (9 March) to join forces and roll out aggressive financial supports for the coronavirus-infected global economy, including direct payments to workers and businesses.", "url": "http://www.euractiv.com/section/economic-governance/news/as-stock-markets-collapse-imf-calls-for-support-for-the-coronavirus-infected-economy/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2020/03/Stock-market-800x450.jpg", "publishedAt": "2020-03-10T07:09:14Z", "content": "The International Monetary Fund called on governments worldwide Monday (9 March) to join forces and roll out aggressive financial supports for the coronavirus-infected global economy, including direct payments to workers and businesses.\r\nBut while several cou… [+4413 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Mask resellers could face 1 year in prison, ¥1 mil fine under new ban", "description": "The reselling of face masks for profit will become a crime punishable by a one-year prison sentence or a 1 million yen fine, or both, amid surging demand spurred by the coronavirus epidemic, the Japanese government said Tuesday. The new rule, aimed at prevent…", "url": "https://japantoday.com/category/crime/mask-resellers-could-face-1-year-in-prison-hefty-fine-under-new-ban", "urlToImage": null, "publishedAt": "2020-03-10T07:06:13Z", "content": "The reselling of face masks for profit will become a crime punishable by a one-year prison sentence or a 1 million yen fine, or both, amid surging demand spurred by the coronavirus epidemic, the Japanese government said Tuesday.\r\nThe new rule, aimed at preven… [+2030 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Gov't to unveil package focusing on support for small businesses hit by virus", "description": "The Japanese government will unveil a second package of steps later on Tuesday to offset the impact of the coronavirus outbreak, focusing on support for small businesses, Finance Minister Taro Aso said, as concerns mount about risks to the country's fragile e…", "url": "https://japantoday.com/category/politics/update-2-japan-to-unveil-coronavirus-package-not-yet-eyeing-extra-budget", "urlToImage": null, "publishedAt": "2020-03-10T07:05:54Z", "content": "The Japanese government will unveil a second package of steps later on Tuesday to offset the impact of the coronavirus outbreak, focusing on support for small businesses, Finance Minister Taro Aso said, as concerns mount about risks to the country's fragile e… [+2697 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Boston cancels St Patrick's Day parade over virus concerns; New York's to go on", "description": "The mayor of Boston announced Monday the city would cancel its annual St Patrick's Day parade over coronavirus concerns, although New York said its parade would go on. The Boston parade, originally scheduled for March 15, was expected to attract about one mil…", "url": "https://japantoday.com/category/world/boston-cancels-st.-patrick%27s-day-parade-new-york%27s-to-go-on", "urlToImage": null, "publishedAt": "2020-03-10T06:15:39Z", "content": "The mayor of Boston announced Monday the city would cancel its annual St Patrick's Day parade over coronavirus concerns, although New York said its parade would go on.\r\nThe Boston parade, originally scheduled for March 15, was expected to attract about one mi… [+2076 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "none@none.com (Imtiaz Ali | Dawn.com)", "title": "Sindh govt to issue advisory on avoiding public gatherings after coronavirus cases rise to 13", "description": "A day after Sindh reported nine more cases of coronavirus, all in Karachi, the provincial health department is expected to issue an advisory for people to avoid large public gatherings. The count on Monday — the highest of the epidemic since it was first dete…", "url": "https://www.dawn.com/news/1539801", "urlToImage": "https://i.dawn.com/large/2020/03/5e6735220a818.jpg?r=1934274193", "publishedAt": "2020-03-10T06:54:12Z", "content": "A day after Sindh reported nine more cases of coronavirus, all in Karachi, the provincial health department is expected to issue an advisory for people to avoid large public gatherings. \r\nThe count on Monday the highest of the epidemic since it was first dete… [+2273 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cases in PH jump to 24 - CNN Philippines", "description": "Cases in PH jump to 24 CNN Philippines WHO says threat of pandemic 'has become very real' even as China recoveries rise CNBC Threat of COVID-19 pandemic 'has become very real': WHO chief ARIRANG NEWS WHO: Coronavirus mortality rate more than flu's Times of In…", "url": "https://www.youtube.com/watch?v=vSnzxgHgYAU", "urlToImage": null, "publishedAt": "2020-03-10T06:22:34Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | 'I wash my hands like a mad man' - life in a coronavirus quarantine", "description": "This South African, who has been quarantined for weeks, does not mind spending time alone, but these days he finds himself more and more puzzled by people, their habits, and strangely their attitude towards pens.", "url": "https://www.news24.com/SouthAfrica/News/i-wash-my-hands-like-a-mad-man-life-in-a-coronavirus-quarantine-20200310", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10057/fc99d7cd7d574300bbecfeb9f00b5a53.jpg", "publishedAt": "2020-03-10T06:54:49Z", "content": "This South African has been quarantined for weeks. He does not mind spending time alone, but these days he finds himself more and more puzzled by people, their habits, and strangely their attitude towards pens. This is part two of our series of first-hand acc… [+2824 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Ajay Nair", "title": "'The war has exploded': Inside Italy's fight against coronavirus", "description": "A doctor at the heart of the coronavirus outbreak in Italy has spoken of the dramatic fight against the disease, saying it is like relentless war and describing how wards are filling up and doctors are working non-stop to save lives.", "url": "https://news.sky.com/story/coronavirus-italian-doctor-says-fighting-covid-19-outbreak-is-like-war-11954229", "urlToImage": "https://e3.365dm.com/20/03/1600x900/skynews-italy-coronavirus_4943641.jpg?20200310072144", "publishedAt": "2020-03-10T06:40:00Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Withnall, Adam Withnall", "title": "Coronavirus: President Xi Jinping visits Wuhan epicentre for first time as China 'set to declare victory over outbreak'", "description": "'Xi could not have visited Wuhan earlier because the risk of him contracting the virus there was initially too high,' says Beijing professor. 'He is there now to reap the harvest'", "url": "https://www.independent.co.uk/news/world/asia/coronavirus-china-wuhan-outbreak-xi-jinping-visit-hubei-cases-deaths-a9389251.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/10/06/china-xi-jinping-virus.jpg", "publishedAt": "2020-03-10T06:42:45Z", "content": "The Chinese president Xi Jinping visited the centre of the coronavirus epidemic for the first time on Tuesday, in a possible sign that Beijing considers the worst of the outbreak to be over.\r\nMainland China reported just 19 new infections on Monday, the lowes… [+4069 chars]"}, {"source": {"id": null, "name": "Samchui.com"}, "author": "Sam Chui", "title": "Covid-19: Qantas Cuts Flight By A Quarter, Sending A380 For Grounding", "description": "Qantas has just announced that they will be cutting their capacity by a quarter for the next 6 months. As explained in the latest media release, this cut “follows the spread of the Coronavirus into Europe and North America over the past fortnight, as well as …", "url": "https://samchui.com/2020/03/10/covid-19-qantas-cuts-flight-by-a-quater-sending-a380-for-grounding/", "urlToImage": "https://samchui.com/wp-content/uploads/2019/12/Qantas-Airbus-A380-1-e1577106765338.jpg", "publishedAt": "2020-03-10T06:55:55Z", "content": "Qantas has just announced that they will be cutting their capacity by a quarter for the next 6 months.\r\nAs explained in the latest media release, this cut follows the spread of the Coronavirus into Europe and North America over the past fortnight, as well as … [+4375 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "P R Sanjai", "title": "Ambani Loses Asia Wealth Crown to Ma in $5.8 Billion Rout", "description": "(Bloomberg) -- Indian energy tycoon Mukesh Ambani is no longer Asia’s richest man, relinquishing the title to Jack Ma after oil prices collapsed along with global stocks.The rout, exacerbated by mounting fears that the spread of the novel coronavirus will thr…", "url": "https://finance.yahoo.com/news/ambani-loses-asia-wealth-crown-221004258.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rcvj8de8bDlktJz9SaP9zQ--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_technology_68/5432db1eaf4e531e8528b483da34f592", "publishedAt": "2020-03-10T06:29:15Z", "content": "(Bloomberg) -- Indian energy tycoon Mukesh Ambani is no longer Asias richest man, relinquishing the title to Jack Ma after oil prices collapsed along with global stocks.\r\nThe rout, exacerbated by mounting fears that the spread of the novel coronavirus will th… [+4294 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "AFP, AFP, AFP, Fatima Khanani, AFP, AFP, AFP, AFP, AFP", "title": "China’s Xi pays first visit to virus epicentre Wuhan", "description": "More than 4,000 people have died and over 110,000 have been infected worldwide, with the majority in China The post China’s Xi pays first visit to virus epicentre Wuhan appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2173061/3-chinas-xi-pays-first-visit-virus-epicentre-wuhan/", "urlToImage": "https://c.tribune.com.pk/2020/03/2173061-xi-1583820950-125-640x480.jpg", "publishedAt": "2020-03-10T06:17:02Z", "content": "China's President Xi Jinping. PHOTO: AFP \r\nBEIJING: Chinese President Xi Jinping arrived in Wuhan on Tuesday for his first visit to the epicentre of the coronavirus epidemic since the crisis erupted in January — a major sign that officials believe the outbrea… [+2286 chars]"}, {"source": {"id": null, "name": "Luxurydaily.com"}, "author": "Luxury Daily News Service", "title": "Rimowa, GLCO, Christie’s, Chubb, Concours of Elegance and UKFT", "description": "Luxury Daily's live news: Rimowa partners with Garrett Leight for first eyewear collab; Christie’s postpones Important Watches auction in Dubai over virus fear; Chubb, targeting wealthy car collectors, to sponsor Concours of Elegance at UK’s Hampton Court Pal…", "url": "https://www.luxurydaily.com/rimowa-glco-christies-chubb-concours-of-elegance-and-ukft/", "urlToImage": "https://www.luxurydaily.com/wp-content/uploads/2020/03/Concours-of-Elegance-Hampton-Court-Palace.jpg", "publishedAt": "2020-03-10T06:40:50Z", "content": "News briefs\r\nMarch 10, 2020\r\n Concours of Elegance at Hampton Court Palace in England. Image courtesy of Concours of Elegance \r\n By Luxury Daily News Service\r\nLuxury Daily's live news:\r\nRimowa partners with Garrett Leight for first eyewear collabGerman luggag… [+5592 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jenni Fink", "title": "Coronavirus Vaccine At Least a Year Away, But Treatment Could Be Here in Months", "description": "When it comes to developing treatments, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Disease, said researchers have results \"almost immediately.\"", "url": "https://www.newsweek.com/coronavirus-vaccine-treatment-antiviral-speed-covid-19-1491292", "urlToImage": "https://d.newsweek.com/en/full/1572564/coronavirus-vaccine-treatment-fauci-covid-19.jpg", "publishedAt": "2020-03-10T07:00:01Z", "content": "America is still more than a year away from a COVID-19 vaccine, but a treatment for the disease caused by the new coronavirus could be available in several months.\r\nSince the first case was identified in the U.S. on January 21, more than 560 people have teste… [+4017 chars]"}, {"source": {"id": null, "name": "Euobserver.com"}, "author": "EUobserver", "title": "[Ticker] Germany-Austria spat over anti-virus facemasks", "description": "A German export ban on masks that protects against the coronavirus has angered Austria and Switzerland. \"It can't be that Germany is holding back products for Austria just because they happen to be stored in a German location,\" said Austrian economy minister …", "url": "https://euobserver.com/tickers/147680", "urlToImage": "https://s3.eu-central-1.amazonaws.com/euobs-media/6e5f90e3e78121ba09aefe7419b47a16-480x.jpg", "publishedAt": "2020-03-10T06:18:12Z", "content": "Today, 07:16The European Commission has a new strategy for Africa. The proposal, whose details have yet to be worked out, spans broad issues like climate, energy, digital transformation, jobs, peace, governance, and migration."}, {"source": {"id": null, "name": "Euobserver.com"}, "author": "EUobserver", "title": "[Ticker] Virus lockdown extended to all of Italy", "description": "Italian prime minister Giuseppe Conte has put the whole country of more than 60m people under a lockdown to avoid the further spread of coronavirus, banning public gatherings and urging people to stay at home. \"There is no more time. I will take responsibilit…", "url": "https://euobserver.com/tickers/147682", "urlToImage": "https://s3.eu-central-1.amazonaws.com/euobs-media/6e5f90e3e78121ba09aefe7419b47a16-480x.jpg", "publishedAt": "2020-03-10T06:23:20Z", "content": "Today, 07:16The European Commission has a new strategy for Africa. The proposal, whose details have yet to be worked out, spans broad issues like climate, energy, digital transformation, jobs, peace, governance, and migration."}, {"source": {"id": null, "name": "Campaignlive.co.uk"}, "author": "Gideon Spanier", "title": "Advertising Week Europe postponed until September over coronavirus concerns", "description": "Organisers moved event from March because of 'public health and safety'.", "url": "https://www.campaignlive.co.uk/article/advertising-week-europe-postponed-until-september-coronavirus-concerns/1676467", "urlToImage": "https://cached.imagescaler.hbpl.co.uk/resize/scaleHeight/815/cached.offlinehbpl.hbpl.co.uk/news/OMC/MattSchecknerHeadshot-20190315030531701-20200310065559125.jpg", "publishedAt": "2020-03-10T06:55:51Z", "content": "Advertising Week Europe, which was due to take place in London on 16 to 19 March, has been cancelled and moved to 14 to 17 September.\r\nThe four-day event is one of the biggest fixtures in the UK advertising calendar, attracting over 20,000 attendees.\r\n\"After … [+1258 chars]"}, {"source": {"id": null, "name": "Protothema.gr"}, "author": "Πρώτο Θέμα", "title": "Coronavirus: These are the high-risk groups – Hygiene measures", "description": "<div class=\"entry-excerpt-in\">\r\n<p>Hygiene measures necessary</p>\r\n</div>\r\n<div class=\"entry-content\">\r\n<div class=\"mlnc-related\">\r\n<div class=\"title_bg\"></div>\r\n</div>\r\n</div>", "url": "https://www.protothema.gr/english-news/article/982786/coronavirus-these-are-the-high-risk-groups-hygiene-measures/", "urlToImage": "https://i1.prth.gr/images/640x360share/files/2020-03-09/vuln77.jpg", "publishedAt": "2020-03-10T06:15:00Z", "content": "Hygiene measures necessary"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "A third Princess cruise ship kept at sea pending virus tests", "description": "These crew members being tested are currently ``asymptomatic`` and are remaining alone in their rooms ``out of an abundance of caution`` as the ship returns to Fort Lauderdale, the company statement said.", "url": "https://indianexpress.com/article/world/a-third-princess-cruise-ship-kept-at-sea-pending-virus-tests/", "urlToImage": "https://images.indianexpress.com/2020/03/AP20069555357633.jpg?w=759", "publishedAt": "2020-03-10T06:17:20Z", "content": "By: Reuters | \r\nPublished: March 10, 2020 11:47:20 am\r\nFILE- In this Thursday, Feb. 13, 2020 file photo, passengers from the Caribbean Princess wait for ground transportation at Port Everglades in Fort Lauderdale (AP)Thousands of passengers on an additional P… [+3953 chars]"}]