[{"source": {"id": null, "name": "Huffpost.com"}, "author": "Reuters", "title": "Investment Advisors Worry U.S. Response To Coronavirus Is Too Little Too Late - HuffPost", "description": "Investment Advisors Worry U.S. Response To Coronavirus Is Too Little Too Late HuffPost If coronavirus spreads within the US, here's how daily life might change CNN Two lessons to be learned in coronavirus outbreak Daily Sabah 5 ways we can prepare for coronav…", "url": "https://www.huffpost.com/entry/investment-advisors-coronavirus-response_n_5e5899b3c5b60102210e9c41", "urlToImage": "https://img.huffingtonpost.com/asset/5e589a2f230000650d0bf4e3.jpeg?ops=1778_1000", "publishedAt": "2020-02-28T04:52:00Z", "content": "NEW YORK, Feb 27 (Reuters) - Investment-advisors are increasingly worried that U.S. authorities are not doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets.\r\nTheir critic… [+4635 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Thailand reports one new coronavirus case, total reaches 41 - health official", "description": "Thailand recorded one new case of coronavirus, bringing the total in the country to 41 since January, a senior health official said on Friday.", "url": "https://www.reuters.com/article/us-china-health-thailand-case-idUSKCN20M0FS", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496309296&w=1200&r=LYNXNPEG1R0A5", "publishedAt": "2020-02-28T04:45:51Z", "content": "BANGKOK (Reuters) - Thailand recorded one new case of coronavirus, bringing the total in the country to 41 since January, a senior health official said on Friday. \r\nThe new case is a 25-year-old Thai man, a tour guide who recently returned from South Korea an… [+437 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Secon and Dana Varinsky", "title": "The US' newest coronavirus patient had no known exposure to anyone sick and hadn't gone to China, which suggests containment might be impossible", "description": "A confirmed coronavirus patient in California had no travel history in China and no known exposure to anyone infected. It's the first potential case of \"community spread\" in the US. One health official said this requires a transition \"from trying to contain t…", "url": "https://www.businessinsider.com/coronavirus-community-spread-us-health-systems-tested-2020-2", "urlToImage": "https://i.insider.com/5e585f25fee23d595b69f1d5?width=1200&format=jpeg", "publishedAt": "2020-02-28T04:49:30Z", "content": "A patient in Solano County, California, has gotten the COVID-19 coronavirus without traveling to China or having any known contact with someone sick, the Centers for Disease Control and Prevention confirmed on Wednesday.\r\n\"This person appears to be a communit… [+6672 chars]"}, {"source": {"id": null, "name": "Digiday.com"}, "author": "Kristina Monllos", "title": "As coronavirus outbreak continues, ad companies restrict travel and encourage remote work", "description": "Agency holding companies are updating travel policies and restricting travel to certain countries and cities amid fears of the coronavirus spreading. The post As coronavirus outbreak continues, ad companies restrict travel and encourage remote work appeared f…", "url": "https://digiday.com/marketing/coronavirus-outbreak-continues-holding-companies-restrict-travel-encourage-remote-work/", "urlToImage": "https://digiday.com/wp-content/uploads/2020/02/coronamask.jpg", "publishedAt": "2020-02-28T05:00:13Z", "content": "Agencies are encouraging remote work and restricting travel to certain countries due to the coronavirus outbreak seizing upeconomies globally.With the fear of contracting coronavirus on the rise, agencies are taking precautions to restrict travel to the affec… [+3588 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Ingraham Angle' panel reacts to CNN's Cuomo likening coronavirus to 9/11 - Fox News", "description": "'Ingraham Angle' panel reacts to CNN's Cuomo likening coronavirus to 9/11 Fox News Right-wing media spreads conspiracy and deny risk of coronavirus - Business Insider Business Insider Fox News hosts accuse Democrats and journalists of 'weaponizing' coronaviru…", "url": "https://www.youtube.com/watch?v=q9xXB-_Bx-Q", "urlToImage": null, "publishedAt": "2020-02-28T05:00:13Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Patrick Frater", "title": "Tokyo Disneyland Theme Parks Closed in Coronavirus Reaction", "description": "The two Disney-branded theme parks in Tokyo, Japan are to close for two weeks as a precaution against the spread of the coronavirus. “Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extraordinary closure from Saturday, Feb 29, 2020, throu…", "url": "https://variety.com/2020/biz/asia/tokyo-disneyland-theme-parks-coronavirus-1203518619/", "urlToImage": "https://pmcvariety.files.wordpress.com/2017/11/tokyo-disneyland-2.jpg?w=700&h=393&crop=1", "publishedAt": "2020-02-28T04:16:08Z", "content": "The two Disney-branded theme parks in Tokyo, Japan are to close for two weeks as a precaution against the spread of the coronavirus.\r\n“Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extraordinary closure from Saturday, Feb 29, 2020, thro… [+1985 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "William Hughes on News, shared by William Hughes to The A.V. Club", "title": "China bans mobile game about pandemics, which should fix everything", "description": "As you may or may not know—based on your own personal exposure to the twin infection vectors of paranoid Facebook posts and dour Twitter threads about U.S. healthcare—the globe is currently facing a teensy little viral pandemic at the moment, as anxieties, fi…", "url": "https://news.avclub.com/china-bans-mobile-game-about-pandemics-which-should-fi-1841965648", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fpspbsg3a7lbpyr6wi2m.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "As you may or may not knowbased on your own personal exposure to the twin infection vectors of paranoid Facebook posts and dour Twitter threads about U.S. healthcarethe globe is currently facing a teensy little viral pandemic at the moment, as anxieties, fina… [+1863 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Lithuania confirms first coronavirus infection", "description": "Lithuania reported its first coronavirus infection on Friday, in a woman who returned this week from a visit to Italy's northern city of Verona, the government said, as the disease spreads rapidly worldwide.", "url": "https://www.reuters.com/article/us-china-health-lithuania-case-idUSKCN20M0E2", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T04:18:11Z", "content": "VILNIUS (Reuters) - Lithuania reported its first coronavirus infection on Friday, in a woman who returned this week from a visit to Italy’s northern city of Verona, the government said, as the disease spreads rapidly worldwide. \r\nHopes that the virus would be… [+521 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "5 Ways To Prevent And Prepare For The Coronavirus: Life Kit - NPR", "description": "5 Ways To Prevent And Prepare For The Coronavirus: Life Kit NPR If coronavirus spreads within the US, here's how daily life might change CNN 5 ways we can prepare for coronavirus | TheHill The Hill How to fight a coronavirus recession The Week NYC Resident Be…", "url": "https://www.npr.org/2020/02/27/810016611/coronavirus-101-what-you-need-to-know-to-prepare-and-prevent", "urlToImage": "https://media.npr.org/assets/img/2020/02/27/lk_coronavirus_grid_wide-99493065e316c4e975b702c9c6fa81a1a344330c.jpg?s=1400", "publishedAt": "2020-02-28T05:03:00Z", "content": "Worried about coronavirus? Keep some non-perishable food items and medicine stocked on hand, and follow flu prevention protocol like sneezing into a tissue, disinfecting surfaces and washing your hands frequently with soap and water.\r\nPhoto Illustration by Ma… [+6579 chars]"}, {"source": {"id": null, "name": "Pocketnow.com"}, "author": "Bruce Lebowitz", "title": "Coronavirus effect: Facebook cancels F8 Developer Conference scheduled in May", "description": "Facebook will organize \"a combo of locally hosted events, videos, and live-streamed content.\" The post Coronavirus effect: Facebook cancels F8 Developer Conference scheduled in May appeared first on Pocketnow.", "url": "https://pocketnow.com/coronavirus-effect-facebook-cancels-f8-developer-conference-scheduled-in-may", "urlToImage": "https://pocketnow.com/wp/../files/2018/05/mark-zuckerberg-facebook-f8-2018.jpg", "publishedAt": "2020-02-28T04:57:36Z", "content": "Facebook F8 Developer Conference attracted over 5,000 people from around the world last year. It was scheduled for May 5 and 6 in San Jose, California this year. However, Facebook has canceled the event due to fears over the coronavirus.\r\nInstead of the F8 ev… [+543 chars]"}, {"source": {"id": null, "name": "Economist.com"}, "author": "The Economist", "title": "In part, the stockmarket’s plunge reflects past complacency", "description": "Covid-19 sparks one of the fastest slides since the second world war", "url": "https://www.economist.com/finance-and-economics/2020/02/28/in-part-the-stockmarkets-plunge-reflects-past-complacency", "urlToImage": "https://www.economist.com/sites/default/files/20200229_FNP507.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "THE SPEED of the sell-off in global stockmarkets is remarkable. On February 19th the S&amp;P 500, Americas main index, reached a record high. Little more than a week later, it has lost one-eighth of its value. The change in mood is astonishing. Last year was … [+3505 chars]"}, {"source": {"id": null, "name": "Oreilly.com"}, "author": "Nat Torkington", "title": "Four short links: 28 February 2020", "description": "Mapping Coronavirus Responsibly (ESRI) — Let’s take a look at how maps can help shape the narrative and, as concern (fear?) grows, how to map the data responsibly. Don’t Use Low-fidelity Prototypes to Test Desirability — One of my favorite techniques for test…", "url": "https://www.oreilly.com/radar/four-short-links-28-february-2020/", "urlToImage": "https://www.oreilly.com/radar/wp-content/uploads/sites/3/2019/06/4_short_links_logo-1400x750.png", "publishedAt": "2020-02-28T05:01:00Z", "content": "Responsible Mapping, Testing Desirability, Data Center Power, and Augmenting Web Apps with Spreadsheets"}, {"source": {"id": null, "name": "Nejm.org"}, "author": "Wei-jie Guan, Zheng-yi Ni, Yu Hu, Wen-hua Liang, Chun-quan Ou, Jian-xing He, Lei Liu, Hong Shan, Chun-liang Lei, David S.C. Hui, Bin Du, Lan-juan Li, Guang Zeng, Kwok-Yung Yuen, Ru-chong Chen, Chun-li Tang, Tao Wang, Ping-yan Chen, Jie Xiang, Shi-yue Li, Jin-lin Wang, Zi-jing Liang, Yi-xiang Peng, Li Wei, Yong Liu, Ya-hua Hu, Peng Peng, Jian-ming Wang, Ji-yang Liu, Zhong Chen, Gang Li, Zhi-jian Zheng, Shao-qin Qiu, Jie Luo, Chang-jiang Ye, Shao-yong Zhu, Nan-shan Zhong", "title": "Clinical Characteristics of Coronavirus Disease 2019 in China", "description": "Original Article from The New England Journal of Medicine — Clinical Characteristics of Coronavirus Disease 2019 in China", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2002032?af=R&rss=currentIssue", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmoa2002032/20200228-02/images/img_small/nejmoa2002032_f1.jpeg", "publishedAt": "2020-02-28T05:00:31Z", "content": "From the State Key Laboratory of Respiratory Disease, National Clinical Research Center for Respiratory Disease, Guangzhou Institute of Respiratory Health, First Affiliated Hospital of Guangzhou Medical University (W.G., W.L., J.H., R.C., C.T., T.W., S.L., Ji… [+3099 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "New York Times", "title": "Iran vice president is one of seven officials to contract coronavirus", "description": "Vice President Masoumeh Ebtekar, Rouhani’s deputy for women’s affairs and the highest-ranking woman in the government, has a confirmed coronavirus infection and is quarantined at home, her deputy said Thursday.", "url": "https://indianexpress.com/article/world/coronavirus-iran-vice-president-masoumeh-ebtekar-6290764/", "urlToImage": "https://images.indianexpress.com/2020/02/iran-coronavirus-759-1.jpg?w=759", "publishedAt": "2020-02-28T04:47:16Z", "content": "Ebtekar, one of four vice presidents, was known to Americans as Mary during the Tehran hostage crisis four decades ago, when, as a young revolutionary, she was a spokeswoman for the captors of the 52 Americans held at the U.S. Embassy.(Written by Farnaz Fassi… [+5865 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Vietnam to suspend visa-free travel for South Koreans: Yonhap", "description": "The Vietnamese government plans to suspend visa-free travel for South Koreans starting on Saturday amid concerns about the coronavirus spreading, Yonhap News Agency said on Friday.", "url": "https://www.reuters.com/article/us-china-health-southkorea-vietnam-idUSKCN20M0ET", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T04:28:05Z", "content": "SEOUL (Reuters) - The Vietnamese government plans to suspend visa-free travel for South Koreans starting on Saturday amid concerns about the coronavirus spreading, Yonhap News Agency said on Friday. \r\nThe South Korean embassy in Vietnam said that it received … [+139 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Raghuram Rajan says fight coronavirus first, worry about stimulus later", "description": "With the spread of coronavirus pushing the world economy toward its worst performance since the financial crisis more than a decade ago, Raghuram Rajan says the best thing governments can do is to fight the epidemic before worrying about stimulus measures.", "url": "https://indianexpress.com/article/business/raghuram-rajan-coronavirus-global-economy-6290795/", "urlToImage": "https://images.indianexpress.com/2018/12/Raghuram-Rajan.jpg?w=759", "publishedAt": "2020-02-28T05:03:53Z", "content": "By: Bloomberg | \r\nPublished: February 28, 2020 10:33:53 am\r\nRaghuram Rajan, former head of the Reserve Bank of India. (PTI Photo)The best economic tonic for the coronavirus shock is to contain its spread and worry about stimulus later, said Raghuram Rajan, fo… [+1730 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Saahil Desai, Christian Paz", "title": "The Atlantic Politics Daily: The American Workplace Isn’t Ready for the Coronavirus", "description": "The guessing game of the stock market in the time of coronavirus fears. Plus: Is there anything Bloomberg’s money can’t buy?", "url": "https://www.theatlantic.com/politics/archive/2020/02/the-american-workplace-isnt-ready-for-the-coronavirus-politics-daily/607231/", "urlToImage": "https://cdn.theatlantic.com/assets/static/a/theatlantic/img/lacroix-default-thumbnail.png", "publishedAt": "2020-02-28T05:00:00Z", "content": "It’s Friday, February 28. South Carolina’s open primaries on Saturday are the final test before Super Tuesday. And President Trump said he would nominate the House Republican John Ratcliffe as director of intelligence (if this sounds familiar, it’s because we… [+4415 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "Tokyo Disneyland And DisneySea Will Close For At Least Two Weeks Because Of Coronavirus", "description": "Tokyo’s two Disney resorts, Disneyland and DisneySea, will be closed for an estimated two weeks because of Japan’s efforts to suppress the spread of the coronavirus in that country. “Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extraor…", "url": "https://deadline.com/2020/02/tokyo-disneyland-disneysea-close-for-two-weeks-coronavirus-1202870480/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/tokyodisneyland.jpg?w=512", "publishedAt": "2020-02-28T04:49:42Z", "content": "Tokyo’s two Disney resorts, Disneyland and DisneySea, will be closed for an estimated two weeks because of Japan’s efforts to suppress the spread of the coronavirus in that country.\r\n“Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extrao… [+882 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Andrew Theen | The Oregonian/OregonLive", "title": "PDX ‘monitoring’ coronavirus, but still business as usual; TriMet working closely with health officials - OregonLive", "description": "PDX ‘monitoring’ coronavirus, but still business as usual; TriMet working closely with health officials OregonLive", "url": "https://www.oregonlive.com/health/2020/02/pdx-monitoring-coronavirus-but-still-business-as-usual-trimet-working-closely-with-health-officials.html", "urlToImage": "https://www.oregonlive.com/resizer/olH7ikTyRX52bl9fiSqPzZOfFHw=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/DVTR2YMKTJHHJCLMRXD5E3ND7Y.jpg", "publishedAt": "2020-02-28T04:24:00Z", "content": "Port of Portland and TriMet officials say theyre keeping close tabs on the latest news and developments surrounding COVID-19, but they havent made any changes in response to the new coronavirus. \r\nBoth transportation entities the Port of Portland owns and ope… [+2876 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Michael Roffman", "title": "Is the Coronavirus Captain Trips?", "description": "The Losers head to the CDC to find out. Is the Coronavirus Captain Trips? Michael Roffman", "url": "https://consequenceofsound.net/2020/02/the-losers-club-coronavirus-captain-trips/", "urlToImage": "https://consequenceofsound.net/wp-content/uploads/2020/02/stephen-king-losers-club-coronavirus.jpg?quality=80", "publishedAt": "2020-02-28T05:08:32Z", "content": "The Losers head to the CDC to evade the Coronavirus.\r\nIt’s there they debate the return of Captain Trips and unpack a Bag of Bones. Topics include: Cocaine Stephen King facelifts, potential Florida monsters for King’s Dominion, and which King creations will b… [+582 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Hugh McIntyre, Contributor, Hugh McIntyre, Contributor https://www.forbes.com/sites/hughmcintyre/", "title": "BTS Cancels Concerts In South Korea Due To Coronavirus Scare", "description": "Fans in South Korea will have to wait to see the band on their next tour.", "url": "https://www.forbes.com/sites/hughmcintyre/2020/02/27/bts-cancels-concerts-in-south-korea-due-to-coronavirus-scare/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1207748663%2F960x0.jpg", "publishedAt": "2020-02-28T04:21:50Z", "content": "NEW YORK, NEW YORK - FEBRUARY 21: (L-R) J-Hope, SUGA, Jungkook, Jimin, RM, V, and Jin of the K-pop ... [+] boy band BTS visit the \"Today\" Show at Rockefeller Plaza on February 21, 2020 in New York City. (Photo by Dia Dipasupil/Getty Images)\r\nGetty Images\r\nThi… [+4131 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/jay-heflin", "title": "'You can't get a straight answer': Businesses struggle to plan through coronavirus damage to Chinese supply chains - Washington Examiner", "description": "The coronavirus outbreak has injected a high level of uncertainty for many businesses who depend on products from China but are clueless as to when they will arrive.", "url": "https://www.washingtonexaminer.com/news/you-cant-get-a-straight-answer-businesses-struggle-to-plan-through-coronavirus-damage-to-chinese-supply-chains", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/5dca723/2147483647/strip/true/crop/3170x1664+0+187/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F85%2Fe4%2F771c8c85423fc19825d101a9c827%2F024f3bc0e52649eaa9ffed5d0e6c2b76.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "The coronavirus outbreak has injected a high level of uncertainty for many businesses who depend on products from China but are clueless as to when they will arrive. \r\nYou cant get a straight answer, said John Mack, president of Frontier Illumination. We talk… [+3411 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "World stocks set for worst week since 2008 as virus stokes recession fears", "description": "MSCI all country world index fell 0.5% after 3.3% drop on Thursday. So far this week it has lost 9.3%, on course for its biggest weekly decline since a 9.8% plunge in November 2008.", "url": "https://indianexpress.com/article/business/world-market/world-stocks-set-for-worst-week-since-2008-as-virus-stokes-recession-fears-6290760/", "urlToImage": "https://images.indianexpress.com/2020/02/tokyo-stock-exchange-asian-markets-759.jpg?w=759", "publishedAt": "2020-02-28T05:04:00Z", "content": "By: Reuters | Tokyo | \r\nPublished: February 28, 2020 10:34:00 am\r\nA visitor takes a photo of screens displaying stock indices at the Tokyo Stock Exchange (TSE), operated by Japan Exchange Group Inc. (JPX), in Tokyo, Japan, on Monday, March 11, 2018. Photograp… [+4941 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Liz Lee", "title": "Malaysia's AirAsia X defers A330neo deliveries as coronavirus crimps demand", "description": "Malaysian long-haul budget airline AirAsia X Bhd said it will defer delivery of 78 Airbus SE A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand.", "url": "https://www.reuters.com/article/us-airasia-group-results-idUSKCN20L1NX", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496304951&w=1200&r=LYNXNPEG1Q0X4", "publishedAt": "2020-02-28T04:29:02Z", "content": "KUALA LUMPUR/SYDNEY (Reuters) - Malaysian long-haul budget airline AirAsia X Bhd (AIRX.KL) said it will defer delivery of 78 Airbus SE (AIR.PA) A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand. \r\nAirAsia X said lat… [+2159 chars]"}, {"source": {"id": null, "name": "Nikkei.com"}, "author": "Nina Xiang", "title": "Coronavirus-fighting tech is strengthening China's mass surveillance - Nikkei Asian Review", "description": "Coronavirus-fighting tech is strengthening China's mass surveillance Nikkei Asian Review", "url": "https://asia.nikkei.com/Opinion/Coronavirus-fighting-tech-is-strengthening-China-s-mass-surveillance", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fs3-ap-northeast-1.amazonaws.com%2Fpsh-ex-ftnikkei-3937bb4%2Fimages%2F7%2F8%2F1%2F8%2F25228187-1-eng-GB%2FR20200227%20QR%20code%20Kuming_2048x1152.jpg?source=nar-cms&width=1024&height=512&fit=cover&gravity=faces", "publishedAt": "2020-02-28T05:00:00Z", "content": "Over the past week, their Lunar New Year absence prolonged by the coronavirus outbreak, Chinese people have been gradually returning to work. As they prepare to leave their hometowns, they can, or are sometimes obliged to, provide personal data such as recent… [+4896 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shivani Bazaz", "title": "Sensex down 1,000 pts. What should MF investors do?", "description": "Sensex down 1,000 pts. What should MF investors do?The Sensex was down 1,128 points or 2.84% at 10:30 am.", "url": "https://economictimes.indiatimes.com/mf/analysis/sensex-down-1000-points-on-coronavirus-scare-what-should-mutual-fund-investors-do/articleshow/74372409.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74372352,width-1070,height-580,imgsize-251123,overlay-etwealthmutualfunds/photo.jpg", "publishedAt": "2020-02-28T04:59:33Z", "content": "Indian stock market lost heavily in the opening trade as inventors became increasingly nervous about a possible coronavirus pandemic. With the deadly virus reaching US shores and reports its detection for the first time in at least 10 countries have shook up … [+2787 chars]"}, {"source": {"id": null, "name": "Wwd.com"}, "author": "Misty White Sidell", "title": "Movado Cancels Davos Watch Conference Over Coronavirus", "description": "Movado has canceled what would have been its third annual watch conference in Davos, Switzerland.", "url": "https://wwd.com/fashion-news/fashion-scoops/movado-cancels-davos-watch-conference-coronavirus-1203515333/", "urlToImage": "https://pmcwwd.files.wordpress.com/2016/12/53-movado.jpg?w=640&h=415&crop=1", "publishedAt": "2020-02-28T05:01:29Z", "content": "The coronavirus has caused another cancellation: Movado’s Swiss watch conference in Davos.\r\nThe watch group has pulled the plug on its event, which had been planned for March 14 to 18, owing to growing concern over the coronavirus in Europe.\r\n“When the virus … [+1353 chars]"}, {"source": {"id": "the-american-conservative", "name": "The American Conservative"}, "author": "Patrick Buchanan", "title": "The Coronavirus is Trump’s Time to Lead", "description": "During this crisis, nations are going to put their people first. As they should. The post The Coronavirus is Trump’s Time to Lead appeared first on The American Conservative.", "url": "https://www.theamericanconservative.com/buchanan/the-coronavirus-is-trumps-time-to-lead/", "urlToImage": "https://www.theamericanconservative.com/wp-content/uploads/2020/02/GettyImages-1208916326.jpg", "publishedAt": "2020-02-28T05:01:55Z", "content": "During this crisis, nations are going to put their people first. As they should.Not until well into the Democratic debate Tuesday night did the COVID-19 coronavirus come up, and it was Mike Bloomberg, not a CBS moderator, who raised it: “The president fired t… [+5007 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "The government's activated its coronavirus emergency plan. Here's what that means for you", "description": "The federal government has pulled the trigger on its emergency response plan for coronavirus. Here's what that means for you.", "url": "https://www.abc.net.au/news/health/2020-02-28/what-coronavirus-emergency-plan-means-for-you/12010056", "urlToImage": "https://www.abc.net.au/cm/rimage/12011780-16x9-large.jpg?v=4", "publishedAt": "2020-02-28T04:26:48Z", "content": "Amid fears the coronavirus outbreak will soon be declared a global pandemic, the Australian Government has pulled the trigger on its emergency response plan and is now operating on the basis the virus is a pandemic.\r\nKey points TEMPLATE\r\nKey points\r\n<ul><li>A… [+5693 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "#39;Slowdown in global oil demand could lead to 2008-like recessionary scenario#39;", "description": "Oil prices are set to crash if the exogenous shock coming out of coronavirus does not stop.", "url": "https://www.moneycontrol.com/news/business/markets/slowdown-in-global-oil-demand-could-lead-to-2008-like-recessionary-scenario-4983521.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/01/crude-oil-770x433.png", "publishedAt": "2020-02-28T04:24:39Z", "content": "Prathamesh Mallya\r\nThe new year has not been good for crude oil as investors have dumped the black gold and turned to gold on account of its safe-haven appeal. Crude oil prices have lost momentum in 2020, with a fall of around 12 percent (for Brent as well as… [+3898 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Holly Secon,Dana Varinsky)", "title": "The US's newest coronavirus patient had no known exposure to anyone sick and hadn't gone to China, which suggests containment might be impossible", "description": "The first coronavirus case from an unknown origin has been reported in the US. It signals a major shift in the outbreak.", "url": "https://news.yahoo.com/us-newest-coronavirus-patient-had-044930490.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/N86oxLKHyexN1h4GsiOiDQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/Kd7qfUsxbIl6qPf5Np9MrA--~B/aD0yMDAwO3c9MjY2NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/bf4a194917742c8c0613d436a37ece4d", "publishedAt": "2020-02-28T04:49:30Z", "content": "UC Davis Medical Center on Thursday in Sacramento, California.\r\nJustin Sullivan/Getty Images\r\n<ul><li>A confirmed coronavirus patient in California had no travel history in China and no known exposure to anyone infected.\r\n</li><li>It could be the first case o… [+7251 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": "Anthony S. Fauci, H. Clifford Lane, Robert R. Redfield", "title": "Covid-19 — Navigating the Uncharted", "description": "Editorial from The New England Journal of Medicine — Covid-19 — Navigating the Uncharted", "url": "https://www.nejm.org/doi/full/10.1056/NEJMe2002387?af=R&rss=currentIssue", "urlToImage": "https://www.nejm.org/templates/jsp/_mms/image/NEJM_defaultlogo_200px.png", "publishedAt": "2020-02-28T05:00:01Z", "content": "The latest threat to global health is the ongoing outbreak of the respiratory disease that was recently given the name Coronavirus Disease 2019 (Covid-19). Covid-19 was recognized in December 2019.1 It was rapidly shown to be caused by a novel coronavirus tha… [+6193 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "India Stocks Extend Slide, Heading for Worst Week in Four Years", "description": "(Bloomberg) -- India stocks tumbled for a sixth day on mounting concerns about the economic impact of the novel coronavirus on the world’s second-most populous nation.The S&P BSE Sensex Index declined 2.9% to 38,581.18 as of 9:52 a.m in Mumbai, set for its wo…", "url": "https://finance.yahoo.com/news/india-stocks-plunge-concerns-grow-035102914.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/55RMWylyFhBYGqXBR4NrhQ--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/bb6ee1b82ebfb39dd54cf16863ea4bea", "publishedAt": "2020-02-28T04:28:12Z", "content": "(Bloomberg) -- India stocks tumbled for a sixth day on mounting concerns about the economic impact of the novel coronavirus on the worlds second-most populous nation.\r\nThe S&amp;P BSE Sensex Index declined 2.9% to 38,581.18 as of 9:52 a.m in Mumbai, set for i… [+1442 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Facebook Cancels F8 Developer Conference Over Global Coronavirus Scare - News18", "description": "Facebook Cancels F8 Developer Conference Over Global Coronavirus Scare News18 Facebook cancels F8 developers conference due to coronavirus, will host online presentations Hindustan Times Coronavirus outbreak: Facebook cancels F8, Microsoft pulls out of Game D…", "url": "https://www.news18.com/news/tech/facebook-cancels-f8-developer-conference-over-global-coronavirus-scare-2518527.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/01/Untitled-design-402.png", "publishedAt": "2020-02-28T04:26:59Z", "content": "Facebook Inc said on Thursday it would cancel its annual developer conference due to fears over the coronavirus, as growing concerns about the economic impact of the global outbreak drove Wall Street to tumble for a sixth straight day. Facebook's F8 conferenc… [+4841 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Gold price today: Coronavirus spread boost safe-haven demand, yellow metal glitters", "description": "Gold prices climbed as worries intensified that the rapidly spreading coronavirus could turn into a pandemic and derail global economic growth.", "url": "https://www.moneycontrol.com/news/business/markets/gold-price-today-coronavirus-spread-boost-safe-haven-demand-yellow-metal-glitters-4985701.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/GOLD-770x433.jpg", "publishedAt": "2020-02-28T04:23:18Z", "content": "Gold prices witnessed healthy gains in the domestic futures trade on February 28 as investors continued buying safe-haven assets avoiding riskier equities amid rising fears of coronavirus becoming a pandemic.\r\nIn the global markets, too, gold prices remained … [+2190 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Liz Lee and Jamie Freed", "title": "Malaysia's AirAsia X defers A330neo deliveries as coronavirus crimps demand", "description": "KUALA LUMPUR/SYDNEY (Reuters) - Malaysian long-haul budget airline AirAsia X Bhd said it will defer delivery of 78 Airbus SE A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand. AirAsia X said late on Thursday it migh…", "url": "https://finance.yahoo.com/news/malaysias-airasia-x-defers-a330neo-041958547.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jL17wXDVBSL.Ssb.cvNHAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzAuNA--/https://s.yimg.com/uu/api/res/1.2/b86pkaNsicZZ7kngH8UxMg--~B/aD01MTk7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/dc423f70d52a08849c986928aea41a53", "publishedAt": "2020-02-28T04:19:58Z", "content": "By Liz Lee and Jamie Freed\r\nKUALA LUMPUR/SYDNEY (Reuters) - Malaysian long-haul budget airline AirAsia X Bhd said it will defer delivery of 78 Airbus SE A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand.\r\nAirAsia X … [+2173 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump dissembling, mixed messages hurt U.S. coronavirus response", "description": "Ron Klain, head of the U.S. response to the Ebola crisis, talks with Rachel Maddow about the problem of Donald Trump's dishonesty combined with the administration's micromanaging of information for government experts hurting the important, necessary messaging…", "url": "https://www.msnbc.com/rachel-maddow/watch/trump-dissembling-mixed-messages-hurt-u-s-coronavirus-response-79588421960", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_maddow_klain_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:54:44Z", "content": null}, {"source": {"id": null, "name": "Nejm.org"}, "author": "Wei-jie Guan, Zheng-yi Ni, Yu Hu, Wen-hua Liang, Chun-quan Ou, Jian-xing He, Lei Liu, Hong Shan, Chun-liang Lei, David S.C. Hui, Bin Du, Lan-juan Li, Guang Zeng, Kwok-Yung Yuen, Ru-chong Chen, Chun-li Tang, Tao Wang, Ping-yan Chen, Jie Xiang, Shi-yue Li, Jin-lin Wang, Zi-jing Liang, Yi-xiang Peng, Li Wei, Yong Liu, Ya-hua Hu, Peng Peng, Jian-ming Wang, Ji-yang Liu, Zhong Chen, Gang Li, Zhi-jian Zheng, Shao-qin Qiu, Jie Luo, Chang-jiang Ye, Shao-yong Zhu, Nan-shan Zhong", "title": "Clinical Characteristics of Coronavirus Disease 2019 in China", "description": "Original Article from The New England Journal of Medicine — Clinical Characteristics of Coronavirus Disease 2019 in China", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2002032?af=R", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmoa2002032/20200228-02/images/img_small/nejmoa2002032_f1.jpeg", "publishedAt": "2020-02-28T05:00:31Z", "content": "From the State Key Laboratory of Respiratory Disease, National Clinical Research Center for Respiratory Disease, Guangzhou Institute of Respiratory Health, First Affiliated Hospital of Guangzhou Medical University (W.G., W.L., J.H., R.C., C.T., T.W., S.L., Ji… [+3099 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "India temporarily suspends visa on arrival for Japanese, South Korean nationals amid coronavirus fears", "description": "The development comes a day after India evacuated 119 Indians and 5 foreigners who were on board the coronavirus-hit cruise ship, Diamond Princess, moored off the Japanese coast.", "url": "https://www.moneycontrol.com/news/india/india-temporarily-suspends-visa-on-arrival-for-japanese-south-korean-nationals-amid-coronavirus-fears-4985911.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/03/H1b_visa_-770x433.jpg", "publishedAt": "2020-02-28T05:10:06Z", "content": "India has temporarily suspended visa on arrival services for nationals of Japan and South Korea in view of the surge in the number of coronavirus cases in the two countries, the Indian embassy here said on Friday.\r\nThe development comes a day after India evac… [+1585 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "COVID-19 a reminder of the challenge of emerging infectious diseases", "description": "The emergence and rapid increase in cases of coronavirus disease 2019 (COVID-19), a respiratory illness caused by a novel coronavirus, pose complex challenges to the global public health, research and medical communities, write federal scientists from NIH's N…", "url": "https://www.eurekalert.org/pub_releases/2020-02/nioa-car022820.php", "urlToImage": "https://eurekalert.org/multimedia/pub/web/225687_web.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "IMAGE: This transmission electron microscope image shows SARS-CoV-2 -- also known as 2019-nCoV, the virus that causes COVID-19 -- isolated from a patient in the US. Virus particles are shown emerging...\r\n view more \r\nCredit: NIAID-RML\r\nWHAT:\r\nThe emergence an… [+3793 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Sethuraman N R", "title": "Sensex, Nifty set for worst week in four years as pandemic worries escalate", "description": "Indian shares fell on Friday, tracking steep falls in world markets, and set for their worst week in four years on growing fears that the coronavirus outbreak could turn into a pandemic and derail global growth. The Nifty fell 2.5% to 11,341.65 by 0348 GMT an…", "url": "https://finance.yahoo.com/news/sensex-nifty-set-worst-week-042811065.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aEDZME65hWM1mit3AzT7qQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDg-/https://s.yimg.com/uu/api/res/1.2/pYlcCQeVP4EVGEF.XTE6Og--~B/aD01MDU7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/82acb875df45dc8f7d4291928ee70368", "publishedAt": "2020-02-28T04:28:11Z", "content": "By Sethuraman N R\r\nBENGALURU (Reuters) - Indian shares fell on Friday, tracking steep falls in world markets, and set for their worst week in four years on growing fears that the coronavirus outbreak could turn into a pandemic and derail global growth.\r\nInves… [+1513 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Bloodbath on D-Street! Sensex plunges 1,000 pts; 5 factors weighing on market", "description": "Sectorally, selling pressure was seen in metals, realty, infrastructure, public sector, capital goods, auto, banks, Oil & Gas, as well as IT stocks.", "url": "https://www.moneycontrol.com/news/business/markets/bloodbath-on-d-street-sensex-plunges-1000-pts-5-factors-weighing-on-market-4985811.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/03/Sensex_BSE_Nifty_NSE_Stock-market_stocks_1280x720-16-770x433.png", "publishedAt": "2020-02-28T04:53:50Z", "content": "Tracking weakness in global markets, Indian indices witnessed a knee-jerk reaction which took benchmark indices to nearly 5-month low. The S&amp;P BSE Sensex suffered a gap down of more than 1,000 points while Nifty50 broke below 11,300 levels in intraday tra… [+5578 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Doctor: WH coronavirus response a ‘colossal failure’", "description": "Dr. Matthew McCarthy, an infectious disease doctor and the author of \"Superbugs: The Race To Stop An Epidemic\" tells Lawrence O'Donnell it is \"outrageous\" that the Trump admin. is not focusing on making test kits available to measure and treat coronavirus cas…", "url": "https://www.msnbc.com/the-last-word/watch/doctor-wh-coronavirus-response-a-colossal-failure-79587909604", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202002/MCCARTHY_0227.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:20:54Z", "content": "Dr. Matthew McCarthy, an infectious disease doctor and the author of \"Superbugs: The Race To Stop An Epidemic\" tells Lawrence O'Donnell it is \"outrageous\" that the Trump admin. is not focusing on making test kits available to measure and treat coronavirus cas… [+15 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Sam Bourgi", "title": "Atlanta Fed’s Q1 GDP Forecast Is Almost as Laughable as the Fed Itself", "description": "The Atlanta Fed's latest GDP forecast seems to short-change the disruptive impact of coronavirus on the U.S. economy. The post Atlanta Fed’s Q1 GDP Forecast Is Almost as Laughable as the Fed Itself appeared first on CCN.com", "url": "https://www.ccn.com/atlanta-feds-q1-gdp-forecast-is-almost-as-laughable-as-the-fed-itself/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/Atlanta-Fed-President.jpg", "publishedAt": "2020-02-28T04:38:23Z", "content": "<ul><li>The Atlanta Feds GDP Tracker is projecting annual growth of 2.7% in the first quarter despite the onset of coronavirus.</li><li>If the forecast holds, it would mark the highest rate of expansion for the U.S. economy since Q1 2019.</li><li>Fed prognost… [+4208 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "DEE-ANN DURBIN, ANNE D'INNOCENZIO and JOSEPH PISANI", "title": "Coronavirus fear touches off a global run on face masks", "description": "Fear of the spreading coronavirus has led to a global run on sales of face masks despite medical experts’ advice that most people who aren’t sick don’t need to wear them. Many businesses are sold out, while others are limiting how many a customer can buy. Ama…", "url": "https://www.seattletimes.com/business/coronavirus-fear-touches-off-a-global-run-on-face-masks/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-47cb31b7d76bd32b3bed6b999bbf162fVirus_Outbreak_Face_Mask_Shortages_37626-1200x630.jpg", "publishedAt": "2020-02-28T05:01:12Z", "content": "Fear of the spreading coronavirus has led to a global run on sales of face masks despite medical experts’ advice that most people who aren’t sick don’t need to wear them.\r\nMany businesses are sold out, while others are limiting how many a customer can buy. Am… [+6634 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Lithuania Confirms Its First Coronavirus Case", "description": "The new disease originated in the Chinese city of Wuhan and has already spread to over 30 countries across the globe. The coronavirus has now hit Europe, with Italy where over 500 people have already been infected experiencing a major outbreak.", "url": "https://sputniknews.com/europe/202002281078425227-lithuania-confirms-its-first-coronavirus-case/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107842/53/1078425300.jpg", "publishedAt": "2020-02-28T04:38:53Z", "content": null}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "James Goyder", "title": "ONE: ‘King Of The Jungle’ Preview (Pt. 2)", "description": "ONE “King of the Jungle” preview (Pt. 2) ahead of the MMA event set for the Singapore Indoor Stadium on Friday. It will take place behind closed doors due to concerns over the coronavirus.", "url": "https://www.mmamania.com/2020/2/27/21152296/one-king-of-the-jungle-preview-pt-2-singapore-mma", "urlToImage": "https://cdn.vox-cdn.com/thumbor/tjW1WcLsq4n_cyz5VOwvqcUaf_s=/0x30:779x438/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19744745/King_of_the_Jungle.jpg", "publishedAt": "2020-02-28T04:30:00Z", "content": "For part one of our preview click here. ONE: “King of the Jungle” is set for the Singapore Indoor Stadium on Friday. It will take place behind closed doors due to concerns over the coronavirus. A few fights have fallen through for the same reason but there wi… [+2812 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Daniel Leussink", "title": "Japan's January factory output beats forecasts but slowdown expected", "description": "Japan's factory output rose more than expected in January, providing some relief for policymakers amid heightened risks of a recession as the coronavirus outbreak in China disrupts supply chains and business activity. Official data on Friday showed factory ou…", "url": "https://finance.yahoo.com/news/japans-january-factory-output-beats-043450916.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/wYQdOzQg_EJ2I.M2G1WYKQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDAuOA--/https://s.yimg.com/uu/api/res/1.2/dhYEjn6AQXmR_ZE3CcutQA--~B/aD01NjM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/31075eaddbe25ddcbc737620d2a1c710", "publishedAt": "2020-02-28T04:34:50Z", "content": "By Daniel Leussink\r\nTOKYO (Reuters) - Japan's factory output rose more than expected in January, providing some relief for policymakers amid heightened risks of a recession as the coronavirus outbreak in China disrupts supply chains and business activity.\r\nTh… [+3356 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump team's coronavirus rhetoric at odds with scientists and health experts", "description": "The Trump White House's upbeat response to the coronavirus health scare is directly at odds with the federal government's own scientists and health experts.", "url": "https://www.msnbc.com/11th-hour/watch/trump-team-s-coronavirus-rhetoric-at-odds-with-scientists-and-health-experts-79587397970", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_bwms_science_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:13:50Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Long list of tasks awaits would-be managers of coronavirus outbreak", "description": "Dr. Ezekiel Emanuel, former Obama health policy adviser, talks with Rachel Maddow about some of the steps that would be taken by anyone wishing to properly manage the preparation and response to the potential spread of coronavirus in the United States.", "url": "http://www.msnbc.com/rachel-maddow/watch/long-list-of-tasks-awaits-would-be-managers-of-coronavirus-outbreak-79587909672", "urlToImage": null, "publishedAt": "2020-02-28T04:30:22Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Akanksha Rana and Yingzhi Yang", "title": "Baidu says first-quarter revenue may tumble as coronavirus takes toll on business, advertising", "description": "\"The rebound of the economy after the outbreak will continue to be a long-term project,\" Baidu CEO Robin Li said in an internal letter obtained by Reuters. The potential fall for first-quarter core revenue - sales made from advertising - was even steeper, wit…", "url": "https://finance.yahoo.com/news/baidu-says-first-quarter-revenue-041405862.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2SYENVrOTsiohPT3XxlG8A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/otcNnmD58PaAWQV2fIme9w--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0f2d408d52cc83e378b7aba18e83631e", "publishedAt": "2020-02-28T04:14:05Z", "content": "By Akanksha Rana and Yingzhi Yang\r\n(Reuters) - Baidu Inc, China's biggest search engine company, said first-quarter revenue could fall as much as 13% from a year earlier as the coronavirus epidemic puts the brakes on economic activity and advertising.\r\nIt exp… [+2100 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Cho Mu-Hyun", "title": "Hyundai suspends factory production after worker tests positive for coronavirus", "description": "It is the latest South Korean firm to have its operations directly impacted by the coronavirus outbreak.", "url": "https://www.zdnet.com/article/hyundai-suspends-factory-production-after-worker-tests-positive-for-coronavirus/", "urlToImage": "https://zdnet2.cbsistatic.com/hub/i/r/2017/06/30/7b90964e-687f-455c-91d0-c198eff59057/thumbnail/770x578/c331d974f63cbf28a7a4173026c082d5/hyundai-cisco-smart-connected-cars.jpg", "publishedAt": "2020-02-28T05:10:00Z", "content": "Hyundai Motor Company has shut down one of its car factories in South Korea after it was revealed an employee had contracted the novel coronavirus.\r\nSince Friday, production at one of Hyundai's factories in its Ulsan Plant has been suspended. The employee tha… [+1173 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | Nigeria confirms coronavirus case, first in sub-Saharan Africa", "description": "Nigeria on Friday announced the first confirmed case of the novel coronavirus in sub-Saharan Africa.", "url": "https://www.news24.com/Africa/News/nigeria-confirms-coronavirus-case-first-in-sub-saharan-africa-20200228", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9837/9723ed3c70584e808113f55b4bc5f83f.jpg", "publishedAt": "2020-02-28T04:47:49Z", "content": "Nigeria on Friday announced the first confirmed case of the novel coronavirus in sub-Saharan Africa.\r\nThe case is an Italian citizen who works in Nigeria and returned from Milan earlier this week, Health Minister Osagie Ehanire said in a statement on Twitter.… [+1808 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US Intelligence Agencies Monitoring Foreign States' Responses to Coronavirus Outbreak – Report", "description": "The virus, which originated in the Chinese city of Wuhan in late December 2019, has taken the lives of about 2,700 people worldwide, as it continues to spread to other countries around the globe causing a panic.", "url": "https://sputniknews.com/us/202002281078425189-us-intelligence-agencies-monitoring-foreign-states-responses-to-coronavirus-outbreak--report/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107842/52/1078425242.jpg", "publishedAt": "2020-02-28T04:33:44Z", "content": "The virus, which originated in the Chinese city of Wuhan in late December 2019, has taken the lives of about 2,700 people worldwide, as it continues to spread to other countries around the globe causing a panic.US intelligence agencies have been following the… [+2085 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "JON GAMBRELL", "title": "Four-time Tour de France winner Chris Froome quarantined after UAE cycling race canceled", "description": "In Abu Dhabi, the capital of the UAE, its sports council said two Italians involved in the race tested positive for the new coronavirus. It said it would cancel the two remaining legs of the competition in Abu Dhabi.", "url": "https://www.bostonglobe.com/2020/02/28/sports/four-time-tour-de-france-winner-chris-froome-quarantined-after-uae-cycling-race-canceled/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/y9gNLyHaKfnnnB8sRj5fK5-jAQ0=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/TEBVGK7RRBAQJGBLLMOCTHAWH4.jpg", "publishedAt": "2020-02-28T04:25:23Z", "content": "DUBAI, United Arab Emirates A major cycling race in the United Arab Emirates was canceled early Friday after two Italians tested positive for the new coronavirus, setting off a quarantine that also ensnared four-time Tour de France winner Chris Froome of Brit… [+2425 chars]"}, {"source": {"id": null, "name": "Chinadigitaltimes.net"}, "author": "Josh Rudolph", "title": "Coronavirus Censorship and Spin Draw Public Backlash", "description": "Despite the lessons thought to have been learned after the 2002 SARS epidemic, Chinese authorities have been readily using censorship and propaganda amid the outbreak of COVID-19", "url": "https://chinadigitaltimes.net/2020/02/coronavirus-censorship-and-spin-draw-public-backlash/", "urlToImage": null, "publishedAt": "2020-02-28T04:25:28Z", "content": "Despite the lessons thought to have been learned after the 2002 SARS epidemic, Chinese authorities have been readily using censorship and propaganda amid the outbreak of COVID-19 novel coronavirus–which some see as a contributing factor to the severity of its… [+12449 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ed Mazza", "title": "Late-Night Hosts Cough All Over Trump’s ‘Ludicrous’ Coronavirus Attack Plan", "description": "TV hosts spread infectious laughs as the virus continues to spread around the world.", "url": "https://www.huffpost.com/entry/late-night-hosts-trump-coronavirus_n_5e587d75c5b6450a30bc5c7b", "urlToImage": "https://img.huffingtonpost.com/asset/5e588da92300005f0d39c665.jpeg?cache=dnckcZ3D0g&ops=1200_630", "publishedAt": "2020-02-28T04:17:35Z", "content": "The markets sank again on Thursday amid fears over the COVID-19 coronavirus infection rapidly spreading around the world. \r\nBut on TV, the late-night hosts were fighting fear with comedy. \r\nNBC’s Seth Meyers lamented that the nation’s health and safety were n… [+1318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths, CNN", "title": "Novel coronavirus sparks massive US stock market losses as cases spread worldwide", "description": "Stock markets in the US have posted some of their worst ever losses as the novel coronavirus sparked mass sell-offs.", "url": "https://www.cnn.com/2020/02/27/asia/novel-coronavirus-covid-19-update-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228092819-coronavirus-0228-japan-01-super-tease.jpg", "publishedAt": "2020-02-28T04:14:35Z", "content": "Hong Kong (CNN)Stock markets in the US have posted some of their worst ever losses as the novel coronavirus sparked mass sell-offs. \r\nThe Dow dropped 1,191 points on Thursday, in its worst one-day point drop in history, while the S&amp;P 500 posted its worst … [+6230 chars]"}, {"source": {"id": null, "name": "Wwd.com"}, "author": "Booth Moore", "title": "Moore From L.A.: At Paris Fashion Week, Air Kissing Is Out, Hand Sanitizer In", "description": "How the most social creatures on earth are adapting to \"social distancing.\"", "url": "https://wwd.com/fashion-news/fashion-features/paris-fashion-week-coronavirus-effects-1203514619/", "urlToImage": "https://pmcwwd.files.wordpress.com/2020/02/shutterstock_editorial_10564637s.jpg?w=640&h=415&crop=1", "publishedAt": "2020-02-28T05:01:58Z", "content": "The LVMH Prize cocktail party is the latest cancellation at a Paris Fashion Week gripped with anxiety over coronavirus, where bottles of hand sanitizer, not perfume, were door gifts at the Paco Rabanne show held Thursday at the Conciergerie, the historic Fren… [+5864 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Quarantine on cruise ship resulted in more Corona patients", "description": "The cruise ship Diamond Princess was quarantined for over two weeks resulting in more coronavirus infected passengers than if they would have disembarked immediately. Rather the opposite to what was intended. This according to a study conducted at Umeå Univer…", "url": "https://www.eurekalert.org/pub_releases/2020-02/uu-qoc022820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/225701_web.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "IMAGE: Professor at the Department of Public Health and Clinical Medicine, Umeå University, Sweden\r\n view more \r\nCredit: Mattias Pettersson\r\nThe cruise ship Diamond Princess was quarantined for over two weeks resulting in more coronavirus infected passengers … [+2045 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": "Ross A. Lincoln", "title": "Disney’s Tokyo Theme Parks to Shut Down for 2 Weeks in Response to Coronavirus Worries", "description": "Both of Disney’s Tokyo theme parks will shut down for two weeks in response to the growing worries about the spread of coronavirus, the company that runs the park announced Thursday. Oriental Land, which runs Tokyo Disneyland and Tokyo DisneySea, said in a st…", "url": "http://www.thewrap.com/disneys-tokyo-theme-parks-to-shut-down-for-2-weeks-in-response-to-coronavirus-worries/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2020/02/Tokyo-Disneyland-Getty-Images.jpg", "publishedAt": "2020-02-28T05:07:11Z", "content": "Both of Disney’s Tokyo theme parks will shut down for two weeks in response to the growing worries about the spread of coronavirus, the company that runs the park announced Thursday.\r\nOriental Land, which runs Tokyo Disneyland and Tokyo DisneySea, said in a s… [+13687 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Japan#39;s January factory output beats forecasts but slowdown expected", "description": "The world#39;s third-largest economy shrank at the fastest pace in almost six years in the December quarter as a nationwide tax hike hurt business and consumer spending and soft overseas demand hit exports.", "url": "https://www.moneycontrol.com/news/world/japans-january-factory-output-beats-forecasts-but-slowdown-expected-4985821.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/03/steel_plant_arcellormittal_720-770x433.jpg", "publishedAt": "2020-02-28T04:41:02Z", "content": "Japan's factory output rose more than expected in January, providing some relief for policymakers amid heightened risks of a recession as the coronavirus outbreak in China disrupts supply chains and business activity.\r\nThe world's third-largest economy shrank… [+3154 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Rep. Garamendi: Trump admin coronavirus response ‘reprehensible,’ ‘dangerous’", "description": "Rep. John Garamendi, whose constituent has been infected with coronavirus, slams the Trump administration's response to the outbreak. He says officials don't know who is ill and early testing is not allowed to be done. Garamendi says the result \"God help us, …", "url": "https://www.msnbc.com/the-last-word/watch/rep-garamendi-trump-admin-coronavirus-response-reprehensible-dangerous-79589445504", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_lw_garamendi_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:21:40Z", "content": "Rep. John Garamendi, whose constituent has been infected with coronavirus, slams the Trump administration's response to the outbreak. He says officials don't know who is ill and early testing is not allowed to be done. Garamendi says the result \"God help us, … [+29 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Rpts: Trump team's coronavirus response mired by protocol breakdown", "description": "The Washington Post was first to break the news of a whistleblower who says federal workers greeted evacuated Americans returning from the center of the coronavirus outbreak in China without proper training or infection control protection leading to", "url": "http://www.msnbc.com/11th-hour/watch/rpts-trump-team-s-coronavirus-response-mired-by-protocol-breakdown-79587909546", "urlToImage": null, "publishedAt": "2020-02-28T04:11:47Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump's handling of coronavirus 'could go off the rails'", "description": "Philip Rucker of The Washington Post reports his sources inside the White House say aides are concerned with how Trump will handle the delicate response needed to a public health scare like coronavirus.", "url": "https://www.msnbc.com/11th-hour/watch/trump-s-handling-of-coronavirus-could-go-off-the-rails-79589445567", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_bwms_rails_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:36:20Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Psychiatrist on Trump’s ‘dangerous’ response to coronavirus crisis", "description": "Dr. Lance Dodes, a contributor to bestselling “Dangerous Case of Donald Trump,” tells Lawrence O’Donnell that President Trump is a “con man” who is making the current public health crisis “all about himself”- which could have grave results for Americans.", "url": "http://www.msnbc.com/the-last-word/watch/psychiatrist-on-trump-s-dangerous-response-to-coronavirus-crisis-79587909614", "urlToImage": null, "publishedAt": "2020-02-28T04:21:20Z", "content": null}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Peter Weber", "title": "The Daily Show's Jordan Klepper and Roy Wood Jr. poll black voters in South Carolina, ask: 'Who is Tom Steyer!?!'", "description": "Every political ad in South Carolina ahead of Saturday's Democratic presidential primary seems to feature former President Barack Obama, 'so it seems a lot of white folks think standing next to a cool black person gives them legitimacy,' Jordan Klepper said o…", "url": "https://theweek.com/speedreads/898807/daily-shows-jordan-klepper-roy-wood-jr-poll-black-voters-south-carolina-ask-who-tom-steyer", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/screen_shot_2020-02-27_at_10.39.07_pm.jpg?itok=VBamq9aV", "publishedAt": "2020-02-28T04:56:59Z", "content": "Federal health employees who met coronavirus evacuees at two California military bases earlier this year did not receive proper training in safety protocols until five days after their arrival, a whistleblower said.\r\nThe New York Timesobtained a portion of th… [+1718 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Facebook cancels annual conference as virus fears rattle firms - Aljazeera.com", "description": "Facebook cancels annual conference as virus fears rattle firms Aljazeera.com Daily Crunch: Facebook cancels F8 over coronavirus concerns TechCrunch Coronavirus concerns prompt cancellation of Facebook F8 developer conference CNET Facebook Cancels Its Biggest …", "url": "https://www.aljazeera.com/ajimpact/facebook-cancels-annual-conference-virus-fears-rattle-firms-200228030208672.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/1/29/b5826666a88246f198f40e4d2d1fe419_18.jpg", "publishedAt": "2020-02-28T05:07:00Z", "content": "Facebook Inc is cancelling its annual developer conference due to fears over the coronavirus, as growing concerns about the economic effects of the global outbreak drove stocks in the United States to tumble for a sixth straight day.\r\nFacebook's F8 conference… [+4813 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "New Zealand confirms first case of COVID-19: Health Ministry", "description": "“Although we have our first case of COVID-19, the chances of community outbreak remain low,” it said in a statement.", "url": "https://www.thehindu.com/news/international/new-zealand-confirms-first-case-of-covid-19-health-ministry/article30939879.ece", "urlToImage": "https://www.thehindu.com/news/international/5zxcwe/article30789473.ece/ALTERNATES/LANDSCAPE_615/BreakNews", "publishedAt": "2020-02-28T04:59:18Z", "content": "New Zealand's Health Ministry on Friday confirmed the country's first case of coronavirus in a person who recently returned from Iran.\r\nThe person, who is in their 60s, tested positive in results that were formally reported earlier in the day, the ministry sa… [+241 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Is Trump team's coronavirus response making things worse on Wall Street?", "description": "Stock markets hate uncertainty. So we discuss with NBC News Sr. Business Correspondent Stephanie Ruhle how the confused coronavirus messaging from the Trump administration could be making things worse for investors.", "url": "https://www.msnbc.com/11th-hour/watch/is-trump-team-s-coronavirus-response-making-things-worse-on-wall-street-79588421606", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_bwms_stocks_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T04:22:53Z", "content": null}, {"source": {"id": null, "name": "Independenttribune.com"}, "author": "Mark Plemmons mplemmons@independenttribune.com", "title": "Friday Five: Follow your mama's advice | Business - Independent Tribune", "description": "No doubt your mom or grandmother gave you this advice: Wash your hands. Cover your mouth when you cough or sneeze. Stay home if you are sick. It applies now", "url": "https://www.independenttribune.com/business/friday-five-follow-your-mama-s-advice/article_37e2cc26-885a-5316-be4a-75ff15731b95.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/independenttribune.com/content/tncms/assets/v3/editorial/4/e5/4e56375d-5439-5d21-989f-7eed8f08fd48/5e582384cc087.image.jpg?crop=1848%2C1040%2C0%2C41&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-02-28T05:00:00Z", "content": "No doubt your mom or grandmother gave you this advice: Wash your hands. Cover your mouth when you cough or sneeze. Stay home if you are sick. It applies now more than ever.\r\nLets be serious for a couple of minutes, before the rants begin. Everybodys all hyped… [+5668 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Sunwolves' matches moved from Japan to Australia over coronavirus", "description": "The Japan-based Sunwolves' Super Rugby matches at home to the ACT Brumbies and Canterbury Crusaders have been moved to Australia over the coronavirus outbreak, the governing body SANZAAR said in a statement on Friday. The Sunwolves were due to host the Brumbi…", "url": "https://japantoday.com/category/sports/update-1-sports-sunwolves-matches-moved-from-japan-to-australia-over-coronavirus", "urlToImage": null, "publishedAt": "2020-02-28T04:46:46Z", "content": "The Japan-based Sunwolves' Super Rugby matches at home to the ACT Brumbies and Canterbury Crusaders have been moved to Australia over the coronavirus outbreak, the governing body SANZAAR said in a statement on Friday.\r\nThe Sunwolves were due to host the Brumb… [+1944 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "MORE ON THE CORONAVIRUS OUTBREAK, from Trent Telenko. “In hindsight the gloom and doom CDC newsconf…", "description": "MORE ON THE CORONAVIRUS OUTBREAK, from Trent Telenko. “In hindsight the gloom and doom CDC newsconference Tuesday by Doctor Nancy Messonnier, the Director of the National Center for Immunization and Respiratory Disease in the CDC seems to be an attempt to dis…", "url": "https://pjmedia.com/instapundit/359784/", "urlToImage": null, "publishedAt": "2020-02-28T04:51:00Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "New Zealand confirms first coronavirus case, Thailand reports a new case", "description": "According to RNZ News, New Zealand’s health authorities confirmed the first case of coronavirus. more to come ...", "url": "https://www.fxstreet.com/news/new-zealand-confirms-first-coronavirus-case-thailand-reports-a-new-case-202002280446", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Oceania/NewZealand/beehive-in-wellington-62780778_Large.jpg", "publishedAt": "2020-02-28T04:46:04Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "‘People’s lives will be lost’: Psychiatrist warns ‘sociopath’ Trump is ‘getting worse’ — and failing in coronavirus response", "description": "President Donald Trump’s psychological problems are getting worse and could be consequential as America faces a potential COVID-19 coronavirus pandemic. MSNBC’s Lawrence O’Donnell on Thursday interviewed Dr. Lance Dodes, a former assistant clinical professor …", "url": "https://www.rawstory.com/2020/02/peoples-lives-will-be-lost-psychiatrist-warns-sociopath-trump-is-getting-worse-and-failing-in-coronavirus-response/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Dr-Lance-Dodes.png", "publishedAt": "2020-02-28T04:47:42Z", "content": "President Donald Trump’s psychological problems are getting worse and could be consequential as America faces a potential COVID-19 coronavirus pandemic.\r\nMSNBC’s Lawrence O’Donnell on Thursday interviewed Dr. Lance Dodes, a former assistant clinical professor… [+779 chars]"}, {"source": {"id": null, "name": "Sport24.co.za"}, "author": null, "title": "Sport24.co.za | Sunwolves games moved to Australia over coronavirus fears", "description": "Australia will host two Super Rugby home games of the Sunwolves after they were relocated from Japan due to fears over the coronavirus.", "url": "https://www.sport24.co.za/Rugby/SuperRugby/sunwolves-games-moved-to-australia-over-coronavirus-fears-20200228", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/2682/055f4ec9f5b04c909d57574770882bcf.jpg", "publishedAt": "2020-02-28T04:36:18Z", "content": "Sydney - Australia will host two Super Rugby home games of the Sunwolves after they were relocated from Japan on Friday due to fears over the deadly coronavirus epidemic.\r\nThe Sunwolves were due to host the Brumbies in Osaka on March 8, but that game will now… [+1705 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "'No one cares': Locked-in Wuhan residents adapt to find food", "description": "The lockdown of Guo Jing's neighbourhood in Wuhan ?- the city at the heart of China's new coronavirus epidemic ?- came suddenly and without warning.", "url": "https://www.channelnewsasia.com/news/asia/wuhan-covid-19-coronavirus-residents-12479982", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12479980/16x9/991/557/c0ff34e0c392c6fc0b4d69ee4805d003/Wr/many-wuhan-communities-have-resorted-to-bulk-buying-services-to-have-food-and-other-items-delivered-to-their-homes-1582863991550-2.jpg", "publishedAt": "2020-02-28T04:40:47Z", "content": "BEIJING: The lockdown of Guo Jing's neighbourhood in Wuhan - the city at the heart of China's coronavirus epidemic - came suddenly and without warning.\r\nUnable to go out, the 29-year-old is now sealed inside her compound where she has to depend on online grou… [+4619 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Stratfor Worldview", "title": "Here's How the Coronavirus Could Take Down China's Tech Companies", "description": "Stratfor Worldview Economics, Asia Not good. Without question, the new coronavirus has taken a toll on China and many other places in the world, infecting at least 30,600 people and killing 633 as of Feb. 7. But only now, as the Lunar New Year holiday draws t…", "url": "https://nationalinterest.org/blog/buzz/heres-how-coronavirus-could-take-down-chinas-tech-companies-127807", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/2020-02-27T221205Z_510116382_RC2A9F9CUY8C_RTRMADP_3_CHINA-HEALTH-USA-PREPAREDNESS.jpg", "publishedAt": "2020-02-28T04:30:00Z", "content": "Without question, the new coronavirus has taken a toll on China and many other places in the world, infecting at least 30,600 people and killing 633 as of Feb. 7. But only now, as the Lunar New Year holiday draws to a close, is Beijing preparing to assess jus… [+9931 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Israelis abroad debate whether third vote in a year worth the trip home", "description": "With no absentee ballot and seemingly endless voting, some are opting to save the hassle and airfare cost, or take a vacation instead. Coronavirus fears and AIPAC aren't helping", "url": "https://www.timesofisrael.com/israelis-abroad-debate-whether-third-vote-in-a-year-worth-the-trip-home/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/02/F200224FF00009-1024x640.jpg", "publishedAt": "2020-02-28T04:42:26Z", "content": "JTA — Five years ago this week, Amos Geva took an EasyJet flight from Berlin to Israels Ben Gurion Airport for a very short visit home.\r\nOn his agenda: dinner with his family, a trip to the ballot box and media interviews about his efforts to encourage Israel… [+7421 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "AJR: Novel coronavirus (COVID-19) imaging features overlap with SARS and MERS", "description": "Although COVID-19's imaging features are variable and nonspecific, the findings thus far do show ''significant overlap'' with those of severe acute respiratory syndrome and Middle East respiratory syndrome. According to AJR, the early evidence suggests that i…", "url": "https://www.eurekalert.org/pub_releases/2020-02/arrs-anc022820.php", "urlToImage": "https://eurekalert.org/multimedia/pub/web/225689_web.jpg", "publishedAt": "2020-02-28T05:00:00Z", "content": "IMAGE: Note--SARS = severe acute respiratory syndrome, MERS = Middle East respiratory syndrome, COVID-19 = coronavirus disease 2019, GGO = ground-glass opacity, ARDS = acute respiratory distress syndrome.\r\naOver a period of...\r\n view more \r\nCredit: American J… [+2685 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": "Bill Gates", "title": "Responding to Covid-19 — A Once-in-a-Century Pandemic?", "description": "Perspective from The New England Journal of Medicine — Responding to Covid-19 — A Once-in-a-Century Pandemic?", "url": "https://www.nejm.org/doi/full/10.1056/NEJMp2003762?af=R&rss=currentIssue", "urlToImage": "https://www.nejm.org/templates/jsp/_mms/image/NEJM_defaultlogo_200px.png", "publishedAt": "2020-02-28T05:01:01Z", "content": "In any crisis, leaders have two equally important responsibilities: solve the immediate problem and keep it from happening again. The Covid-19 pandemic is a case in point. We need to save lives now while also improving the way we respond to outbreaks in gener… [+7974 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Surajit Dasgupta", "title": "Gold prices today rise after falling for three days in a row - Livemint", "description": "Gold prices today rise after falling for three days in a row Livemint Gold set for third monthly gain; pandemic fears lift rate-cut bets CNBC Gold price today: Coronavirus spread boost safe-haven demand, yellow metal glitters Moneycontrol.com Gold prices rise…", "url": "https://www.livemint.com/market/stock-market-news/gold-prices-today-rise-after-falling-for-three-days-in-a-row-11582860859699.html", "urlToImage": "https://images.livemint.com/img/2020/02/28/600x338/2019-07-17T013509Z_1_LYNXNPEF6G02H_RTROPTP_3_GLOBAL-PRECIOUS_1563645963040_1582861015131.JPG", "publishedAt": "2020-02-28T04:24:33Z", "content": "Gold prices rose today in Indian markets, snapping a three-day fall. On MCX, gold April gold futures rose 0.35% to 42,534 per 10 gram, tracking an advance in global rates. Silver futures on MCX however declined 0.8% to 46,284 per kg. From Monday's record high… [+1445 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Malaysia's AirAsia X defers A330neo deliveries as coronavirus crimps demand", "description": "Malaysian long-haul budget airline AirAsia X Bhd  said it will defer delivery of 78 Airbus SE  A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand.", "url": "https://www.channelnewsasia.com/news/business/malaysia-s-airasia-x-defers-a330neo-deliveries-as-coronavirus-crimps-demand-12479986", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12479984/16x9/991/557/382fe209628c9b5465a47335f77142a0/tj/an-airasia-airbus-a320-plane-is-pictured-at-kuala-lumpur-international-airport-in-sepang-1.jpg", "publishedAt": "2020-02-28T04:36:26Z", "content": "KUALA LUMPUR/SYDNEY: Malaysian long-haul budget airline AirAsia X Bhd said it will defer delivery of 78 Airbus SE A330neo planes and consider other changes to reduce its fleet as the coronavirus dents demand.\r\nAirAsia X said late on Thursday it might sell two… [+2197 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "The Associated Press", "title": "BTS cancels series of planned concerts in South Seoul after concerns of Coronavirus outbreak", "description": "The BTS concert would have involved a number of global production companies and a large number of foreigners among its expert crew, with more than 200,000 concertgoers expected The post BTS cancels series of planned concerts in South Seoul after concerns of C…", "url": "https://www.firstpost.com/entertainment/bts-cancels-series-of-planned-concerts-in-south-seoul-after-concerns-of-coronavirus-outbreak-8096561.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/04/bts-twitter-1280.jpg", "publishedAt": "2020-02-28T04:57:31Z", "content": "Seoul: K-pop superstar group BTS has canceled a series of planned concerts in Seoul in April due to concerns about a soaring viral outbreak in South Korea, its management agency announced Friday.\r\nWe regret to announce that the BTS MAP OF THE SOUL TOUR ... ha… [+1684 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Baidu says first-quarter revenue may tumble as coronavirus takes toll on business, advertising", "description": "Baidu Inc, China's biggest search engine company, said first-quarter revenue could fall as much as 13per cent from a year earlier as the coronavirus epidemic puts the brakes on economic activity and advertising.", "url": "https://www.channelnewsasia.com/news/business/baidu-says-first-quarter-revenue-may-tumble-as-coronavirus-takes-toll-on-business--advertising-12479842", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12479840/16x9/991/557/a49631e087733f3e80db3c5321e7cfb1/BW/file-photo--a-baidu-sign-is-seen-at-the-world-internet-conference--wic--in-wuzhen-1.jpg", "publishedAt": "2020-02-28T04:15:30Z", "content": "REUTERS: Baidu Inc, China's biggest search engine company, said first-quarter revenue could fall as much as 13per cent from a year earlier as the coronavirus epidemic puts the brakes on economic activity and advertising.\r\nIt expects revenue between 21 billion… [+2170 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Australian health minister urges calm as virus looms over F1, major events", "description": "Australia's health minister on Friday urged the sports-mad country not to fear being infected by the coronavirus when attending major events such as Formula One's season-opening Grand Prix in Melbourne next month. Australia introduced emergency measures on Th…", "url": "https://japantoday.com/category/world/sport-australia-minister-urges-calm-as-virus-looms-over-f1-major-events", "urlToImage": null, "publishedAt": "2020-02-28T04:46:08Z", "content": "Australia's health minister on Friday urged the sports-mad country not to fear being infected by the coronavirus when attending major events such as Formula One's season-opening Grand Prix in Melbourne next month.\r\nAustralia introduced emergency measures on T… [+2096 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FP Staff", "title": "Sensex sinks 1,083.85 points in opening session amid global selloff, Nifty tanks 312 points; over Rs 5 lakh cr investor wealth wiped off", "description": "Sensex sank 1,100.27 points, or 2.77 per cent, to 38,645.39, while the NSE Nifty cracked 329.50 points, or 2.83 per cent, to 11,303.80, The post Sensex sinks 1,083.85 points in opening session amid global selloff, Nifty tanks 312 points; over Rs 5 lakh cr inv…", "url": "https://www.firstpost.com/business/sensex-sinks-1083-85-points-in-opening-session-amid-global-selloff-nifty-tanks-312-points-over-rs-5-lakh-cr-investor-wealth-wiped-off-8096571.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/02/sensex-bse_01.jpg", "publishedAt": "2020-02-28T04:39:15Z", "content": "The Sensex nosedived over 1000 points in opening session at the Bombay Stock Exchange on Friday. The market wiped off over Rs 5 lakh crore investor wealth in opening session mid a massive selloff in global equities as rising coronavirus cases outside China st… [+2948 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Coronavirus: India Temporarily Suspends 'Visa on Arrival' for Japanese, South Korean Nationals", "description": "New Delhi (Sputnik): India has taken precautions to prevent the spread of the novel coronavirus that originated in the Chinese city of Wuhan. So far New Delhi has evacuated 883 Indian and foreign nationals from the epicenter of the virus as well as from the l…", "url": "https://sputniknews.com/india/202002281078425150-coronavirus-india-temporarily-suspends-visa-on-arrival-for-japanese-south-korean-nationals/", "urlToImage": "https://cdn5.img.sputniknews.com/images/107835/70/1078357021.jpg", "publishedAt": "2020-02-28T04:59:05Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Chinese researchers release first pathology report for COVID-19 - CGTN", "description": "Chinese researchers release first pathology report for COVID-19 CGTN View Full coverage on Google News", "url": "https://news.cgtn.com/news/2020-02-28/Chinese-researchers-release-first-pathology-report-for-COVID-19-OrNdEezwJi/index.html", "urlToImage": "https://news.cgtn.com/news/7755544e34457a4d78517a4d774d6a4e3449444f31457a6333566d54/img/167dc9756478441a9ee68cdfbfe9c49b/167dc9756478441a9ee68cdfbfe9c49b-1.png", "publishedAt": "2020-02-28T04:28:20Z", "content": "The first pathology report of a dead patient with novel coronavirus pneumonia (COVID-19) was published on the Journal of Forensic Medicine on Friday.\r\nThe report indicates that this patient's lungs remain the main organ affected by the disease, suggesting tha… [+1894 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "The Daily Show's Jordan Klepper and Roy Wood Jr. poll black voters in South Carolina, ask: 'Who is Tom Steyer!?!'", "description": "Every political ad in South Carolina ahead of Saturday's Democratic presidential primary seems to feature former President Barack Obama, \"so it seems a lot of white folks think standing next to a cool black person gives them legitimacy,\" Jordan Klepper said o…", "url": "https://news.yahoo.com/daily-shows-jordan-klepper-roy-045659004.html", "urlToImage": null, "publishedAt": "2020-02-28T04:56:59Z", "content": null}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Korea cases top 2,000, Italy 500, pet dog infected: Virus update", "description": "The number of new coronavirus cases in South Korea crossed 2,000, and those in Italy 500. Japan is closing schools to limit the spread of the outbreak. New cases continue to appear outside of China with Italy, Iran and Kuwait reporting more infections. Nigeri…", "url": "https://www.bangkokpost.com/world/1867799/korea-cases-top-2-000-italy-500-pet-dog-infected-virus-update", "urlToImage": "https://static.bangkokpost.com/media/content/20200228/c1_1867799_700.jpg", "publishedAt": "2020-02-28T04:32:00Z", "content": "The number of new coronavirus cases in South Korea crossed 2,000, and those in Italy 500. Japan is closing schools to limit the spread of the outbreak. New cases continue to appear outside of China with Italy, Iran and Kuwait reporting more infections. Nigeri… [+14244 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "JPMorgan Joins Rush to Curb Global Travel as Virus Spreads", "description": "(Bloomberg) -- JPMorgan Chase & Co. curbed non-essential travel globally, joining a string of other corporate giants in restricting business trips as the spreading coronavirus risks becoming a pandemic.Because of the broadening spread of the virus, it’s now “…", "url": "https://finance.yahoo.com/news/jpmorgan-joins-rush-curb-global-043014277.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DesVWqAgwKlUE7JAAaHq.w--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/e7520f4a03697f9d57cc9bcb6db62c36", "publishedAt": "2020-02-28T04:30:14Z", "content": "(Bloomberg) -- JPMorgan Chase &amp; Co. curbed non-essential travel globally, joining a string of other corporate giants in restricting business trips as the spreading coronavirus risks becoming a pandemic.\r\nBecause of the broadening spread of the virus, its … [+3442 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Tokyo Disney parks closing for two weeks over virus concerns", "description": "The operator of Tokyo's two Disney resorts, Disneyland and DisneySea, said Friday the parks would be closed for around two weeks on fears over the outbreak of the new coronavirus. &quot;Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extr…", "url": "https://japantoday.com/category/national/Tokyo-Disney-parks-closing-for-two-weeks-over-virus-concerns", "urlToImage": null, "publishedAt": "2020-02-28T04:54:50Z", "content": "The operator of Tokyo's two Disney resorts, Disneyland and DisneySea, said Friday the parks would be closed for around two weeks on fears over the outbreak of the new coronavirus.\r\n\"Tokyo Disneyland and Tokyo DisneySea have decided to proceed with an extraord… [+1076 chars]"}, {"source": {"id": null, "name": "Technode.com"}, "author": "Chris Udemans", "title": "Baidu’s Q4 profits surge, warns of Covid-19 effect on Q1", "description": "Baidu's guidance about the first quarter cast a shadow over its better-than-expected Q4 results, which saw profits soar 200% year on year.", "url": "https://technode.com/2020/02/28/baidus-q4-profits-surge-warns-of-covid-19-effect-on-q1/", "urlToImage": "https://cdn.technode.com/wp-content/uploads/2019/10/BAIDU3.jpg", "publishedAt": "2020-02-28T05:03:42Z", "content": "2 min read The exterior of a Baidu building in Beijing on Oct. 30, 2019. (Image credit: TechNode/Coco Gao)\r\nSearch giant Baidu’s profits ballooned in the fourth quarter but the company warned of flagging revenue during the first three months of 2020 as a resu… [+2446 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Baidu Reports Q4 Earnings Beat, Shares Tank On Grim Q1 Outlook Due To Coronavirus", "description": "The Chinese internet giant posted total revenue of about $4.1 billion, up 6% from the $3.9 billion posted in the similar quarter last year and 3% higher than the previous quarter's total revenue of $4 billion.  \"We finished 2019 making tremendous progress in …", "url": "https://finance.yahoo.com/news/baidu-reports-q4-earnings-beat-041202695.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-28T04:12:02Z", "content": "Baidu Inc. (NYSE: BIDU) reported its earnings for the fourth quarter of the financial year 2019 on Thursday.\r\nWhat Happened\r\nThe Chinese internet giant posted total revenue of about $4.1 billion, up 6% from the $3.9 billion posted in the similar quarter last … [+1567 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump just pushed one of his worst conspiracy theories yet (Greg Sargent/Washington Post)", "description": "Greg Sargent / Washington Post : Trump just pushed one of his worst conspiracy theories yet — President Trump is now fully embracing the conspiracy theory that his assorted enemies are deliberately hyping the coronavirus threat, all to damage him politically.…", "url": "https://www.memeorandum.com/200227/p133", "urlToImage": "https://www.washingtonpost.com/resizer/W6i3I1CiPOt9hIzNF4QsyxA4f3k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MTCRRZSY7MI6VDX5B6IEXXMAK4.jpg", "publishedAt": "2020-02-28T04:25:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Askamanager.org"}, "author": "Ask a Manager", "title": "my boss told his wife we had an affair but we didn’t, what does a fast rejection mean, and more", "description": "It’s five answers to five questions. Here we go… 1. I worked for a married couple and the husband told his wife we had an affair — but we didn’t I quit my retail management job two years ago over work/life balance issues and started working as a private home …", "url": "https://www.askamanager.org/2020/02/my-boss-told-his-wife-we-had-an-affair-but-we-didnt-what-does-a-fast-rejection-mean-and-more.html", "urlToImage": "https://www.askamanager.org/wp-content/uploads/2014/04/bannersmfb.png", "publishedAt": "2020-02-28T05:03:02Z", "content": "Its five answers to five questions. Here we go\r\n1. I worked for a married couple and the husband told his wife we had an affair but we didn’t\r\nI quit my retail management job two years ago over work/life balance issues and started working as a private home ch… [+9533 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FP Staff", "title": "Bloodbath on D-Street: Sensex sinks 1126 points in morning session amid global selloff, Nifty tanks 339 points; over Rs 5 lakh cr investor wealth wiped off", "description": "Sensex sank 1,100.27 points, or 2.77 per cent, to 38,645.39, while the NSE Nifty cracked 329.50 points, or 2.83 per cent, to 11,303.80, The post Bloodbath on D-Street: Sensex sinks 1126 points in morning session amid global selloff, Nifty tanks 339 points; ov…", "url": "https://www.firstpost.com/business/sensex-sinks-1129-points-in-morning-session-amid-global-selloff-nifty-tanks-339-points-over-rs-5-lakh-cr-investor-wealth-wiped-off-8096571.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/02/sensex-bse_01.jpg", "publishedAt": "2020-02-28T04:39:15Z", "content": "After the Sensex nosedived over 1000 points in opening session at the Bombay Stock Exchange on Friday, the benchmark index fell further 48 points or 2.83 percent down to 1126.65 in the late morning session. The Nifty was down 339.15 points or 2.92 percent at … [+4207 chars]"}, {"source": {"id": null, "name": "Intelnews.org"}, "author": "Joseph Fitsanakis", "title": "US intelligence agencies using ‘wide range’ of spy tools to monitor coronavirus", "description": "United States intelligence agencies are using “a wide range” of tools, ranging from open-source collection to communications interception and human intelligence, to collect desperately needed data about the spread of the coronavirus, according to sources.", "url": "https://intelnews.org/2020/02/28/01-2728/", "urlToImage": "https://intelligencenews.files.wordpress.com/2020/02/first-post-h-6.jpg", "publishedAt": "2020-02-28T05:08:01Z", "content": "February 28, 2020by Joseph FitsanakisLeave a comment\r\nUnited States intelligence agencies are using a wide range of tools, ranging from open-source collection to communications interception and human intelligence, to collect desperately needed data about the … [+2329 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "Global funds cut equity exposure in February amid coronavirus risks - Reuters Poll", "description": "According to a monthly Reuters poll of 38 wealth managers and CIOs in Europe, the US, Britain and Japan, global funds look to cut their equity allocat", "url": "https://www.fxstreet.com/news/global-funds-cut-equity-exposure-in-february-amid-coronavirus-risks-reuters-poll-202002280432", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Equities/hundred-shares-1058243_Large.jpg", "publishedAt": "2020-02-28T04:32:16Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}]