[{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Could North Korea handle a Covid-19 outbreak?", "description": "So far, the country claims to have no cases of Covid-19 - but that has been questioned.", "url": "https://www.bbc.co.uk/news/world-asia-51624624", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7370/production/_111025592_39f17d7c-b5a5-48ea-a366-34397372b7f2.jpg", "publishedAt": "2020-02-26T00:15:39Z", "content": "Image copyrightAFP PHOTO/KCNA VIA KNSImage caption\r\n North Korean media has been open about the risks of the virus - and the efforts to combat it\r\nAs the number of coronavirus cases in South Korea keeps on rising, attention is turning to how its impoverished … [+7102 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Three more Chinese regions lower emergency response level as virus threat recedes", "description": "The northwestern Chinese regions of Inner Mongolia and Xinjiang and the southwestern province of Sichuan have downgraded their emergency response level after assessing that health risks from the coronavirus outbreak have receded, state media reported.", "url": "https://www.reuters.com/article/us-china-health-response-idUSKCN20K029", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200226&t=2&i=1495243206&w=1200&r=LYNXNPEG1P02D", "publishedAt": "2020-02-26T01:01:43Z", "content": "SHANGHAI (Reuters) - The northwestern Chinese regions of Inner Mongolia and Xinjiang and the southwestern province of Sichuan have downgraded their emergency response level after assessing that health risks from the coronavirus outbreak have receded, state me… [+2118 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lucy Anna Gray", "title": "Coronavirus in US: Trump administration attacked for 'unacceptable' response as San Francisco declares state of emergency", "description": "Americans have been warned by the US Centers for Disease Control and Prevention (CDC) to begin preparing for the spread of the coronavirus.“The data over the past week about the spread in other countries has raised our level of concern and expectation that we…", "url": "https://news.yahoo.com/coronavirus-us-live-updates-officials-203100582.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/H4RsDelRm2bnj09s7UBE9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MTY-/https://s.yimg.com/uu/api/res/1.2/0DVX4EElxHw6BNKtLmNYyA--~B/aD0zNTg7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/8dedf3c37f6dcf6c0befdb8faf9609cd", "publishedAt": "2020-02-26T00:59:00Z", "content": "AFP via Getty Images\r\nAmericans have been warned by the US Centers for Disease Control and Prevention (CDC) to begin preparing for the spread of the coronavirus.\r\nThe data over the past week about the spread in other countries has raised our level of concern … [+1242 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Samuel Tolbert", "title": "PUBG Corp is the latest company to pull out of PAX East and GDC", "description": "The battle royale developer and publisher joins the ever-growing list of those not attending PAX East or GDC. What you need to know PUBG Corp is no longer attending PAX East or GDC 2020. The main cause of concern was the current Coronavirus outbreak. The comp…", "url": "https://www.windowscentral.com/pubg-corp-pulls-out-pax-east", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2019/07/pubg%20new%20look.jpg?itok=rFbAxcHj", "publishedAt": "2020-02-26T00:42:49Z", "content": "If you thought companies might be done pulling out of PAX East or GDC, you were naive. PUBG Corp has shared that it is no longer attending either convention. The company had planned to host a happy hour event for fans, which will no longer happen for now. \"We… [+445 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Zach Wichter", "title": "Some airlines cut back on inflight service to combat coronavirus. Will those changes stick?", "description": "Airlines have been front and center as the coronavirus outbreak has forced widespread changes for travelers around the globe. Carriers have slashed thousands of flights, especially in China and Southeast Asia. Now, an increasing number of airlines are adjusti…", "url": "http://thepointsguy.com/news/coronavirus-airlines-inflight-service/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2019/11/20191105_Singapore-Premium-Economy-KGenter-cabin-meal-service.jpg?fit=1600%2C1200px&ssl=1", "publishedAt": "2020-02-26T01:00:11Z", "content": "Airlines have been front and center as the coronavirus outbreak has forced widespread changes for travelers around the globe. Carriers have slashed thousands of flights, especially in China and Southeast Asia.\r\nNow, an increasing number of airlines are adjust… [+3455 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Elffie Chew", "title": "Singapore Researchers Make Advances in Coronavirus Test Method", "description": "A medical research team in Singapore has managed to establish links between cases in the city-state using a new testing method.", "url": "https://www.bloomberg.com/news/articles/2020-02-26/singapore-researchers-make-breakthrough-in-coronavirus-testing", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/imxQrnCEzZok/v1/1200x800.jpg", "publishedAt": "2020-02-26T00:57:03Z", "content": "A medical research team in Singapore has managed to establish links between cases in the city-state using a new testing method.\r\nUsing a serological test developed by researchers from the Duke-NUS Medical School, the team was able to confirm that two individu… [+1007 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Coronavirus latest: SF Mayor London Breed explains declaring state of emergency - KGO-TV", "description": "Coronavirus latest: SF Mayor London Breed explains declaring state of emergency KGO-TV San Francisco declares state of emergency over coronavirus | TheHill The Hill San Francisco Declares State Of Emergency After CDC Predicts Spread Of Coronavirus KPIX CBS SF…", "url": "https://abc7news.com/5967460", "urlToImage": "https://cdn.abcotvs.com/dip/images/5967390_022520-kgo-london-breed-full-presser-vid.jpg?w=1600", "publishedAt": "2020-02-26T00:18:02Z", "content": "SAN FRANCISCO (KGO) -- San Francisco Mayor London Breed declared a local state of emergency due to the coronavirus Tuesday afternoon.There are no confirmed cases of the virus in San Francisco, she assured the community during her press conference, so she expl… [+2192 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "As CDC warns of Coronavirus spread, UNMC begins to test possible treatment - KMTV 3 News Now", "description": "As CDC warns of Coronavirus spread, UNMC begins to test possible treatment KMTV 3 News Now We can’t stop the coronavirus now. But we can be ready for it. The Washington Post CDC official warns Americans that coronavirus will spread CNN Coronavirus will spread…", "url": "https://www.youtube.com/watch?v=qC8HcM89DvM", "urlToImage": "https://i.ytimg.com/vi/qC8HcM89DvM/maxresdefault.jpg", "publishedAt": "2020-02-26T00:39:48Z", "content": "As CDC warns of Coronavirus spread, UNMC begins to test possible treatment"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jason Hall)", "title": "Crude Oil Threatens Double-Digit Drop As Coronavirus Selloff Continues", "description": "Two major global crude oil benchmarks have lost 7% of their value in four trading sessions on concerns over global oversupply and falling demand.", "url": "https://www.fool.com/investing/2020/02/25/crude-oil-threatens-double-digit-drop-as-coronavir.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559847/oil-barrels.jpg", "publishedAt": "2020-02-26T00:50:29Z", "content": "In a world awash with oil supplies, the hits just keep on coming. Since last Thursday, Feb. 20, crude oil traders have sent prices of the world's largest crude benchmarks down sharply, erasing nearly all of the gains since the 2020 low on Feb. 10. \r\nFeb. 24 w… [+1911 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Richard A. D'Aveni, Contributor, Richard A. D'Aveni, Contributor https://www.forbes.com/sites/richarddaveni/", "title": "The Coronavirus Won’t Boost 3D Printing", "description": "Overall, until additive makes economic sense on its own accord, any epidemic short of the 1919 Spanish Flu will make little difference.  But politics and trade wars are unpredictable, so we can’t say this with certainty.", "url": "https://www.forbes.com/sites/richarddaveni/2020/02/25/the-coronavirus-wont-boost-3d-printing/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208599256%2F960x0.jpg", "publishedAt": "2020-02-26T00:52:27Z", "content": "Ive written extensively in the past few years on additive manufacturing, often suggesting that additive will spread partly because companies will produce more at home rather than rely on slow global supply chains.&amp;nbsp;&amp;nbsp;By using smaller, flexible… [+8230 chars]"}, {"source": {"id": null, "name": "Kare11.com"}, "author": "Heidi Wigdahl", "title": "CDC: Prepare for coronavirus to spread in U.S. - KARE11.com", "description": "\"This is all part of waking up to the fact that we have to be ready and respond,\" said Dr. Michael Osterholm, director of CIDRAP at the University of Minnesota.", "url": "https://www.kare11.com/article/news/health/cdc-prepare-for-coronavirus-to-spread-in-us/89-2478acb0-d461-4668-80a9-7b500f5c31d5", "urlToImage": "https://media.kare11.com/assets/KARE/images/b652ffd0-c09d-44ba-b267-7a340e4d6690/b652ffd0-c09d-44ba-b267-7a340e4d6690_1140x641.jpg", "publishedAt": "2020-02-26T01:11:34Z", "content": "MINNEAPOLIS, Minnesota The Centers for Disease Control and Prevention said Tuesday that Americans should prepare for the spread of the novel coronavirus in communities across the country. \r\n\"It's not so much a question of if this will happen any more, but rat… [+3945 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "ABC News Prime: 2020 South Carolina debate preview, Stock Market, Coronavirus - ABC News", "description": "ABC News Prime: 2020 South Carolina debate preview, Stock Market, Coronavirus ABC News Democratic candidates gear up for South Carolina debate l ABC News ABC News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=zXK6tYb7lVk", "urlToImage": "https://i.ytimg.com/vi/zXK6tYb7lVk/maxresdefault.jpg", "publishedAt": "2020-02-26T01:05:03Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Gabrielle Chung", "title": "Olympic Committee Member Says Tokyo 2020 May Be Canceled If Coronavirus Isn't Brought Under Control", "description": "The 2020 Summer Olympics in Tokyo may be called off should the number of coronavirus cases around the world continue to rise, according to a senior member of the International Olympic Committee. While the sporting event is currently scheduled to start July 24…", "url": "https://people.com/sports/tokyo-olympics-may-be-canceled-if-coronavirus-isnt-under-control-says-committee-member-dick-pound/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2F2020-olympic-games-preparation-in-tokyo.jpg%3Fcrop%3D0px%2C0px%2C4817px%2C2528.925px%26resize%3D1200%2C630", "publishedAt": "2020-02-26T00:23:07Z", "content": "The 2020 Summer Olympics in Tokyo may be called off should the number of coronavirus cases around the world continue to rise, according to a senior member of the International Olympic Committee.\r\nWhile the sporting event is currently scheduled to start July 2… [+2997 chars]"}, {"source": {"id": null, "name": "Kwwl.com"}, "author": "Ashley Neighbor", "title": "Cost of business expected to increase as coronavirus impacts Chinese production - kwwl.com", "description": "The novel coronavirus has already impacted global markets. The DOW Jones closed down nearly 900 points after it dropped more than 1,000 points Monday.", "url": "https://kwwl.com/2020/02/25/cost-of-business-expected-to-increase-as-coronavirus-impacts-chinese-production/", "urlToImage": "https://quincy-network.s3.ca-central-1.amazonaws.com/wp-content/uploads/sites/6/2020/02/GLOBAL-CORONAVIRUS.jpg", "publishedAt": "2020-02-26T00:30:56Z", "content": "IOWA CITY, Iowa (KWWL) -- China was the United States' largest import supplier of goods in 2018 but this year the cost of doing business may rise as the coronavirus continues to spread, shutting down Chinese factories.\r\nThe novel coronavirus has already impac… [+2557 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stanley White", "title": "Asian stocks, Treasury yields fall as pandemic fears intensify", "description": "Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.", "url": "https://www.reuters.com/article/us-global-markets-idUSKBN20K01Y", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200226&t=2&i=1495239038&w=1200&r=LYNXMPEG1P027", "publishedAt": "2020-02-26T01:01:59Z", "content": "TOKYO (Reuters) - Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows. \r\nThe S&amp;P 500 .SPX and the… [+3144 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Susan Zirinsky welcomes attendees to the tenth 2020 Democratic debate - CBS News", "description": "Susan Zirinsky welcomes attendees to the tenth 2020 Democratic debate CBS News What Twitter Has to Say About the Democratic Debate Slate ABC News Prime: 2020 South Carolina debate preview, Stock Market, Coronavirus ABC News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=tuITZjkUKNo", "urlToImage": null, "publishedAt": "2020-02-26T01:09:02Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dan De Luce and Leila Gharagozlou and Emmanuelle Saliba and Robert Windrem", "title": "Why is Iran's reported mortality rate for coronavirus higher than in other countries?", "description": "Iran's high reported coronavirus death rate raises questions about how officials diagnose infections, and whether the regime wants to play down the outbreak.", "url": "https://www.nbcnews.com/health/health-news/why-iran-s-reported-mortality-rate-coronavirus-higher-other-countries-n1142646", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_09/3243806/200225-tehran-iran-disinfect-sunway-coronavirus-ew-322p_92ad918df4ce392adfb589eb6b6774cd.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-26T00:52:00Z", "content": "WASHINGTON Iran has the highest reported number of deaths from the coronavirus outside China, raising questions about how the government is handling the public health crisis and whether the often secretive regime has been fully transparent about the extent of… [+7095 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Futures: Coronavirus Stock Market Sell-Off Continues; Disney CEO Bob Iger Exits, Salesforce, Virgin Galactic, Insulet Move On Earnings - Investor's Business Daily", "description": "Dow Jones Futures: Coronavirus Stock Market Sell-Off Continues; Disney CEO Bob Iger Exits, Salesforce, Virgin Galactic, Insulet Move On Earnings Investor's Business Daily Dow tumbles nearly 900 points as coronavirus fears continue CNN Stocks tumble for second…", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-coronavirus-stock-market-sell-off-disney-ceo-bob-iger-leaves-salesforce-insulet-earnings/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/01/BIZ05_disney_010220_news.jpg", "publishedAt": "2020-02-26T00:17:00Z", "content": "Dow Jones futures rose late Tuesday, along with S&amp;P 500 futures and Nasdaq futures, trying to rebound after the coronavirus stock market sell-off continued Tuesday. Disney (DIS) CEO Bob Iger will step down immediately, ahead of schedule.\r\nXSalesforce.com … [+5956 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Coronavirus Is Bat Coronavirus With SARS Receptor and Likely Joined in a Lab", "description": "Genetic analysis of the COVID-19 virus shows that it is very similar to a coronavirus in bats but the receptor binding looks like the receptor for SARS. This could happen naturally with slow changes... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2020/02/coronavirus-is-bat-coronavirus-with-sars-receptor-and-likely-joined-in-a-lab.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-25-at-4.45.45-PM.png", "publishedAt": "2020-02-26T00:56:18Z", "content": "Genetic analysis of the COVID-19 virus shows that it is very similar to a coronavirus in bats but the receptor binding looks like the receptor for SARS. This could happen naturally with slow changes of one in ten thousand sequences each year. This appeared al… [+2980 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "W. E. Messamore", "title": "The White House Coronavirus Updates Are Just As Phony as China’s", "description": "White House officials have expressed consternation toward China for covering up the severity of coronavirus. Unfortunately, they're now doing the exact same thing. The post The White House Coronavirus Updates Are Just As Phony as China’s appeared first on CCN…", "url": "https://www.ccn.com/the-white-house-coronavirus-updates-are-just-as-phony-as-chinas/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/donald-trump-pic.jpg", "publishedAt": "2020-02-26T00:29:04Z", "content": "<ul><li>President Trump and top White House economist Larry Kudlow claimed coronavirus is under control in the United States.</li><li>But U.S. health officials are warning that the exact opposite is true.</li><li>The Trump Administration recently criticized C… [+3858 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Bahrain orders all schools & kindergartens SHUT DOWN for 2 weeks as coronavirus cases soar", "description": "Bahraini students will be skipping classes due to a perfectly valid reason for the next two weeks, after the country’s education ministry ordered schools and nurseries to be temporarily closed amid a surge in coronavirus cases. Read Full Article at RT.com", "url": "https://www.rt.com/news/481687-bahrain-coronavirus-school-shutdown/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e55c0342030277d3121d91e.JPG", "publishedAt": "2020-02-26T00:52:47Z", "content": "State-run as well as private kindergartens and schools in Bahrain will shut their doors for two weeks starting Wednesday, the Gulf monarchy's authorities announced on Tuesday, after the 9 new cases of the deadly COVID-19 were reported, bringing the total numb… [+1616 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: Doctors and nurses fighting coronavirus in China die of both infection and fati…", "description": "CORONAVIRUS UPDATE: Doctors and nurses fighting coronavirus in China die of both infection and fatigue. “The rate of new infections and deaths overall appears to be slowing in China. But the toll on medical workers reflects the harrowing costs of a politicall…", "url": "https://pjmedia.com/instapundit/359523/", "urlToImage": null, "publishedAt": "2020-02-26T01:03:37Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "tsonnemaker@businessinsider.com (Tyler Sonnemaker)", "title": "Amazon is reportedly deleting some third-party listings that jack up surgical mask prices as the coronavirus creates a shortage", "description": "Amazon has removed some listings that raised prices on surgical masks amid a shortage caused by the coronavirus, according to Wired.", "url": "https://news.yahoo.com/amazon-reportedly-deleting-third-party-004908192.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GX.VR1coNYIKzbA7qcirvA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/_mDBWibEscDnVs3xJ4j0VA--~B/aD0yMjc2O3c9MzAzNTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/147d88748a5f3410f6d23fa736624c17", "publishedAt": "2020-02-26T00:49:08Z", "content": "A worker collects orders at Amazon's fulfilment centre in Rugeley, central England December 11, 2012.\r\nREUTERS/Phil Noble\r\n<ul><li>The coronavirus outbreak has led to a shortage of protective masks and other medical supplies, leading some sellers to significa… [+2582 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly, Contributor, Gordon Kelly, Contributor https://www.forbes.com/sites/gordonkelly/", "title": "Apple Insiders Reveal Shock iPhone 12 Release News", "description": "The release of Apple's new iPhone 12 is suddenly in doubt...", "url": "https://www.forbes.com/sites/gordonkelly/2020/02/25/apple-iphone-12-release-date-upgrade-new-iphone-9-update-iphone-11-pro-max/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e55bed6765d4500072d3296%2F960x0.jpg", "publishedAt": "2020-02-26T01:00:11Z", "content": "Apples all-new iPhone 12 is taking shape fast and, while the design looks familiar, it is all-change inside for one of the companys biggest releases in years. But that release has now been cast in doubt.&amp;nbsp;iPhone 12 concept render \r\nAppleInsider\r\nApple… [+6352 chars]"}, {"source": {"id": null, "name": "Cyclingtips.com"}, "author": "Iain Treloar", "title": "From Milan-San Remo to manufacturing: How coronavirus is affecting cycling", "description": "Supported by In China, almost 80,000 people are currently infected with novel coronavirus – mostly in Hubei province, where 60 million people have been in lockdown for more than a month. On the Diamond Princess cruise ship in Japan, another 691 infected indiv…", "url": "https://cyclingtips.com/2020/02/from-milan-san-remo-to-manufacturing-how-coronavirus-is-affecting-cycling/", "urlToImage": "https://cdn-cyclingtips.pressidium.com/wp-content/uploads/2020/02/Coronavirus-feature-grey.jpg", "publishedAt": "2020-02-26T00:59:53Z", "content": "In China, almost 80,000 people are currently infected with novel coronavirus mostly in Hubei province, where 60 million people have been in lockdown for more than a month. On the Diamond Princess cruise ship in Japan, another 691 infected individuals are quar… [+10743 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Coronavirus Fatality Statistics By Age, Gender and Conditions", "description": "There are coronavirus (COVID-19) fatality statistics based on age, gender and pre-existing conditions. The rates are mainly for hospitalized cases in China. There is likely 5-10 times as many people... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2020/02/coronavirus-fatality-statistics-by-age-gender-and-conditions.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2020/01/HERO_coronavirus.jpg", "publishedAt": "2020-02-26T00:16:20Z", "content": "There are coronavirus (COVID-19) fatality statistics based on age, gender and pre-existing conditions. The rates are mainly for hospitalized cases in China. There is likely 5-10 times as many people who caught the virus but had no symptoms or did not need to … [+2376 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "Shock And Wha? Disney Downplays Surprise, Timing Of Bob Chapek Succeeding Bob Iger", "description": "It felt like pulling off a Band-Aid: fast and by surprise. “Did not see this coming – Wowza,” entertainment analyst Rich Greenfield of LightShed Partners tweeted Tuesday, moments after Disney announced that Bob Chapek would take over as CEO immediately, with …", "url": "https://deadline.com/2020/02/disney-bob-iger-successor-timing-reaction-bob-chapek-1202868321/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/bob-chapek-disney.jpg?w=1024", "publishedAt": "2020-02-26T00:56:04Z", "content": "It felt like pulling off a Band-Aid: fast and by surprise.\r\n“Did not see this coming – Wowza,” entertainment analyst Rich Greenfield of LightShed Partners tweeted Tuesday, moments after Disney announced that Bob Chapek would take over as CEO immediately, with… [+5520 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Canaries hotel locked down over coronavirus as Spain reports first mainland cases", "description": "By Inti Landauro and Emma Pinedo MADRID (Reuters) - A large Canary Islands hotel was locked down for coronavirus tests on Tuesday after a guest and his wife were found to be infected, as Spain also reported its first three cases of the disease on the mainland…", "url": "https://www.firstpost.com/world/canaries-hotel-locked-down-over-coronavirus-as-spain-reports-first-mainland-cases-8086631.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/26/2020-02-25T185520Z_1_LYNXMPEG1O1CW_RTROPTP_2_CHINA-HEALTH-SPAIN.jpg", "publishedAt": "2020-02-26T00:41:03Z", "content": "By Inti Landauro and Emma Pinedo\r\nMADRID (Reuters) - A large Canary Islands hotel was locked down for coronavirus tests on Tuesday after a guest and his wife were found to be infected, as Spain also reported its first three cases of the disease on the mainlan… [+2945 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Everything China Is Doing to Support Its Markets During Outbreak", "description": "(Bloomberg) -- China’s deadly coronavirus outbreak has been met with a wide-ranging response from policy makers seeking to cushion the economy, support financial markets and bolster investor confidence. Here’s a look at some of the steps taken, along with mar…", "url": "https://finance.yahoo.com/news/everything-china-doing-support-markets-002845756.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/9wlEonxd_06TgH0p904yIg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/00254d81457a5198eb8159feb4df61e4", "publishedAt": "2020-02-26T00:28:45Z", "content": "(Bloomberg) --\r\nChinas deadly coronavirus outbreak has been met with a wide-ranging response from policy makers seeking to cushion the economy, support financial markets and bolster investor confidence. Heres a look at some of the steps taken, along with mark… [+5791 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "USA TODAY editors", "title": "OnPolitics: How will Bloomberg fight back?", "description": "Elizabeth Warren went for Bloomberg during last week's debate and has shown no signs of letting up. What will happen tonight?", "url": "https://news.yahoo.com/onpolitics-bloomberg-fight-back-003634792.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/AKV7d0rSss4xWrN4uGcDYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/UBj6OKQMMydfUepoft5lXw--~B/aD0yNzkxO3c9NDE4NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/4c929604d7dc22700a805c858f19c0e7", "publishedAt": "2020-02-26T00:36:34Z", "content": "OMG. The debates are getting good\r\nWho is ready for more debate drama? Well, get ready, because all signs are pointing to an extra crunchy Democratic debate tonight. Elizabeth Warren has continued her attacks on Michael Bloomberg. Bernie Sanders has a full he… [+823 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Stanley White", "title": "Asian stocks, Treasury yields fall as pandemic fears intensify", "description": "Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows. Yields on 10-year and 30-year U.S. Treasuries te…", "url": "https://news.yahoo.com/asian-stocks-treasury-yields-fall-004856794.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xiGnE2YMZfROMdZLO112cA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjcuMg--/https://s.yimg.com/uu/api/res/1.2/D_2atu62QE2kkejE.0qjYg--~B/aD01NDI7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/6928517c4cabf3a577ea2ff0c91c0242", "publishedAt": "2020-02-26T00:48:56Z", "content": "By Stanley White\r\nTOKYO (Reuters) - Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.\r\nThe S&amp;P… [+3240 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Stanley White", "title": "Asian stocks, Treasury yields fall as pandemic fears intensify", "description": "Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows. Yields on 10-year and 30-year U.S. Treasuries te…", "url": "https://finance.yahoo.com/news/asian-stocks-treasury-yields-fall-004856460.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0Gjj0aoVkPa5lBjLIhklBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjcuMg--/https://s.yimg.com/uu/api/res/1.2/hKvvXhuJ9L9cyDMbBcGPNA--~B/aD01NDI7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/2ea4737adfddd8f7afadff44eccaf1c9", "publishedAt": "2020-02-26T00:48:56Z", "content": "By Stanley White\r\nTOKYO (Reuters) - Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.\r\nThe S&amp;P… [+3240 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Holly Secon)", "title": "Men's beards could render face masks useless, health authorities warn — one surprisingly comprehensive graphic reveals why 'walrus' is fine but 'mutton chops' won't do", "description": "Different kinds of facial hair can prevent the necessary impenetrable seal from being formed. This graphic shows if your facial hair puts you at risk.", "url": "https://news.yahoo.com/mens-beards-could-render-face-004445400.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/J08mfj7aQdqwZ2FPOZRQxw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/Ec8jbnvO61OGbOe0Ac7Tbg--~B/aD04ODg7dz0xMTg0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/EN/business_insider_articles_888/d16723b379c0162f9feff34fc5f32813", "publishedAt": "2020-02-26T00:44:45Z", "content": "CDC_facial hair graphic\r\nCDC\r\nThe demand for face masks is skyrocketing amid the global coronavirus outbreak.\r\nBut according to health experts, most members of the public use their medical masks wrong. Often, people will touch their facemask to adjust it or t… [+3858 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Robert Legare", "title": "Largest face mask maker in U.S. can't keep up with coronavirus demand", "description": "\"It's a madhouse. We are going as fast as we can,\" said Mike Bowen of Prestige Ameritech.", "url": "https://www.cbsnews.com/news/coronavirus-americas-largest-face-mask-manufacturer-cant-keep-up-with-demand/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/02/26/db4a41a1-2f2b-4277-a23e-98c15b676f51/thumbnail/1200x630g4/58dd0e118a60c4dfea6709146a41b425/ap-20055226221212.jpg", "publishedAt": "2020-02-26T00:58:17Z", "content": "Washington — As international markets are left gasping from the effects of the spreading coronavirus — with the Dow shedding another 879 points on Tuesday — one American business is struggling to keep pace with the skyrocketing demand for its products. \r\n\"It'… [+2582 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Danny McDonald, Matthew Berg", "title": "How are Massachusetts schools, universities dealing with coronavirus ?", "description": "“We are confident we will be ready to respond and assist as the situation develops,” said Caitlin McLaughlin, a Boston Public Health Commission spokeswoman.", "url": "https://www.bostonglobe.com/2020/02/26/metro/how-are-massachusetts-schools-universities-dealing-with-coronavirus/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=140", "publishedAt": "2020-02-26T00:56:41Z", "content": "We are confident we will be ready to respond and assist as the situation develops, said Caitlin McLaughlin, a commission spokeswoman, in a statement.\r\nBoston EMS dispatchers will ask specific questions during 911 calls based on CDC criteria for coronavirus, i… [+3862 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "San Francisco Mayor Declares Local Emergency Over Coronavirus", "description": "WASHINGTON (Sputnik) - San Francisco Mayor London Breed during a press conference announced that she is a declaring a local emergency over the novel coronavirus.", "url": "https://sputniknews.com/us/202002261078405404-san-francisco-mayor-declares-local-emergency-over-coronavirus/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107712/21/1077122179.jpg", "publishedAt": "2020-02-26T00:31:03Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monique Friedlander For Daily Mail Australia", "title": "The Bachelor's Tim Robards claims media coverage of coronavirus is 'clickbait'", "description": "The Bachelor's Tim Robards, 37, has made controversial statements about media's coverage of the  coronavirus.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8044421/The-Bachelors-Tim-Robards-claims-media-coverage-coronavirus-clickbait.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/23/25198242-0-image-a-163_1582673816385.jpg", "publishedAt": "2020-02-26T00:13:13Z", "content": "The Bachelor's Tim Robards, 37, has made controversial statements about media's coverage of the coronavirus. \r\nOn Tuesday night, the chiropractor spoke to fans via Instagram Stories about the deadly flu-like infection; which has already claimed more than 2,50… [+8653 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Matthew Chapman", "title": "Trump administration failing to calm public fears of coronavirus: they’re ‘losing the capacity to be seen as serious’", "description": "On Tuesday, the Washington Post profiled the Trump administration’s efforts to assuage public fears about the coronavirus pandemic — and noted they have become mired in serious credibility problems that damage their ability to direct the public. “The rosy she…", "url": "https://www.rawstory.com/2020/02/trump-administration-failing-to-calm-public-fears-of-coronavirus-theyre-losing-the-capacity-to-be-seen-as-serious/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/01/donald-trump-afp.jpg", "publishedAt": "2020-02-26T00:42:22Z", "content": "On Tuesday, the Washington Postprofiled the Trump administration’s efforts to assuage public fears about the coronavirus pandemic and noted they have become mired in serious credibility problems that damage their ability to direct the public.\r\n“The rosy sheen… [+1514 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "Stuff", "title": "Coronavirus: Tokyo Olympics still 'business as usual'", "description": "Athletes preparing for Games in Japan told to stay 'focused on your sport' as the coronavirus creates anxiety.", "url": "https://www.stuff.co.nz/sport/other-sports/119807930/coronavirus-tokyo-olympics-still-business-as-usual", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/y/w/1/u/t/image.related.StuffLandscapeSixteenByNine.1420x800.1zbwe2.png/1582679476251.jpg", "publishedAt": "2020-02-26T01:11:13Z", "content": "It's \"business as usual\" ahead of the Olympics despite the outbreak of coronavirus, says International Olympic Committee member Dick Pound.\r\n Speaking to the Associated Press, Pound, an IOC member since 1978,  told athletes to \"keep focused on your sport\".\r\n … [+3187 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "AMBROSE EVANS-PRITCHARD", "title": "With coronavirus uncontained, the global economy is heading for a sudden halt", "description": "ANALYSIS: If the coronavirus epidemic continues, it will set in motion a chain-reaction ending in a worldwide bust.", "url": "https://www.stuff.co.nz/business/world/119809673/with-coronavirus-uncontained-the-global-economy-is-heading-for-a-sudden-halt", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/c/7/b/3/image.related.StuffLandscapeSixteenByNine.1420x800.1zbxqh.png/1582676987161.jpg", "publishedAt": "2020-02-26T00:29:47Z", "content": "ANALYSIS: Covid-19 is self-evidently beyond the point of meaningful containment for the world as a whole.\r\n Virologists and infectious disease experts have known for three weeks that this was highly probable, and certainly not a mere tail-risk as suggested by… [+6486 chars]"}, {"source": {"id": null, "name": "Menshealth.com"}, "author": "Marty Munson", "title": "CDC Warns It's Time to Start Preparing for Coronavirus in the U.S.", "description": "\"This could be bad.\"", "url": "https://www.menshealth.com/health/a31105809/cdc-coronavirus-warning-how-not-to-freak-out/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/shutterstock-editorial-10566536g-1582673403.jpg?crop=1.00xw:0.753xh;0,0.134xh&resize=1200:*", "publishedAt": "2020-02-26T00:17:00Z", "content": "The CDC warned Americans this week that they should prepare for the new coronavirus, named COVID-19, to disrupt their lives. The New York Times quotes the director of the National Center for Immunization and Respiratory Disease, Nancy Messonnier, M.D. as sayi… [+3177 chars]"}, {"source": {"id": null, "name": "Malaysiakini.com"}, "author": "Malaysiakini", "title": "Second Wuhan evacuation plane lands in KLIA", "description": "UPDATED 8.15AM | CORONAVIRUS | The plane lands safely about 6.50am, carrying 66 of the 75 people scheduled to return.", "url": "https://www.malaysiakini.com/news/512227", "urlToImage": "https://i.ncdn.xyz/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2020/02/4a91bd02421d5c140240a3aa6460b4e0.jpg", "publishedAt": "2020-02-26T00:12:00Z", "content": "CORONAVIRUS | The second aircraft sent to evacuate Malaysians and their families from Wuhan and surrounding areas in China has safely returned to Malaysia.\r\nAirAsia flight AK8265 landed at KLIA about 6.50am, carrying 66 of the 75 people scheduled to depart Wu… [+1524 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Staff", "title": "Air Canada extends China flight cancellations to April 10 over COVID-19 outbreak - Global News", "description": "Air Canada extends China flight cancellations to April 10 over COVID-19 outbreak Global News Coronavirus: Sick Korean Air flight attendant reportedly served Tel Aviv, LA flight - Business Insider Business Insider Delta Braces For Coronavirus Impact Amid Seoul…", "url": "http://globalnews.ca/news/6596406/air-canada-china-flights-coronavirus/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/cpt11248279-e1582678788978.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-02-26T01:00:10Z", "content": "Air Canada is extending its cancellation of all flights between Canada and China to April 10 due to the novel coronavirus epidemic, following the lead of its U.S. counterparts.\r\nThe announcement comes nearly a month after the airline first halted direct fligh… [+1100 chars]"}, {"source": {"id": null, "name": "Theeconomiccollapseblog.com"}, "author": "Michael Snyder", "title": "Ominous Warnings About The Very Rapid Spread Of The Coronavirus", "description": "Is a widespread coronavirus outbreak inside the United States inevitable? After weeks of generally optimistic statements, officials are now warning us to prepare for the worst. Over the past several days we have seen the number of confirmed cases outside of C…", "url": "http://theeconomiccollapseblog.com/archives/ominous-warnings-about-the-very-rapid-spread-of-the-coronavirus", "urlToImage": "http://theeconomiccollapseblog.com/wp-content/uploads/2020/02/COVID-19-Coronavirus-Pandemic-Public-Domain.jpg", "publishedAt": "2020-02-26T00:55:09Z", "content": "Is a widespread coronavirus outbreak inside the United States inevitable?  After weeks of generally optimistic statements, officials are now warning us to prepare for the worst.  Over the past several days we have seen the number of confirmed cases outside of… [+9740 chars]"}, {"source": {"id": null, "name": "Brobible.com"}, "author": "paulsacca", "title": "Coronavirus Update: San Francisco Declares State Of Emergency, CDC: ‘This Might Be Bad,’ Hotel Quarantined, Iran Minster Infected", "description": "Coronavirus update: San Francisco state of emergency, CDC issues COVID-19 warning, hotel in Spain quarantined, Iran health minister infected", "url": "https://brobible.com/culture/article/coronavirus-update-cdc-hotel-quarantine-iran-san-francisco-vaccine/", "urlToImage": "https://brobible.files.wordpress.com/2020/02/gettyimages-1208601122.jpg?quality=90&w=650", "publishedAt": "2020-02-26T00:35:02Z", "content": "Getty Image / Europa Press News / Contributor\r\nThe coronavirus is quickly becoming a global outbreak and presenting a potential threat to the United States. The latest coronavirus update has the death toll a more than 2,700 worldwide, and over 80,000 confirme… [+5243 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Pippa Stevens", "title": "Trump is reportedly furious that the stock market is plunging on coronavirus fears", "description": "According to a new report, President Trump believes health officials' warnings over the coronavirus has sparked the market sell-off.", "url": "https://www.cnbc.com/2020/02/25/trump-is-reportedly-furious-with-the-plunging-stock-market-due-to-coronavirus-fears.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106382670-1581352535240gettyimages-1199936416.jpeg?v=1581365525", "publishedAt": "2020-02-26T00:35:00Z", "content": "President Donald Trump is reportedly furious that stocks are plunging, believing that health officials' warnings have spooked investors, The Washington Post reported Tuesday night, citing two people familiar with the president's thinking.\r\nThe president has r… [+1872 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Ross J Burland", "title": "The total number of confirmed coronavirus cases in Italy has increased to 323, including 11 deaths", "description": "According to the People's Daily China, the total number of confirmed coronavirus cases in Italy has increased to 323, including 11 deaths, as of 12 am", "url": "https://www.fxstreet.com/news/the-total-number-of-confirmed-coronavirus-cases-in-italy-has-increased-to-323-including-11-deaths-202002260019", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Europe/Eurozone_countries/Italy/map-of-italy-18438200_Large.jpg", "publishedAt": "2020-02-26T00:19:39Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "EUR/USD: Sell the rallies amid coronavirus spread, poor fundamentals – Citibank", "description": "Analysts at Citigroup offer their view on trading the EUR/USD pair in the near-term, as coronavirus contagion spills over to Italy. Key quotes: “The e", "url": "https://www.fxstreet.com/news/eur-usd-sell-the-rallies-amid-coronavirus-spread-poor-fundamentals-citibank-202002260108", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/EURUSD/money-13797882_Large.jpg", "publishedAt": "2020-02-26T01:08:28Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "NZD/USD extends losses towards 0.6300 amid broad risk-off", "description": "Despite bouncing off in the last minutes to 0.6320, NZD/USD fails to overcome the previous day’s negative tone amid the initial Asian session on Wedne", "url": "https://www.fxstreet.com/news/nzd-usd-extends-losses-towards-06300-amid-broad-risk-off-202002260017", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/NZDUSD/new-zealand-money-nzd-dollars-amp-coins-50479594_Large.jpg", "publishedAt": "2020-02-26T00:17:47Z", "content": "<ul><li>NZD/USD stays on the back foot as coronavirus fears weigh on the markets.</li><li>China’s deadly virus spreads faster in Europe, calls of vaccine remain doubtful.</li><li>The US officials flashed mixed signals, Tokyo Olympics in limbo.</li></ul>Despit… [+1931 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Health authorities expect coronavirus spread on US soil", "description": "WASHINGTON: American health authorities said on Tuesday (Feb 25) they ultimately expect the novel coronavirus to spread in the United States and are urging local governments, businesses, and schools to develop plans like cancelling mass gatherings or switchin…", "url": "https://www.channelnewsasia.com/news/world/health-authorities-expect-coronavirus-spread-on-us-soil-12470978", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12470976/16x9/991/557/14aea3246266df6515f443d067b52231/UL/usa-coronavirus.jpg", "publishedAt": "2020-02-26T00:25:52Z", "content": "WASHINGTON: American health authorities said on Tuesday (Feb 25) they ultimately expect the novel coronavirus to spread in the United States and are urging local governments, businesses, and schools to develop plans like cancelling mass gatherings or switchin… [+4171 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Asian stocks, Treasury yields fall as pandemic fears intensify", "description": "Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.", "url": "https://www.channelnewsasia.com/news/business/asian-stocks--treasury-yields-fall-as-pandemic-fears-intensify-12471020", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12471018/16x9/991/557/57c117963abbecb2bbcbb85dc20a7271/nO/a-man-walks-past-an-electronic-display-showing-asian-markets-indices-outside-a-brokerage-in-tokyo-1.jpg", "publishedAt": "2020-02-26T00:50:52Z", "content": "TOKYO: Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.\r\nThe S&amp;P 500 and the Dow Jones Indust… [+3172 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "The first coronavirus vaccine is ready for human testing", "description": "Fears over a larger global spread of the coronavirus and its disease COVID-19 show no signs of slowing. Global economies are beginning to feel the pinch and even the 2020 Tokyo Olympics faces a possible cancellation. With all this going on, scientists have be…", "url": "https://bgr.com/2020/02/25/coronavirus-vaccine-human-testing/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/02/coronavirus.jpg?quality=98&strip=all", "publishedAt": "2020-02-26T01:08:37Z", "content": "Fears over a larger global spread of the coronavirus and its disease COVID-19 show no signs of slowing. Global economies are beginning to feel the pinch and even the 2020 Tokyo Olympics faces a possible cancellation. With all this going on, scientists have be… [+1554 chars]"}, {"source": {"id": null, "name": "Mactrast.com"}, "author": "Chris Hauk", "title": "Coronavirus Travel Restrictions to Possibly Delay Apple’s iPhone 12 Lineup Preparations", "description": "Apple employees usually visit China this time of year to smooth the wrinkles out of the iPhone manufacturing process with assembly partners. However, the coronavirus is delaying the process. Read More...", "url": "https://www.mactrast.com/2020/02/coronavirus-travel-restrictions-to-possibly-delay-apples-iphone-12-lineup-preparations/", "urlToImage": "https://s4827.pcdn.co/wp-content/uploads/2020/01/Coronavirus-800x480-2.jpg", "publishedAt": "2020-02-26T00:37:52Z", "content": "Apple engineers and executives generally making the pilgrimage to China this time of year, as Apple’s Chinese suppliers begin readying the manufacture of the new iPhones. However, this year that process is being delayed due to coronavirus travel restrictions.… [+2300 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Shale Decline Inevitable As Oil Prices Crash", "description": "Financial stress and crashing oil prices have increased pressure on U.S. shale drillers in recent weeks, and have started to impact production in all major shale basins outside of the Permian", "url": "https://finance.yahoo.com/news/shale-decline-inevitable-oil-prices-010000901.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-26T01:00:00Z", "content": "The U.S. shale industry continues to show signs of slowing down, with production declining in major shale basins outside of the Permian.\r\nFinancing stress has plagued the shale sector for quite some time, but investors continue to bail on oil and gas stocks. … [+4234 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Despite CDC warnings, Rush Limbaugh dismisses coronavirus as effort ‘to bring down Trump’", "description": "The head of CDC's National Center for Immunization and Respiratory Diseases warned that Americans should prepare for the inevitability that the virus will spread here in the United States. That hasn’t stopped Rush Limbaugh from dismissing it as overhyped in a…", "url": "https://www.msnbc.com/hardball/watch/despite-cdc-warnings-rush-limbaugh-dismisses-coronavirus-as-effort-to-bring-down-trump-79434821967", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_hardball_limbaugh_200225_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-26T00:59:01Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Chris Hayes: Trump is worried coronavirus will be bad for his re-election", "description": "Trump is saying everything is fine so he can get re-elected. But that is not the President's job. The President's job is to deal with the problem, and keep Americans safe.", "url": "http://www.msnbc.com/all-in/watch/chris-hayes-trump-is-worried-coronavirus-will-be-bad-for-his-re-election-79436357617", "urlToImage": null, "publishedAt": "2020-02-26T01:08:03Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Laurence Watt", "title": "Volunteers makes task of self-isolation easier amid coronavirus fears", "description": "Richmond resident Fatima Wang is leading a group of volunteers to help travellers returning from China who might have been exposed to the COVID-19 virus.", "url": "https://www.cbc.ca/news/canada/british-columbia/coronavirus-volunteer-1.5474835", "urlToImage": "https://i.cbc.ca/1.5475893.1582671673!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/fatima-wang-1.jpeg", "publishedAt": "2020-02-26T00:47:16Z", "content": "A Richmond resident and former Wuhan resident is leading a group of volunteers to help travellers returning from China who might have been exposed to the COVID-19 virus. \r\nAfter hearing the news from her home city and province at the epicentre of the outbreak… [+2568 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "HANNAH MARTIN", "title": "Coronavirus: How New Zealand GPs, hospitals are bracing for potential cases", "description": "Hospital isolation rooms and 18 million face masks: How local health bodies are readying for COVID-19.", "url": "https://www.stuff.co.nz/national/health/119262541/coronavirus-how-new-zealand-gps-hospitals-are-bracing-for-potential-cases", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/c/4/t/j/image.related.StuffLandscapeSixteenByNine.1420x800.1z07kd.png/1582679003389.jpg", "publishedAt": "2020-02-26T01:03:21Z", "content": "Hospital isolation rooms, including the 'Ebola ward' at Auckland hospital, may be used for coronavirus patients if - or when - the virus arrives in New Zealand.\r\n Middlemore Hospital has multiple negative pressure rooms used for infectious airborne diseases, … [+3979 chars]"}, {"source": {"id": "the-american-conservative", "name": "The American Conservative"}, "author": "Michael Warren Davis", "title": "The Cost of Being an Entirely Bourgeois Nation", "description": "We don't make things anymore, including our own medicines. What happens when our dependence on globalization is really put to the test? The post The Cost of Being an Entirely Bourgeois Nation appeared first on The American Conservative.", "url": "https://www.theamericanconservative.com/articles/the-real-cost-of-being-an-entirely-bourgeois-nation/", "urlToImage": "https://www.theamericanconservative.com/wp-content/uploads/2020/02/bethlehem-steel.jpg", "publishedAt": "2020-02-26T00:51:27Z", "content": "We don't make things anymore, including our own medicines. What happens when our dependence on globalization is really put to the test?For the first six months of our marriage, my wife and I have settled on a little patch of rural Michigan while she finishes … [+9303 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "IOC member casts doubt on postponing or moving Tokyo Games (Stephen Wade/Associated Press)", "description": "Stephen Wade / Associated Press : IOC member casts doubt on postponing or moving Tokyo Games — TOKYO (AP) — A senior member of the International Olympic Committee said Tuesday that if it proves too dangerous to hold the Olympics in Tokyo this summer because o…", "url": "https://www.memeorandum.com/200225/p133", "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3a4325d74f347b9abbbd32dba7acaaa/3000.jpeg", "publishedAt": "2020-02-26T00:30:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Ross J Burland", "title": "USD/JPY steadies on 110 handle, correcting bloodbath lows", "description": "USD/JPY fell from 111.00 in Asia yesterday to just below 110.00 in the New York session following a drop in US stocks and lower US yields and equities", "url": "https://www.fxstreet.com/news/usd-jpy-steadies-on-110-handle-correcting-bloodbath-lows-202002260026", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/USDJPY/usdjpy_Large.jpg", "publishedAt": "2020-02-26T00:26:10Z", "content": "<ul><li>USD/JPY bulls replenish the 110 handle, but for how long in the face of the coronavirus spread?</li><li>Principal deputy director of the CDC: \"Current global circumstances suggest it’s likely this virus will cause a pandemic.\"</li></ul>USD/JPY fell fr… [+2289 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "Asian economies outside China to feel the heat of coronavirus economic fallout – Reuters poll", "description": "According to the latest Reuters poll, most major Asian economies are likely to face either a significant slowdown or contraction in the current quarte", "url": "https://www.fxstreet.com/news/asian-economies-outside-china-to-feel-the-heat-of-coronavirus-economic-fallout-reuters-poll-202002260046", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/asia-and-global-business-gm168716213-16133860_Large.jpg", "publishedAt": "2020-02-26T00:46:25Z", "content": "According to the latest Reuters poll, most major Asian economies are likely to face either a significant slowdown or contraction in the current quarter, as the negative economic fallout of the coronavirus will be more evident now.\r\n“With the contagion interru… [+1167 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Nicole Drum", "title": "Batman Writer and Artist Address Coronavirus Concerns Ahead of C2E2", "description": "Batman writer Tom King and artist Mitch Gerads along with Doc Shaner and Clay Mann are making major changes to their fan policies ahead of C2E2 and other upcoming conventions in response to the Centers for Disease Control's public health response the coronavi…", "url": "https://comicbook.com/comics/2020/02/26/batman-writer-and-artist-address-coronavirus-concerns-ahead-of-c/", "urlToImage": "https://media.comicbook.com/2020/02/batman-mitch-gerads-coronavirus-1208668-640x320.jpeg", "publishedAt": "2020-02-26T00:53:00Z", "content": "Batman writer Tom King and artist Mitch Gerads along with Doc Shaner and Clay Mann are making major changes to their fan policies ahead of C2E2 and other upcoming conventions in response to the Centers for Disease Control's public health response the coronavi… [+3413 chars]"}, {"source": {"id": null, "name": "Tweaktown.com"}, "author": "Derek Strickland", "title": "CD Projekt RED, Square Enix, Capcom, Bluehole all skip PAX East", "description": "The looming coronavirus threat is disrupting the games industry's biggest annual events, and key players like Sony, CD Projekt RED, Capcom, and many more are skipping major trade shows like PAX East. Following the CDC's warning to the American public, more ga…", "url": "https://www.tweaktown.com/news/70870/cd-projekt-red-square-enix-capcom-bluehole-all-skip-pax-east/index.html", "urlToImage": "https://images.tweaktown.com/news/7/0/70870_2355_cd-projekt-red-square-enix-capcom-skip-pax-east-due-to-coronavirus_full.png", "publishedAt": "2020-02-26T00:39:27Z", "content": "The looming coronavirus threat is disrupting the games industry's biggest annual events, and key players like Sony, CD Projekt RED, Capcom, and many more are skipping major trade shows like PAX East.\r\nFollowing the CDC's warning to the American public, more g… [+1892 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Dan De Luce and Leila Gharagozlou and Emmanuelle Saliba and Robert Windrem", "title": "Why is Iran's reported mortality rate for coronavirus higher than in other countries?", "description": "Iran’s reported mortality rate for the illness — about 16 percent — surpasses the rate for other countries by a dramatic margin.", "url": "https://news.yahoo.com/why-irans-reported-mortality-rate-005200497.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/WHs8VIxHZfXJWLNEQgEjEw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03OTMuNg--/https://s.yimg.com/uu/api/res/1.2/Or5ONcc1KaeNywW8DXX9jw--~B/aD0xNTUwO3c9MjUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/nbc_news_122/8be491f0a194e5b75ed700a27ab710d4", "publishedAt": "2020-02-26T00:52:00Z", "content": ""}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Jason Perlow", "title": "NewsGuard Technologies launches Coronavirus Misinformation Tracking Center", "description": "False information about COVID-19 is plaguing the internet. Now NewsGuard wants to stop it.", "url": "https://www.zdnet.com/article/newsguard-technologies-launches-coronavirus-misinformation-tracking-center/", "urlToImage": "https://zdnet3.cbsistatic.com/hub/i/r/2020/02/25/0f99385a-f509-40a2-a918-4f9b83bea0c9/thumbnail/770x578/92a096e96d3a084323dbb2651faa5a1f/health-impact-news.png", "publishedAt": "2020-02-26T01:00:07Z", "content": "New York City-based NewsGuard Technologies, which hosts a subscription service that rates the credibility of online content sources using a multi-point check system, has launched a Coronavirus Misinformation Tracking Center for the purposes of disseminating i… [+3464 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Three more Chinese regions lower emergency response level as virus threat recedes", "description": "The northwestern Chinese regions of Inner Mongolia and Xinjiang and the southwestern province of Sichuan have downgraded their emergency response level after...", "url": "https://news.yahoo.com/three-more-chinese-regions-lower-005706227.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-26T00:57:06Z", "content": "SHANGHAI, Feb 26 (Reuters) - The northwestern Chinese regions of Inner Mongolia and Xinjiang and the southwestern province of Sichuan have downgraded their emergency response level after assessing that health risks from the coronavirus outbreak have receded, … [+2117 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Betsy McCaughey", "title": "Pandemic prep: What you should know to protect against coronavirus", "description": "With outbreaks raging in ­Italy, Iran, South Korea and other countries, US authorities now predict coronavirus will strike Americans here, causing “significant disruptions to our lives.” The warning came from Centers for Disease Control and Prevention officia…", "url": "https://nypost.com/2020/02/25/pandemic-prep-what-you-should-know-to-protect-against-coronavirus/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/coronavirus-health-hospitals.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-26T00:32:28Z", "content": "With outbreaks raging in ­Italy, Iran, South Korea and other countries, US authorities now predict coronavirus will strike Americans here, causing significant disruptions to our lives. The warning came from Centers for Disease Control and Prevention official … [+4290 chars]"}, {"source": {"id": null, "name": "Crikey.com.au"}, "author": "Charlie Lewis", "title": "Virus watch: what you need to know about COVID-19", "description": "There's a lot of talk about 'pandemic' going around. How worried should you be? The post Virus watch: what you need to know about COVID-19 appeared first on Crikey.", "url": "https://www.crikey.com.au/2020/02/26/coronavirus-covid-19-australia/", "urlToImage": "https://www.crikey.com.au/wp-content/uploads/2020/02/20200211001448470263-original.jpg", "publishedAt": "2020-02-26T00:28:11Z", "content": "There's a lot of talk about 'pandemic' going around. How worried should you be?(Image: AP/Andy Wong)\r\nThis morning the World Health Organisation announced that countries should be “in a phase of preparedness” for a coronavirus pandemic. \r\nAs panic spreads, he… [+3820 chars]"}, {"source": {"id": null, "name": "Investmentwatchblog.com"}, "author": "alexmark", "title": "Jim Rickards: The impact of coronavirus on the Chinese economy is orders of magnitude greater than most analysts estimate", "description": null, "url": "https://www.investmentwatchblog.com/jim-rickards-the-impact-of-coronavirus-on-the-chinese-economy-is-orders-of-magnitude-greater-than-most-analysts-estimate/", "urlToImage": null, "publishedAt": "2020-02-26T00:33:11Z", "content": "by Jim Rickards via Daily Reckoning\r\nHow bad is the coronavirus pandemic in China? Its worse than the Chinese government knows and worse than the world believes.\r\nHere are the official statistics on the coronavirus (technically COVID-19) as of today: There ar… [+8569 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Bevan Shields", "title": "Italy's coronavirus 'red zone' springs a leak", "description": "In a very Italian way, the man-made dam wall designed to hold back the virus from spilling over into Europe is already cracking.", "url": "https://www.smh.com.au/world/europe/italy-s-coronavirus-red-zone-springs-a-leak-20200226-p544cp.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.22299431459254576%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_49/t_crop_custom/q_86%2Cf_auto/14d8924d653c0e469589a9e92c49c51269f3d017", "publishedAt": "2020-02-26T00:46:07Z", "content": "Normal text sizeLarger text sizeVery large text size\r\nOn the outskirts of Zorlesco, a small town in Italy's north, Luigi Malabarba is living on the frontline of the coronavirus outbreak - literally.\r\nPolice cars swooped in on Monday and a handful of officers … [+7349 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Reuters", "title": "1 in critical condition as new cases pop up in Germany", "description": "People in close contact with the patient will be kept in home isolation.", "url": "https://www.freemalaysiatoday.com/category/world/2020/02/26/1-in-critical-condition-as-new-cases-pop-up-in-germany/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/Germany-coronavirus-260220-AP.jpg", "publishedAt": "2020-02-26T00:27:23Z", "content": "A woman wearing a breathing mask walks in front of the Eurocity train station in Munich Feb 24. (AP pic)\r\nBERLIN: A 25-year-old man living in the southern German state of Baden-Wuerttemberg has tested positive for coronavirus after a trip to Milan, and anothe… [+1973 chars]"}, {"source": {"id": null, "name": "Minx.cc"}, "author": "Ace", "title": "CDC: The Question Isn't If We'll Have a Coronavirus Outbreak, But When", "description": "Does everyone remember the AKSHUALLY brigade of the media telling us three weeks ago that this was no big deal and AKSHUALLY not nearly as dangerous as the flu? Enemies of the People. Liberals -- including globalist NeverTrump GOPers --...", "url": "http://minx.cc/?post=386037", "urlToImage": null, "publishedAt": "2020-02-26T00:20:10Z", "content": null}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Extreme Panic Could Soon Hit USA…", "description": "U.S. government officials are doing their best to keep the general population calm, but everyone can see what is happening in the rest of the world. There are now empty store shelves in Italy just…", "url": "https://governmentslaves.news/2020/02/25/extreme-panic-could-soon-hit-usa/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/01/Coronavirus-Virus-World-China.jpg", "publishedAt": "2020-02-26T00:52:02Z", "content": "U.S. government officials are doing their best to keep the general population calm, but everyone can see what is happening in the rest of the world.  There are now empty store shelves in Italy just like there are in China.  People are waiting in extremely lon… [+8449 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "5 European nations report virus cases with links to Italy", "description": "Five European countries announced cases of COVID-19 disease Tuesday in people who had recently traveled from the Lombardy region in Italy, where the virus emerged as a fast-growing cluster last week.", "url": "https://www.bostonglobe.com/news/nation/2020/02/25/european-nations-report-virus-cases-with-links-italy/RwOPgFnbX1QoCTNRgiXoxH/story.html", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=140", "publishedAt": "2020-02-26T00:37:00Z", "content": "Croatia also confirmed its first case Tuesday, also a man who had traveled to Milan.\r\nPrime Minister Andrej Plenkovic said its a younger man, with a mild form of the disease and that he has been isolated and his condition is good.\r\nOfficials in the western Au… [+3851 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Sickest patients 'facing hours stuck on trolleys'", "description": "BBC analysis shows a surge in hospital delays as experts warn 'little in tank' to cope with coronavirus.", "url": "https://www.bbc.co.uk/news/health-51565492", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/802F/production/_99551823_gettyimages-108877854.jpg", "publishedAt": "2020-02-26T00:43:01Z", "content": "Image copyrightGetty Images\r\nMany of the most seriously ill patients are waiting for hours on trolleys and in corridors as the NHS struggles to find them beds, BBC research shows.\r\nNearly a quarter of patients admitted on to wards during December and January … [+5273 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "South Korea reports 169 more cases of new coronavirus, mostly in and around Daegu, bringing total infections to 1,146", "description": "South Korea reports 169 more cases of new coronavirus, mostly in and around Daegu, bringing total infections to 1,146", "url": "https://abcnews.go.com/Health/wireStory/south-korea-reports-169-cases-coronavirus-daegu-bringing-69216131", "urlToImage": "null", "publishedAt": "2020-02-26T01:10:15Z", "content": "SEOUL, South Korea -- \r\nSouth Korea reports 169 more cases of new coronavirus, mostly in and around Daegu, bringing total infections to 1,146."}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Disney CEO Bob Iger Steps Down in Surprise Announcement", "description": "The Walt Disney Co. named as his replacement Bob Chapek, most recently chairman of Disney’s parks, experiences and products business.", "url": "https://www.snopes.com/ap/2020/02/25/disney-ceo-bob-iger-steps-down-in-surprise-announcement/", "urlToImage": "https://www.snopes.com/tachyon/2020/02/ap_iger.jpg?fit=800,562", "publishedAt": "2020-02-26T00:49:01Z", "content": "NEW YORK (AP) Disney CEO Bob Iger, who steered the companys absorption of Star Wars, Pixar, Marvel and Foxs entertainment businesses and the launch of a Netflix challenger, is stepping down immediately, the company said in a surprise announcement Tuesday.\r\nTh… [+4673 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Lora Kolodny", "title": "Tesla shares have dropped by $100 in 2 days", "description": "Despite the drop, Tesla's market cap is still greater than that of General Motors, Ford and Fiat-Chrysler combined.", "url": "https://www.cnbc.com/2020/02/25/tesla-shares-have-dropped-by-100-in-2-days.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105997479-1562000109270gettyimages-173277243.jpeg?v=1578400843", "publishedAt": "2020-02-26T00:49:00Z", "content": "The share price of Tesla dropped more than $100 in just two days amid a broader market sell-off fueled by coronavirus concerns. The stock dipped by as much as 7.3% on Tuesday, and closed down more than 4% for the day at $799.91. It's shed about $19 billion in… [+3378 chars]"}, {"source": {"id": null, "name": "Shine.cn"}, "author": null, "title": "China has changed course of COVID-19 outbreak through pragmatic approach: WHO expert - SHINE", "description": "China has changed course of COVID-19 outbreak through pragmatic approach: WHO expert SHINE High rate of deaths in devastated Wuhan Hong Kong Standard View Full coverage on Google News", "url": "https://www.shine.cn/news/nation/2002262825/", "urlToImage": "https://obj.shine.cn/files/2020/02/26/87378914-5160-4e7f-ba56-7649fab04da0_0.jpg", "publishedAt": "2020-02-26T00:34:00Z", "content": "Team leader of the joint mission between World Health Organization and China on COVID-19, Bruce Aylward, shows graphics during a press conference at the WHO headquarters in Geneva on February 25, 2020.\r\nChina has changed the course of COVID-19 outbreak, Bruce… [+2214 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Mirror Football)", "title": "Ed Woodward says Manchester United are monitoring coronavirus situation closely", "description": "Inter Milan's Europa League clash against Ludogorets will be played behind closed doors, and with United also in the competition the club are poised to follow any advice from UEFA or Premier League", "url": "https://www.mirror.co.uk/sport/football/news/ed-woodward-says-manchester-united-21577897", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21387868.ece/ALTERNATES/s1200/0_Ed-Woodward-File-Photo.jpg", "publishedAt": "2020-02-26T00:48:45Z", "content": "Manchester United are closely monitoring the coronavirus situation as sporting events continue to be impacted, executive vice-chairman Ed Woodward has said. \r\nChina has reported 77,658 cases and 2,663 deaths following the outbreak of the virus that has spread… [+2331 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Victor Reklaitis", "title": "Live blog: Updates and analysis as 2020 Democrats debate in South Carolina", "description": "Seven Democratic presidential hopefuls are debating in South Carolina on Tuesday night ahead of the state’s primary on Saturday, and MarketWatch is...", "url": "https://www.marketwatch.com/story/2020-democrats-debate-in-south-carolina-live-blog-2020-02-25", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IA784_debate_ZG_20200224123916.jpg", "publishedAt": "2020-02-26T00:52:36Z", "content": "Seven Democratic presidential hopefuls are debating in South Carolina on Tuesday night ahead of the states primary on Saturday, and MarketWatch is delivering live updates on the action.\r\nJoe Biden, Mike Bloomberg, Pete Buttigieg, Amy Klobuchar, Bernie Sanders… [+615 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Richard Klasco, Contributor, Richard Klasco, Contributor", "title": "Sorry, I Don't Want Your Cold. Please Keep It To Yourself", "description": "Nothing offends a cold sufferer more than the suggestion that they might pose a risk to others.", "url": "https://www.forbes.com/sites/richardklasco/2020/02/25/sorry-i-dont-want-your-cold-please-keep-it-to-yourself/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F148981627%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D5280%26cropY1%3D210%26cropY2%3D3180", "publishedAt": "2020-02-26T00:15:42Z", "content": "Nothing offends a cold sufferer more than the suggestion that they might pose a risk to others.\r\nViruses such as the common cold, influenza, and coronavirus are highly contagious. Yet, some cold sufferers live in denial of this inconvenient truth. \r\nGetty\r\nAs… [+3747 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribers)", "title": "Univar Inc (UNVR) Q4 2019 Earnings Call Transcript", "description": "UNVR earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/25/univar-inc-unvr-q4-2019-earnings-call-transcript.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-26T01:00:48Z", "content": "Image source: The Motley Fool.\r\nUnivar Inc (NYSE:UNVR)Q4 2019 Earnings CallFeb 25, 2020, 9:00 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nGood morning, ladies and g… [+54940 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Sonnemaker", "title": "Amazon is reportedly deleting some third-party listings that jack up surgical mask prices as the coronavirus creates a shortage (AMZN)", "description": "The coronavirus outbreak has led to a shortage of protective masks and other medical supplies, leading some sellers to significantly increase prices. Amazon has been trying to prevent the practice on its platform, alerting sellers who may be in violation of i…", "url": "https://www.businessinsider.com/amazon-battles-sellers-over-pricing-amid-coronavirus-mask-shortage-2020-2", "urlToImage": "https://i.insider.com/5e55b57ffee23d7d85188e67?width=1200&format=jpeg", "publishedAt": "2020-02-26T00:49:08Z", "content": "As people across the world try to protect themselves from the Wuhan coronavirus, which has now claimed 2,700 lives and infected another 80,000, demand for medical supplies has spiked. As a result, prices for products like surgical masks have jumped to several… [+1661 chars]"}, {"source": {"id": null, "name": "Alternet.org"}, "author": "Cody Fenwick", "title": "Trump is already bungling the coronavirus response — and it could get much worse", "description": "When he was a private citizen in 2014, Donald Trump railed against President Barack Obama about the unfolding Ebola crisis, even though the outbreak never had a major impact on… Related Stories Republicans push aggressive and pointless anti-abortion bills as …", "url": "https://www.alternet.org/2020/02/trump-is-already-bungling-the-coronavirus-response-and-it-could-get-much-worse/", "urlToImage": "https://www.alternet.org/wp-content/uploads/2020/02/49579043171_5fc7001afe_o.jpg", "publishedAt": "2020-02-26T01:02:24Z", "content": "When he was a private citizen in 2014, Donald Trump railed against President Barack Obama about the unfolding Ebola crisis, even though the outbreak never had a major impact on the United States mainland. But with a keen instinct for political winds, Trump ri… [+6139 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": "Tristan Harrison", "title": "Coronavirus: Is there safety anywhere on the ASX?", "description": "The share market continues to be volatile because of the coronavirus, is there safety anywhere on the ASX? The post Coronavirus: Is there safety anywhere on the ASX? appeared first on Motley Fool Australia.", "url": "https://www.fool.com.au/2020/02/26/coronavirus-is-there-safety-anywhere-on-the-asx/", "urlToImage": "https://www.fool.com.au/wp-content/uploads/2019/05/Safe-dividends-16.9-600x337.jpg", "publishedAt": "2020-02-26T00:45:29Z", "content": "The share market continues to be volatile because of the coronavirus, is there safety anywhere on the ASX?\r\nThe All Ordinaries(ASX: XAO) has fallen another 1.8% this morning. Highly-valued growth shares like Magellan Financial Group Ltd(ASX: MFG) and Pro Medi… [+4134 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Tyler Clifford", "title": "Cramer's lightning round: 'Nothing's immunized from the coronavirus'", "description": "\"Mad Money\" host Jim Cramer rings the lightning round bell, which means he's giving his answers to callers' stock questions at rapid speed.", "url": "https://www.cnbc.com/2020/02/25/cramer-lightning-round-nothing-is-immunized-from-the-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/102086320-mad-money-lightning-2.jpg?v=1532384256", "publishedAt": "2020-02-26T00:18:52Z", "content": "Axon Enterprise: \"Nothing's immunized from the coronavirus, but you know I like Axon ... It's been a big win for us and we're reiterating that we still like it.\"\r\nInseego: \"Oh, man. It's got 5G and it's got SaaS, and therefore it means that they ought to come… [+902 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Edited Transcript of STWD earnings conference call or presentation 25-Feb-20 3:00pm GMT", "description": "Q4 2019 Starwood Property Trust Inc Earnings Call", "url": "https://finance.yahoo.com/news/edited-transcript-stwd-earnings-conference-010428628.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-26T01:04:28Z", "content": "GREENWICH Feb 26, 2020 (Thomson StreetEvents) -- Edited Transcript of Starwood Property Trust Inc earnings conference call or presentation Tuesday, February 25, 2020 at 3:00:00pm GMT=============================================================================… [+78893 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Holly Secon", "title": "Men's beards could render face masks useless, health authorities warn — one surprisingly comprehensive graphic reveals why 'walrus' is fine but 'mutton chops' won't do", "description": "Sales of medical face masks are spiking around the world amid an outbreak of a new type of coronavirus, although experts say they're not the most effective form of protection. More »", "url": "https://www.businessinsider.com.au/cdc-recommends-different-facial-hairstyles-work-better-with-face-masks-2020-2", "urlToImage": "https://i.insider.com/5e55b2f1fee23d7edc628104", "publishedAt": "2020-02-26T00:44:45Z", "content": "The demand for face masks is skyrocketing amid the global coronavirus outbreak.\r\nBut according to health experts, most members of the public use their medical masks wrong. Often, people will touch their facemask to adjust it or take it off, rendering its germ… [+3681 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Reuters Natalie Rahhal Acting Us Health Editor", "title": "US begins first coronavirus treatment clinical trial using Ebola drug in Nebraska patients", "description": "The first coronavirus patient in the trial has already been begun treatment in the trial of remdesivir at the University of Nebraska Medical Center. Doctors expect results within the year.", "url": "https://www.dailymail.co.uk/health/article-8043547/U-S-begins-coronavirus-clinical-trial-testing-Gileads-experimental-drug.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/22/25194832-0-image-a-9_1582669250150.jpg", "publishedAt": "2020-02-26T00:21:57Z", "content": "US health officials said on Tuesday the first clinical trial testing Gilead Sciences Inc's experimental antiviral drug, remdesivir, in hospitalized patients with the coronavirus has started.\r\nThe first trial participant is an American who was repatriated afte… [+3239 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stanley White", "title": "Asian stocks, Treasury yields fall as pandemic fears intensify", "description": "Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows.", "url": "https://in.reuters.com/article/us-global-markets-idINKBN20K01Y", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200226&t=2&i=1495239038&w=1200&r=LYNXMPEG1P027", "publishedAt": "2020-02-26T00:51:20Z", "content": "TOKYO (Reuters) - Asian shares fell on Wednesday as a U.S. warning to Americans to prepare for the possibility of a coronavirus pandemic drove another Wall Street tumble and pushed yields on safe-haven Treasuries to record lows. \r\nThe S&amp;P 500 .SPX and the… [+3144 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "bshilliday", "title": "Selena Gomez Bonds With Mom Mandy Teefey On Chicago Trip: See Rare Photos Of Them Together", "description": "Selena Gomez and her mom Mandy Teefey took a mother-daughter weekend trip to Chicago. The singer shared a series of pics where they took in the sights and also helped solve a cold case murder at CrimeCon.", "url": "https://hollywoodlife.com/2020/02/25/selena-gomez-mom-mandy-teefey-chicago-trip-pics-tourists/", "urlToImage": "https://pmchollywoodlife.files.wordpress.com/2020/02/selena-gomez-mom-mandy-teeft-shutterstock-ftr.jpg", "publishedAt": "2020-02-26T01:10:18Z", "content": "Selena Gomez and her mom Mandy Teefey took a mother-daughter weekend trip to Chicago. The singer shared a series of pics where they took in the sights and also helped solve a cold case murder at CrimeCon.\r\nSelena Gomez is more that just a superstar singer. Sh… [+2084 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sarah Vine for the Daily Mail", "title": "SARAH VINE: The most shattering truth about Harvey Weinstein and women has been laid bare", "description": "SARAH VINE: Like all skilled abusers he knew how to exploit the ambiguity of the situation to his advantage. He set out deliberately to manipulate and confuse their emotions.", "url": "https://www.dailymail.co.uk/debate/article-8044747/SARAH-VINE-shattering-truth-Harvey-Weinstein-women-laid-bare.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/26/00/25200518-0-image-a-80_1582677646185.jpg", "publishedAt": "2020-02-26T00:47:22Z", "content": "The sordid story of Harvey Weinstein has taught us many unsavoury truths about Hollywood, and about the kind of abuse that lurks behind those million-dollar smiles.\r\nNever before have the workings of this tawdry world been laid bare in such excoriating detail… [+9045 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Enoch Yiu, Enoch Yiu", "title": "Coronavirus will hurt the HK$1 trillion pension savings of 3 million Hongkongers as stock markets slump, warns MPF watchdog", "description": "The coronavirus outbreak has caused a global stock market slump which will hurt the returns of almost 3 million Hongkongers with savings tied up in the HK$1 trillion (US$128.38 billion) mandatory pension scheme, according to the regulator and industry watcher…", "url": "https://www.scmp.com/business/banking-finance/article/3052297/coronavirus-will-hurt-hk1-trillion-pension-savings-3", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/25/10758256-57b3-11ea-b438-8452af50d521_image_hires_193956.JPG?itok=WLcxmLat&v=1582630801", "publishedAt": "2020-02-26T00:45:07Z", "content": null}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Morgan Chalfant", "title": "Five takeaways from Trump's trip to India", "description": "President Trump on Tuesday concluded a busy two-day trip to India, where he was received in spectacular fashion but came up short on securing a trade deal.Trump used the visit to highlight acc...", "url": "https://thehill.com/homenews/administration/484623-five-takeaways-from-trumps-trip-to-india", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_modinarendra_022520getty_lead.jpg", "publishedAt": "2020-02-26T00:56:37Z", "content": "President TrumpDonald John TrumpTrump suggests Sotomayor, Ginsburg should have to recuse themselves on 'Trump related' casesSanders says idea he can't work with Republicans is 'total nonsense' Sanders releases list of how to pay for his proposalsMORE on Tuesd… [+7748 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": "James Mickleboro", "title": "SeaLink Travel share price jumps 9% on half year results", "description": "The SeaLink Travel Group Ltd (ASX:SLK) share price is surging higher following the release of its half year results... The post SeaLink Travel share price jumps 9% on half year results appeared first on Motley Fool Australia.", "url": "https://www.fool.com.au/2020/02/26/sealink-travel-share-price-jumps-9-on-half-year-results/", "urlToImage": "https://www.fool.com.au/wp-content/uploads/2018/12/Beat-the-market-16.9-600x337.jpeg", "publishedAt": "2020-02-26T00:36:04Z", "content": "The SeaLink Travel Group Ltd(ASX: SLK) share price has avoided the market selloff and is charging higher on Wednesday.\r\nIn morning trade the travel company’s shares are up 9% to $4.23 following its half year results release.\r\nHow did SeaLink perform in the fi… [+2587 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Dear NY Times, please do not say Iran is emerging as a worldwide coronavirus threat, we have a trigger-happy president with nukes that already thinks Iran is a deadly threat. Kthxbye, America [Scary]", "description": "Dear NY Times, please do not say Iran is emerging as a worldwide coronavirus threat, we have a trigger-happy president with nukes that already thinks Iran is a deadly threat. Kthxbye, America", "url": "https://www.fark.com/comments/10723482/Dear-NY-Times-please-do-not-say-Iran-is-emerging-as-a-worldwide-coronavirus-threat-we-have-a-trigger-happy-president-with-nukes-that-already-thinks-Iran-is-a-deadly-threat-Kthxbye-America", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/i/iD/fark_iDBSTEKgXP98JSAep8wjzmcdmuc.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583125200&Signature=mHJ32EWjQG3WFyhqc%2F6F2yYTH9g%3D", "publishedAt": "2020-02-26T01:06:00Z", "content": "How bad could it be?North Korea has reported zero cases.None.Nada.Indonesia has reported zero cases.Zilch.Naught.\r\nI'm sure those open, honest, capable, and competent governments would let us know if they had any cases."}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Tyler Sonnemaker", "title": "Amazon is reportedly deleting some third-party listings that jack up surgical mask prices as the coronavirus creates a shortage", "description": "As people across the world try to protect themselves from the Wuhan coronavirus, which has now  claimed 2,700 lives and infected another 80,000, demand for medical supplies has spiked. As a result, prices for products like surgical masks have jumped to severa…", "url": "https://www.businessinsider.com.au/amazon-battles-sellers-over-pricing-amid-coronavirus-mask-shortage-2020-2", "urlToImage": "https://i.insider.com/5e55a489fee23d73875a99f2", "publishedAt": "2020-02-26T00:49:08Z", "content": "<ul><li>\r\nThe coronavirus outbreak has led to a shortage of protective masks and other medical supplies, leading some sellers to significantly increase prices.\r\n</li><li>\r\nAmazon has been trying to prevent the practice on its platform, alerting sellers who ma… [+2582 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "San Francisco Chronicle", "title": "Local emergency declared in San Francisco amid coronavirus concerns", "description": "Not long after CDC officials urged Americans to prepare for coronavirus outbreaks that will almost certainly begin to spread nationwide, Mayor London Breed declared a state of emergency for the city of San Francisco.", "url": "https://www.freerepublic.com/focus/f-news/3819505/posts", "urlToImage": null, "publishedAt": "2020-02-26T01:00:26Z", "content": "Skip to comments.\r\nLocal emergency declared in San Francisco amid coronavirus concernsSan Francisco Chronicle ^\r\n | February 25, 2020\r\n | Amanda Bartlett\r\nPosted on 02/25/2020 5:00:26 PM PST by artichokegrower\r\nNot long after CDC officials urged Americans to … [+4744 chars]"}]