[{"source": {"id": "engadget", "name": "Engadget"}, "author": "Jon Fingas", "title": "Google explains how it's tackling the coronavirus outbreak", "description": "Google's efforts to inform people about the coronavirus outbreak extend well beyond a search alert. The company has outlined all the ways it's addressing COVID-19, including a bid to stamp out misinformation. On top of the SOS Alert (with news and tips) in we…", "url": "https://www.engadget.com/2020/03/06/google-coronavirus-information/", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D1600%252C800%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C800%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2020-03%252F454a3670-5ff1-11ea-bcbf-bebb3775eb52%26client%3Da1acac3e1b3290917d92%26signature%3D8c2c69a480746a81170dabf362c51f81caea5441&client=amp-blogside-v2&signature=8f17e691841b35af6d5f4f4551a473712ecbefa6", "publishedAt": "2020-03-06T22:47:00Z", "content": "What you don't see will also matter. Google said it was \"working around the clock\" to stamp out conspiracy theories and other misinformation, including malware and phishing scams exploiting fear of the coronavirus outbreak. It's blocking all ads trying to exp… [+673 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Second coronavirus death confirmed in England", "description": "A second patient in England who tested positive for coronavirus has died, England's Chief Medical Officer Chris Whitty confirmed on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-death-idUSKBN20T2Y4", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T22:11:48Z", "content": "(Reuters) - A second patient in England who tested positive for coronavirus has died, England’s Chief Medical Officer Chris Whitty confirmed on Friday. \r\nThe patient was being treated at Milton Keynes University Hospital and had underlying health conditions, … [+113 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Did China's Travel Bans Help Delay the Outbreak? It's Complicated", "description": "New research looking into China’s early containment efforts of the deadly new coronavirus suggests the government’s strict travel restrictions may have bought the world some time, if not China itself. But it also seems that other travel restrictions to affect…", "url": "https://gizmodo.com/did-chinas-travel-bans-help-delay-the-outbreak-its-com-1842162406", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/f0fiq7k8rhtnp9rrfklo.jpg", "publishedAt": "2020-03-06T22:31:00Z", "content": "New research looking into Chinas early containment efforts of the deadly new coronavirus suggests the governments strict travel restrictions may have bought the world some time, if not China itself. But it also seems that other travel restrictions to affected… [+3482 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pence: 21 people test positive for coronavirus on cruise ship", "description": "Twenty-one people aboard a cruise ship denied entry to San Francisco have tested positive for coronavirus and the ship will be brought to a non-commercial port this weekend, and all passengers and crew will be tested, U.S. Vice President Mike Pence said on Fr…", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-pence-idUSKBN20T304", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499762559&w=1200&r=LYNXMPEG2520Q", "publishedAt": "2020-03-06T22:56:24Z", "content": "WASHINGTON (Reuters) - Twenty-one people aboard a cruise ship denied entry to San Francisco have tested positive for coronavirus and the ship will be brought to a non-commercial port this weekend, and all passengers and crew will be tested, U.S. Vice Presiden… [+104 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Trump says he would rather have cruise ship passengers stay on ship", "description": "President Donald Trump said on Friday he would rather have passengers on a cruise ship, which was denied entry to San Francisco over coronavirus concerns, remain on board the vessel.", "url": "https://www.reuters.com/article/us-health-coronavirus-cruiseship-trump-idUSKBN20T2ZY", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499761026&w=1200&r=LYNXMPEG2520O", "publishedAt": "2020-03-06T22:51:36Z", "content": "ATLANTA (Reuters) - President Donald Trump said on Friday he would rather have passengers on a cruise ship, which was denied entry to San Francisco over coronavirus concerns, remain on board the vessel. \r\nBut Trump said he would let others make the decision w… [+381 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "SXSW Canceled Due To Coronavirus After Austin Declares 'Local Disaster'", "description": "South by Southwest, the annual tech, film and music conference held in Austin, Texas, has been canceled due to concerns surrounding the COVID-19 coronavirus outbreak. From a report: Local government officials announced the update at a press conference Friday …", "url": "https://science.slashdot.org/story/20/03/06/2241211/sxsw-canceled-due-to-coronavirus-after-austin-declares-local-disaster", "urlToImage": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now", "publishedAt": "2020-03-06T22:41:00Z", "content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "N.Y. travel insurance to cover coronavirus in 'cancel for any reason' policies: Gov. Cuomo", "description": "Travel insurance companies and travel agents will offer New York residents and businesses the ability to buy coverage when making travel plans that would allow them to cancel a trip for any reason, including those related to coronavirus, New York Governor And…", "url": "https://www.reuters.com/article/us-new-york-health-insurance-idUSKBN20T2ZD", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499754233&w=1200&r=LYNXMPEG25209", "publishedAt": "2020-03-06T22:31:34Z", "content": "(Reuters) - Travel insurance companies and travel agents will offer New York residents and businesses the ability to buy coverage when making travel plans that would allow them to cancel a trip for any reason, including those related to coronavirus, New York … [+90 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Michelle Mark", "title": "21 people aboard a cruise ship off the California coast tested positive for coronavirus after tests were helicoptered in", "description": "Twenty-one people aboard the Grand Princess cruise ship have tested positive for the novel coronavirus while the ship has remained in limbo off the California coast. Of those who tested positive, 19 were crew members, and two were passengers. The California A…", "url": "https://www.businessinsider.com/grand-princess-cruise-ship-passengers-positive-for-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e627c92fee23d1e083ec607?width=1200&format=jpeg", "publishedAt": "2020-03-06T22:51:56Z", "content": "Twenty-one people have tested positive for the new coronavirus on the Grand Princess cruise ship, which has been circling off the California coast for days, officials announced Friday afternoon. Of those, 19 were crew members, and two were passengers.\r\nOveral… [+2089 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "A leaked presentation reveals the document US hospitals are using to prepare for a major coronavirus outbreak. It estimates 96 million US coronavirus cases and 480,000 deaths.", "description": "Hospitals are confronting the rising threat of the novel coronavirus in the US. In a February webinar presentation hosted by the American Hospital Association, national healthcare experts from organizations across the US laid out what hospitals need to know a…", "url": "https://www.businessinsider.com/presentation-how-hospitals-are-preparing-for-us-coronavirus-outbreak-2020-3", "urlToImage": "https://i.insider.com/58582822a1a45e60398b66b5?width=1200&format=jpeg", "publishedAt": "2020-03-06T22:22:00Z", "content": "The spread of the coronavirus outbreak in the US could push the healthcare system to its limits. \r\nHospitals are bracing for what could be millions of admissions nationwide as the virus spreads. \r\nThe American Hospital Association, which represents thousands … [+1954 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Napier Lopez", "title": "SXSW has officially been canceled amid coronavirus concerns", "description": "South by Southwest, the huge music, technology, and film festival in Austin, has been canceled for the first time in 34 years. By now, the culprit is no surprise: Coronavirus. “After careful deliberation, there was no acceptable path forward that would mitiga…", "url": "https://thenextweb.com/?p=1277031", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2FSnag_1094152b.png&signature=f45b25fede4e45adc1dbf1a58ad41c21", "publishedAt": "2020-03-06T22:43:52Z", "content": "South by Southwest, the huge music, technology, and film festival in Austin, has been canceled for the first time in 34 years. By now, the culprit is no surprise: Coronavirus.\r\nAfter careful deliberation, there was no acceptable path forward that would mitiga… [+1207 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "awoodward@businessinsider.com (Aylin Woodward,Shayanne Gal)", "title": "One chart shows 11 countries' current coronavirus death rates, based on the known number of cases and deaths", "description": "The death rate for the coronavirus varies around the world — but that's likely because some countries are testing more people than others.", "url": "https://news.yahoo.com/one-chart-shows-11-countries-225900214.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/lTY3qURejx7evEWxNn.MIA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/7pEA3JDLTILXIX2ICefwMw--~B/aD0xMjUwO3c9MTY2NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/dbf4938597bba0e3094882e3a47711f2", "publishedAt": "2020-03-06T22:59:00Z", "content": "Disinfection workers spray antiseptic solution against the coronavirus at a subway station on February 21 in Seoul, South Korea.\r\nChung Sung-Jun/Getty Images\r\n<ul><li>More than 100,000 people have been infected with the new coronavirus and 3,460 have died. Ab… [+3992 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Lydia O'Connor", "title": "⚡ Austin Cancels SXSW Festival Amid Coronavirus Outbreak", "description": "The festival was scheduled to start on March 13.", "url": "https://www.huffpost.com/entry/austin-cancel-sxsw-festival-coronavirus_n_5e62c83dc5b6055728050b25", "urlToImage": "https://img.huffingtonpost.com/asset/5e62c966230000d41a0bfcc4.jpeg?cache=xewErCC1f5&ops=1200_630", "publishedAt": "2020-03-06T22:13:35Z", "content": "The city of Austin announced Friday that it is canceling South by Southwest amid health concerns over the current coronavirus outbreak.\r\nThe annual media festival, known as SXSW, was scheduled to kick off on March 13. The organizers said they hope to reschedu… [+63 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward and Shayanne Gal", "title": "One chart shows 11 countries' current coronavirus death rates, based on the known number of cases and deaths", "description": "More than 100,000 people have been infected with the new coronavirus and 3,460 have died. About 80% of cases and deaths are in China. But the death rate — the number of known deaths out of the total number of confirmed cases — varies widely by country right n…", "url": "https://www.businessinsider.com/coronavirus-death-rate-by-country-2020-3", "urlToImage": "https://i.insider.com/5e629c33fee23d612d5b8c46?width=1200&format=jpeg", "publishedAt": "2020-03-06T22:59:00Z", "content": "The death rate from the new coronavirus is higher in the US so far than anywhere else in the world. The rate, a basic calculation that divides the number of known deaths by the total number of confirmed cases, was about 6% in the US as of Friday morning. Four… [+2816 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "SXSW canceled, Austin says goodbye to $350 million", "description": "SXSW, Austin's annual festival for music, tech, business, art, and culture was canceled because of the spreading coronavirus. By the festival producers' own calculation, SXSW pumped $350 million into Austin it 2018, $356 million in 2019. The Austin American S…", "url": "https://boingboing.net/2020/03/06/sxsw-canceled-austin-says-goo.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/SxSW_logo-1.jpg?fit=680%2C408&ssl=1", "publishedAt": "2020-03-06T22:30:35Z", "content": "SXSW, Austin's annual festival for music, tech, business, art, and culture was canceled because of the spreading coronavirus.  By the festival producers' own calculation, SXSW pumped $350 million into Austin it 2018, $356 million in 2019.\r\nThe Austin American… [+2190 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "South by Southwest festival cancelled over coronavirus", "description": "The world famous event is called off for the first time in its 34-year history.", "url": "https://www.bbc.co.uk/news/world-us-canada-51778423", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7D11/production/_111171023_gettyimages-1136286091.jpg", "publishedAt": "2020-03-06T22:28:05Z", "content": "Image copyrightGetty ImagesImage caption\r\n An audience watches a screening of a new film at SXSW\r\nOne of America's most famous music festivals, South by Southwest, has been cancelled due to coronavirus fears.\r\nOrganisers of the annual event in Austin, Texas, … [+794 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Walmart leadership is urging its 9,000 'Elite Fleet' truck drivers to buy cleaning supplies with their company cards amid coronavirus fears", "description": "Walmart confirmed to Business Insider that it sent an audio message to its truck drivers on March 4 with advice on how to conduct business amid coronavirus concerns. Joe Metzger, who is senior vice president of supply chain at Walmart, advised truckers to pur…", "url": "https://www.businessinsider.com/coronavirus-turcking-walmart-truck-drivers-buy-supplies-company-cards-2020-3", "urlToImage": "https://i.insider.com/5e62c264fee23d1646677b7a?width=1200&format=jpeg", "publishedAt": "2020-03-06T23:02:27Z", "content": "A Walmart executive sent an audio message to the mega-retailer's trucking fleet on March 4 about how to navigate coronavirus, the company confirmed to Business Insider. \r\nIn the audio recording, Joe Metzger, who is senior vice president of supply chain at Wal… [+2280 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Noah Buhayar and Nic Querolo / Bloomberg", "title": "Local Residents Complain Over Plans For Coronavirus Motel at Epicenter of Seattle Outbreak", "description": "Officials in King County, Washington said they plan to buy and renovate an Econo Lodge south of Seattle to house virus patients.", "url": "https://time.com/5798644/seattle-coronavirus-econo-lodge/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/seattle-coronavirus-econo-lodge.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-06T23:03:26Z", "content": "(Bloomberg) — What started as a bold plan to slow the spread of the coronavirus in the Seattle area is quickly devolving into a Nimby battle.\r\nOfficials in King County, Washington, the epicenter of the outbreak in the U.S., said this week they would use emerg… [+4446 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Jim Metzendorf", "title": "AC Podcast 463: Google I/O canceled; New Pixel features; OnePlus 8 leaks", "description": "Google I/O 2020 has been canceled due to COVID-19 concerns, but presentations will still be held digitally. As developments moves forward, new features are available to Google Pixel users. Daniel Bader, Andrew Martonik, and Jerry Hildenbrand details what's go…", "url": "https://www.androidcentral.com/ac-podcast-463-google-io-canceled-new-pixel-features-oneplus-8-leaks", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/google-assistant-google-io-2019.jpg?itok=va72EsCc", "publishedAt": "2020-03-06T22:52:57Z", "content": "Google I/O 2020 has been canceled due to COVID-19 concerns, but presentations will still be held digitally. As developments moves forward, new features are available to Google Pixel users. Daniel Bader, Andrew Martonik, and Jerry Hildenbrand details what's go… [+537 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Jon Swartz", "title": "South By Southwest festival canceled due to coronavirus", "description": "Bowing to immense pressure amid the spread of COVID-19, organizers of the South By Southwest conference in Austin canceled the event late Friday, a week before the event was set to begin.", "url": "http://www.marketwatch.com/story/south-by-southwest-festival-canceled-due-to-coronavirus-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB702_sxsw_0_ZG_20200306171110.jpg", "publishedAt": "2020-03-06T22:19:52Z", "content": "Bowing to immense pressure amid the spread of COVID-19, the city of Austin canceled the South By Southwest conference late Friday, a week before the event was set to begin. I have declared a local disaster in the city, and associated with that, I have issued … [+1346 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "SXSW 2020 canceled after Austin declares local emergency", "description": "City officials in Austin, Texas, on Friday issued an order that effectively cancels the annual South by Southwest (SXSW) festival over concerns that the mass gathering could help spread the novel coronavirus.", "url": "https://appleinsider.com/articles/20/03/06/sxsw-2020-canceled-after-austin-declares-local-emergency", "urlToImage": "https://photos5.appleinsider.com/gallery/34806-63136-SXSW-xl.jpg", "publishedAt": "2020-03-06T22:59:07Z", "content": "City officials in Austin, Texas, on Friday issued an order that effectively cancels the annual South by Southwest (SXSW) festival over concerns that the mass gathering could help spread the novel coronavirus.The event, which features film and music festivals,… [+975 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Michael Potuck", "title": "SXSW canceled as Austin’s Mayor announces ‘local disaster’", "description": "In a move that surprised many, earlier this week Austin, Texas officials and SXSW organizers said the festival would still happen despite coronavirus concerns. However, now the city’s mayor has declared a “local disaster” and SXSW has been canceled. more… The…", "url": "https://9to5mac.com/2020/03/06/sxsw-canceled-austin-declared-local-disaster/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/sxsw-canceled-coronavirus.jpg?quality=82&strip=all", "publishedAt": "2020-03-06T22:22:27Z", "content": "In a move that surprised many, earlier this week Austin, Texas officials and SXSW organizers said the festival would still happen despite coronavirus concerns. However, now the city’s mayor has declared a “local disaster” and SXSW has been canceled.\r\nReported… [+955 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo News Video", "title": "Trump says anyone who needs a coronavirus test 'gets a test'", "description": "While speaking with press at the CDC, President Trump said that \"anybody that needs a test gets a test. They're there... they're beautiful.&quot...", "url": "https://news.yahoo.com/trump-says-anyone-needs-coronavirus-223149559.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/uMaq5U3QtbxMFQ8twrYooA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/QGjncGSko.3hH5RKG6oxGw--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e62cf579947850cd2ed8de7/5e62cf5cf5f0a60001cd681e_1280x720_FES_v1.jpg", "publishedAt": "2020-03-06T22:31:49Z", "content": "While speaking with press at the CDC, President Trump said that \"anybody that needs a test gets a test. They're there... they're beautiful.\""}, {"source": {"id": "politico", "name": "Politico"}, "author": "David Lim", "title": "Trump administration still struggling to ramp up coronavirus testing", "description": "At least 23 states have now confirmed cases of the coronavirus.", "url": "https://www.politico.com/news/2020/03/06/trump-administration-coronavirus-testing-123116", "urlToImage": "https://static.politico.com/c6/8d/8ee98ba146558733c9a0241b0c53/200306-trump-azar-getty-773.jpg", "publishedAt": "2020-03-06T22:51:52Z", "content": "\"The last lots are here being validated by Dr. [Steve] Monroe's team as we speak,\" Azar said late Friday during a visit to the agency's Atlanta headquarters. He said that \"up to 4 million tests\" would be available by the end of next week.\r\nIn the meantime, th… [+3123 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "Elon Musk draws ire after calling panic over coronavirus epidemic 'dumb' - CNET", "description": "Some followers are angry at the CEO, while others say he is addressing panic behavior, not the seriousness of the illness.", "url": "https://www.cnet.com/news/elon-musk-draws-ire-after-calling-panic-over-coronavirus-epidemic-dumb/", "urlToImage": "https://cnet1.cbsistatic.com/img/tF69aDLfv4vQg9UhsH6v1--plg4=/2019/12/12/fedf7a07-57af-4725-b317-adb666a8d19c/twitter-in-stream-wide-elon-musk-cybertruckk.jpg", "publishedAt": "2020-03-06T22:52:00Z", "content": "Elon Musk is known for his buzzworthy tweets, but a tweet he sent Friday afternoon drew attention for his opinion about a virus. Musk, the CEO of SpaceX and Tesla, delivered his message in a concise five words: \"The coronavirus panic is dumb.\"\r\nThe coronaviru… [+4493 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Morse", "title": "Google, Twitter, Facebook to pay hourly workers affected by coronavirus - CNET", "description": "The moves follow a similar decision by Microsoft.", "url": "https://www.cnet.com/news/google-twitter-facebook-to-pay-hourly-workers-affected-by-coronavirus/", "urlToImage": "https://cnet3.cbsistatic.com/img/-Xo9vsW-28yCgL1lnb4XPhzOEWY=/756x567/2020/03/06/05798b4a-3fda-4d7d-a10d-390b6ef0366b/gettyimages-1208505324.jpg", "publishedAt": "2020-03-06T22:41:28Z", "content": "Getty Images\r\nGoogle, Twitter and Facebook will continue to pay hourly workers who can't do their jobs remotely even as big technology companies urge their full-time staff to work from home in order to prevent the spread of the coronavirus that causes COVID-1… [+1481 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Peter Helman", "title": "SXSW 2020 Cancelled Due To Coronavirus Concerns", "description": "Tech companies including Amazon, Facebook, Twitter, and Apple pulled out of SXSW this week due to concerns over the spread of coronavirus. Artists like Ozzy Osbourne, Trent Reznor, and the Beastie Boys also cancelled their scheduled appearances. And now, the …", "url": "https://www.stereogum.com/2076009/sxsw-2020-cancelled-due-to-coronavirus-concerns/news/", "urlToImage": "https://static.stereogum.com/uploads/2020/03/GettyImages-1129434650-1583533217-608x421.jpg", "publishedAt": "2020-03-06T22:21:45Z", "content": "Tech companies including Amazon, Facebook, Twitter, and Apple pulled out of SXSW this week due to concerns over the spread of coronavirus. Artists like Ozzy Osbourne, Trent Reznor, and the Beastie Boys also cancelled their scheduled appearances. And now, the … [+951 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Live: 1st positive case of coronavirus in J&K; 2 more suspected in Punjab", "description": "Total coronavirus cases has crossed one lakh globally, with almost 3,500 deaths. Outside China, a total of 20,290 cases has been recorded around the world since the epidemic began, including 414 deaths. So far, India has 32 confirmed cases of coronavirus. Sta…", "url": "http://timesofindia.indiatimes.com/india/coronavirus-in-india-live-updates-1st-positive-case-of-coronavirus-in-jammu-2-more-suspected-in-punjab/articleshow/74520733.cms", "urlToImage": null, "publishedAt": "2020-03-06T22:48:28Z", "content": null}, {"source": {"id": "politico", "name": "Politico"}, "author": "Renuka Rayasam", "title": "Austin cancels South by Southwest festival amid coronavirus threat", "description": "A number of major companies — including Apple, Facebook, Intel, HBO and Netflix — had already announced they were pulling their employees from the 10-day conference.", "url": "https://www.politico.com/news/2020/03/06/sxsw-austin-coronavirus-123104", "urlToImage": "https://static.politico.com/21/f7/198e12f44457b764cc851993773d/200306-austin-gty-773.jpg", "publishedAt": "2020-03-06T22:17:39Z", "content": "Austin, Texas. | Drew Angerer/Getty Images\r\nAUSTIN, Texas The city of Austin announced today this years South by Southwest festival is being canceled amid an ongoing coronavirus threat.\r\nA number of major companies including Apple, Facebook, Intel, HBO and Ne… [+391 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Shieber", "title": "Stocks fall again on continued coronavirus worries", "description": "The major indices were down again -- although their declines were less severe than they had been during the week. Investors appeared to shake off positive labor statistics (the U.S. added 273,000 jobs, ahead of expectations), as the expanding number of corona…", "url": "https://finance.yahoo.com/news/stocks-fall-again-continued-coronavirus-221440531.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ma4IU4o1WnB3MhHDgfsAHg--~B/aD0xNzE3O3c9MjU3NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/f65fabba4a66b1624c47d069bbb381fd", "publishedAt": "2020-03-06T22:14:40Z", "content": "Is it good news to say that stocks fell less sharply than they had on previous days?\r\nThat's the bright side of another turbulent trading day across the Nasdaq and New York Stock Exchange. The major indices were down again -- although their declines were less… [+2551 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Coronavirus live: 21 on cruise ship off US test +ve", "description": "Total coronavirus cases has crossed one lakh globally, with almost 3,500 deaths. Outside China, a total of 20,290 cases have been recorded around the world since the epidemic began, including 414 deaths. In India, a Delhi resident became the 31st person testi…", "url": "http://timesofindia.indiatimes.com/india/coronavirus-in-india-live-updates-7-march-2020/articleshow/74520733.cms", "urlToImage": null, "publishedAt": "2020-03-06T22:48:28Z", "content": null}, {"source": {"id": null, "name": "Keyt.com"}, "author": "https://www.facebook.com/keytnc3beth/", "title": "Ventura County confirms first \"presumptive positive\" coronavirus case - KEYT", "description": "Ventura County confirms first \"presumptive positive\" coronavirus case KEYT Ventura County officials announce 1 ‘presumptive’ case of coronavirus — another Princess cruise passenger KTLA Sacramento County declares public health emergency amid coronavirus Sacra…", "url": "https://keyt.com/news/ventura-county/2020/03/06/ventura-county-confirms-first-presumptive-positive-coronavirus-case/", "urlToImage": "https://s3.us-east-1.wasabisys.com/keyt.com/2020/03/coronavirus-4817450-copy-860x484.jpg", "publishedAt": "2020-03-06T22:15:40Z", "content": "VENTURA COUNTY, Calif. - The Ventura County Public Health Lab revealed early Friday afternoon that it has confirmed one presumptive positive case of the novel coronavirus. \r\nSecondary confirmation is pending from the Centers for Disease Control and Prevention… [+2735 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Covid-19: Surat’s diamond industry in crisis", "description": "The world’s largest diamond cutting and polishing centre in Surat is staring at severe liquidity crisis because of huge payment overdues by traders in Hong Kong and China in the aftermath of coronavirus outbreak.", "url": "https://timesofindia.indiatimes.com/city/surat/surats-diamond-industry-in-crisis-after-blockage-of-rs5000-crore-in-china-hk/articleshow/74519812.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74521943,width-1070,height-580,imgsize-545849,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-06T22:30:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus - Second British death and more than 100000 cases worldwide - BBC News - BBC News", "description": "Coronavirus - Second British death and more than 100000 cases worldwide - BBC News BBC News Latest on the spread of coronavirus around the world Reuters.com Everything travelers need to know about coronavirus East Bay Times Long-Term Impacts Of Coronavirus In…", "url": "https://www.youtube.com/watch?v=nETgZwRuJPU", "urlToImage": "https://i.ytimg.com/vi/nETgZwRuJPU/maxresdefault.jpg", "publishedAt": "2020-03-06T23:04:15Z", "content": null}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "SXSW Officially Canceled by the City of Austin Due to Coronavirus Precautions", "description": "Following studios like Amazon, Apple, Netflix, Warner Media and Lionsgate dropping out of the South by Southwest (SXSW) film, music, tech and media festival earlier this week, the city of Austin has decided to cancel the event entirely. The cancellation doesn…", "url": "https://www.slashfilm.com/sxsw-canceled-by-city-of-austin/", "urlToImage": "https://www.slashfilm.com/wp/wp-content/images/sxsw2020-banner2.jpg", "publishedAt": "2020-03-06T22:18:51Z", "content": "The City of Austin has cancelled the March dates for SXSW and SXSW EDU. SXSW will faithfully follow the Citys directions.\r\nWe are devastated to share this news with you. The show must go on is in our DNA, and this is the first time in 34 years that the March … [+1807 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Surur", "title": "Microsoft to help physicians by making remote consultations easier using Microsoft Teams", "description": "Microsoft has announced new capabilities coming soon to Microsoft 365 that help physicians perform remote consultations easier, something that has become increasingly important due to the Coronavirus outbreak. Video conferencing provides a way for clinicians …", "url": "https://mspoweruser.com/microsoft-to-help-physicians-by-making-remote-consultations-easier-using-microsoft-teams/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2020/03/microsoft-365.jpg", "publishedAt": "2020-03-06T23:00:53Z", "content": "Microsoft has announced new capabilities coming soon to Microsoft 365 that help physicians perform remote consultations easier, something that has become increasingly important due to the Coronavirus outbreak.\r\nVideo conferencing provides a way for clinicians… [+2466 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Maria Sherman", "title": "The Grossest Thing You've Seen at Work", "description": "In the immortal words of Blink-182, work sucks. It sucks because it is gross, and people are gross. The more people, the grosser it is. Coronavirus prep has made office workers and other colleagues less gross, but not enough. Sneezing now makes people suspici…", "url": "https://jezebel.com/the-grossest-thing-youve-seen-at-work-1842033134", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rqxsfdbnus6szjp2xkoh.jpg", "publishedAt": "2020-03-06T23:00:00Z", "content": "In the immortal words of Blink-182, work sucks. It sucks because it is gross, and people are gross. The more people, the grosser it is. Coronavirus prep has made office workers and other colleagues less gross, but not enough. Sneezing now makes people suspici… [+5768 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Matt Kim", "title": "SXSW Canceled Due to Coronavirus Concerns", "description": "SXSW, the annual Austin music and arts festival, has been canceled over concerns about coronavirus.", "url": "https://www.ign.com/articles/sxsw-canceled-due-to-coronavirus-concerns", "urlToImage": null, "publishedAt": "2020-03-06T22:14:59Z", "content": null}, {"source": {"id": null, "name": "Fox5dc.com"}, "author": "FOX 5 DC", "title": "2 who attended an AIPAC conference in DC test positive...", "description": "2 who attended an AIPAC conference in DC test positive... (Top headline, 15th story, link ) Related stories: COVERUP IN BEIJING: Chinese whistleblowers say virus recovery 'fake, it's all fake'... U.S. Customs STILL NOT screening passengers from hot-spots... F…", "url": "https://www.fox5dc.com/news/2-new-yorkers-who-attended-an-aipac-conference-in-dc-test-positive-for-coronavirus", "urlToImage": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2020/03/724/407/5b2b1c47-47cf712f-GettyImages-1203807634-1.jpg?ve=1&tl=1", "publishedAt": "2020-03-06T23:07:36Z", "content": "WASHINGTON - Two people from New York who attended the AIPAC conference in D.C. have tested positive for the coronavirus, the organization said on Friday evening.\r\nThe American Israel Public Affairs Committee group tweeted a statement regarding the confirmati… [+768 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Abner Li", "title": "Sundar Pichai details Google, Alphabet response to coronavirus and this ‘unprecedented moment’", "description": "Given the company’s size, the wide-ranging impact of COVID-19 on Google is not surprising. Google today published a letter from Sundar Pichai to employees that lays out the company’s coronavirus response. more… The post Sundar Pichai details Google, Alphabet …", "url": "https://9to5google.com/2020/03/06/google-coronavirus-response/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/01/google_logo_1.jpg?resize=1024,512", "publishedAt": "2020-03-06T22:33:45Z", "content": "Given the company’s size, the wide-ranging impact of COVID-19 on Google is not surprising. Google today published a letter from Sundar Pichai to employees that lays out the company’s coronavirus response.\r\nThe primary takeaway from the Alphabet and Google CEO… [+2421 chars]"}, {"source": {"id": null, "name": "Columbian.com"}, "author": null, "title": "'Germ-fest' party preceded deadly nursing home outbreak - The Columbian", "description": "'Germ-fest' party preceded deadly nursing home outbreak The Columbian ‘It’s Pure Panic’: A Wrenching Wait at Nursing Home Where Coronavirus Took Hold The New York Times Heartbreaking photos show elderly couple separated due to coronavirus quarantine Yahoo New…", "url": "https://www.columbian.com/news/2020/mar/06/germ-fest-party-preceded-deadly-nursing-home-outbreak/", "urlToImage": "https://pcdn.columbian.com/wp-content/uploads/2020/03/Virus_Outbreak_US_87591.jpg-9505a.jpg", "publishedAt": "2020-03-06T22:28:19Z", "content": "Pat and Bob McCauley, who visited a friend eight times in two weeks before the outbreak, said they noticed some staff members wearing face masks during a visit on Wednesday, Feb. 26, that included the Mardi Gras party but didn’t think much of it. They went to… [+1070 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Shieber", "title": "Big tech commits to paying wages for hourly employees affected by coronavirus plans", "description": "Following Microsoft's lead from late last night, some the biggest technology companies in the U.S. have agreed to page wages for hourly employees impacted by the ongoing corporate response to the coronavirus. It's the right thing for companies to do, from bot…", "url": "https://finance.yahoo.com/news/big-tech-commits-paying-wages-224739358.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/EZKZ6TChE.J6WR6fclzwrw--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/8fb00a8695684065a0435fb53ab89498", "publishedAt": "2020-03-06T22:47:39Z", "content": "Following Microsoft's lead from late last night, some the biggest technology companies in the U.S. have agreed to pay wages for hourly employees impacted by the ongoing corporate response to the coronavirus outbreak.\r\nIt's the right thing for companies to do,… [+2080 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Ben Yakas", "title": "Extra Extra: A Photo Essay On The Art Of Piano Moving In NYC", "description": "Because you want to know if it's safe to hook up while coronavirus spreads, check out today's end-of-day links: Byford talks Cuomo, neighborhood names, Shell to become She'll, moving pianos, VHS Vault, doggy big sister, and more. [ more › ]", "url": "https://gothamist.com/news/extra-extra-coronavirus-hookup-guide", "urlToImage": "https://cms.prod.nypr.digital/images/301792/fill-1200x650/", "publishedAt": "2020-03-06T22:16:26Z", "content": "Gothamist is a website about New York City news, arts and events, and food, brought to you by New York Public Radio.\r\nSupport for Gothamist is provided by Craig Newmark Philanthropies and Josh Reznick. Additional support provided by the Wyncote Foundation and… [+35 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Burns", "title": "SXSW cancelled as Austin declares coronavirus emergency", "description": "COVID-19 claimed another event this afternoon. Music-centric event SXSW (South by Southwest) was cancelled as Austin, Texas declared a state of emergency. “We are devastated to share this news with you,” said a SXSW representative in a statement this afternoo…", "url": "https://www.slashgear.com/covid19-sxsw-cancelled-as-austin-declares-coronavirus-emergency-06612484/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/cancelled.jpg", "publishedAt": "2020-03-06T22:46:41Z", "content": "COVID-19 claimed another event this afternoon. Music-centric event SXSW (South by Southwest) was cancelled as Austin, Texas declared a state of emergency. “We are devastated to share this news with you,” said a SXSW representative in a statement this afternoo… [+2799 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "We Don't Have a Full Picture on Coronavirus Yet, Says Kleiner Perkins Partner", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-06/we-don-t-have-a-full-picture-on-coronavirus-yet-says-kleiner-perkins-partner-video", "urlToImage": null, "publishedAt": "2020-03-06T22:43:48Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "How Celebrities Are Preparing — and Helping — During the Coronavirus Outbreak", "description": "With the Centers for Disease Control telling Americans to prepare “for a significant disruption” to their lives as the new coronavirus spreads across the country, celebrities, too, are altering their plans and taking steps to help. Several stars have donated …", "url": "https://people.com/health/how-celebrities-are-preparing-and-helping-during-the-coronavirus-outbreak/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fbieber-katy-perry-and-arnold-schwarzenegger.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T22:53:41Z", "content": "With the Centers for Disease Control telling Americans to prepare “for a significant disruption” to their lives as the new coronavirus spreads across the country, celebrities, too, are altering their plans and taking steps to help.\r\nSeveral stars have donated… [+3544 chars]"}, {"source": {"id": null, "name": "Thechive.com"}, "author": "Bob", "title": "SXSW is canceled due to coronavirus scare and Here…We…Go…", "description": "Major news as the coronavirus continues it's scary trajectory.", "url": "https://thechive.com/2020/03/06/sxsw-is-cancelled-due-to-coronavirus-scare-and-here-we-go/", "urlToImage": "https://thechive.com/wp-content/uploads/2020/03/swsw.jpg?quality=85&strip=info", "publishedAt": "2020-03-06T23:02:25Z", "content": "It is official, my current hometown of Austin, Texas has officially canceled the massive 2-week event of SXSW over concerns of the rapidly spreading coronavirus. This is the first time in the event’s 34-year history that it’s been canceled.\r\nThe major news wa… [+1008 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vikram Doctor", "title": "Coronavirus outbreak: Divided by face masks, united by handwashing", "description": "The one thing virus experts are united on is the importance of clean hands. There might be debates about what kind of face mask to use, or whether masks should be bought at all, but about handwashing there are no doubts. The virus lingers on surfaces that han…", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/a-hands-on-approach-to-health/articleshow/74520367.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74521226,width-1070,height-580,imgsize-637024,overlay-economictimes/photo.jpg", "publishedAt": "2020-03-06T22:40:24Z", "content": "Mumbai: In February last year, Pete Hegseth, a host on the rightwing Fox News TV channel in the US, made a startling admission: He hadn’t washed his hands in over 10 years. “Germs are not a thing,” he asserted. “I can’t see them, therefore they are not real.”… [+8930 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "Top Biogen execs were at meeting where attendees had Covid-19 - STAT", "description": "Top Biogen execs were at meeting where attendees had Covid-19 STAT 3 test positive for coronavirus after Biogen meeting in Boston Boston.com Dozens of Biogen employees to be tested for COVID-19 after three confirmed cases within the company Boston 25 News Sev…", "url": "https://www.statnews.com/2020/03/06/biogen-workers-test-positive-for-coronavirus-transmission-linked-to-leadership-meeting/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2018/10/STAT_Biogen01-1024x576.jpg", "publishedAt": "2020-03-06T22:57:53Z", "content": "Biogens CEO, chief financial officer, and head of research and development were among those at a corporate meeting last week attended by eight people who later tested positive for the novel coronavirus, and the company said it has taken aggressive steps to pr… [+3123 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Lauren Lantry", "title": "Trump, self-professed germaphobe, continues shaking hands amid coronavirus concerns - ABC News", "description": "Trump, self-professed germaphobe, continues shaking hands amid coronavirus concerns ABC News Conway: Trump spoke about cutting deficit, not Medicare and Social Security, at Fox News town hall Fox News Trump attacks Biden's cognitive health in possible general…", "url": "https://abcnews.go.com/Politics/trump-professed-germaphobe-continues-shaking-hands-amid-coronavirus/story?id=69441047", "urlToImage": "https://s.abcnews.com/images/Politics/trump-tornado-9-us-rc-200306_hpMain_16x9_992.jpg", "publishedAt": "2020-03-06T22:53:17Z", "content": "President Donald Trump, a self-professed 'germaphobe,' continued to shake peoples hands Friday, despite recommendations from health experts urging everyone to maintain distance from one another as coronavirus cases in the U.S. topped 200 and rose to nearly 10… [+3496 chars]"}, {"source": {"id": null, "name": "Nofilmschool.com"}, "author": "Jason Hellerman", "title": "SXSW Cancelled Due to the Coronavirus", "description": "SXSW joins the Hollywood panic over the coronavirus by canceling its 2020 event. On Friday, March 6, Mayor Steve Adler of Austin, Texas, announced that the film, music, and interactive industry conference South by Southwest was to be canceled because of the p…", "url": "https://nofilmschool.com/sxsw-cancelled", "urlToImage": "https://nofilmschool.com/sites/default/files/styles/facebook/public/screen_shot_2020-03-06_at_2.09.31_pm.png?itok=cbZAaQH0", "publishedAt": "2020-03-06T22:20:00Z", "content": "SXSW joins the Hollywood panic over the coronavirus by canceling its 2020 event. \r\nOn Friday, March 6, Mayor Steve Adler of Austin, Texas, announced that the film, music, and interactive industry conference South by Southwest was to be canceled because of the… [+1548 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Teich, Contributor, Paul Teich, Contributor https://www.forbes.com/sites/paulteich/", "title": "Cloud Supply Chain Q1 Earnings Reports Start Assessing Coronavirus Impact", "description": "Early assessments that COVID-19 impact would be limited to China’s internal markets or that it would be limited to Chinese data center supply chain continuity are most likely short-sighted and are understating COVID-19’s probable long-term worldwide impact.", "url": "https://www.forbes.com/sites/paulteich/2020/03/06/cloud-supply-chain-q1-earnings-reports-start-assessing-coronavirus-impact/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e62caaee1e6170007590f62%2F0x0.jpg", "publishedAt": "2020-03-06T22:40:54Z", "content": "The first cluster of earnings reports for cloud supply chain vendors did not mention the 2019 novel coronavirus (COVID-19). That changed in mid-February as vendors assessed its impact. \r\nEarly assessments that COVID-19 impact would be limited to Chinas intern… [+7528 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "David Pierini", "title": "Austin cancels SXSW over coronavirus fears", "description": "Organizers for SXSW, seemingly stubborn about holding the beloved March event in the face of a coronavirus outbreak, announced the city of Austin canceled the conference. Event planners scrapped the tech and music conference, set to begin March 13, after loca…", "url": "https://www.cultofmac.com/690283/sxsw-canceled-cornovirus/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2020/03/20_SXSW_Website_SEO-1-780x439.jpg", "publishedAt": "2020-03-06T22:23:33Z", "content": "Organizers for South by Southwest, desperately hoping to hold the March event in the face of a coronavirus outbreak, announced Friday that the city of Austin cancelled the conference.\r\nEvent planners scrapped the tech and music conference, set to begin March … [+1328 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "Deutsche Bank’s Annual Palm Beach Media Conference Goes Audio Only On Coronavirus Fears", "description": "Deutsche Bank Friday said coronavirus jitters prompted a last-minute shift in its annual media investor conference to video only for the event, slated to run Monday through Wednesday in Palm Beach, Florida with a host of major companies presenting. “After car…", "url": "https://deadline.com/2020/03/deutsche-bank-conference-video-only-1202876459/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/11/palm-springs-movie.jpg?w=451", "publishedAt": "2020-03-06T22:14:34Z", "content": "Deutsche Bank Friday said coronavirus jitters prompted a last-minute shift in its annual media investor conference to audio only for the event, slated to run Monday through Wednesday in Palm Beach, Florida with a host of major companies presenting.\r\n“After ca… [+1321 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Inside the race to find a coronavirus vaccine and treatment - Washington Post", "description": "Across the U.S. and the globe, scientists are racing to develop a vaccine and a treatment to contain the novel coronavirus, even if it means it won’t be read...", "url": "https://www.youtube.com/watch?v=7K85hMmDXy4", "urlToImage": "https://i.ytimg.com/vi/7K85hMmDXy4/maxresdefault.jpg", "publishedAt": "2020-03-06T23:07:02Z", "content": "Across the U.S. and the globe, scientists are racing to develop a vaccine and a treatment to contain the novel coronavirus, even if it means it wont be ready for this outbreak. Read more: https://wapo.st/32WZKYU. Subscribe to The Washington Post on YouTube: h… [+177 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Joanna Robinson", "title": "SXSW Cancelled Amid Coronavirus Fear", "description": "The city of Austin has declared a local disaster: “This is a medical and data-driven decision.”", "url": "https://www.vanityfair.com/hollywood/2020/03/sxsw-2020-cancelled", "urlToImage": "https://media.vanityfair.com/photos/5e62d0d8a62e1100087d1369/16:9/w_1280,c_limit/GettyImages-1131175725.jpg", "publishedAt": "2020-03-06T22:40:48Z", "content": "Austins South by Southwest Festival has joined the growing list of global events impacted by the spread of the coronavirus. During a press conference Friday afternoon, Austin Mayor Steve Adler announced that the ten-day festival set for March 13-22which featu… [+3072 chars]"}, {"source": {"id": null, "name": "Westsideseattle.com"}, "author": null, "title": "Facing a drop in business due to Coronavirus concerns, West Seattle businesses says they are working hard to keep things safe - Westside Seattle", "description": "Facing a drop in business due to Coronavirus concerns, West Seattle businesses says they are working hard to keep things safe Westside Seattle", "url": "https://www.westsideseattle.com/robinson-papers/2020/03/06/facing-drop-business-due-coronavirus-concerns-west-seattle-businesses", "urlToImage": null, "publishedAt": "2020-03-06T22:36:49Z", "content": "The impact on business of coronavirus concerns is starting to be felt across multiple sectors and with no end in site, it could be profound. Airlines are reporting drops in passenger traffic by up to 50% projecting a lost of up to $113 billion. The University… [+4541 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Sean Neumann", "title": "Coronavirus Worries Leave College Basketball Teams Playing with No One in the Stands to Watch", "description": "A Friday basketball game between Yeshiva University and Worcester Polytechnic Institute at Johns Hopkins University in Baltimore is believed to be the first U.S. sporting event without a crowd due to coronavirus worries, according to the Associated Press, whi…", "url": "https://people.com/sports/johns-hopkins-basketball-game-no-attendees-because-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcoronvirus-no-crowd-1.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T22:18:54Z", "content": "A Friday basketball game between Yeshiva University and Worcester Polytechnic Institute at Johns Hopkins University in Baltimore is believed to be the first U.S. sporting event without a crowd due to coronavirus worries, according to the Associated Press, whi… [+2677 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Ashley Boucher", "title": "SXSW Festival Canceled by the City of Austin Due to Coronavirus Concerns", "description": "The annual South by Southwest festival (SXSW) Festival in Austin, Texas, has been canceled due to growing concerns about the novel coronavirus (COVID-19) outbreak. The festival organizers announced the cancelation on its website on Friday, pointing out that i…", "url": "https://people.com/health/sxsw-canceled-coronavirus-concerns/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fsxsw.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T22:50:11Z", "content": "The annual South by Southwest festival (SXSW) Festival in Austin, Texas, has been canceled due to growing concerns about the novel coronavirus (COVID-19) outbreak.\r\nThe festival organizers announced the cancelation on its website on Friday, pointing out that … [+2845 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Managing your retirement savings amid coronavirus fears", "description": "Charlie Nelson, CEO of Retirement and Employee Benefits at Voya Financial, joins The Final Round to discuss how investors should navigate recent volatility and savings.", "url": "https://finance.yahoo.com/video/managing-retirement-savings-amid-coronavirus-222329303.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/v9tl1epKymMA6jdYGnP21A--~B/aD0yMzg4O3c9NDI1MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e62cd6569e6c51d61e1111a/5e62cd6569e6c51d61e1111b_o_U_v2.jpg", "publishedAt": "2020-03-06T22:23:29Z", "content": "Charlie Nelson, CEO of Retirement and Employee Benefits at Voya Financial, joins The Final Round to discuss how investors should navigate recent volatility and savings."}, {"source": {"id": null, "name": "Adweek.com"}, "author": "David Cohen", "title": "Google Updates Its Coronavirus Efforts Both Inside and Outside of the Company", "description": "Google and Alphabet CEO Sundar Pichai detailed the company's efforts to deal with the coronavirus in a blog post Friday, based on an email he sent to employees earlier in the day. The company established a 24-hour incident-response team to stay in sync with t…", "url": "https://www.adweek.com/digital/google-updates-its-coronavirus-efforts-both-inside-and-outside-of-the-company/", "urlToImage": "https://www.adweek.com/wp-content/uploads/2020/03/GoogleCoronavirusUpdateHero-600x315.jpg", "publishedAt": "2020-03-06T22:40:17Z", "content": "Google and Alphabet CEO Sundar Pichai detailed the companys efforts to deal with the coronavirus in a blog post Friday, based on an email he sent to employees earlier in the day.The company established a 24-hour incident-response team to stay in sync with the… [+2753 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Andrew Sheivachman, Skift", "title": "Coronavirus Panic Outlines Failures of Most Travel Insurance", "description": "Travel insurance is rarely a good deal for most travelers. While these products fall short of being a full-blown scam, they let down travelers during chaotic and unpredictable events. -Andrew Sheivachman", "url": "https://skift.com/2020/03/09/coronavirus-panic-outlines-failures-of-most-travel-insurance/", "urlToImage": "https://skift.com/wp-content/uploads/2019/09/thumbnail-2da3940d6a286a3f41f675ffddf322e2-e1569321811557.jpeg", "publishedAt": "2020-03-06T22:12:06Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Amanda Lauren, Contributor, Amanda Lauren, Contributor https://www.forbes.com/sites/amandalauren/", "title": "Coronavirus Is A Public Health Crisis, But A Boon To Real Estate Buyers", "description": "Should buyers take advantage of current market conditions and low mortgage rates or wait it out?", "url": "https://www.forbes.com/sites/amandalauren/2020/03/06/coronavirus-is-a-public-health-crisis-but-a-boon-to-real-estate-buyers/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1147674294%2F0x0.jpg", "publishedAt": "2020-03-06T22:15:05Z", "content": "Could coronavirus be a boon for the buyers market?\r\nGetty\r\nIn just a few short weeks, the Coronavirus outbreak has impacted many aspects of everyday life. Events and conventions have been canceled and postponed. Public fear of the unknown along with an abunda… [+5306 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "The Associated Press", "title": "South by Southwest festival cancelled over COVID-19", "description": "Officials in Austin, Texas, have cancelled the South by Southwest arts and technology festival.", "url": "https://www.cbc.ca/news/entertainment/south-by-southwest-coronavirus-covid-19-cancelled-1.5489353", "urlToImage": "https://i.cbc.ca/1.5489383.1583533151!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/sxsw-springsteen.JPG", "publishedAt": "2020-03-06T22:33:54Z", "content": "Officials in Austin, Texas, have cancelled the South by Southwest arts and technology festival.\r\nMayor Steve Adler said Friday he'd declared a \"local disaster\" in the city as a precaution because of the threat of the coronavirus, effectively cancelling the an… [+624 chars]"}, {"source": {"id": null, "name": "Matadornetwork.com"}, "author": "Eben Diskin", "title": "Events canceled due to coronavirus", "description": "Everyone is taking extreme precautions. The post All the major events around the world canceled due to the coronavirus so far appeared first on Matador Network.", "url": "https://matadornetwork.com/read/events-canceled-coronavirus/", "urlToImage": "https://d36tnp772eyphs.cloudfront.net/blogs/1/2020/03/people-gathered-under-cherry-blossoms-in-japan-1200x854.jpg", "publishedAt": "2020-03-06T22:30:00Z", "content": "Uncertainty surrounding the new coronavirus has led many companies, governments, and other organizations to cancel events all around the world. Since large gatherings are believed to be conducive to the spread of disease, people are wary of attending events t… [+2129 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "VP Pence delivers coronavirus update: 21 positive cases on California cruise ship", "description": "Vice President Pence delivers an update on coronavirus, confirms 21 people on the Grand Princess cruise ship off the coast of California have tested positive for coronavirus", "url": "http://www.msnbc.com/mtp-daily/watch/vp-pence-delivers-coronavirus-update-21-positive-cases-on-california-cruise-ship-80183365716", "urlToImage": null, "publishedAt": "2020-03-06T22:55:53Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Stocks fall again on continued coronavirus worries", "description": "Is it good news to say that stocks fell less sharply than they had on previous days? That’s the bright side of another turbulent trading day across the Nasdaq and New York Stock Exchange. The major indices were down again — although their declines were less s…", "url": "http://techcrunch.com/2020/03/06/stocks-fall-again-on-continued-coronavirus-worries/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2017/11/gettyimages-104501049.jpg?w=600", "publishedAt": "2020-03-06T22:14:40Z", "content": "Is it good news to say that stocks fell less sharply than they had on previous days?\r\nThat’s the bright side of another turbulent trading day across the Nasdaq and New York Stock Exchange. The major indices were down again — although their declines were less … [+2550 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Nicole Karlis", "title": "Nurse union issues grave warning on COVID-19: \"The nation's hospitals are unprepared\"", "description": "The lack of protocol \"is truly disturbing,\" says Jane Thomason, an industrial hygienist for the union", "url": "https://www.salon.com/2020/03/06/nurse-union-issues-grave-warning-on-covid-19-the-nations-hospitals-are-unprepared/", "urlToImage": "https://media.salon.com/2020/03/national-nurses-united-press-conference-0306201.jpg", "publishedAt": "2020-03-06T23:00:01Z", "content": "As novel coronavirus cases continue to grow in the United States, thousands of unionized nurses say that they find the lack of preparedness among their employers and hospitals alarming — and fear that they may be at risk for COVID-19 as a result. \r\nOn Thursda… [+7299 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why AMC Networks Stock Dropped 16% in February", "description": "Shares of the cable network sold off after a disappointing earnings report.", "url": "https://www.fool.com/investing/2020/03/06/why-amc-networks-stock-dropped-16-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562033/amc-networks-scene-from-walking-dead-slide-3-source-amc-networks.jpg", "publishedAt": "2020-03-06T22:41:00Z", "content": "What happened\r\nShares of AMC Networks(NASDAQ:AMCX) slipped again last month as the parent of cable networks like AMC, SundanceTV, BBC America, and IFC posted disappointing results in its fourth-quarter earnings report. The report came out the same week that s… [+2569 chars]"}, {"source": {"id": null, "name": "Thefader.com"}, "author": "Salvatore Maicki", "title": "SXSW 2020 has been cancelled due to coronavirus concerns", "description": "“We are exploring options to reschedule the event and are working to provide a virtual SXSW online experience as soon as possible for 2020 participants.”", "url": "https://www.thefader.com/2020/03/06/sxsw-2020-cancellation-coronavirus-covid19-austin-texas-south-by-southwest", "urlToImage": "https://thefader-res.cloudinary.com/private_images/c_limit,w_1024/c_crop,h_409,w_753,x_3,y_16,f_auto,q_auto:eco/Screen_Shot_2020-03-06_at_5.01.12_PM_t2bwa2/Screen_Shot_2020-03-06_at_5.01.12_PM_t2bwa2.jpg", "publishedAt": "2020-03-06T22:12:40Z", "content": "South By Southwest's 2020 conference has been cancelled due to concerns over CO-VID19. The cancellation was announced in a press conference held at Austin City Hall on Friday afternoon. \"This is not a panic-based decision, it is a decision based on medical ex… [+597 chars]"}, {"source": {"id": null, "name": "Cleantechnica.com"}, "author": "Steve Hanley", "title": "Coronavirus Partly Responsible For Dramatic Decrease In Nitrogen Dioxide Pollution Over China", "description": "Nitrogen dioxide emissions in China have plunged since the coronavirus outbreak. Is there a lesson we can learn from that?", "url": "https://cleantechnica.com/2020/03/06/coronavirus-partly-responsible-for-dramatic-decrease-in-nitrogen-dioxide-pollution-over-china/", "urlToImage": "https://cleantechnica.com/files/2020/03/china_trop_2020056.png", "publishedAt": "2020-03-06T23:00:05Z", "content": "March 6th, 2020 by Steve Hanley \r\nAccording to a report by NASA’s Earth Observatory, the Tropospheric Monitoring Instrument onboard the European Space Agencys Sentinel-5 satellite and the Ozone Monitoring Instrument on NASAs Aura satellite reveal a startling … [+4229 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "Sensex swings 1,459 points intra-day, Yes Bank crashes 56%", "description": "Yes Bank shares came under selling pressure, sinking 56 per cent to Rs 16.20 after the bank was placed under a 30-day moratorium by the RBI.", "url": "https://indianexpress.com/article/business/market/sensex-swings-1459-points-intra-day-yes-bank-crashes-56/", "urlToImage": "https://images.indianexpress.com/2020/02/AP-indian-stock-market-bse-759.jpg?w=759", "publishedAt": "2020-03-06T22:13:06Z", "content": "After diving over 1,459 points during the day, the 30-share BSE Sensex settled 893.99 points, or 2.32 per cent, lower at 37,576.62. (AP Photo/Rajanish Kakade)The Reserve Bank of Indias curbs on Yes Bank and a heavy sell-off in global markets triggered by coro… [+1292 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Kaitlyn Booth", "title": "SXSW 2020 Canceled Due to Coronavirus Concerns", "description": "It looks like another March event has been canceled. Earlier today Reedpop announced that they would be canceling Emerald City Comic-Con and now another March event has canceled due to public health concerns. According to the official twitter account, South b…", "url": "https://www.bleedingcool.com/2020/03/06/sxsw-2020-canceled-due-to-coronavirus-concerns/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/65041970_10156436067613994_2042437161780772864_o-1-1200x628.jpg", "publishedAt": "2020-03-06T22:28:05Z", "content": "It looks like another March event has been canceled. Earlier today Reedpop announced that they would be canceling Emerald City Comic-Con and now another March event has canceled due to public health concerns. According to the official twitter account, South b… [+1122 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Jack Morse", "title": "Entitled billionaire Elon Musk thinks coronavirus panic is 'dumb'", "description": "The world stands transfixed by possible disaster and Elon Musk is here to offer his unsolicited opinion. Calling to mind the infamous submarine stunt, the entitled billionaire chose today to lecture us all on a subject matter decidedly outside of his expertis…", "url": "https://mashable.com/article/elon-musk-coronavirus-tweet/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252F91%252Fb2ff81f7bb1949eca5d718183d975468.ff1bc.png%252F1200x630.png?signature=Jz1j-lJuh19ge8kJguTsjLeUsYY=", "publishedAt": "2020-03-06T22:15:07Z", "content": "The world stands transfixed by possible disaster and Elon Musk is here to offer his unsolicited opinion. \r\nCalling to mind the infamous submarine stunt, the entitled billionaire chose today to lecture us all on a subject matter decidedly outside of his expert… [+1561 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "SXSW Cancelation Brings Dire Predictions About Austin Economic Impact", "description": "For Austin, the unthinkable has happened. SXSW has cancelled its 2020 edition, with the mayor declaring a “local disaster” in the city. Austin’s economy relies on the annual film/music/tech/comedy gathering to fuel much of the rest of the year. The lack of a …", "url": "https://deadline.com/2020/03/sxsw-cancellation-dire-predictions-economic-impact-1202876501/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/sxsw.jpg?w=1024", "publishedAt": "2020-03-06T22:22:32Z", "content": "For Austin, the unthinkable has happened. SXSW has cancelled its 2020 edition, with the mayor declaring a “local disaster” in the city.\r\nAustin’s economy relies on the annual film/music/tech/comedy gathering to fuel much of the rest of the year. The lack of a… [+2133 chars]"}, {"source": {"id": null, "name": "Necn.com"}, "author": "Jack Thurston", "title": "‘An Opportunity Here to Really Help:’ Vt. Tech Companies Poised to Address Coronavirus Challenges - NECN", "description": "Technology companies say they have a role to play in the world’s response to the growing threat from coronavirus. “There’s an opportunity here to really...", "url": "https://www.necn.com/news/local/an-opportunity-here-to-really-help-vt-tech-companies-poised-to-address-coronavirus-challenges/2242214/", "urlToImage": "https://media.necn.com/2019/09/Cell-Phone-2.jpg?resize=1200%2C675", "publishedAt": "2020-03-06T22:52:55Z", "content": "Technology companies say they have a role to play in the\r\nworlds response to the growing threat from coronavirus.\r\nTheres an opportunity here to really help, said Ethan Bechtel, the CEO of OhMD.\r\nOhMD, which operates out of the Vermont Center for Emerging Tec… [+3158 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump visits the Centers for Disease Control and Prevention - Washington Post", "description": "Trump visits the Centers for Disease Control and Prevention Washington Post Trump administration overrode CDC recommendation that elderly, at-risk populations not fly: AP | TheHill The Hill View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=ndojafDR2fI", "urlToImage": "https://i.ytimg.com/vi/ndojafDR2fI/maxresdefault.jpg", "publishedAt": "2020-03-06T22:47:07Z", "content": "President Trump visits the Centers for Disease Control and Prevention in Atlanta during the coronavirus outbreak. Subscribe to The Washington Post on YouTube: https://wapo.st/2QOdcqK\r\nFollow us:Twitter: https://twitter.com/washingtonpostInstagram: https://www… [+78 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Jackson McHenry", "title": "SXSW Canceled Amid Coronavirus Fears", "description": "“We are exploring options to reschedule the event.”", "url": "http://www.vulture.com/2020/03/sxsw-2020-cancelled-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2020/03/06/6-sxsw.w1200.h630.jpg", "publishedAt": "2020-03-06T22:18:50Z", "content": "The spread of coronavirus has led to the cancellation of one of the most major cultural events yet: The City of Austin has announced that it is canceling South by Southwest this year amid fears about the disease. Austin mayor Steve Adler announced the news Fr… [+1326 chars]"}, {"source": {"id": null, "name": "Scottaaronson.com"}, "author": "Scott", "title": "Coronavirus: the second-weirdest solution?", "description": "Many people have suggested coating handles, doorknobs and so forth with virus-killing copper tape. It’s a shame that this isn’t being tried on a wider scale. In the meantime, though, here’s a related but different idea that I had last night. Imagine we could …", "url": "https://www.scottaaronson.com/blog/?p=4664", "urlToImage": null, "publishedAt": "2020-03-06T22:21:52Z", "content": "Many people have suggested coating handles, doorknobs and so forth with virus-killing copper tape. Its a shame that this isnt being tried on a wider scale. In the meantime, though, heres a related but different idea that I had last night.\r\nImagine we could co… [+2205 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "GuruFocus.com", "title": "3 Five-Star Companies at Historically Low Price-Sales Ratios", "description": "Stocks to consider as coronavirus fears tremble markets, including two travel companies Continue reading...", "url": "https://finance.yahoo.com/news/3-five-star-companies-historically-222545378.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6IMyeOcy8Tlc782cM7TX3w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/jbwcffS0Ty9kZ57Ah_SWsQ--~B/aD00MDA7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/us.finance.gurufocus/ec9f61f90131a5ff448482036cb76a6a", "publishedAt": "2020-03-06T22:25:45Z", "content": "In light of ongoing coronavirus fears, three stocks that have a five-starGuruFocus business predictability rank and are trading near historically low price-sales ratios are Norwegian Cruise Line Holdings Ltd. (NYSE:NCLH), Hyatt Hotels Corp. (NYSE:H) and BJ's … [+4184 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " BaAaaAaa via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_940cde95c5434dbb010b60b7d6d4eefb", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T23:10:15Z", "content": "Nebraska, Coronavirus, Pete Ricketts, University of Nebraska Medical Center\r\nThe woman, who is \"very seriously ill,\" is at Methodist Hospital in Omaha, officials said, and is being transferred to the Nebraska Biocontainment..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " 34 Products That Might Make You Feel Like You're Cheating At Life via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_b3d9d59a7c309e1ba40c31777bef1ff5", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T23:10:15Z", "content": "Nebraska, Coronavirus, Pete Ricketts, University of Nebraska Medical Center\r\nThe woman, who is \"very seriously ill,\" is at Methodist Hospital in Omaha, officials said, and is being transferred to the Nebraska Biocontainment..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " It's Always Sunny in High Quality Gifs via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_5774c44754308c7c29deb0858bfff0db", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T23:10:15Z", "content": "Nebraska, Coronavirus, Pete Ricketts, University of Nebraska Medical Center\r\nThe woman, who is \"very seriously ill,\" is at Methodist Hospital in Omaha, officials said, and is being transferred to the Nebraska Biocontainment..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " None of you understand by thepotsmoker MORE MEMES via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_e8e621a9aa59494d15ad3b6dee652408", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T23:10:15Z", "content": "Nebraska, Coronavirus, Pete Ricketts, University of Nebraska Medical Center\r\nThe woman, who is \"very seriously ill,\" is at Methodist Hospital in Omaha, officials said, and is being transferred to the Nebraska Biocontainment..."}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Pres. Trump during CDC visit: 'Anybody that needs a test can have a test'", "description": "During his visit to the CDC, Pres. Trump talks about the coronavirus testing kit.", "url": "https://www.msnbc.com/mtp-daily/watch/pres-trump-during-cdc-visit-anybody-that-needs-a-test-can-have-a-test-80182853529", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_trumpcdc_200306_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T22:31:22Z", "content": null}, {"source": {"id": null, "name": "Propublica.org"}, "author": "by Marshall Allen and Lisa Song", "title": "You Might Be Buying a Hand Sanitizer That Won’t Work for Coronavirus", "description": "by Marshall Allen and Lisa Song ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published. It’s tempting, especially now, to buy one of the many hand sanitizers whose label says i…", "url": "https://www.propublica.org/article/coronavirus-hand-sanitizers-cdc-recommended-alcohol", "urlToImage": "https://assets.propublica.org/images/articles/20200306-hand-sanitizer-bottle-highlighted-1200x630.jpg", "publishedAt": "2020-03-06T22:23:18Z", "content": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as theyre published.\r\nIts tempting, especially now, to buy one of the many hand sanitizers whose label says it kills 99.99% of illness causing… [+5888 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "South Korea Tries ‘Social Distancing’ to Prevent Coronavirus Spread", "description": "An expression recently introduced by officials in Seoul closely describes life for many in South Korea these days: “Let’s Take a Break from Social Life.” The government is working to limit face-to-face interaction to help prevent the spread of the new coronav…", "url": "https://learningenglish.voanews.com/a/south-korea-tries-social-distancing-to-prevent-coronavirus-spread/5316633.html", "urlToImage": "https://gdb.voanews.com/efab5a10-b9c4-49e1-927b-dc99eaa0308a_cx0_cy3_cw0_w1200_r1_s.jpg", "publishedAt": "2020-03-06T22:55:29Z", "content": "An expression recently introduced by officials in Seoul closely describes life for many in South Korea these days: Lets Take a Break from Social Life. \r\nThe government is working to limit face-to-face interaction to help prevent the spread of the new coronavi… [+3860 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "James D. Walsh", "title": "Will New York City Schools Close Over the Coronavirus?", "description": "As the number of confirmed cases of COVID-19 in New York ramped up to 44 on Friday, parents and students faced the possibility of school closures.", "url": "http://nymag.com/intelligencer/2020/03/two-new-york-city-prep-schools-close-over-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/03/06/6-coronavirus-nyc.w1200.h630.jpg", "publishedAt": "2020-03-06T23:04:47Z", "content": "As the number of confirmed cases of COVID-19 in New York ramped up to 44 on Friday, parents and students faced the possibility of highly disruptive school closures  not to mention the potential cancellation of spring break trips. Already, two Manhattan prep s… [+4252 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Lewis", "title": "South Korea is using drive-thrus to test for coronavirus", "description": "While the U.S. scrambles to test potential coronavirus patients quickly and effectively, South Korea is implementing an innovative solution — drive-thru test centers.", "url": "https://www.cbsnews.com/news/coronavirus-south-korea-drive-thru-test-covid-19/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/06/29b9ccdb-706c-423d-81bf-0be4eebb065a/thumbnail/1200x630/1cfcb9558cbb72f75ffd70df83074168/ap-20061364458837.jpg", "publishedAt": "2020-03-06T22:21:47Z", "content": "In the U.S., Americans are used to picking up Whoppers and Big Macs using drive-thrus. In South Korea, you can now use a drive-thru to get tested for coronavirus. \r\nInadequate coronavirus testing in the U.S. has raised fears across the country that people may… [+2643 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "How could coronavirus impact the U.S. economy?", "description": "Austan Goolsbee on the economic impact of the coronavirus and how the U.S. economy relies more on face-to-face services.", "url": "https://www.msnbc.com/mtp-daily/watch/how-could-coronavirus-impact-the-u-s-economy-80180805884", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_goolsbee_200306_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T22:25:43Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Richard Engel: 'Skeptical' of the decreasing coronavirus cases out of China", "description": "Richard Engel on the decreasing number of coronavirus cases in China and how much that can be trusted.", "url": "https://www.msnbc.com/mtp-daily/watch/richard-engel-skeptical-of-the-decreasing-coronavirus-cases-out-of-china-80182853971", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_engelonchina_200306_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T22:52:36Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Washington Post Staff", "title": "21 test positive on California cruise ship so far...", "description": "21 test positive on California cruise ship so far... (First column, 4th story, link ) Related stories: Robots fighting virus by disinfecting hospitals, taking temps, preparing meals... Thousands of Americans asked to 'self-quarantine'... UPDATE: Confirmed 'Cl…", "url": "https://www.washingtonpost.com/health/dozens-of-passengers-on-a-stranded-cruise-ship-are-infected-by-coronavirus-that-number-could-soon-grow/2020/03/06/17cf1974-5fdb-11ea-b014-4fafa866bb81_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/ac_atIksDE0TcTDzu-LC4xyZSD4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W55MWCS77QI6VMU3TW2C66ADU4.jpg", "publishedAt": "2020-03-06T23:07:37Z", "content": "BREAKING NEWS: Among the 46 persons swabbed, 24 were negative and one was inconclusive.\r\nNineteen of the positive tests came from crew members, Vice President Pence said. Officials plan to bring the ship into a non-commercial port over the weekend, where all … [+92 chars]"}, {"source": {"id": null, "name": "Metalsucks.net"}, "author": "MetalSucks", "title": "SXSW Canceled Over Coronavirus Scare", "description": "The city of Austin proactively canceled the festival ahead of coronavirus contagion fears. The post SXSW Canceled Over Coronavirus Scare appeared first on MetalSucks.", "url": "https://www.metalsucks.net/2020/03/06/sxsw-canceled-over-coronavirus-scare/", "urlToImage": "https://www.metalsucks.net/wp-content/uploads/2020/03/sxsw.jpg", "publishedAt": "2020-03-06T22:26:47Z", "content": "The annual South by Southwest festival has been canceled by the city of Austin, TX over fears surrounding the spread of the coronavirus, The New York Times reports. It is the first major American festival or tour to come down as a result of the spreading cont… [+2298 chars]"}, {"source": {"id": null, "name": "Kvue.com"}, "author": "Andy Baio", "title": "City of Austin declares local disaster, cancels SXSW 2020", "description": "This announcement follows several major organizations and companies deciding to not attend the festival.", "url": "https://www.kvue.com/article/entertainment/events/sxsw/sxsw-austin-2020-cancelled-petition-coronavirus/269-3423a862-7cd7-49be-8125-41d84b8c6a13", "urlToImage": "https://media.kvue.com/assets/KVUE/images/c4a99fdc-1a20-4479-851f-59e575534eaa/c4a99fdc-1a20-4479-851f-59e575534eaa_1140x641.jpg", "publishedAt": "2020-03-06T22:12:56Z", "content": "AUSTIN, Texas For the first time in its 33-year history, South by Southwest has been canceled as the City of Austin declares a local emergency due to concerns about the coronavirus spreading.\r\nIn an announcement on Friday by Mayor Steve Adler, Judge Sarah Eck… [+2969 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Stephen Gandel", "title": "South by Southwest festival canceled due to coronavirus", "description": "Announcement comes after Apple, Facebook and other big companies withdrew from the annual event.", "url": "https://www.cbsnews.com/news/coronavirus-south-by-southwest-canceled/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/06/492ac022-2da9-4a6c-89b5-df599fe0fcdd/thumbnail/1200x630/65d445ef689ff5ddff8fbb0d6cd06b67/swsw-img-2710.jpg", "publishedAt": "2020-03-06T22:31:53Z", "content": "pulled out of the eventThe upcoming South by Southwest festival has been canceled because of concerns about the novel coronavirus, officials in Austin, Texas, announced Friday. \r\nThe move to pull the plug on the popular music and technology industry conferenc… [+791 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "President Trump surveys Tennessee tornado damage l ABC News - ABC News", "description": "President Trump surveys Tennessee tornado damage l ABC News ABC News Reese Witherspoon Opens Up About Feeling 'Overwhelmed' After Tennessee Tornado and Coronavirus Outbreak PEOPLE.com ''This Is Real Devastation': Trump Tours Tornado Damage In Tennessee | NBC …", "url": "https://www.youtube.com/watch?v=kUNip0LCDak", "urlToImage": null, "publishedAt": "2020-03-06T22:29:12Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Adweek.com"}, "author": "David Cohen", "title": "Instagram’s Coronavirus Efforts Mirror Those of Parent Company Facebook", "description": "Instagram detailed its efforts to keep its users safe and informed with regard to the coronavirus, which basically mirror those of parent company Facebook. We're working to keep the Instagram community safe and informed on COVID-19. Here's an update on some o…", "url": "https://www.adweek.com/digital/instagrams-coronavirus-efforts-mirror-those-of-parent-company-facebook/", "urlToImage": "https://www.adweek.com/wp-content/uploads/2020/03/InstagramConnectWithHealthOrganizations-600x315.jpg", "publishedAt": "2020-03-06T23:05:50Z", "content": "Instagram detailed its efforts to keep its users safe and informed with regard to the coronavirus, which basically mirror those of parent company Facebook.Were working to keep the Instagram community safe and informed on COVID-19. Heres an update on some of t… [+891 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Doctor clarifies what's fact or fiction with the coronavirus", "description": "The spread of misinformation with the coronavirus is a real concern. Dr. Celine Gounder from the NYU School of Medicine and Bellevue Hospital joined CBSN tp break down what we know about the disease.", "url": "https://www.cbsnews.com/video/doctor-clarifies-whats-fact-or-fiction-with-the-coronavirus/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/06/42f26824-ab1c-493e-8ede-113a75686dd9/thumbnail/1200x630/662a69a25cd773f9deb6a18229d01125/0306-cbsn-coronafactfiction-wct-2042839-640x360.jpg", "publishedAt": "2020-03-06T22:48:56Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "NBC Sports Washington", "title": "Coronavirus outbreak: Wizards doing their best to keep players, staff healthy", "description": "With the coronavirus now close to Washington, the Wizards are doing their best to be vigilant and prevent its spread.", "url": "https://sports.yahoo.com/coronavirus-outbreak-wizards-doing-best-224155676.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/7_ACYJuyuwwzug5hARUbuQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnwashington.com/39febfb0643d3b751d3588cb7d9912a4", "publishedAt": "2020-03-06T22:41:55Z", "content": "WASHINGTON -- The coronavirus is no longer a back-burner concern for the D.C. area. It is officially here with three cases in Montgomery County, MD.\r\nThat is where several members of the Washington Wizards live and the team just came back from a lengthy road … [+1747 chars]"}, {"source": {"id": null, "name": "Languagehat.com"}, "author": "languagehat", "title": "Careful of the Miley!", "description": "From that impeachable source, NewsBiscuit, Cockneys announce ‘Miley Cyrus’ as official rhyming slang for Coronavirus: Above a well-known pie and mash shop in London’s East End, the annual summit of cockneys, an oppressed minority group, unveiled their new rhy…", "url": "http://languagehat.com/careful-of-the-miley/", "urlToImage": null, "publishedAt": "2020-03-06T22:57:35Z", "content": "Above a well-known pie and mash shop in Londons East End, the annual summit of cockneys, an oppressed minority group, unveiled their new rhyming slang for this Jeremy Hunt of a virus. After handing out market flyers for a 50% off sale of Cor Blimey trousers a… [+1111 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Covid-19 & your pets: No need to panic — yet - Times of India", "description": "Covid-19 & your pets: No need to panic — yet Times of India Dog tests 'weak positive' for coronavirus, a 1st case of human-to-canine infection Live Science Explained: Can dogs contract coronavirus? The Indian Express Hong Kong dog with coronavirus is 'doing w…", "url": "https://timesofindia.indiatimes.com/city/delhi/covid-19-your-pets-no-need-to-panic-yet/articleshow/74520155.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74521848,width-1070,height-580,imgsize-188052,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-06T23:06:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}]