[{"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "Passengers aboard quarantined cruise ship share photos", "description": "More than 3,500 people aboard the Grand Princess have been stuck on the cruise ship since Wednesday. Their two-week journey from San Francisco to Hawaii was cut short after officials learned that a California man who'd traveled on that ship last month contrac…", "url": "https://www.cnn.com/2020/03/07/us/grand-princess-cruise-photos-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200307154249-03-grand-princess-cruise-ship-photos-super-tease.jpg", "publishedAt": "2020-03-07T22:00:14Z", "content": "(CNN)More than 3,500 people aboard the Grand Princess have been stuck on the cruise ship since Wednesday. Their two-week journey from San Francisco to Hawaii was cut short after officials learned that a California man who'd traveled on that ship last month co… [+530 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connor Perrett", "title": "The US government has completed fewer than 6,000 coronavirus tests as more states report new cases and deaths", "description": "The US Centers for Disease Control and Prevention has tested fewer than 6,000 potential coronavirus cases so far. The figure came from FDA Commissioner Stephen Hahn on Saturday, who last week promised there would be 1 million test kits available by the end of…", "url": "https://www.businessinsider.com/us-cdc-conducted-fewer-than-6000-coronavirus-tests-2020-3", "urlToImage": "https://i.insider.com/5e640a39fee23d0ea8512172?width=1200&format=jpeg", "publishedAt": "2020-03-07T21:29:46Z", "content": "The United States government has conducted 5,861 tests for the novel coronavirus as of Friday at 6 p.m., US Food and Drug Administration Commissioner Stephen Hahn said on Saturday at an off-camera press briefing, CNN reported.\r\nThe report comes amid a rise in… [+3036 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Sebastian Murdock", "title": "Matt Gaetz Wore Gas Mask To Mock Coronavirus Worries. One Of His Constituents Just Died From It", "description": "The Republican congressman made light of the virus days before a person in his Florida district died of the illness.", "url": "https://www.huffpost.com/entry/matt-gaetz-gas-mask-mock-coronavirus-concerns-one-of-his-constituents-just-died-from-it_n_5e64067cc5b68d61645545d6", "urlToImage": "https://img.huffingtonpost.com/asset/5e640747230000821839cf26.jpeg?ops=1200_630", "publishedAt": "2020-03-07T21:38:40Z", "content": "Rep. Matt Gaetz (R-Fla.) mocked coronavirus concerns by wearing a gas mask on the House floor just days before an infected man from his district died.\r\n“Reviewing the coronavirus supplemental appropriation and preparing to go vote,” he said in a tweet Wednesd… [+1071 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: Should I cancel my flight? Will recirculated air on a plane spread coronavirus? Here’s what you need to know before traveling", "description": "Travelers mull over plans in light of COVID-19: ‘My trip is not as important as someone else’s health.’", "url": "http://www.marketwatch.com/story/should-i-cancel-my-flight-will-recirculated-air-on-a-plane-spread-coronavirus-heres-what-you-need-to-know-before-traveling-2020-03-07-17103010", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-03-07T22:00:10Z", "content": "Travelers mull over plans in light of COVID-19: My trip is not as important as someone elses health. See full story.\r\nThese nine companies are working on coronavirus treatments or vaccines heres where things stand\r\nA mix of legacy drugmakers and small startup… [+926 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Sarah Owermohle and Meridith McGraw", "title": "Trump officials unsure how many people tested for coronavirus", "description": "They also defended Trump&#39;s claim that anyone can get tested.", "url": "https://www.politico.com/news/2020/03/07/coronavirus-testing-white-house-briefing-123411", "urlToImage": "https://static.politico.com/bc/f5/78d7408e47ccac65755ac8caf10c/20200302-azar-ap-773.jpg", "publishedAt": "2020-03-07T22:03:12Z", "content": "Trump officials said Trump's claim that \"anyone who wants a test can get a test\" was accurate, but that people still need the approval of their doctors and state public health officials. But on Thursday, Vice President Mike Pence told reporters that that we d… [+913 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Ciara Postpones Texas Concert Amid Coronavirus Concerns", "description": "Ciara has postponed an upcoming concert in her birthplace of Fort Hood, Texas amid concerns about the coronavirus outbreak. The pregnant singer was scheduled to perform at the grand opening of the USO Fort Hood on March 19, but said Saturday the event is bein…", "url": "https://deadline.com/2020/03/ciara-postpones-texas-concert-over-coronavirus-1202876841/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/10331962x.jpg?w=1024", "publishedAt": "2020-03-07T21:48:14Z", "content": "Ciara has postponed an upcoming concert in her birthplace of Fort Hood, Texas amid concerns about the coronavirus outbreak.\r\nThe pregnant singer was scheduled to perform at the grand opening of the USO Fort Hood on March 19, but said Saturday the event is bei… [+1507 chars]"}, {"source": {"id": null, "name": "Nbcconnecticut.com"}, "author": "NBC Connecticut", "title": "Conn. Doctor Tests Positive for Coronavirus Marking Second Case Connected to State - NBC Connecticut", "description": "Conn. Doctor Tests Positive for Coronavirus Marking Second Case Connected to State NBC Connecticut Coronavirus is probably here already; it’s time for Gov. Lamont — and all of us — to step up our game Hartford Courant Second CT hospital employee from NY tests…", "url": "https://www.nbcconnecticut.com/news/local/conn-doctor-tests-positive-for-coronavirus-marking-second-case-connected-to-state/2234564/", "urlToImage": "https://media.nbcconnecticut.com/2019/09/Coronavirus-up-close-COVID-19.jpg?resize=1200%2C675", "publishedAt": "2020-03-07T21:13:00Z", "content": "A Connecticut community physician has tested positive for coronavirus, marking the second case connected to the state within a day.\r\nThe newest person who is infected is a community physician who made rounds at Bridgeport Hospital, according to Governor Ned L… [+7064 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "New York Coronavirus Test Delays Meant Days Without Diagnosis", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-07/new-york-coronavirus-test-delays-meant-days-without-diagnosis", "urlToImage": null, "publishedAt": "2020-03-07T21:54:00Z", "content": null}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Harriet Baskas", "title": "The 6 coolest gadgets we spotted at this year’s Travel Goods Showcase", "description": "Your travel plans may be on hold for a while due to event and conference cancellations, reduced flight schedules and concerns about the spread of coronavirus. But someday – let’s hope soon – your adventures around the globe should resume in earnest. And when …", "url": "http://thepointsguy.com/guide/travel-goods-showcase-best-gear-gadgets/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2020/03/1_Rollink.jpg?fit=2048%2C2048px&ssl=1", "publishedAt": "2020-03-07T22:00:12Z", "content": "Your travel plans may be on hold for a while due to event and conference cancellations, reduced flight schedules and concerns about the spread of coronavirus.\r\nBut someday lets hope soon – your adventures around the globe should resume in earnest. And when th… [+3467 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Lakers Star LeBron James Won’t Play If NBA Bans Fans From Games Over Coronavirus", "description": "Los Angeles Lakers star LeBron James said he won’t play any games if the NBA bans fans from attending due to fears over the coronavirus. On Friday, the NBA sent memos to teams saying they should prepare for the possibility that they may need to play games wit…", "url": "https://variety.com/2020/biz/news/laker-lebron-james-not-playing-nba-ban-fans-coronavirus-nba-1203527042/", "urlToImage": "https://pmcvariety.files.wordpress.com/2018/07/lebronjames4.jpg?w=700&h=393&crop=1", "publishedAt": "2020-03-07T21:59:47Z", "content": "Los Angeles Lakers star LeBron James said he won’t play any games if the NBA bans fans from attending due to fears over the coronavirus.\r\nOn Friday, the NBA sent memos to teams saying they should prepare for the possibility that they may need to play games wi… [+1592 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Steve Silva", "title": "Arctic Winter Games cancelled due to coronavirus concerns", "description": "The Whitehorse 2020 Arctic Winter Games have been cancelled due to concerns about novel coronavirus.", "url": "https://www.cbc.ca/news/canada/north/arctic-winter-games-cancelled-coronavirus-1.5490055", "urlToImage": "https://i.cbc.ca/1.3390924.1561396714!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/breaking-news.jpg", "publishedAt": "2020-03-07T22:04:38Z", "content": "The Whitehorse 2020 Arctic Winter Games have been cancelled due to concerns about novel coronavirus.\r\n\"It has been determined that cancelling the 2020 Arctic Winter Games is the most responsible precautionary measure,\" reads a statement from the City of White… [+709 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "The Associated Press", "title": "Coronavirus quarantine hotel collapses in China, trapping 70 people - The Mercury News", "description": "Coronavirus quarantine hotel collapses in China, trapping 70 people The Mercury News Seven dead after coronavirus quarantine hotel collapses in China CNN Coronavirus: Dozens trapped as China quarantine hotel collapses BBC News Coronavirus quarantine hotel in …", "url": "https://www.mercurynews.com/coronavirus-quarantine-hotel-collapses-in-china-trapping-70-people", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/03/SJM-Z-ChinaHotelCollapse-0307.jpg?w=1024&h=683", "publishedAt": "2020-03-07T21:17:25Z", "content": "BEIJING (AP) A hotel used for medical observation of people who had contact with coronavirus patients collapsed in southeastern China on Saturday, trapping some 70 people, state media reported. There were no immediate reports of deaths.\r\nAt least 33 people we… [+1174 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Punjab: Capt. Amarinder Singh forms 7-member GoM to monitor situation, preparedness", "description": "Amarinder, who is personally monitoring the situation on a day-to-day basis, will hold a meeting every Monday to review and deliberate on the recommendations of the GoM, which will be led by Local Government Minister Brahm Mohindra.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-capt-amarinder-singh-forms-7-member-gom-to-monitor-situation-preparedness/", "urlToImage": "https://images.indianexpress.com/2019/11/amarinder-singh.jpg?w=759", "publishedAt": "2020-03-07T21:22:38Z", "content": "The group has been mandated to submit a comprehensive report to the chief minister after  monitoring the entire situation on a day-to-day basis. (File)Punjab Chief Minister Capt. Amarinder Singh Saturday constituted a seven-member Group of Ministers (GoM) to … [+2368 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "CORONAVIRUS: Chinese doctors say coronavirus ‘like a combination of SARS and AIDS’, can cause ir…", "description": "CORONAVIRUS: Chinese doctors say coronavirus ‘like a combination of SARS and AIDS’, can cause irreversible lung damage.", "url": "https://pjmedia.com/instapundit/360663/", "urlToImage": null, "publishedAt": "2020-03-07T21:30:52Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "CORONAVIRUS: New CDC guidance says older adults should ‘stay at home as much as possible’ due to cor…", "description": "CORONAVIRUS: New CDC guidance says older adults should ‘stay at home as much as possible’ due to coronavirus.", "url": "https://pjmedia.com/instapundit/360654/", "urlToImage": null, "publishedAt": "2020-03-07T21:44:43Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Marnie the Dog, Famous Tongue-Out Pup, Dies at 18", "description": "Marnie the Dog -- the Internet-famous pooch who was known for her tongue-out expression -- has died. The Shih Tzu's owner, Shirley Braha, announced the tragic news Saturday on Instagram, writing... \"It is with much grief I share the news that…", "url": "https://www.tmz.com/2020/03/07/marnie-the-dog-famous-tongue-out-pup-dies-dead/", "urlToImage": "https://imagez.tmz.com/image/9f/16by9/2020/03/07/9f03a35cccbc46cc868faf9c1098630f_xl.jpg", "publishedAt": "2020-03-07T21:55:25Z", "content": "Marnie the Dog -- the Internet-famous pooch who was known for her tongue-out expression -- has died.\r\nThe Shih Tzu's owner, Shirley Braha, announced the tragic news Saturday on Instagram, writing ... \"It is with much grief I share the news that Marnie passed … [+1507 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Why Is There A Worldwide Run On Toilet Tissue Amid The Coronavirus? via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_105926e05dc8e972b69e6aab48b7d767", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-07T21:40:08Z", "content": "Purdue Boilermakers men's basketball, Rutgers Scarlet Knights men's...\r\nAlong with honoring the team's three seniors, the Boilermakers are playing for a better seed in the Big Ten tournament and earn an NCAA bid."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus threatens to have broad economic impact", "description": "New jobs numbers released Friday show a decrease in the unemployment rate before the spread of coronavirus. Yahoo Finance reporter Akiko Fujita spoke to CBSN's Reena Ninan about the broader economic impact of the spreading disease.", "url": "https://www.cbsnews.com/video/coronavirus-threatens-to-have-broad-economic-impact/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/07/f5254040-94f9-449c-abe6-5a228c3a8d6b/thumbnail/1200x630/d88737c13134171fbc9850a5ab00577b/0307-cbsn-coronabusiness-wkj-wkk-2043367-640x360.jpg", "publishedAt": "2020-03-07T21:57:50Z", "content": null}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Gavin Sheehan", "title": "Seattle Game Companies Are Having Staff Work From Home Due To Coronavirus", "description": "Gaming companies in Seattle are taking a smarter route toward having employees work through the coronavirus, which includes working from home. Several companies in the area have decided to take the initiative to keep their staff safe by not having them come t…", "url": "https://www.bleedingcool.com/2020/03/07/seattle-game-companies-are-having-staff-work-from-home-due-to-coronavirus/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/microsoft-redmond-campus-1200x628.jpg", "publishedAt": "2020-03-07T21:40:39Z", "content": "Gaming companies in Seattle are taking a smarter route toward having employees work through the coronavirus, which includes working from home. Several companies in the area have decided to take the initiative to keep their staff safe by not having them come t… [+1041 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": null, "title": "Tech Stocks News: Zoom and Okta Report Earnings - Nasdaq", "description": "The coronavirus continued to be the main headline across the world this week. Fears about how the virus will affect businesses led to more market volatility as stocks moved up and down viciously.", "url": "https://www.fool.com/investing/2020/03/07/tech-stocks-news-zoom-and-okta-report-earnings.aspx", "urlToImage": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg", "publishedAt": "2020-03-07T21:44:00Z", "content": "The coronavirus continued to be the main headline across the world this week. Fears about how the virus will affect businesses led to more market volatility as stocks moved up and down viciously.\r\nLooking beyond this broader-market news, however, was some int… [+3548 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH LIVE: Update to Life Care Center of Kirkland coronavirus outbreak - KING 5", "description": "WATCH LIVE: Update to Life Care Center of Kirkland coronavirus outbreak KING 5 Nursing Home at Center of Washington Coronavirus Outbreak Target of Criticism The Wall Street Journal 'Germ-fest' party preceded deadly nursing home outbreak msnNOW 'Germ-fest' par…", "url": "https://www.youtube.com/watch?v=YcT9EQTj4qA", "urlToImage": "https://i.ytimg.com/vi/YcT9EQTj4qA/maxresdefault.jpg", "publishedAt": "2020-03-07T21:39:11Z", "content": "As of Saturday, 26 residents Life Care Center residents have died and of those 13 tested positive for coronavirus (COVID-19). A task force of at least 30 medical professionals from the United States Public Health Service are now on the ground helping the staf… [+67 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Li Cohen", "title": "New York declares state of emergency amid coronavirus outbreak", "description": "There are 76 confirmed COVID-19 cases in New York State, including 11 in New York City.", "url": "https://www.cbsnews.com/news/new-york-joins-4-other-states-in-declaring-state-of-emergency-amid-coronavirus-outbreak-2020-03-07/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/07/01f2df06-3981-4f4b-9cac-095fb6f50251/thumbnail/1200x630/8c8ed9cd0d9022eb2332bcc2a8772ad9/gettyimages-1204736689.jpg", "publishedAt": "2020-03-07T21:32:12Z", "content": "New York Governor Andrew Cuomo declared a state of emergency amid the coronavirus outbreak. Shortly before the announcement, he tweeted that there are now 76 confirmed cases of COVID-19 throughout the state, most of which are in Westchester County.   \r\nAs of … [+6097 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "NEWS YOU CAN USE: Science May Have Discovered Regular Drinkers Of Hard Liquor Are Better Protected …", "description": "NEWS YOU CAN USE: Science May Have Discovered Regular Drinkers Of Hard Liquor Are Better Protected From Coronavirus.", "url": "https://pjmedia.com/instapundit/360618/", "urlToImage": null, "publishedAt": "2020-03-07T22:00:11Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jackie Northam", "title": "Iran Sanctions Aggravate Coronavirus Crisis", "description": "Have years of U.S. sanctions and efforts to isolate Iran affected the ability to get information about –- or aid to help control –- the coronavirus, as it continues to spread?", "url": "https://www.npr.org/2020/03/07/813288996/iran-sanctions-aggravate-coronavirus-crisis", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-03-07T22:00:03Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jocelyne ZABLIT", "title": "Anxiety aboard US cruise ship as NY declares coronavirus emergency", "description": "Passengers trapped aboard a US cruise ship, stranded by a coronavirus outbreak, spoke of their growing anxiety on Saturday as New York state announced a state of emergency over a spike in new cases. One of the holidaymakers onboard the Grand Princess told AFP…", "url": "https://news.yahoo.com/anxiety-aboard-us-cruise-ship-ny-declares-coronavirus-213851624.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9TZzUt00BU_6KIv5tOSjVg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDA-/https://s.yimg.com/uu/api/res/1.2/D8Cpk5H1XpL7Hs_Qp8C2kQ--~B/aD00NDQ7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/6915afd82e73bc6acb1e9785696ad053a1b9d10b.jpg", "publishedAt": "2020-03-07T21:38:51Z", "content": "Los Angeles (AFP) - Passengers trapped aboard a US cruise ship, stranded by a coronavirus outbreak, spoke of their growing anxiety on Saturday as New York state announced a state of emergency over a spike in new cases.\r\nOne of the holidaymakers onboard the Gr… [+3613 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Alison Branley", "title": "Tasmania closed borders to prevent Spanish flu outbreak, but it would not work with coronavirus", "description": "Tasmania closed its borders in 1919 to guard against the Spanish flu pandemic. But could shutting off the island from visitors help prevent a coronavirus outbreak over a century later?", "url": "https://www.abc.net.au/news/2020-03-08/why-closing-tasmanian-borders-for-coronavirus-would-not-work/12033900", "urlToImage": "https://www.abc.net.au/news/image/12034382-16x9-700x394.jpg", "publishedAt": "2020-03-07T21:17:33Z", "content": "Posted \r\nMarch 08, 2020 08:17:33\r\nSenator Jacqui Lambie has suggested Tasmania close its borders to protect people from the coronavirus.\r\nKey points:\r\n<ul><li>Senator Jacqui Lambie has suggested Tasmania close its borders to prevent the spread of coronavirus<… [+6143 chars]"}, {"source": {"id": null, "name": "Livejournal.com"}, "author": "stewie_e", "title": "Here Come the Excuses Y’all: Justin Bieber downgrades stadium tour stops due to coronavirus fears", "description": "Justin Bieber Swaps Stadiums for Arenas on Tour Thanks to Coronavirus https://t.co/v2nXTFhSSE — TMZ (@TMZ) March 7, 2020 A follow up to yesterday’s post. Here comes that PR spin via Team Bieber and Scooter Braun. The source claims that the Coronavirus is the …", "url": "https://ohnotheydidnt.livejournal.com/117369934.html", "urlToImage": "https://l-files.livejournal.net/og_image/3616053/458476?v=1583617517", "publishedAt": "2020-03-07T21:45:14Z", "content": "Justin Bieber Swaps Stadiums for Arenas on Tour Thanks to Coronavirus https://t.co/v2nXTFhSSE\r\n— TMZ (@TMZ) March 7, 2020\r\nA follow up to yesterdays post.Here comes that PR spin via Team Bieber and Scooter Braun. The source claims that the Coronavirus is the … [+154 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Alexandra Samuels", "title": "Funerals could be streamed online if coronavirus outbreak becomes a pandemic", "description": "Confirmed cases of COVID-19 globally hit 101,800 on Friday with 3,460 deaths in total. The post Funerals could be streamed online if coronavirus outbreak becomes a pandemic appeared first on The Daily Dot.", "url": "https://www.dailydot.com/irl/coronavirus-funerals-live-streamed/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/coronavirus-funerals-live-streamed.jpg", "publishedAt": "2020-03-07T21:51:02Z", "content": "Experts warn: People may have to watch their loved ones funerals via live stream should the coronavirus become a pandemic.\r\nTo be sure, theres no set timeline for whenor ifthis will happen. The National Association of Funeral Directors told Sky News its worki… [+1432 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Alexandra Samuels", "title": "Influencer YesJulz admits to lying about travel history after being pulled aside amid coronavirus fears", "description": "She lied to an official about visiting France after being pulled aside for coughing in the airport. The post Influencer YesJulz admits to lying about travel history after being pulled aside amid coronavirus fears appeared first on The Daily Dot.", "url": "https://www.dailydot.com/irl/coronavirus-yesjulz-france-twitter/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/coronavirus-yesjulz-france-twitter-1.jpg", "publishedAt": "2020-03-07T21:16:58Z", "content": "Instagram-famous YesJulz admitted on Twitter that she lied to an official about visiting France after being pulled aside for coughing amid coronavirus fears. \r\nAccording to the Daily Mailin since-deleted tweetsJulz laced into the officials not for thoroughly … [+2139 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Jamie White", "title": "EMERGENCY REPORT: Coronavirus Is An Engineered Weapon For The Global Takedown Of The Western World", "description": "Alex Jones delivers a deep-dive report on COVID-19 and its global & domestic implications.", "url": "https://www.infowars.com/emergency-report-coronavirus-is-an-engineered-weapon-for-the-global-takedown-of-the-western-world/", "urlToImage": "https://assets.infowars.com/2020/03/mikeadamsalexjones239847.jpg", "publishedAt": "2020-03-07T22:02:01Z", "content": "Alex Jones throughly dissects the coronavirus outbreak, from its man-made origins to its global economic implications based on hard scientific data and intel from the top experts in virology, bioweapons, and international law.\r\nTurbo Force is back! Boost your… [+62 chars]"}, {"source": {"id": null, "name": "Onemileatatime.com"}, "author": "Ben (Lucky)", "title": "Weekly Review: March 7, 2020", "description": "Hello from Nicaragua! We're spending the weekend enroute to Calala Island. While this is an incredible use of World of Hyatt points on the surface, I'm curious what it's actually like, because getting there sure isn't easy when you consider how close to home …", "url": "https://onemileatatime.com/weekly-review-march-7-2020/", "urlToImage": "https://onemileatatime.com/wp-content/uploads/2019/11/Calala-Island-Nicaragua-4.jpg", "publishedAt": "2020-03-07T21:33:36Z", "content": "Hello from Nicaragua! We’re spending the weekend enroute to Calala Island. While this is an incredible use of World of Hyatt points on the surface, I’m curious what it’s actually like, because getting there sure isn’t easy when you consider how close to home … [+4679 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nelson Hem", "title": "Barron's Picks And Pans: Coronavirus Picks, Bonds, Safe Havens And More", "description": "This weekend's Barron's cover story offers 12 stocks to buy amid the coronavirus sell-off. Other featured articles focus on bonds and on gold as investments -- and the safest safe havens.Also, the prospects for semiconductor and pharmaceutical stocks, a real …", "url": "https://finance.yahoo.com/news/barrons-picks-pans-coronavirus-picks-220900583.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yrC4OWxCWLsVB1.cFRGPzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/cnygrK2gtJwEcKNSSkd6jg--~B/aD00MDA7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/Benzinga/4e5073adce57245dce91c87cf86c4d97", "publishedAt": "2020-03-07T22:09:00Z", "content": "This weekend's Barron's cover story offers 12 stocks to buy amid the coronavirus sell-off. \r\nOther featured articles focus on bonds and on gold as investments and the safest safe havens.\r\nAlso, the prospects for semiconductor and pharmaceutical stocks, a real… [+2802 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Noah C", "title": "Joe Budden Calls BS On Justin Bieber's Coronavirus-Related Tour Downsizing", "description": "Joe Budden thinks Justin Bieber's \"Changes\" tour venue changes aren't a result of the Coronavirus scare. https://www.hotnewhiphop.com/joe-budden-calls-bs-on-justin-biebers-coronavirus-related-tour-downsizing-news.105692.html", "url": "https://www.hotnewhiphop.com/joe-budden-calls-bs-on-justin-biebers-coronavirus-related-tour-downsizing-news.105692.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1583614949_52967b6ed2e8c1cd3fc9cd9ec3f9a319.jpg/daf20b770793a945bf5cd5e9359c622f/1583614949_8d014f771951d980a1c0e00d64825c2d.jpg", "publishedAt": "2020-03-07T21:25:07Z", "content": "On Friday (Mar. 6), it was announced that Justin Bieber's arena tour in support of his new album, Changes, would be downsizing to smaller venues. Coronavirus was cited as a factor leading to these adjustments, as it has been impacting everything else in the w… [+1140 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "PM Modi reviews situation as 3 more test positive for coronavirus in India - Hindustan Times", "description": "PM Modi reviews situation as 3 more test positive for coronavirus in India Hindustan Times PM Modi gets emotional while interacting with Jan Aushadhi Yojana beneficiaries Times of India Critics Talking About ‘Right’ Things Hate Those Doing Them: Modi The Quin…", "url": "https://www.hindustantimes.com/india-news/pm-modi-reviews-situation-as-3-more-test-positive/story-xFIGKytcdJzVkMWzJCFKPO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/08/Pictures/international-prevention-saturday-hindustan-coronavirus-passengers-wearing_c85a34dc-60b6-11ea-be04-6cf974e2d9f7.jpg", "publishedAt": "2020-03-07T21:37:38Z", "content": "India on Saturday reported three more positive cases of the new coronavirus disease (Covid-19), taking the total number of infected people in the country to 34, even as Prime Minister Narendra Modi held a review meeting to discuss measures to contain the outb… [+5187 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "China exports plunge on coronavirus epidemic", "description": "China's exports plummeted in the first two months of this year on the back of a coronavirus epidemic that forced businesses to suspend operations, disrupting the world's supply chains. Exports fell 17.2 percent, the biggest drop since February 2019 during the…", "url": "https://japantoday.com/category/business/china-exports-plunge-on-coronavirus-epidemic", "urlToImage": null, "publishedAt": "2020-03-07T22:05:06Z", "content": "China's exports plummeted in the first two months of this year on the back of a coronavirus epidemic that forced businesses to suspend operations, disrupting the world's supply chains.\r\nExports fell 17.2 percent, the biggest drop since February 2019 during th… [+2250 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Coronavirus leaves passenger-filled ships without ports", "description": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days. Keeping all of the passengers on board instead of letting …", "url": "https://japantoday.com/category/world/coronavirus-leaves-passenger-filled-ships-without-ports", "urlToImage": null, "publishedAt": "2020-03-07T22:08:13Z", "content": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days.\r\nKeeping all of the passengers on board instead of letting… [+3739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling and Susannah Cullinane, CNN", "title": "Golden State Warriors to play NBA game despite coronavirus warning", "description": "The Golden State Warriors will take on the Philadelphia 76ers in San Francisco later today despite local health officials warning against large gatherings over coronavirus fears.", "url": "https://www.cnn.com/2020/03/07/us/golden-state-warriors-nba-coronavirus-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200308060603-golden-state-warriors-stephen-curry-super-tease.jpg", "publishedAt": "2020-03-07T21:23:19Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Europe: Messi penalty eases Setien pressure", "description": "Lionel Messi's late penalty edged Barcelona to a 1-0 victory at home to Real Sociedad to ease the pressure on manager Quique Setien.", "url": "https://www.skysports.com/football/news/11095/11952530/european-round-up-lionel-messi-sends-barcelona-top-to-ease-pressure-on-quique-setien", "urlToImage": "https://e2.365dm.com/20/03/1600x900/skysports-lionel-messi-barcelona_4941596.jpg", "publishedAt": "2020-03-07T22:11:00Z", "content": "Lionel Messi's late penalty edged Barcelona to a 1-0 victory at home to Real Sociedad to ease the pressure on manager Quique Setien.\r\nThe 61-year-old, who replaced Ernesto Valverde in January, had come under fire after last weekend's El Clasico defeat to Real… [+3438 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "Italian Winery Mishap Causes Wine (Yes, Wine) to Flow from Pipes in Nearby Homes", "description": "Wine was on tap for some unsuspecting Italian locals — right in the comfort of their own homes. On Wednesday, residents in Castelvetro, Italy, turned on their faucets, showers and other water sources to discover wine flowing through their homes’ pipes, accord…", "url": "https://people.com/food/italian-winery-mishap-wine-from-faucets-in-homes/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fwine.jpg%3Fcrop%3D0px%2C0px%2C2400px%2C1260px%26resize%3D1200%2C630", "publishedAt": "2020-03-07T21:15:00Z", "content": "Wine was on tap for some unsuspecting Italian locals — right in the comfort of their own homes.\r\nOn Wednesday, residents in Castelvetro, Italy, turned on their faucets, showers and other water sources to discover wine flowing through their homes’ pipes, accor… [+1854 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "How Trump Lost Control of Coronavirus", "description": "Washington Post: \"Infighting quickly materialized among agencies that have long had poor relationships — feuding was especially intense between the CDC and the Office of the Assistant Secretary for Preparedness and Response — and when the situation went awry,…", "url": "https://politicalwire.com/2020/03/07/how-trump-lost-control-of-coronavirus/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-07T21:19:03Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "New CDC guidance says older adults should 'stay at home as much as possible' due to coronavirus (Elizabeth Cohen/CNN)", "description": "Elizabeth Cohen / CNN : New CDC guidance says older adults should ‘stay at home as much as possible’ due to coronavirus — (CNN)Amid a coronavirus outbreak in the United States, the US Centers for Disease Control and Prevention is encouraging older people and …", "url": "https://www.memeorandum.com/200307/p63", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200304041310-05-coronavirus-0303-seattle-super-tease.jpg", "publishedAt": "2020-03-07T22:10:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Moldova Confirms First Case of Coronavirus in Country", "description": "CHISINAU (Sputnik) - The first case of coronavirus, officially known as COVID-19, was confirmed in Moldova on Saturday, the Health Ministry said, adding that a woman who returned from Italy tested positive for the virus.", "url": "https://sputniknews.com/europe/202003071078505936-moldova-confirms-first-case-of-coronavirus-in-country/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107832/01/1078320147.jpg", "publishedAt": "2020-03-07T21:37:52Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Greece Confirms 21 New Cases of Coronavirus, Total Number Reaches 66", "description": "ATHENS (Sputnik) - Greece confirmed 21 new cases of the coronavirus disease, officially known as COVID-19, on Saturday, while the total number of people infected with the virus reached 66, the Health Ministry said.", "url": "https://sputniknews.com/europe/202003071078506013-greece-confirms-21-new-cases-of-coronavirus-total-number-reaches-66/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107850/60/1078506033.jpg", "publishedAt": "2020-03-07T22:03:01Z", "content": null}, {"source": {"id": null, "name": "Kuow.org"}, "author": "Dyer Oxley", "title": "'Volatile and unpredictable': Life Care speaks publicly for the first time since COVID-19 outbreak - KUOW News and Information", "description": "'Volatile and unpredictable': Life Care speaks publicly for the first time since COVID-19 outbreak KUOW News and Information Coronavirus outbreak claims lives of more than a dozen Life Care Center residents KING 5 Nursing Home at Center of Washington Coronavi…", "url": "https://www.kuow.org/stories/volatile-and-unpredictable-life-care-speaks-publicly-for-the-first-time-since-covid-19-outbreak", "urlToImage": "https://kuow-prod.imgix.net/store/018cbe968e873caba0c1ad23a3f2db8e.jpg?fm=jpg&fit=max&w=1200&h=628&q=80", "publishedAt": "2020-03-07T21:52:52Z", "content": "Our experience with this so far is that this virus has been shown to be volatile and unpredictable, said Tim Killian, a public liaison for Life Care Center.\r\nEverything weve learned so far is that we know very little about how this virus will act, he said, no… [+2791 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Channel NewsAsia", "title": "To minimise your risk of COVID-19, stop touching your face", "description": "It’s a quirk of human nature that we touch our eyes, noses and mouths all day long. It’s also a major way we pick up infections like coronavirus.", "url": "https://cnalifestyle.channelnewsasia.com/wellness/to-minimise-your-risk-of-covid-19-stop-touching-your-face-12492866", "urlToImage": "https://www.channelnewsasia.com/image/12494124/16x9/768/432/9436ace3c5674e9709e23bdcdeae138c/gp/woman-posing-with-hand-on-face.jpg", "publishedAt": "2020-03-07T22:03:39Z", "content": null}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "Anxiety aboard US cruise ship due to coronavirus", "description": "No word when Grand Princess will be able to dock in California, after 21 people aboard test positive for coronavirus.", "url": "http://www.israelnationalnews.com/News/News.aspx/276961", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/945/945736.jpg", "publishedAt": "2020-03-07T22:02:31Z", "content": "Passengers trapped aboard a US cruise ship, stranded by a coronavirus outbreak, spoke of their growing anxiety on Saturday as New York state announced a state of emergency over a spike in newcases.\r\nOne of the holidaymakers onboard the Grand Princess told AFP… [+3539 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "This Week In Music: South By Southwest Cancellation Raises Future Issues For Live Events", "description": "The biggest story in the music business this week – really, the only story, given the ramifications – was the Austin Mayor’s decision to pull the plug on South by Southwest. It marked the first time in the event’s 34-year-history that the show won’t go on. Al…", "url": "https://deadline.com/2020/03/this-week-in-music-sxsw-cancellation-raises-questions-on-future-live-events-1202876830/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/sxsw.jpg?w=1024", "publishedAt": "2020-03-07T21:34:19Z", "content": "The biggest story in the music business this week – really, the only story, given the ramifications – was the Austin Mayor’s decision to pull the plug on South by Southwest. It marked the first time in the event’s 34-year-history that the show won’t go on.\r\nA… [+3740 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "JAY REEVES", "title": "Coronavirus leaves passenger-filled ships without ports", "description": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days. Keeping all of the passengers on board instead of letting …", "url": "https://news.yahoo.com/coronavirus-leaves-passenger-filled-ships-211828676.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Ulvk3DHlFFwu5c1v1eXCYw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02MjEuODY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/7jmICxaREGlCI6WQhDLe2g--~B/aD0xOTYwO3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/a57702a4cf7e1c0e305712faddaa5bde", "publishedAt": "2020-03-07T21:18:28Z", "content": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days.\r\nKeeping all of the passengers on board instead of letting… [+3689 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Italy set to lock down Lombardy after coronavirus jump", "description": "Italy is set to lock down its wealthiest and most populous region, which includes the financial capital Milan, as part of tough new measures expected to be approved on Saturday to try to contain the coronavirus outbreak.", "url": "https://www.channelnewsasia.com/news/world/coronavirus-covid19-italy-lombardy-lock-down-12513610", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12513756/16x9/991/557/1fa82b48cf1cd618b29e0b3671d482eb/DP/piazza-bra--virtually-deserted-as-italy-battles-a-coronavirus-outbreak--in-verona-1.jpg", "publishedAt": "2020-03-07T21:33:32Z", "content": "ROME: Italy is set to lock down its wealthiest and most populous region, which includes the financial capital Milan, as part of tough new measures expected to be approved on Saturday (Mar 7) to try to contain the coronavirus outbreak.\r\nThe new rules include t… [+3524 chars]"}, {"source": {"id": null, "name": "Activistpost.com"}, "author": "Aaron", "title": "Post-Coronavirus Future? Injectable Biosensors, A.I. Virus Detection, Robots and a Cashless Society", "description": "By Aaron Kesel As a result of the coronavirus, we are witnessing a push towards injectable sensors for virus detection, Orwellian surveillance, A.I. and robots,... Post-Coronavirus Future? Injectable Biosensors, A.I. Virus Detection, Robots and a Cashless Soc…", "url": "https://www.activistpost.com/2020/03/post-coronavirus-future-injectable-biosensors-a-i-virus-detection-robots-and-a-cashless-society.html", "urlToImage": "https://www.activistpost.com/wp-content/uploads/2020/03/virus-ai-pix-1024x609-1.jpg", "publishedAt": "2020-03-07T21:38:25Z", "content": "By Aaron Kesel\r\nAs a result of the coronavirus, we are witnessing a push towards injectable sensors for virus detection, Orwellian surveillance, A.I. and robots, as well as a call to quarantine U.S. fiat money coming out of China due to its potential to sprea… [+4245 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Gov't unveils zero-interest loan scheme for firms hit by virus", "description": "Prime Minister Shinzo Abe said Saturday the government will launch a scheme to extend zero interest loans with no collateral to small and midsized companies reeling from the new-coronavirus turmoil. The state-owned Japan Finance Corp is among entities that wi…", "url": "https://japantoday.com/category/business/abe-unveils-zero-interest-loan-scheme-for-small-firms-hit-by-virus", "urlToImage": null, "publishedAt": "2020-03-07T22:01:11Z", "content": "Prime Minister Shinzo Abe said Saturday the government will launch a scheme to extend zero interest loans with no collateral to small and midsized companies reeling from the new-coronavirus turmoil.\r\nThe state-owned Japan Finance Corp is among entities that w… [+2165 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Canceling Tokyo Olympics would cut Japan GDP growth by 1.4%: estimate", "description": "If the ongoing spread of the new coronavirus forces Japan to cancel the Tokyo Olympics, it would reduce the country's annual gross domestic product growth by 1.4 percent, according to an estimate by a securities firm. In a report released Friday, SMBC Nikko S…", "url": "https://japantoday.com/category/2020-tokyo-olympics/update1-canceling-tokyo-olympics-would-cut-japan-gdp-growth-by-1.4-estimate", "urlToImage": null, "publishedAt": "2020-03-07T22:02:20Z", "content": "If the ongoing spread of the new coronavirus forces Japan to cancel the Tokyo Olympics, it would reduce the country's annual gross domestic product growth by 1.4 percent, according to an estimate by a securities firm.\r\nIn a report released Friday, SMBC Nikko … [+970 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Virus cancellations send Olympic beach hopefuls scrambling", "description": "Olympic beach volleyball hopefuls Emily Stockman and Kelley Larsen thought they’d have plenty of chances to play themselves into the Tokyo Games during a two-year qualification period that ends with the international tour finale in June. Since the spread of c…", "url": "https://japantoday.com/category/2020-tokyo-olympics/virus-cancellations-send-olympic-beach-hopefuls-scrambling", "urlToImage": null, "publishedAt": "2020-03-07T22:02:42Z", "content": "Olympic beach volleyball hopefuls Emily Stockman and Kelley Larsen thought theyd have plenty of chances to play themselves into the Tokyo Games during a two-year qualification period that ends with the international tour finale in June.\r\nSince the spread of c… [+4599 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Gabriel Fernandez", "title": "LeBron James says 'I ain't playing' in empty arenas if the NBA decides to ban fans amid coronavirus concerns", "description": "Pandemic or no pandemic, The King says he'll only play if there are fans watching", "url": "https://www.cbssports.com/nba/news/lebron-james-says-i-aint-playing-in-empty-arenas-if-the-nba-decides-to-ban-fans-amid-coronavirus-concerns/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2020/03/03/33bed084-c82e-4672-8a85-7633aee15f0f/thumbnail/1200x675/3d52de964ab03542947fb092cd2f1908/lebron.jpg", "publishedAt": "2020-03-07T21:17:21Z", "content": "Throughout the course of much of his career, LeBron James has worked hard for the goodwill of as many basketball fans as possible in seemingly every way, shape and form. This latest effort comes in response to the NBA reportedly circulating a memo on Friday t… [+1519 chars]"}, {"source": {"id": null, "name": "Youredm.com"}, "author": "Karlie Powell", "title": "Dave Clarke Speaks Out to DJs Amid Coronavirus Cancellations: “Send the Fees Back”", "description": "Ultra Music Festival, Tomorrowland Winter, SXSW and more are canceled due to the coronavirus outbreak — and the entertainment industry is taking a major hit because of it. Just days or weeks out from these events, festival organizers are scrambling to issue r…", "url": "https://www.youredm.com/2020/03/07/dave-clarke-speaks-out-coronavirus-cancellations/", "urlToImage": "https://www.youredm.com/wp-content/uploads/2019/06/firefly-sprawling-crowd_Photo-via-aLIVE-Coverage.jpg", "publishedAt": "2020-03-07T22:03:49Z", "content": "Ultra Music Festival, Tomorrowland Winter, SXSW and more are canceled due to the coronavirus outbreak — and the entertainment industry is taking a major hit because of it.\r\nJust days or weeks out from these events, festival organizers are scrambling to issue … [+850 chars]"}, {"source": {"id": null, "name": "Milestomemories.com"}, "author": "Miles To Memories", "title": "Coronavirus & How to Find the Best Cruise Deals Right Now. Insane Prices from $44", "description": "Cruise prices continue to plummet. We have seen entire cruises for as low as $44 per person. Those prices are insane and we'll show you how to find them, but should you go? The post Coronavirus & How to Find the Best Cruise Deals Right Now. Insane Prices from…", "url": "https://milestomemories.com/cruise-deals-coronavirus/", "urlToImage": "https://milestomemories.com/wp-content/uploads/2019/04/Carnival-Cruise-May-2009.jpg", "publishedAt": "2020-03-07T21:50:36Z", "content": "This post may contain affiliate links; please read our advertiser disclosure for more information.\r\nCarnival Paradise\r\nI just can’t seem to shake this strong desire to go on a cruise. While that might seem incredibly crazy to some of you, those deal lovers ou… [+3629 chars]"}, {"source": {"id": null, "name": "Cboardinggroup.com"}, "author": "C Boarding Group", "title": "United Extends 2020 Status Match Program by 30 days in response to Coronavirus", "description": "In an email sent to MileagePlus members on March 7th, United Airlines has announced that it is extending the window to complete a 2020 Status Match by 30 days. The post United Extends 2020 Status Match Program by 30 days in response to Coronavirus appeared fi…", "url": "https://cboardinggroup.com/united-extends-2020-status-match-program-by-30-days-in-response-to-coronavirus/", "urlToImage": "https://cboardinggroup.com/wp-content/uploads/2020/03/United-Extends-2020-Status-Match-Program.png", "publishedAt": "2020-03-07T21:49:33Z", "content": "In an email sent to MileagePlus members on March 7th, United Airlines has announced that it is extending the window to complete a 2020 Status Match by 30 days.\r\nThis email was sent on the heels of a letter from CEO Oscar Munoz earlier and highlights a few key… [+1586 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Patrick Hill, Dan Warburton)", "title": "Brit coronavirus victim 'was so excited for cruise' and died 60 mins after diagnosis", "description": "EXCLUSIVE: The friend of one of the two victims of coronavirus who died in Britain has called his friend a \"wonderful man.\"", "url": "https://www.mirror.co.uk/news/uk-news/brit-coronavirus-victim-was-excited-21652774", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21652056.ece/ALTERNATES/s1200/0_Milton-Keynes-University-Hospital.jpg", "publishedAt": "2020-03-07T22:00:00Z", "content": "A friend of one of the two coronavirus victims to die in Britain paid tribute to his pal and spoke of the heartbreak for his family.\r\nThe 83-year-old died four days after being admitted to hospital following his return from a Caribbean cruise.\r\nBut anguished … [+3795 chars]"}, {"source": {"id": null, "name": "Thegatewaypundit.com"}, "author": "Jim Hoft", "title": "UPDATE: Latest Numbers from Italy Show 99% of Coronavirus Deaths are People 60 and Older!", "description": "It appears Coronavirus is Deadly Senior’s disease The Italian government released their latest numbers on the coronavirus update on Saturday. There were 1,247 new cases of the deadly disease reported in Italy on Saturday. The Italian government also released …", "url": "https://www.thegatewaypundit.com/2020/03/update-latest-numbers-from-italy-show-99-of-coronavirus-deaths-are-people-60-and-older/", "urlToImage": "https://www.thegatewaypundit.com/wp-content/uploads/11-11-1200x630.jpg", "publishedAt": "2020-03-07T21:52:13Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Molly Pike)", "title": "Pregnant Ciara cancels concert on doctor's orders due to coronavirus fears", "description": "Ciara, who is pregnant with her third child, has been forced to cancel her Texas gig on doctor's orders over coronavirus fears", "url": "https://www.mirror.co.uk/3am/celebrity-news/pregnant-ciara-cancels-concert-doctors-21652681", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21652721.ece/ALTERNATES/s1200/0_2020-Vanity-Fair-Oscar-Party-Hosted-By-Radhika-Jones-Arrivals.jpg", "publishedAt": "2020-03-07T21:41:45Z", "content": "Ciara has been forced to cancel a concert due to coronavirus fears.\r\nThe singer, who is pregnant with her third child, has released a statement explaining that she can't go through with the Texas gig on doctor's orders.\r\nShe had been due to perform at the ope… [+1733 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "Here's One Event Not Hit by Coronavirus", "description": "When 57 mushers line up Sunday for the official start of the Iditarod Trail Sled Dog Race, it will be the second-smallest field in the past two decades, the AP reports. Only last year’s field of 52 was smaller. Interest in the world’s most famous sled dog rac…", "url": "https://www.newser.com/story/287880/heres-one-event-not-hit-by-coronavirus.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1286018-12-20200307162017.jpeg", "publishedAt": "2020-03-07T21:30:00Z", "content": "(Newser)\r\nWhen 57 mushers line up Sunday for the official start of the Iditarod Trail Sled Dog Race, it will be the second-smallest field in the past two decades, the AP reports. Only last year’s field of 52 was smaller. Interest in the world’s most famous sl… [+1407 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Women’s world Ice hockey championships in Canada canceled due to virus", "description": "The women’s world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus. The two-week tournament was set to open March 31, with venues in Halifax and Truro, Nova Scotia. René Fasel, pres…", "url": "https://japantoday.com/category/sports/fasel-tells-ap-women%27s-world-hockey-championships-canceled", "urlToImage": null, "publishedAt": "2020-03-07T22:07:52Z", "content": "The womens world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus.\r\nThe two-week tournament was set to open March 31, with venues in Halifax and Truro, Nova Scotia.\r\nRené Fasel, pre… [+4218 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Diamond Princess passenger dies, bringing ship's death toll to 7", "description": "A man who had been aboard the Diamond Princess cruise ship and was infected with coronavirus has died, bringing the death toll from the ship to seven, Japanese public broadcaster NHK said on Saturday. The man was not Japanese, NHK said, without giving details…", "url": "https://japantoday.com/category/national/update-1-diamond-princess-passenger-dies-bringing-ship%27s-death-toll-to-seven-nhk", "urlToImage": null, "publishedAt": "2020-03-07T22:03:05Z", "content": "A man who had been aboard the Diamond Princess cruise ship and was infected with coronavirus has died, bringing the death toll from the ship to seven, Japanese public broadcaster NHK said on Saturday.\r\nThe man was not Japanese, NHK said, without giving detail… [+441 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Elizabeth White", "title": "How To Start an Economic Depression (Not Coronavirus)? Cheap, Mass-Produced Sea Mines", "description": "Elizabeth White Security, World Why hasn't it happened yet? When you stop and think about it for any length of time, it seems a miracle that the global economy spins on as well as it does. As the spread of the coronavirus Covid-19 has shown, any decent disrup…", "url": "https://nationalinterest.org/blog/buzz/how-start-economic-depression-not-coronavirus-cheap-mass-produced-sea-mines-130322", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/B714%20%281%29.jpg", "publishedAt": "2020-03-07T21:30:00Z", "content": "When you stop and think about it for any length of time, it seems a miracle that the global economy spins on as well as it does. As the spread of the coronavirus Covid-19 has shown, any decent disruption to the global supply chain causes ripples from tourism … [+4976 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Brett Samuels and Jessie Hellmann", "title": "CDC has tested 1,583 people for coronavirus", "description": "The Center for Disease Control and Prevention (CDC) has tested 1,583 people for the coronavirus since the first cases were identified in the U.S. in January, health officials said Saturday.Food and Drug Administrat...", "url": "https://thehill.com/homenews/administration/486452-cdc-has-tested-1583-people-for-coronavirus", "urlToImage": "https://thehill.com/sites/default/files/20200307_hahnstephen_gettyimages.jpg", "publishedAt": "2020-03-07T21:46:21Z", "content": "The Center for Disease Control and Prevention (CDC) has tested 1,583 people for the coronavirus since the first cases were identified in the U.S. in January, health officials said Saturday.\r\nFood and Drug Administration (FDA) Commissioner Stephen Hahn told re… [+5130 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Constituent Dies After Gaetz Made Light of Crisis", "description": "Days after Rep. Matt Gaetz (R-FL) wore an enormous gas mask during a House floor vote on an emergency funding package for the coronavirus response, the congressman announced that a resident in his northwestern Florida district had died of covid-19, the Washin…", "url": "https://politicalwire.com/2020/03/07/constituent-dies-after-gaetz-made-light-of-crisis/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-07T21:22:30Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Saudi Arabia slashes April crude oil prices after OPEC's supply pact collapsed - Investing.com", "description": "Saudi Arabia slashes April crude oil prices after OPEC's supply pact collapsed Investing.com Oil plunges most since 2008 on unraveling Saudi-Russia alliance msnNOW Putin Dumps MBS to Start a War on America’s Shale Oil Industry Yahoo Finance Saudi Arabia Shoul…", "url": "https://www.investing.com/news/commodities-news/saudi-arabia-slashes-april-crude-oil-prices-after-opecs-supply-pact-collapsed-2103983", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEG260RC_L.jpg", "publishedAt": "2020-03-07T21:41:00Z", "content": "DUBAI (Reuters) - Saudi Arabia slashed its official selling price (OSP) for April for all its crude grades to all destinations, after OPECs oil supply cut pact with Russia fell apart on Friday, sending oil into a tailspin.\r\nState oil giant Saudi Aramco (SE:22… [+1489 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Coronavirus in N.Y.: Cuomo Declares State of Emergency (New York Times)", "description": "New York Times : Coronavirus in N.Y.: Cuomo Declares State of Emergency — The announcement came as the number of patients in New York rose to 76, including a man who is apparently an Uber driver in Queens. — ALBANY, N.Y. — Gov. Andrew M. Cuomo declared a stat…", "url": "https://www.memeorandum.com/200307/p58", "urlToImage": "https://static01.nyt.com/images/2020/03/07/nyregion/07nyvirus-cuomo-1/07nyvirus-cuomo-facebookJumbo.jpg", "publishedAt": "2020-03-07T21:20:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Coronavirus Live Updates: New York Declares Emergency as Outbreak Spreads in U.S. and Surges in Europe (New York Times)", "description": "New York Times : Coronavirus Live Updates: New York Declares Emergency as Outbreak Spreads in U.S. and Surges in Europe — U.S. cases pass 370, and thousands on a cruise ship off California await testing. — RIGHT NOW Washington State's count of cases has passe…", "url": "https://www.memeorandum.com/200307/p60", "urlToImage": "https://www.nytimes.com/newsgraphics/2020/03/04/corona-virus-social-images/assets/promo.jpg?u=1583613895653", "publishedAt": "2020-03-07T21:25:05Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Kate McCann", "title": "Govt doing 'everything in its power' to delay coronavirus spread", "description": "Millions of volunteers could be given four weeks off work to help take the strain off the health service in the event the coronavirus outbreak becomes a pandemic, the government has announced.", "url": "https://news.sky.com/story/coronavirus-govt-doing-everything-in-its-power-to-delay-spread-of-infection-11952537", "urlToImage": "https://e3.365dm.com/20/03/1600x900/skynews-coronavirus-uk-nhs_4939320.jpg?20200305191840", "publishedAt": "2020-03-07T22:11:00Z", "content": null}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Italy Plans Large-Scale Lockdown in Country's North to Fight Coronavirus (Wall Street Journal)", "description": "Wall Street Journal : Italy Plans Large-Scale Lockdown in Country's North to Fight Coronavirus — Quarantine, if approved, would apply to 11 provinces and cities including Milan, Venice and Parma — MILAN—The Italian government is planning to lock down Lombardy…", "url": "https://www.memeorandum.com/200307/p61", "urlToImage": "https://images.wsj.net/im-161940/social", "publishedAt": "2020-03-07T21:55:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Insidethemagic.net"}, "author": "TJ Muscaro", "title": "Disney’s Official Statement Regarding Coronavirus Protocol and the Theme Parks", "description": "The novel coronavirus known officially as COVID-19 continues to spread across the United States. As of now, there are three confirmed cases in Florida and 69 confirmed cases in California. However, despite numbers, the risk of infection still remains low acro…", "url": "https://insidethemagic.net/2020/03/coronavirus-u-s-disney-parks-statement-tm1/", "urlToImage": "https://insidethemagic-119e2.kxcdn.com/wp-content/uploads/2020/03/Untitled-design-97.png", "publishedAt": "2020-03-07T21:26:44Z", "content": "The novel coronavirus known officially as COVID-19 continues to spread across the United States. As of now, there are three confirmed cases in Florida and 69 confirmed cases in California. However, despite numbers, the risk of infection still remains low acro… [+2790 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Emily Selleck", "title": "LeBron James Refuses To Play If NBA Bans Fans Over Coronavirus Fears: ‘That’s Impossible’", "description": "NBA star LeBron James has revealed he won't play if the league bans fans from attending games over fears of coronavirus spreading.", "url": "https://hollywoodlife.com/2020/03/07/lebron-james-coronavirus-nba-games-interview/", "urlToImage": "https://pmchollywoodlife.files.wordpress.com/2020/03/lebron-james-nba-rex-ftr.jpg", "publishedAt": "2020-03-07T21:48:04Z", "content": "NBA star LeBron James has revealed he won’t play if the league bans fans from attending games over fears of coronavirus spreading.\r\nLeBron James, 35, has talked to reporters about coronavirus fears and how they could affect the NBA. Amid reports the league to… [+2440 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Blockbuster new book reports Mick Mulvaney thought it was a good thing Donald Trump is mentally ill", "description": "Ousted White House chief of staff Mick Mulvaney suggested it may be a good thing that President Donald Trump is mentally ill, including to an anecdote in a new book reported by New York Times columnist Maureen Dowd. Dowd noted supporters of Trump have been ca…", "url": "https://www.rawstory.com/2020/03/blockbuster-new-book-reports-mick-mulvaney-thought-it-was-a-good-thing-donald-trump-is-mentally-ill/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2018/12/trump-unhinged-rant-2.jpg", "publishedAt": "2020-03-07T21:47:31Z", "content": "Ousted White House chief of staff Mick Mulvaney suggested it may be a good thing that President Donald Trump is mentally ill, including to an anecdote in a new book reported by New York Times columnist Maureen Dowd.\r\nDowd noted supporters of Trump have been c… [+2435 chars]"}, {"source": {"id": null, "name": "Metafilter.com"}, "author": "hazyjane", "title": "Ideas to help elderly neighbors during coronavirus?", "description": "I live in a medium sized village in England. At the end of my street is a block of 20 retirement flats and I often see elderly people walking past my house on the way to the local shops. Now that coronavirus is here I'd like to help make sure they're ok if th…", "url": "http://ask.metafilter.com/342550/Ideas-to-help-elderly-neighbors-during-coronavirus", "urlToImage": "http://cdn.mefi.us/images/askmefi/apple-touch-icon.png", "publishedAt": "2020-03-07T21:49:17Z", "content": "What I've thought about doing is putting a note through each door introducing myself and saying if they need something and don't feel they can go out to call me. I have a bit of extra money I could use to help out but my concerns are:1. I don't want this to g… [+734 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "J. Edward Moreno", "title": "Sunday shows preview: Trump administration gears up for new week of coronavirus response; Sanders prepares for next phase of primaries", "description": "The Trump administration's response to the spread of the coronavirus in the U.S., the six primaries taking place Tuesday, and the status of the recently-signed Taliban peace deal are topics expected to...", "url": "https://thehill.com/homenews/sunday-talk-shows/486447-sunday-shows-preview-trump-administration-gears-up-for-new-week-of", "urlToImage": "https://thehill.com/sites/default/files/coronavirus_03052020getty.jpg", "publishedAt": "2020-03-07T21:15:46Z", "content": "The Trump administrations response to the spread of the coronavirus in the U.S., the six primaries taking place Tuesday, and the status of the recently-signed Taliban peace deal are topics expected to dominate the Sunday talk show lineup this weekend. \r\nThe D… [+5067 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Isabella Nikolic For Mailonline", "title": "Amanda Holden posts rare snap with her daughters after a relaxing stroll in the Cotswolds", "description": "The presenter, 49, shared a sweet family snap as they enjoyed a spot of fresh air on a low-key stroll in The Cotswolds.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8086515/Amanda-Holden-posts-rare-snap-daughters-relaxing-stroll-Cotswolds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/07/20/25665334-0-image-a-79_1583613747122.jpg", "publishedAt": "2020-03-07T21:46:03Z", "content": "She was last seen larking around with her Heart Radio co-host Jamie Theakston while presenting at the Global Awards.\r\nBut Amanda Holden looked every inch the doting mum as she shared a rare snap with her daughters Lexi, 14, and Hollie, eight, on Saturday.\r\nTh… [+2255 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Nick Valdez", "title": "Super Dragon Ball Heroes Season 2 Debuts First Episode", "description": "Super Dragon Ball Heroes' arcade game began a whole new endeavor this spring with a story expansion for both the original game and promotional anime series. Unfortunately while Coronavirus concerns have temporarily halted the expansion hitting the arcade game…", "url": "https://comicbook.com/anime/2020/03/07/super-dragon-ball-heroes-season-2-episode-1-watch-anime-online/", "urlToImage": "https://media.comicbook.com/2020/03/super-dragon-ball-heroes-season-2-big-bang-mission-anime-1210052-640x320.jpeg", "publishedAt": "2020-03-07T21:59:00Z", "content": "Super Dragon Ball Heroes' arcade game began a whole new endeavor this spring with a story expansion for both the original game and promotional anime series. Unfortunately while Coronavirus concerns have temporarily halted the expansion hitting the arcade game… [+2635 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Matthew Aguilar", "title": "Bloodshot Star Vin Diesel Says We Need Movies Now More Than Ever In Face Of Coronavirus", "description": "The coronavirus has not only been a health threat, but its effects ave been felt in several industries, including those of travel, entertainment, and more. That means some movies have shifted, like Bond 25, while others have maintained their original release …", "url": "https://comicbook.com/movies/2020/03/07/bloodshot-vin-diesel-need-movies-now-more-ever-coronavirus/", "urlToImage": "https://media.comicbook.com/2020/01/bloodshot-poster-1203899-640x320.jpeg", "publishedAt": "2020-03-07T21:38:00Z", "content": "The coronavirus has not only been a health threat, but its effects ave been felt in several industries, including those of travel, entertainment, and more. That means some movies have shifted, like Bond 25, while others have maintained their original release … [+2706 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Dolberg nets injury-time winner as Nice beats Monaco 2-1", "description": "Striker Kasper Dolberg scored the winner in the third minute of injury time as Nice rallied to beat local rival Monaco 2-1 in the French league", "url": "https://www.foxsports.com/soccer/story/dolberg-nets-injury-time-winner-as-nice-beats-monaco-2-1-030720", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-07T21:59:39Z", "content": "PARIS (AP) — Striker Kasper Dolberg scored the winner in the third minute of injury time as Nice rallied to beat Monaco 2-1 in the French league on Saturday.\r\nNice moved ahead of local rival Monaco — the teams are 30 minutes apart when driving along the Frenc… [+2607 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JAY REEVES Associated Press", "title": "Coronavirus leaves passenger-filled ships without ports", "description": "The new coronavirus is posing a dilemma for cruise ships around the world", "url": "https://abcnews.go.com/Travel/wireStory/coronavirus-leaves-passenger-filled-ships-ports-69458194", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_46ea501e86734b6ebb883586221df448_16x9_992.jpg", "publishedAt": "2020-03-07T21:18:48Z", "content": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days.\r\nKeeping all of the passengers on board instead of letting… [+3689 chars]"}, {"source": {"id": null, "name": "Tvblog.it"}, "author": "Giorgia Iovane, Giorgia Iovane", "title": "Una Storia da Cantare senza pubblico fa servizio pubblico: il sabato sera parte con le regole anti-coronavirus [VIDEO]", "description": "#mp-video_content__1706017{position: relative;padding-bottom: 56.25%;height: 0 !important;overflow: hidden;width: 100% !important;} #mp-video_content__1706017.brid, #mp-video_content__1706017 iframe...", "url": "https://www.tvblog.it/post/1706009/una-storia-da-cantare-senza-pubblico-video", "urlToImage": "https://media.tvblog.it/4/49d/0307_213906_unastoriadacantare.jpg", "publishedAt": "2020-03-07T21:55:22Z", "content": "Bianca Guaccero ed Enrico Ruggeri aprono la quarta e ultima puntata di Una Storia da Cantare ricordando al pubblico tv le regole fondamentali dell'Istituto Superiore di Sanità per evitare il contagio da Coronavirus. Un modo per contestualizzare l'assenza del … [+1302 chars]"}, {"source": {"id": null, "name": "Justjared.com"}, "author": "Just Jared", "title": "Dave Bautista's 'My Spy' Pushed Back from March 13 Opening", "description": "Dave Bautista‘s upcoming movie My Spy has been pushed back from its March 13 opening date, according to Deadline. The reason for the date change is indirectly related to Coronavirus. The James Bond movie No Time to Die was going to open on April 10, but it wa…", "url": "http://www.justjared.com/2020/03/07/dave-bautistas-my-spy-pushed-back-from-march-13-opening/", "urlToImage": "http://cdn01.cdn.justjared.com/wp-content/uploads/headlines/2020/03/spy-pushed.jpg", "publishedAt": "2020-03-07T21:15:49Z", "content": "Dave Bautista‘s upcoming movie My Spy has been pushed back from its March 13 opening date, according to Deadline. \r\nThe reason for the date change is indirectly related to Coronavirus. The James Bond movie No Time to Die was going to open on April 10, but it … [+323 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Glen Owen Kate Mansey For The Mail On Sunday", "title": "The Queen vows not to let the coronavirus outbreak stop her and is determined to to set an example", "description": "The 93-year-old Monarch will attend the Commonwealth Day service in Westminster tomorrow and mix with representatives from 54 different Commonwealth countries.", "url": "https://www.dailymail.co.uk/news/article-8087001/The-Queen-vows-not-let-coronavirus-outbreak-stop-determined-set-example.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/07/21/25673148-0-image-a-20_1583617667591.jpg", "publishedAt": "2020-03-07T22:01:37Z", "content": "The Queen has vowed to not let the coronavirus outbreak stop her from performing her duties as Government officials discuss how best to protect senior Royals from the bug.\r\nThe Monarch, who is 93, will attend the Commonwealth Day service in Westminster Abbey … [+7039 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Daniel Politi", "title": "The White House Has Hired Two College Seniors to Fill Top Posts in Recent Weeks", "description": "The latest is Anthony Labruna, who is scheduled to graduate in May and will be deputy White House liaison at the Department of Commerce.", "url": "https://slate.com/news-and-politics/2020/03/white-house-hired-two-college-seniors-fill-top-posts.html", "urlToImage": "https://compote.slate.com/images/d45ba4d7-6296-4640-9186-981b11eada7e.jpeg?width=780&height=520&rect=4203x2802&offset=0x0", "publishedAt": "2020-03-07T21:29:20Z", "content": "President Donald Trump makes his way to board Marine One from the South Lawn of the White House in Washington, D.C. on March 6, 2020.\r\n<ol><li>\r\nThe Times Attempt to Create a Bernie-Russia Scandal Is an Embarrassment\r\n </li><li>\r\nThe Most Visible Uncontrolled… [+1969 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JAY REEVES Associated Press", "title": "Coronavirus leaves passenger-filled ships without ports", "description": "The new coronavirus is posing a dilemma for cruise ships around the world", "url": "https://abcnews.go.com/Business/wireStory/coronavirus-leaves-passenger-filled-ships-ports-69458195", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_46ea501e86734b6ebb883586221df448_16x9_992.jpg", "publishedAt": "2020-03-07T21:19:04Z", "content": "Cruise ships hit by coronavirus outbreaks have quickly found themselves with no ports for thousands of passengers as countries on four continents have quarantined vessels or kept them at sea for days.\r\nKeeping all of the passengers on board instead of letting… [+3689 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": null, "title": "Coronavirus: Seattle's First Responders", "description": "First responders in the Seattle area are figuring out how best to do their jobs given the possibility they might be called into a coronavirus outbreak. One fire crew is on self-quarantine.", "url": "https://www.npr.org/2020/03/07/813288975/coronavirus-seattles-first-responders", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-03-07T22:00:03Z", "content": null}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "6N: England downs Wales 33-30 to keep pressure on France", "description": "England has seen off Wales 33-30 at Twickenham to keep the pressure on Six Nations rugby leader France", "url": "https://www.foxsports.com/rugby/story/6n-england-downs-wales-33-30-to-keep-pressure-on-france-030720", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-07T21:37:18Z", "content": "LONDON (AP) — England could yet steal the Six Nations rugby crown from France after seeing off Wales 33-30 at Twickenham on Saturday.\r\nThe English have rebounded from their drubbing in Paris on the opening day to beat Scotland, Ireland and Wales and earn a fi… [+4328 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Giulia Segreti and Gavin Jones", "title": "Italy locks down wealthiest and most populous region amid coronavirus spread", "description": "Tough new measures expected to come into force from Sunday include telling people not to enter or leave Lombardy, which is home to 10 million people.", "url": "https://www.smh.com.au/world/europe/italy-locks-down-wealthiest-and-most-populous-region-amid-coronavirus-spread-20200308-p547wm.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2147%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_107/t_crop_custom/q_86%2Cf_auto/93b3e582f544532ac5c3c2f0c552fa8f53636c33", "publishedAt": "2020-03-07T21:34:01Z", "content": "So far, only a few limited areas of northern Italy, known as \"red zones\", have been quarantined.\r\nLeave will be cancelled for all healthcare workers, weddings, funerals and sports events suspended, and home working should be adopted as much as possible, the d… [+2591 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": null, "title": "Coronavirus: Seattle Mayor Jenny Durkan", "description": "NPR's Michel Martin speaks with Seattle Mayor Jenny Durkan about the city's response to the coronavirus. The Seattle area is one of the hotspots for COVID-19 in the U.S.", "url": "https://www.npr.org/2020/03/07/813288968/coronavirus-seattle-mayor-jenny-durkan", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-03-07T22:00:03Z", "content": null}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "SA Eli Hoffmann", "title": "China exports plunge, but worst likely still to come", "description": "<ul><li>China’s exports <a href=\"http://www.customs.gov.cn/customs/xwfb34/302425/2879133/index.html\" target=\"_blank\">plunged 17.2%</a> in Jan./Feb. 2020 on the back of a coronavirus epidemic that forced businesses to suspend operations, according to official …", "url": "https://seekingalpha.com/news/3549554-china-exports-plunge-worst-likely-still-to-come", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-03-07T21:56:41Z", "content": "Chinas exports plunged 17.2% in Jan./Feb. 2020 on the back of a coronavirus epidemic that forced businesses to suspend operations, according to official data released Saturday. Chinese authorities said last month that January and Februarys data would be combi… [+765 chars]"}, {"source": {"id": null, "name": "Padailypost.com"}, "author": null, "title": "Stanford cancels classes, will limit attendance at sporting events, big tech tells workers to stay home - The Daily Post", "description": "BY SONYA HERRERA AND EMILY MIBACH Daily Post Staff Writers As cases of COVID-19 increase in the area, Stanford on Friday (March ) announced it will cancel in-person classes, and [...]", "url": "https://padailypost.com/2020/03/07/stanford-cancels-classes-will-limit-attendance-at-sporting-events-big-tech-tells-workers-to-stay-home/", "urlToImage": "https://padailypost.com/wp-content/uploads/2020/03/coronavirus.png", "publishedAt": "2020-03-07T21:37:43Z", "content": "BY SONYA HERRERA AND EMILY MIBACHDaily Post Staff Writers\r\nAs cases of COVID-19 increase in the area, Stanford on Friday (March ) announced it will cancel in-person classes, and the city of Los Altos has canceled all senior programs.\r\nStanford is canceling cl… [+4623 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Guy deliberately bumping into women regrets it when he tries it on pro-wrestler", "description": "Japanese women's wrestlers can be just as a tough outside the ring--or even tougher, as wrestling legend Chigusa Nagayo proved when she stopped a man from assaulting a woman and broke her own finger in the process. Freelance women's wrestler Hiroyo Matsumoto …", "url": "https://japantoday.com/category/national/guy-deliberately-bumping-into-women-regrets-it-when-he-tries-it-on-pro-wrestler", "urlToImage": null, "publishedAt": "2020-03-07T22:03:16Z", "content": "Japanese women's wrestlers can be just as a tough outside the ring--or even tougher, as wrestling legend Chigusa Nagayo proved when she stopped a man from assaulting a woman and broke her own finger in the process. Freelance women's wrestler Hiroyo Matsumoto … [+1901 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Amber Jamieson", "title": "70 People Were Trapped After A Hotel In China Where Coronavirus Patients Were Quarantined Collapsed", "description": "So far 40 people have been rescued, and no deaths have been reported. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/amberjamieson/coronavirus-quarantine-collapse-china-hotel", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/7/21/campaign_images/a3b9db8bcbbc/70-people-were-trapped-after-a-hotel-in-china-whe-2-1433-1583616669-6_dblbig.jpg", "publishedAt": "2020-03-07T21:37:54Z", "content": "A hotel in southeastern China that was used to quarantine people feared to be infected with the coronavirus collapsed on Saturday night, trapping 70 people in the wreckage, reported Chinese media.\r\nChinese state news agency, The People's Daily, reported that … [+1407 chars]"}, {"source": {"id": null, "name": "Statesman.com"}, "author": "Bob Sechler, Lori Hawkins, Shonda Novak", "title": "Loss of SXSW a gut punch for some Austin businesses - Austin American-Statesman", "description": "For Austin’s downtown hospitality sector, the annual South by Southwest festival has become the financial equivalent of Christmas, Hanukkah and", "url": "https://www.statesman.com/article/20200307/BUSINESS/200309037", "urlToImage": "https://www.statesman.com/storyimage/TX/20200307/BUSINESS/200309037/AR/0/AR-200309037.jpg", "publishedAt": "2020-03-07T21:57:35Z", "content": "For Austin’s downtown hospitality sector, the annual South by Southwest festival has become the financial equivalent of Christmas, Hanukkah and Black Friday rolled into a 10-day whirlwind each March.\r\nThat makes the cancellation of this year’s event a huge ec… [+5830 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Paul Myerberg, USA TODAY", "title": "Amid coronavirus concerns, NCAA's top medical officer says barring fans for tournament would be 'worst-case scenario'", "description": "NCAA tournaments are set to proceed at the current time, and group's chief medical officer says that barring fans would be \"worst-case scenario.\"", "url": "https://www.usatoday.com/story/sports/ncaab/2020/03/07/coronavirus-ncaa-evaluates-tournaments-march-madness-no-fans-worst-scenario/4987664002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/07/USAT/c359fddc-2582-459a-ab5d-3a5270091d1b-empty2.JPG?crop=1821,1024,x1084,y685&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-07T21:38:18Z", "content": "What I'm Hearing: Italy is having closed door games, will the rest of the sports world follow?\r\nUSA TODAY\r\nThe NCAA has evaluated a “worst-case scenario” for the upcoming men’s and women’s basketball tournaments that bars spectators from games and pre-screens… [+3182 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By CELIA JEAN,JERUSALEM POST STAFF", "title": "Economy Ministry: There is no shortage of food products", "description": "Around the world, people have been seen emptying stores around the world because of fears sparked by the coronavirus ;", "url": "https://www.jpost.com/Israel-News/Economy-Ministry-There-is-no-shortage-of-food-products-620129", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/453967", "publishedAt": "2020-03-07T22:08:07Z", "content": null}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Saudi Arabia in royal purge over 'coup plot'", "description": "Saudi authorities have detained three princes including King Salman's brother and nephew for allegedly plotting a coup, three sources told AFP Saturday, signalling the de facto ruler's tightening grip on power.", "url": "https://www.channelnewsasia.com/news/world/saudi-arabia-in-royal-purge-over--coup-plot--12513748", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12513746/16x9/991/557/55f9ed1d6470fd5cbc53614bcc9f8d50/DL/saudi-king-salman-bin-abdulaziz-r-crown-prince-mohammed-bin-nayef-c-and-deputy-crown-prince-mohammed-bin-salman-pictured-in-late-2016-1583615412239-4.jpg", "publishedAt": "2020-03-07T21:32:25Z", "content": "RIYADH: Saudi authorities have detained three princes including King Salman's brother and nephew for allegedly plotting a coup, three sources told AFP Saturday (Mar 7), signalling the de facto ruler's tightening grip on power.\r\nThe detentions, which cast asid… [+4435 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andy Gregory, Andy Gregory", "title": "RAF fighter jets scrambled to intercept Russian aircraft near Scotland, MoD says", "description": "Nato forces move to head off an unknown number of bombers near British airspace", "url": "https://www.independent.co.uk/news/uk/home-news/russia-raf-fighter-jets-typhoons-scotland-lossiemouth-a9384991.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/07/21/russia-bomber.jpg", "publishedAt": "2020-03-07T22:01:14Z", "content": "RAF fighter jets have been scrambled to intercept several Russian aircraft skirting British airspace.\r\nAn unconfirmed number of Russian aircraft were spotted near Scotland and within what the RAF described as the UKs area of interest, prompting the deployment… [+21431 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "103,000 reported cases of coronavirus", "description": null, "url": "http://www.israelnationalnews.com/News/Flash.aspx/490516", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/799/799624.jpg", "publishedAt": "2020-03-07T21:12:00Z", "content": "According to media reports, approximately 103,000 people from 90 countries worldwide have been diagnosed with the coronavirus as of Saturday, March 7th, 2020."}]