[{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "No Pandemic... Yet: WHO Holds Back as Coronavirus Outbreak Spreads Globally", "description": "A deadly new coronavirus is now clearly spreading across the globe—with hundreds of reported local cases surging in countries outside China, previously the sole epicenter of the outbreak. But for the time being, the World Health Organization said on Monday th…", "url": "https://gizmodo.com/who-coronavirus-not-a-pandemic-yet-despite-continuing-1841887144", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a0ku7muv2jpm48dvve9p.jpg", "publishedAt": "2020-02-24T16:13:00Z", "content": "A deadly new coronavirus is now clearly spreading across the globewith hundreds of reported local cases surging in countries outside China, previously the sole epicenter of the outbreak. But for the time being, the World Health Organization said on Monday tha… [+3029 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Germany's Altmaier: Still too early to quantify coronavirus impact on economy", "description": "The coronavirus epidemic will have a \"slight impact\" on the world economy, but it is still too early to quantify how much growth it will cost in the end, German Economy Minister Peter Altmaier said on Monday.", "url": "https://www.reuters.com/article/us-china-health-germany-economy-idUSKCN20I1X2", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200224&t=2&i=1494628353&w=1200&r=LYNXNPEG1N1L5", "publishedAt": "2020-02-24T16:33:34Z", "content": "BERLIN (Reuters) - The coronavirus epidemic will have a “slight impact” on the world economy, but it is still too early to quantify how much growth it will cost in the end, German Economy Minister Peter Altmaier said on Monday. \r\n“It’s not yet possible to det… [+641 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "'The most disruptive thing to hit markets in many years': 5 financial experts sound off on coronavirus chaos, and what it means for investors", "description": "Stock markets around the world slumped on Monday as new coronavirus deaths in Iran, Italy, and South Korea marked a new high for outbreak-related fears. Economists have repeatedly downgraded their projections for global growth as the virus stifles demand, whi…", "url": "https://www.businessinsider.com/stock-market-selloff-5-experts-address-coronavirus-fears-global-outlook-2020-2", "urlToImage": "", "publishedAt": "2020-02-24T16:26:45Z", "content": "Associated Press<ul><li>Stock markets around the world slumped on Monday as new coronavirus deaths in Iran, Italy, and South Korea marked a new high for outbreak-related fears.</li><li>Economists have repeatedly downgraded their projections for global growth … [+7322 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mia Jankowicz", "title": "Iran is closing schools, scrambling for hospital places, and spraying disinfectant in the subway as coronavirus deaths and cases spike", "description": "Iran is closing public spaces like schools, universities, and cultural centers in an effort to control the novel coronavirus outbreak, Agence France-Presse (AFP) reported. It has also dedicated 230 hospitals to fighting the virus, and disinfecting public tran…", "url": "https://www.businessinsider.com/coronavirus-iran-schools-hospitals-public-transport-2020-2", "urlToImage": "https://i.insider.com/5e53e683fee23d6d16328f58?width=1200&format=jpeg", "publishedAt": "2020-02-24T16:25:15Z", "content": "Iran is closing schools and dedicating hospitals across the country to fight the novel coronavirus as the number of infections sharply increased across the country, according to multiple reports.\r\nThe government on Sunday closed schools, universities, and cul… [+2301 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Carmen Reinicke", "title": "The stock market's fear gauge spikes to its highest since August as the coronavirus outbreak rages", "description": "The Cboe Volatility Index, or VIX, spiked as much as 40% on Monday, the highest since August. The VIX is a measure of volatility in the markets and is often referred to as a \"fear gauge.\" Investors are worried about the impact of the coronavirus on global mar…", "url": "https://www.businessinsider.com/stock-market-fear-index-spiked-vix-highest-since-august-coronavirus-2020-2", "urlToImage": "https://images.markets.businessinsider.com/image/5e18d98cf4423118be550b72-2400/gettyimages-1158948864.jpg", "publishedAt": "2020-02-24T16:46:00Z", "content": "Xinhua/Wang Ying/Getty Images\r\n<ul><li>The Cboe Volatility Index, or VIX, spiked as much as 40% on Monday, the highest since August. </li><li>The VIX is a measure of volatility in the markets and is often referred to as a \"fear gauge.\"</li><li>Investors are w… [+2459 chars]"}, {"source": {"id": null, "name": "Taskandpurpose.com"}, "author": "Task & Purpose", "title": "US troops in Korea are on high alert for coronavirus after widow of retired soldier tests positive", "description": "US Forces Korea has put US service members there on high alert following a positive coronavirus test by a widow of a retired soldier. USFK is now at its second-highest health-protection level, and the change comes as South Korea reaches 800 confirmed cases of…", "url": "https://taskandpurpose.com/news/us-forces-korea-coronavirus-alert", "urlToImage": "https://i.insider.com/5e53f68dfee23d09c573b845?width=1200&format=jpeg", "publishedAt": "2020-02-24T16:23:58Z", "content": "US military forces in South Korea aren't taking any chances after the widow of a retired soldier tested positive for the coronavirus, the first US Forces Korea-related individual to do so according to military officials there.\r\nAs a result, USFK command raise… [+1953 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "Fidelity and Charles Schwab say some users ran into technical issues in early trading as stocks tanked the most since August", "description": "Fidelity and Charles Schwab apologized to clients Monday morning after technical issues kept users from executing trades during the worst market slump in months. Users took to Twitter with complaints about login errors, their accounts incorrectly showing a $0…", "url": "https://www.businessinsider.com/fidelity-charles-schwab-brokerage-users-technical-errors-market-tumble-coronavirus-2020-2", "urlToImage": "https://images.markets.businessinsider.com/image/5e53ef54fee23d7e8f33dba7-2400/2016-10-05t120000z40274713tm3ec9s17rh01rtrmadp3usa-fidelity-family.jpg", "publishedAt": "2020-02-24T17:01:26Z", "content": "REUTERS/Brian Snyder\r\n<ul><li>Fidelity and Charles Schwab apologized to clients Monday morning after technical issues kept users from executing trades during the worst market slump in months.</li><li>Users took to Twitter with complaints about login errors, t… [+2775 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Stephen S. Roach", "title": "Project Syndicate: Coronavirus: The global economy is much more vulnerable now than during the SARS epidemic", "description": "Time for stock-market investors to reassess the risks from the coronavirus and whether a similar V-shaped recovery is possible.", "url": "https://www.marketwatch.com/story/coronavirus-the-global-economy-is-much-more-vulnerable-now-than-during-the-sars-epidemic-2020-02-24", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IA775_corona_ZG_20200224112102.jpg", "publishedAt": "2020-02-24T16:25:57Z", "content": "NEW HAVEN, CONN. (Project Syndicate) The world economy has clearly caught a cold. The outbreak of COVID-19 came at a particularly vulnerable point in the global business cycle. World output expanded by just 2.9% in 2019 the slowest pace since the 2008-09 glob… [+6386 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: Dow slides more than 800 points as coronavirus stirs fears of lasting global economic hit", "description": "U.S. stocks trade sharply lower Monday, joining a global equity selloff, as the spread of coronavirus raises worries that global economic growth could take a hit.", "url": "https://www.marketwatch.com/story/dow-slides-more-than-800-points-as-coronavirus-stirs-fears-of-lasting-global-economic-hit-2020-02-24", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-02-24T17:00:11Z", "content": "U.S. stocks trade sharply lower Monday, joining a global equity selloff, as the spread of coronavirus raises worries that global economic growth could take a hit. See full story.\r\nWarren Buffett says dont buy or sell on the headlines as coronavirus sends stoc… [+1114 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "This chart reveals why the rising GDP hasn't helped the middle class", "description": "The Manhattan Institute issued a report that reveals that a year of middle class wages no longer pays for major household expenditures. From The Washington Post : Lead author Oren Cass distills it as follows: “In 1985, the typical male worker could cover a fa…", "url": "https://boingboing.net/2020/02/24/this-chart-reveals-why-the-ris.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/02/Screen-Shot-2020-02-24-at-9.04.23-AM.jpg?fit=680%2C433&ssl=1", "publishedAt": "2020-02-24T17:09:22Z", "content": "We are desperate desperate for more people, Donald Trump cabinet member Mick Mulvaney said in a recording obtained by The Washington Post. We are running out of people to fuel the economic growth that weve had in our nation over the last four years. We need m… [+1433 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Rupert Steiner", "title": "Medicine shortages for pets, postponed conferences and empty shelves—firms sound the alarm over coronavirus", "description": "Primark owner warned there could be supply shortages on some of its clothing lines. Conference organizer Ascential postponed an event while Dechra Pharmaceuticals said pet medicine could run out long-term.", "url": "https://www.marketwatch.com/story/medicine-shortages-for-pets-postponed-conferences-and-empty-shelvesfirms-sound-the-alarm-over-coronavirus-2020-02-24", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IA776_dogvir_ZG_20200224112105.jpg", "publishedAt": "2020-02-24T17:10:05Z", "content": "Three leading U.K. companies sounded the alarm over the coronavirus on Monday as fear spread into markets at the start of a busy earnings week.\r\nAssociated British Foods (ABF) \r\nABF, -1.55%\r\n , owner of retail chain Primark, warned there could be supply short… [+2973 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Rekindles China Trade Uncertainty: Millman (Radio)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-02-24/coronavirus-rekindles-china-trade-uncertainty-millman-radio", "urlToImage": null, "publishedAt": "2020-02-24T16:51:21Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Inter's Europa clash without fans", "description": "Inter Milan's Europa League match against Ludogorets will be played behind closed doors over coronavirus fears - while more Serie A fixtures could be set for the same fate.", "url": "https://www.skysports.com/football/news/11854/11942413/coronavirus-inter-milans-europa-league-clash-vs-ludogorets-to-be-played-without-fans", "urlToImage": "https://e1.365dm.com/19/09/1600x900/skysports-antonio-conte-inter-milan_4762787.jpg", "publishedAt": "2020-02-24T16:58:00Z", "content": "Inter Milan's Europa League match against Ludogorets will be played behind closed doors over coronavirus fears - while more Serie A fixtures could be set for the same fate.\r\nBulgarian side Ludogorets had written to UEFA to request information about the corona… [+4779 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Serie A could be played without fans", "description": "The Italian government is moving towards having football matches played behind closed doors in affected areas as authorities try to contain the spreading coronavirus that has made northern Italy the focal point of the outbreak in Europe.", "url": "https://www.skysports.com/football/news/11854/11942413/coronavirus-serie-a-games-could-be-played-behind-closed-doors", "urlToImage": "https://e1.365dm.com/19/09/1600x900/skysports-antonio-conte-inter-milan_4762787.jpg", "publishedAt": "2020-02-24T16:58:00Z", "content": "The Italian government is moving towards having football matches played behind closed doors in affected areas as authorities try to contain the spreading coronavirus that has made northern Italy the focal point of the outbreak in Europe.\r\nSerie A president Pa… [+4689 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Dives As Coronavirus Upends Outlook For Fed, 2020 Election, US Economy - Investor's Business Daily", "description": "Dow Jones Dives As Coronavirus Upends Outlook For Fed, 2020 Election, US Economy Investor's Business Daily Live Market Watch: Stocks tank on world health concerns | 2/24/2020 Fox Business DOW PLUNGES 1,000 POINTS CNBC 5 Reasons Not to Panic-Sell Over the Coro…", "url": "https://www.investors.com/news/dow-jones-dives-coronavirus-upends-outlook-fed-2020-election-us-economy/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/02/Stock-CoronaVirus-04-shutt.jpg", "publishedAt": "2020-02-24T16:45:00Z", "content": "The growing possibility of a coronavirus pandemic has suddenly scrambled the outlook for the U.S. economy, Fed interest rate policy and the 2020 election. The Dow Jones Industrial Average sank 800 points Monday, because everything has become unpredictable. Ye… [+5036 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Steep decline in Coronavirus cases in China", "description": "Steep decline in Coronavirus cases in China\"I know the challenges with the statistics that come out of China sometimes with changing numbers and what we had to do is look very carefully different sources of information to say confidently this is actually decl…", "url": "https://economictimes.indiatimes.com/news/international/world-news/steep-decline-in-coronavirus-cases-in-china-who-expert/articleshow/74289629.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74289640,width-1070,height-580,imgsize-73166,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-24T16:46:49Z", "content": "Beijing: A World Health Organisation expert said on Monday that there was a steep decline in newly-reported cases of COVID-19 due to actions taken by the Chinese government to contain the deadly coronavirus. \r\nCanadian epidemiologist Bruce Aylward, who heads … [+4138 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Long Lines For Face Masks In City At Center Of South Korea's Coronavirus Crisis | NBC News - NBC News", "description": "Long Lines For Face Masks In City At Center Of South Korea's Coronavirus Crisis | NBC News NBC News Mapping coronavirus: South Koreans turn to online tracking as cases surge Reuters More than 600 people infected by coronavirus in South Korea CBS Evening News …", "url": "https://www.youtube.com/watch?v=Q7-KN-52GxU", "urlToImage": null, "publishedAt": "2020-02-24T16:25:45Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Zoe Suen", "title": "Luxury Braces for $43 Billion in Losses as Coronavirus Panic Goes Global", "description": "The tragedy’s effects are rippling across the industry, from front rows to travel retail.", "url": "https://www.businessoffashion.com/articles/news-analysis/luxury-braces-for-43-billion-in-losses-as-coronavirus-panic-goes-global", "urlToImage": null, "publishedAt": "2020-02-24T17:01:36Z", "content": null}, {"source": {"id": null, "name": "Variety.com"}, "author": "Cynthia Littleton", "title": "Disney, Amazon, ViacomCBS Shares Hit as Stock Market Tumbles Amid Coronavirus Fears", "description": "Fears of the Coronavirus spreading across the world sent major stock indices tumbling on Monday morning. Shares of Disney and Amazon were down more than 4% in early trading as reports that the deadly virus has hit South Korea and Italy spooked investors. The …", "url": "https://variety.com/2020/biz/news/disney-amazon-viacomcbs-shares-hit-as-stock-market-tumbles-amid-coronavirus-fears-1203512866/", "urlToImage": "https://pmcvariety.files.wordpress.com/2017/12/media-stocks-wall-street-placeholder.jpg?w=700&h=393&crop=1", "publishedAt": "2020-02-24T16:19:05Z", "content": "Fears of the Coronavirus spreading across the world sent major stock indices tumbling on Monday morning. Shares of Disney and Amazon were down more than 4% in early trading as reports that the deadly virus has hit South Korea and Italy spooked investors.\r\nThe… [+616 chars]"}, {"source": {"id": null, "name": "Cryptoslate.com"}, "author": null, "title": "Why is the Bitcoin price crashing in tandem with the Dow Jones? - CryptoSlate", "description": "Why is the Bitcoin price crashing in tandem with the Dow Jones? CryptoSlate Stocks Plummet Over Fear of Coronavirus | LIVE | NowThis NowThis News Dow plunges 1,000 points, gives up gain for the year CNBC Global stocks plunge as coronavirus fears grow beyond C…", "url": "https://cryptoslate.com/why-is-the-bitcoin-price-crashing-in-tandem-with-the-dow-jones/", "urlToImage": "https://cryptoslate.com/wp-content/uploads/2020/02/1x.png", "publishedAt": "2020-02-24T16:36:00Z", "content": "The Dow Jones Industrial Average (DJIA) plummeted by 850 points upon opening, as fears towards the coronavirus outbreak hit its peak. Bitcoin also dropped by 3.5 percent on the day and is down by 8 percent in the past 11 days.\r\nBitcoin is not ready to be a sa… [+2831 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Chris Price", "title": "Monday evening news briefing: Is it safe to travel as coronavirus takes hold in Europe?", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here.", "url": "https://www.telegraph.co.uk/news/2020/02/24/monday-evening-news-briefing-safe-travel-coronavirus-takes-hold/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/02/24/TELEMMGLPICT000225824090_1-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "publishedAt": "2020-02-24T16:21:05Z", "content": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here. For two-minute audio updates, try The Briefing - on podcasts, smart speakers and WhatsApp.\r\nTravel advice updated as coronavirus grips continent \r\nSeve… [+4989 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Dan Caplinger)", "title": "Stock Market News: Berkshire Sinks Despite Buffett Optimism; Gilead Rises on Coronavirus Hopes", "description": "Markets took a huge hit on new concerns about the spreading COVID-19 outbreak.", "url": "https://www.fool.com/investing/2020/02/24/stock-market-news-berkshire-sinks-despite-buffett.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559499/doctor-hospital-gettyimages-695337976.jpg", "publishedAt": "2020-02-24T16:34:00Z", "content": "The stock market dove on Monday morning, reacting negatively to news that the COVID-19 outbreak saw a considerable increase in new cases in South Korea and Italy over the weekend. The spread of the coronavirus is raising fears that the outbreak could have muc… [+3618 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Brendan Ahern, Contributor, Brendan Ahern, Contributor https://www.forbes.com/sites/brendanahern/", "title": "China Market Update: Why Mainland Investors Are Buying Stocks", "description": "Korea was crushed by nearly 4% as coronavirus cases increased while Australia, India, Malaysia and Singapore were off more than 2%.", "url": "https://www.forbes.com/sites/brendanahern/2020/02/24/china-market-update-why-mainland-investors-are-buying-stocks/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1202993393%2F960x0.jpg", "publishedAt": "2020-02-24T17:09:59Z", "content": "People wearing a protective facemask to protect against the COVID-19 coronavirus walk past the ... [+] Intercontinental hotel in Beijing on February 24, 2020. - The novel coronavirus has spread to more than 25 countries since it emerged in December and is cau… [+13795 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Eric Abent", "title": "Coronavirus just cost GDC 2020 another big exhibitor", "description": "The upcoming Game Developers Conference has lost another big name in the wake of the cornovirus outbreak (COVID-19), as Kojima Productions has announced that it won’t be attending the show. Kojima Productions joins Sony and Facebook in dropping out of GDC 202…", "url": "https://www.slashgear.com/coronavirus-just-cost-gdc-2020-another-big-exhibitor-24610816/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/02/Death-Stranding-screenshot-PS4-Pro-1.jpg", "publishedAt": "2020-02-24T16:23:56Z", "content": "The upcoming Game Developers Conference has lost another big name in the wake of the cornovirus outbreak (COVID-19), as Kojima Productions has announced that it won’t be attending the show. Kojima Productions joins Sony and Facebook in dropping out of GDC 202… [+1635 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Lydia Dishman", "title": "Zoom stock is rising as coronavirus spreads", "description": "COVID-19 fears are causing businesses to cancel travel and rely on videoconferencing, instead. Shares of Zoom, the videoconference provider, are surging as the number of coronavirus cases continues to rise across the globe. Zoom’s stock price was up 5.18% to …", "url": "https://www.fastcompany.com/90467568/zoom-stock-is-rising-as-coronavirus-spreads?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/02/p-1-zoom-stock-rising-as-coronavirus-spreads.jpg", "publishedAt": "2020-02-24T16:23:19Z", "content": "Shares of Zoom, the videoconference provider, are surging as the number of coronavirus cases continues to rise across the globe. Zoom’s stock price was up 5.18% to $107 per share before the closing bell.It’s no wonder more people are bullish on Zoom right now… [+986 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Lydia Dishman", "title": "Zoom stock is rising as coronavirus spreads", "description": "COVID-19 fears are causing businesses to cancel travel and rely on videoconferencing, instead. Shares of Zoom, the videoconference provider, are surging as the number of coronavirus cases continues to rise across the globe. Zoom’s stock price was up 5.18% to …", "url": "https://www.fastcompany.com/90467568/zoom-stock-is-rising-as-coronavirus-spreads?partner=rss&utm_source=twitter.com&utm_medium=social&utm_campaign=rss+fastcompany&utm_content=rss", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/02/p-1-zoom-stock-rising-as-coronavirus-spreads.jpg", "publishedAt": "2020-02-24T16:23:19Z", "content": "Shares of Zoom, the videoconference provider, are surging as the number of coronavirus cases continues to rise across the globe. Zoom’s stock price was up 5.18% to $107 per share before the closing bell.It’s no wonder more people are bullish on Zoom right now… [+986 chars]"}, {"source": {"id": null, "name": "Mlive.com"}, "author": "Taylor DesOrmeau | tdesorme@mlive.com", "title": "‘Nightmare’ cruise plagued by coronavirus panic is over for Michigan family - MLive.com", "description": "‘Nightmare’ cruise plagued by coronavirus panic is over for Michigan family MLive.com CDC: Westerdam passenger never had coronavirus Martha's Vineyard Times Malaysia Says American Coronavirus Case Now Tests Negative for Virus VOA Khmer View Full Coverage on G…", "url": "https://www.mlive.com/news/jackson/2020/02/nightmare-cruise-plagued-by-coronavirus-panic-is-over-for-michigan-family.html", "urlToImage": "https://www.mlive.com/resizer/iXspXdnCL-As_W_OQXUxi0RDwHc=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/MFCZHR426FCHXL4UUD6P3Z3H3I.jpg", "publishedAt": "2020-02-24T16:26:00Z", "content": "ONSTED, MI The Muth family is home in Michigan after nearly three weeks of international travel toils.\r\nThe Muths were on Holland Americas Westerdam cruise in Asia, but their ship was turned away from multiple countries because of coronavirus fears, since it … [+2291 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus Sickens an Ailing Energy Bond Market", "description": "(Bloomberg Opinion) -- The most obvious symptom of coronavirus’ spread in the energy sector is the slumping oil price. The less obvious, but equally serious, signs can be found in the financing market for oil and gas producers.Exxon Mobil Corp., that haven of…", "url": "https://finance.yahoo.com/news/coronavirus-sickens-ailing-energy-bond-170734489.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/0jNznOYeD13oa287kfg7RA--~B/aD04Mjg7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/7c6275eea04f5c3ad028c74890b78b03", "publishedAt": "2020-02-24T17:07:34Z", "content": "(Bloomberg Opinion) -- The most obvious symptom of coronavirus spread in the energy sector is the slumping oil price. The less obvious, but equally serious, signs can be found in the financing market for oil and gas producers.\r\nExxon Mobil Corp., that haven o… [+4932 chars]"}, {"source": {"id": null, "name": "Scottadamssays.com"}, "author": "Scott Adams, Scott Adams", "title": "Episode 830 Scott Adams: Bloomberg as the T*rd in the Punch Bowl, Bernie and Fidel, Healthcare", "description": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a Content: Coronavirus worldwide impact Twitter unfollowing mystery and the TikTok app President Trump treated as a superstar in India Why do Democrats see incentives as cruel? The chil…", "url": "https://www.scottadamssays.com/2020/02/24/episode-830-scott-adams-bloomberg-as-the-trd-in-the-punch-bowl-bernie-and-fidel-healthcare/", "urlToImage": "http://www.scottadamssays.com/wp-content/uploads/2020/02/Episode-830.png", "publishedAt": "2020-02-24T17:06:22Z", "content": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a\r\nContent:\r\n<ul><li>Coronavirus worldwide impact</li><li>Twitter unfollowing mystery and the TikTok app</li><li>President Trump treated as a superstar in India</li><li>Why do Democrats… [+645 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus will have larger impact on companies like Amazon, Wayfair than Apple: Analyst", "description": "The impact of the coronavirus on tech is escalating, as D.A. Davidson Senior Research Analyst Tom Forte says it will have the largest impact on companies like Amazon and Wayfair. He joins Yahoo Finance's On the Move panel to discuss.", "url": "https://finance.yahoo.com/video/coronavirus-larger-impact-companies-amazon-163943721.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/EGbPrxwl_zmGQ2OcckbnJQ--~B/aD0xOTkwO3c9MzU0MztzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/24/5e53fc5122734150614eb511/5e53fc5122734150614eb512_o_U_v2.jpg", "publishedAt": "2020-02-24T16:39:43Z", "content": "The impact of the coronavirus on tech is escalating, as D.A. Davidson Senior Research Analyst Tom Forte says it will have the largest impact on companies like Amazon and Wayfair. He joins Yahoo Finance's On the Move panel to discuss."}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Chong Koh Ping - The Wall Street Journal,Anna Isaac,Caitlin McCabe", "title": "Dow industrials close 1,000 points lower as coronavirus cases mount", "description": "Fears about contagion rattled investors after a surge of cases outside China were reported over the weekend, prompting concerns about new pockets of infection in Italy, Iran and South Korea.", "url": "https://www.thestar.com/wsj/business/2020/02/24/stocks-fall-as-coronavirus-spread-accelerates-outside-china.html", "urlToImage": "https://images.thestar.com/vjQzGmYYDpSN_uwOk1muktbuAks=/1200x800/smart/filters:cb(1582608270984)/https://www.thestar.com/content/dam/thestar/wsj/business/2020/02/24/stocks-fall-as-coronavirus-spread-accelerates-outside-china/new_york_stock_exchange.jpg", "publishedAt": "2020-02-24T16:26:50Z", "content": "Investors around the world stepped up their retreat from stocks and piled into haven assets like government bonds and gold, reflecting escalating worries that the coronavirus will crimp global growth.\r\nThe Dow Jones Industrial Average dropped 1,030 points, or… [+6507 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO expert leading Wuhan investigation praises China's 'aggressive' measures in containing COVID-19 - CNA", "description": "WHO expert leading Wuhan investigation praises China's 'aggressive' measures in containing COVID-19 CNA Amid China virus fears, even a haircut is a major operation The Associated Press Beijing airport, trains, streets remain quiet due to virus INQUIRER.net Pl…", "url": "https://www.youtube.com/watch?v=i-ovfJ8R2io", "urlToImage": "https://i.ytimg.com/vi/i-ovfJ8R2io/maxresdefault.jpg", "publishedAt": "2020-02-24T16:33:26Z", "content": "Bruce Aylward, the head of a World Health Organization (WHO) team of medical experts investigating the COVID-19 outbreak in China, has commended the country for its ambitious approach in containing the virus. Speaking at a news conference in Beijing, he said … [+465 chars]"}, {"source": {"id": null, "name": "Reality.news"}, "author": "Tommy Palladino", "title": "Magic Leap Hosting LEAP Developer Days at Magic Leap HQ in May", "description": "Despite the cancellation of Mobile World Congress and several high-profile companies pulling out of the upcoming Game Developers Conference, Magic Leap is pushing forward with hosting its own developer conference. Instead of organizing a major public conferen…", "url": "https://next.reality.news/news/magic-leap-hosting-leap-developer-days-magic-leap-hq-may-0262821/", "urlToImage": "https://img.reality.news/img/08/22/63718128868870/0/magic-leap-hosting-leap-developer-days-magic-leap-hq-may.1280x600.jpg", "publishedAt": "2020-02-24T16:18:00Z", "content": "Despite the cancellation of Mobile World Congress and several high-profile companies pulling out of the upcoming Game Developers Conference, Magic Leap is pushing forward with hosting its own developer conference.\r\nInstead of organizing a major public confere… [+3026 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Connor Bamford, Connor Bamford", "title": "Coronavirus might be here to stay – and face masks won't necessarily stop the spread", "description": "We needn't rely solely on global authorities to keep us safe. These are a number of things we can all do to help minimise the risk of being infected", "url": "https://www.independent.co.uk/voices/coronavirus-sars-pandemic-disease-china-europe-iran-uk-a9355716.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/24/16/coronavirus-uk.jpg", "publishedAt": "2020-02-24T16:48:00Z", "content": "The world looks to be teetering on the edge of a coronavirus (or severe acute respiratory coronavirus 2/SARS-CoV-2) pandemic that will be extremely hard for the world to contain. \r\nAs the epidemic of COVID-19 (the disease caused by the coronavirus) continues … [+7650 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Global stocks plunge as coronavirus fears grow beyond China", "description": "The Dow Jones Industrial Average opened sharply lower Monday as concern grows over the impact of the coronavirus outbreak. Melissa Armo, founder and owner of The Stock Swoosh, joins CBSN with analysis.", "url": "https://www.cbsnews.com/video/market-update-global-stocks-plunge-as-coronavirus-fears-grow-beyond-china/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/24/75afcdcb-5c35-474c-8ff9-35b8409dcfb0/thumbnail/1200x630/c78342f9bc75727836846e0a6b2b5894/cbsn-fusion-market-update-global-stocks-plunge-as-coronavirus-fears-grow-beyond-china-thumbnail-449857-640x360.jpg", "publishedAt": "2020-02-24T16:16:03Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "mjankowicz@businessinsider.com (Mia Jankowicz)", "title": "Iran is closing schools, scrambling for hospital places, and spraying disinfectant in the subway as coronavirus deaths and cases spike", "description": "The government said 12 people had died of the novel coronavirus as of Monday, though one official said the number is actually much higher.", "url": "https://news.yahoo.com/iran-closing-schools-scrambling-hospital-162515515.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/o1cBX6g8_k.2ORBCCIf24w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/bkFIEfgElJ4lazh61Sgikw--~B/aD0xMjY3O3c9MTY4OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/fea7571a8ca2ffdd448a319890bcce7e", "publishedAt": "2020-02-24T16:25:15Z", "content": "Iranian women wear face masks to prevent contracting the novel coronavirus at the Grand Bazaar in Tehran, Iran, on February 20, 2020.\r\nWest Asia News Agency)/Nazanin Tabatabaee via Reuters\r\n<ul><li>Iran is closing public spaces like schools, universities, and… [+3323 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What does the coronavirus mean for China's economy? | CNBC Explains - CNBC International", "description": "What does the coronavirus mean for China's economy? | CNBC Explains CNBC International World Economy Shudders as Coronavirus Threatens Global Supply Chains The Wall Street Journal Top 5 Things to Know in the Market on Monday, February 24th Investing.com Globa…", "url": "https://www.youtube.com/watch?v=k_9DLnl1RBE", "urlToImage": "https://i.ytimg.com/vi/k_9DLnl1RBE/maxresdefault.jpg", "publishedAt": "2020-02-24T16:59:44Z", "content": "An outbreak of a novel coronavirus originating from Wuhan, China has gripped the world, as the death toll and infection count grow by the day. So, what happens when a completely unforeseen event shocks the worlds second largest economy? CNBCs Uptin Saiidi exp… [+373 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "John Carney, John Carney", "title": "Markets Point Toward Coronavirus Rate Cuts", "description": "The Fed said recently that it believes its current target will remain appropriate for the foreseeable future. The market disagrees. | Economy", "url": "https://www.breitbart.com/economy/2020/02/24/markets-point-toward-coronavirus-rate-cuts/", "urlToImage": "https://media.breitbart.com/media/2020/02/GettyImages-1197381798-e1582563780138-638x335.jpg", "publishedAt": "2020-02-24T17:04:21Z", "content": "The Federal Reserve may be forced to move quickly in reaction to the spreading outbreak of the coronavirus, market indicators suggested Monday.\r\nStocks plunged on Monday, pushing the Dow Jones Industrial average down by over 900 points on the open, and bonds … [+1725 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Tanvir Abid, CFA", "title": "OPEC Cannot And Will Not Cut Production In March", "description": "Prevailing OPEC production is already at rock bottom with the group already shouldering the burden.Even though coronavirus led concerns of demand slowdown persist.Saudi Arabia and UAE will be very reluctant to implement further unilateral production cuts.Upsi…", "url": "https://seekingalpha.com/article/4326622-opec-cannot-and-will-not-cut-production-in-march", "urlToImage": "https://static2.seekingalpha.com/images/marketing_images/oil_gas/ecology_shale_gas_cc0.png", "publishedAt": "2020-02-24T16:33:40Z", "content": "Current OPEC production already at rock bottom\r\nOPECs January 2020 production at 28.86 mb/d (secondary sources) is the lowest at least since March 2014. Approx. 300 kb/d production loss was seen in Libya followed by smaller declines in Angola, Iraq and Kuwait… [+6686 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Andrew Kerr", "title": "Stock Market Plunges Over Fears Of Coronavirus Pandemic", "description": "U.S. stocks plunged Monday morning over fears of a possible global coronavirus pandemic.", "url": "https://dailycaller.com/2020/02/24/stock-market-plunges-coronavirus/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/February-7-stock-exchange-e1582560257779.jpg", "publishedAt": "2020-02-24T16:34:42Z", "content": "U.S. stocks plunged Monday morning over fears of a possible global coronavirus pandemic.\r\nThe Dow Jones dropped 997 points, or 3.4%, when markets opened Monday, CNN reported. The S&amp;P 500 and Nasdaq also fell 3.2% and 4.3%, respectively.\r\nThe Monday mornin… [+1978 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Carrie Mihalcik", "title": "Is the coronavirus a pandemic? 'Not yet,' says WHO - CNET", "description": "Recent spikes in COVID-19 cases have been reported in Italy, Iran and South Korea.", "url": "https://www.cnet.com/news/is-the-coronavirus-a-pandemic-not-yet-says-who/", "urlToImage": "https://cnet3.cbsistatic.com/img/vCH6QNFmVn-H_O0o6ISr5MXwI3w=/756x567/2020/01/31/da59eefd-3cb4-41d0-81cb-26d23ee755ae/coronavirus-gettyimages-1195645030.jpg", "publishedAt": "2020-02-24T16:56:00Z", "content": "People are seen wearing masks as they cross a road in Mong Kok District on Jan. 24 in Hong Kong, China.\r\nVernon Yuen/NurPhoto via Getty Images\r\nThe World Health Organization says it doesn't yet consider the deadly coronavirus outbreak to be a pandemic. While … [+1583 chars]"}, {"source": {"id": null, "name": "Hawaiinewsnow.com"}, "author": "", "title": "Officials: Hawaii flu outbreak complicated by virus fears - Hawaii News Now", "description": "Officials: Hawaii flu outbreak complicated by virus fears Hawaii News Now Does the flu vaccine work? The numbers are in INFORUM Flu is hitting children hard this season: What you need to know TODAY Flu slams local hospitals, schools nwitimes.com Coronavirus V…", "url": "https://www.hawaiinewsnow.com/2020/02/24/officials-hawaii-flu-outbreak-complicated-by-virus-fears/", "urlToImage": "https://www.hawaiinewsnow.com/resizer/USAXBopxCJZDvnv-nmQQVpJFJRU=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/MZNCD26IT5GZPIERJ3I7L2R6XQ.jpg", "publishedAt": "2020-02-24T16:15:00Z", "content": "HONOLULU (AP) Hawaii is bracing for 50,000 to 70,000 cases of flu this year. But a surge in influenza has been complicated by fears of the new virus that started in China.\r\nMany patients visiting Hawaii emergency rooms for flu cases are worried about contract… [+1664 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "COVID-19 can be contained: WHO chief - China.org.cn", "description": "COVID-19 can be contained: WHO chief China.org.cn Coronavirus outbreak: As fears of a pandemic mount, WHO says world is not ready Economic Times What does the coronavirus mean for China's economy? | CNBC Explains CNBC International Virus Outbreak: China vows …", "url": "http://www.china.org.cn/world/Off_the_Wire/2020-02/25/content_75740386.htm", "urlToImage": null, "publishedAt": "2020-02-24T17:03:25Z", "content": "GENEVA, Feb. 24 (Xinhua) -- The chief of the World Health Organization (WHO) said Monday that COVID-19 can be contained, which is a clear key message based upon the findings by the WHO-China joint mission in China.\r\nAt a daily briefing, WHO Director-General T… [+1331 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Oil slides 4% on demand concerns as coronavirus spreads", "description": "Global equities also extended losses as worries about the impact of the virus grew, with the number of cases jumping in Iran, Italy and South Korea.", "url": "https://www.moneycontrol.com/news/business/commodities/oil-slides-4-on-demand-concerns-as-coronavirus-spreads-4973021.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/01/crude-oil-770x433.png", "publishedAt": "2020-02-24T16:15:01Z", "content": "Oil prices slumped by 4% on Monday as the rapid spread of the coronavirus in countries outside China added to investor concerns over the impact on demand for crude.\r\nGlobal equities also extended losses as worries about the impact of the virus grew, with the … [+2363 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Yomi Kazeem", "title": "Nigeria’s economy is making a comeback—but it’s still not happening fast enough", "description": "Nigeria's economic growth rate remains far short of the government's projections.", "url": "https://qz.com/africa/1807355/nigerias-economy-has-best-quarterly-growth-since-recession/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2017/04/nigerians-at-a-lagos-island-market.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-02-24T16:26:29Z", "content": "Since suffering a recession and full year of negative growth in 2016, Nigeria, Africas largest economy has recoveredslowly.\r\nData from Nigerias statistics bureau shows the pace of recovery remains slow despite noting a milestone: gross domestic product (GDP) … [+2593 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Ben Warren", "title": "Economist Warns: Bond Market Now A “Great Big Bubble”", "description": "Bond market propping up stock prices", "url": "https://www.infowars.com/economist-warns-bond-market-now-a-great-big-bubble/", "urlToImage": "https://assets.infowars.com/2020/02/NYCUSAGetty22420.jpg", "publishedAt": "2020-02-24T16:33:33Z", "content": "Investors poured into safe-havens last week as the coronavirus continued to create worry about the global economy.\r\nBond yields hit all-time lows with the yield on the 30-year US Treasury dropping below 2%.  Meanwhile, stocks tumbled Friday, with every major … [+4268 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Associated Press", "title": "Coronavirus patients at Travis AFB have nowhere to go", "description": "Coronavirus patients at Travis Air Force Base must go. Diamond Cruise ship evacuees who tested positive for the pneumonia-like virus need to leave the base in Fairfield, Calif., even if they don't have symptoms, according to federal authorities.", "url": "https://www.sfgate.com/bayarea/article/Coronavirus-patients-Travis-AFB-must-move-15079843.php", "urlToImage": "https://s.hdnux.com/photos/01/10/61/02/19075245/5/rawImage.jpg", "publishedAt": "2020-02-24T16:39:55Z", "content": "<ul><li>Mary Cahill, left, leaves a news conference where officials discussed the proposal for housing coronavirus patients at the Fairview Development Center in Costa Mesa, Calif., Saturday, Feb. 22, 2020. A court temporarily blocked the U.S. government from… [+5111 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Steph Willems", "title": "Chevrolet’s First Chinese EV Hits the Market at a Difficult Time", "description": "The price seems right, the range looks good, and the body? Well, we’ve seen far more ungainly vehicles achieve success in the past. The Chevrolet Menlo, the bowtie brand’s first EV in China, went on sale in the troubled nation last week with both pros and con…", "url": "https://www.thetruthaboutcars.com/2020/02/chevrolets-first-chinese-ev-hits-the-market-at-a-difficult-time/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2020/02/amenlo-610x429.jpg", "publishedAt": "2020-02-24T16:30:26Z", "content": "The price seems right, the range looks good, and the body? Well, we’ve seen far more ungainly vehicles achieve success in the past. The Chevrolet Menlo, the bowtie brand’s first EV in China, went on sale in the troubled nation last week with both pros and con… [+2539 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Frances Martel, Frances Martel", "title": "Study: China Lied, Wuhan Virus Did Not Originate in Meat Market", "description": "Chinese scientists have concluded that the Wuhan coronavirus did not originate at a wild meat market as the Communist Party had previously asserted, the South China Morning Post reported on Sunday.", "url": "https://www.breitbart.com/asia/2020/02/24/study-china-lied-wuhan-virus-did-not-originate-in-meat-market/", "urlToImage": "https://media.breitbart.com/media/2020/02/wuhan-wild-meat-market-640x335.jpg", "publishedAt": "2020-02-24T16:59:47Z", "content": "Chinese scientists have concluded that the Wuhan coronavirus did not originate at a wild meat market as the Communist Party had previously asserted, the South China Morning Post reported on Sunday.\r\nAfter weeks of the never-before-seen virus infecting people … [+5802 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "State Street’s $2 Billion Loan ETF Posts Biggest Outflow Ever", "description": "(Bloomberg) -- Exchange-traded fund investors are souring on floating-rate loans amid growing bets that the coronavirus will force the Federal Reserve to cut borrowing costs.State Street Corp.’s $2.1 billion SPDR Blackstone/GSO Senior Loan ETF, ticker SRLN, p…", "url": "https://finance.yahoo.com/news/state-street-2-billion-loan-161637250.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.C6u4kr.hAPCo850.P24jA--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/be4eed5af9ad880e1525d460b3d222dc", "publishedAt": "2020-02-24T16:16:37Z", "content": "(Bloomberg) -- Exchange-traded fund investors are souring on floating-rate loans amid growing bets that the coronavirus will force the Federal Reserve to cut borrowing costs.\r\nState Street Corp.s $2.1 billion SPDR Blackstone/GSO Senior Loan ETF, ticker SRLN, … [+2288 chars]"}, {"source": {"id": null, "name": "Yourmileagemayvary.net"}, "author": "Your Mileage May Vary", "title": "Should You Avoid Chinatowns In The U.S. Because Of Coronavirus?", "description": "There’s no weather event, corporate bankruptcy or airline crash that even comes to close to the disruption of global travel due to coronavirus, or COVID-19 to be scientifically correct. The… The post Should You Avoid Chinatowns In The U.S. Because Of Coronavi…", "url": "https://yourmileagemayvary.net/2020/02/24/should-you-avoid-chinatowns-in-the-u-s-because-of-coronavirus/", "urlToImage": "https://yourmileagemayvary.net/wp-content/uploads/2020/02/pexels-photo-1115175-262774923-1582517086738-1024x576.jpeg", "publishedAt": "2020-02-24T17:09:28Z", "content": "There’s no weather event, corporate bankruptcy or airline crash that even comes to close to the disruption of global travel due to coronavirus, or COVID-19 to be scientifically correct. The extent of the health crisis the virus will cause is still unknown but… [+4246 chars]"}, {"source": {"id": null, "name": "Globalresearch.ca"}, "author": "Stephen Lendman", "title": "Russia Accused of Campaign Blaming US for Coronavirus Outbreak", "description": "Russia has been a prime US target since its 1917 revolution, relations between both countries uneasy at best from that time to now. Propaganda by US officials and establishment media demonizes the country and its leadership, ongoing for over a … The post Russ…", "url": "https://www.globalresearch.ca/russia-behind-campaign-blame-us-coronavirus-outbreak/5704471", "urlToImage": "https://www.globalresearch.ca/wp-content/uploads/2018/03/russiagate.png", "publishedAt": "2020-02-24T16:36:32Z", "content": "Russia has been a prime US target since its 1917 revolution, relations between both countries uneasy at best from that time to now.\r\nPropaganda by US officials and establishment media demonizes the country and its leadership, ongoing for over a century except… [+3996 chars]"}, {"source": {"id": null, "name": "Wng.org"}, "author": "raldrich@wng.org", "title": "Iran battles coronavirus", "description": "Iranian authorities are contradicting each other on just how much the coronavirus outbreak has grown. Officials in the hardest-hit city of Qom on Monday reported 50 people had died of the disease since Feb. 13. But Iranian Health Ministry spokesman Iraj Harir…", "url": "https://world.wng.org/content/iran_battles_coronavirus", "urlToImage": "https://world.wng.org/sites/default/files/AP20054452905758.jpg", "publishedAt": "2020-02-24T16:31:16Z", "content": "Iranian authorities are contradicting each other on just how much the coronavirus outbreak has grown. Officials in the hardest-hit city of Qom on Monday reported 50 people had died of the disease since Feb. 13. But Iranian Health Ministry spokesman Iraj Harir… [+631 chars]"}, {"source": {"id": null, "name": "Thenewhumanitarian.org"}, "author": null, "title": "In the news: Coronavirus cases surge outside China", "description": "Iran’s neighbours shut their borders as Covid-19 reaches new countries in the Middle East. But closures can also push migrants to underground networks.", "url": "https://www.thenewhumanitarian.org/news/2020/02/24/coronavirus-spread-border-closures-covid-19-iran-middle-east-kuwait-bahrain-afghanistan-migrants", "urlToImage": "http://assets.irinnews.org/s3fs-public/styles/responsive_large/public/tnh-coronavirus-spread-border-closures-covid-19-iran-middle-east-kuwait-bahrain-afghanistan-migrants-thumbnail.jpg?Lg4iTyaLh9T89mK2AeaV2nvKTLGuSQje", "publishedAt": "2020-02-24T16:22:53Z", "content": "Countries in the Middle East and South Asia ratcheted up border closures on Monday amid a surge of coronavirus cases in Iran and fears that an outbreak once largely limited to China is gaining a global foothold.\r\nAfter denying the existence of coronavirus wit… [+2127 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ed Cara", "title": "No Pandemic... Yet: WHO Holds Back As Coronavirus Outbreak Spreads Globally", "description": "A deadly new coronavirus is now clearly spreading across the globe—with hundreds of reported local cases surging in countries outside China, previously the sole epicentre of the outbreak. But for the time being, the World Health Organisation said on Monday th…", "url": "https://www.gizmodo.com.au/2020/02/no-pandemic-yet-who-holds-back-as-coronavirus-outbreak-spreads-globally/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/a0ku7muv2jpm48dvve9p.jpg", "publishedAt": "2020-02-24T16:13:00Z", "content": "A deadly new coronavirus is now clearly spreading across the globewith hundreds of reported local cases surging in countries outside China, previously the sole epicentre of the outbreak. But for the time being, the World Health Organisation said on Monday tha… [+3031 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Sky Palma", "title": "Man responsibly goes to hospital after he suspects coronavirus infection — then gets slammed with $3K bill from insurance company", "description": "Osmel Martinez Azcue took a work trip to China last month, but when he returned to Miami he started developing flu-like symptoms, making him wonder if he’d contracted coronavirus. Taking what he felt was the responsible course of action, he went to Jackson Me…", "url": "https://www.rawstory.com/2020/02/man-responsibly-goes-to-hospital-after-he-suspects-coronavirus-infection-then-gets-slammed-with-3k-bill-from-insurance-company/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/coronavirus-.jpeg", "publishedAt": "2020-02-24T16:29:41Z", "content": "Osmel Martinez Azcue took a work trip to China last month, but when he returned to Miami he started developing flu-like symptoms, making him wonder if he’d contracted coronavirus.\r\nTaking what he felt was the responsible course of action, he went to Jackson M… [+1651 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Carmen Reinicke", "title": "The stock market's fear gauge spikes to its highest since August as the coronavirus outbreak rages", "description": "The Cboe Volatility Index, or VIX, spiked as much as 40% on Monday, the highest since August. The VIX is a measure of volatility in the markets and is often referred to as a \"fear gauge.\" Investors are worried about the impact of the coronavirus on global mar…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-fear-index-spiked-vix-highest-since-august-coronavirus-2020-2-1028932414", "urlToImage": "https://images.markets.businessinsider.com/image/5e18d98cf4423118be550b72-2400/gettyimages-1158948864.jpg", "publishedAt": "2020-02-24T16:46:00Z", "content": "Xinhua/Wang Ying/Getty Images\r\n<ul><li>The Cboe Volatility Index, or VIX, spiked as much as 40% on Monday, the highest since August. </li><li>The VIX is a measure of volatility in the markets and is often referred to as a \"fear gauge.\"</li><li>Investors are w… [+2459 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Silver Price Forecast – Silver Markets Overbought", "description": "Silver markets have gapped higher to kick off the trading session on Monday but are most certainly overbought. After all, the market is starting to form a bit of a shooting star, but even more important than that it is above the Bollinger Band indicator.", "url": "https://finance.yahoo.com/news/silver-price-forecast-silver-markets-170602242.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/nwFY6jUyxT2Pq.9VumzIGg--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/fd50a848f16fdea687bb0c06b6e9e5e7", "publishedAt": "2020-02-24T17:06:02Z", "content": "Silver markets gapped higher to kick off the trading session on Monday, and then reached much higher during the Asian and European session as fears of coronavirus spreading into a worldwide pandemic have caused a lot of people fearing that the market will be … [+1281 chars]"}, {"source": {"id": null, "name": "247wallst.com"}, "author": "Paul Ausick", "title": "Energy Sector Continues Getting Hammered by Coronavirus Spread", "description": "The impact of the spreading coronavirus has hit the energy sector particularly hard. Here are some of Monday's biggest losers.", "url": "https://247wallst.com/energy-business/2020/02/24/energy-sector-continues-getting-hammered-by-coronavirus-spread/", "urlToImage": "https://s2.wp.com/wp-content/themes/vip/247wallst/images/247-50x50.png", "publishedAt": "2020-02-24T16:45:22Z", "content": "With the markets seeing a major sell-off on Monday, the fears of the latest coronavirus spreading into a pandemic beyond China (South Korea, Italy, Turkey) are becoming more real. We are also now getting to see some of the expected election volatility come in… [+2709 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Exclusive: IMF says global economy could still see 'v-shaped' recovery from coronavirus", "description": "IMF Chief Economist Gita Gopinath told Yahoo Finance on Monday that the virus could become a global pandemic but said she could see a scenario where the economy impact is only temporary.", "url": "https://finance.yahoo.com/news/imf-says-global-economy-could-still-see-vshaped-recovery-from-coronavirus-165030794.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/OAuh0o4k15ynuaj7dzwTVQ--~B/aD0zMTE3O3c9NDc3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/fa0e3b50-5723-11ea-9bf9-cfdd71199368", "publishedAt": "2020-02-24T16:50:30Z", "content": "The International Monetary Fund says the coronavirus remains a source of tremendous uncertainty to the global economy, but said it can still imagine a scenario where the negative effects are only temporary.\r\nIMF Chief Economist Gita Gopinath told Yahoo Financ… [+2751 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "Dow slumps 866 points in early trade", "description": "U.S. stocks fell sharply Monday, following a sell-off in overseas markets, as a surge in virus cases and a worrisome spread of the disease outside China sent investors running for safety. The Dow Jone", "url": "https://www.thehindu.com/business/markets/dow-slumps-866-points/article30906577.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-02-24T17:11:18Z", "content": "U.S. stocks fell sharply Monday, following a sell-off in overseas markets, as a surge in virus cases and a worrisome spread of the disease outside China sent investors running for safety. The Dow Jones Industrial Average slumped 866 points, or 3%, to 28,127, … [+516 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "Fox Business host blames Bernie’s Nevada win for stock market crash — not the coronavirus", "description": "The Dow Jones Industrial Average fell by 800 points in early Monday trading, as fears grew about China’s government being unable to contain the deadly coronavirus. On Fox Business, however, host Charles Payne said that the true culprit behind the drop was Sen…", "url": "https://www.rawstory.com/2020/02/fox-business-host-blames-bernies-nevada-win-for-stock-market-crash-not-the-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/03/charles-payne.jpg", "publishedAt": "2020-02-24T16:41:11Z", "content": "The Dow Jones Industrial Average fell by 800 points in early Monday trading, as fears grew about China’s government being unable to contain the deadly coronavirus.\r\nOn Fox Business, however, host Charles Payne said that the true culprit behind the drop was Se… [+1165 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Agence France-Presse", "title": "World Health Organization tells world to brace for ‘potential pandemic’ as new coronavirus spreads", "description": "The World Health Organization warned countries on Monday to be ready for a “potential pandemic” as new deaths and infections in Europe, the Middle East and Asia triggered more drastic efforts to contain the new coronavirus. The number of fatalities in China —…", "url": "https://www.rawstory.com/2020/02/world-health-organization-tells-world-to-brace-for-potential-pandemic-as-new-coronavirus-spreads/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/china_virus_afp.jpg", "publishedAt": "2020-02-24T16:12:33Z", "content": "The World Health Organization warned countries on Monday to be ready for a “potential pandemic” as new deaths and infections in Europe, the Middle East and Asia triggered more drastic efforts to contain the new coronavirus.\r\nThe number of fatalities in China … [+4637 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": "Sean Burch", "title": "Apple’s Stock Slides 5% As Coronavirus Fears Rise", "description": "Apple’s stock price dropped 5% in early trading on Monday, as Wall Street continues to fear the impact coronavirus will have on the tech giant’s business — as well as the global economy. After a few hours of trading, Apple shares were down to about $298 — aft…", "url": "http://www.thewrap.com/apples-stock-slides-5-as-coronavirus-fears-rise/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2019/05/Apple.jpg", "publishedAt": "2020-02-24T16:28:08Z", "content": "Apple’s stock price dropped 5% in early trading on Monday, as Wall Street continues to fear the impact coronavirus will have on the tech giant’s business — as well as the global economy.\r\nAfter a few hours of trading, Apple shares were down to about $298 — af… [+1278 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FP Staff", "title": "Donald Trump’s India visit: POTUS, FLOTUS visit Sabarmati Ashram and Taj Mahal; $3 bn defence deal on anvil, says US president", "description": "While speaking at the Motera cricket stadium, Donald Trump promised to settle a three billion dollar defence deal with India during his India visit The post Donald Trump’s India visit: POTUS, FLOTUS visit Sabarmati Ashram and Taj Mahal; $3 bn defence deal on …", "url": "https://www.firstpost.com/photos/donald-trumps-india-visit-potus-flotus-visit-sabarmati-ashram-and-taj-mahal-3-bn-defence-deal-on-anvil-says-us-president-8081561.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/02/image-1-edit__1582551032_136.232.64.82.jpg", "publishedAt": "2020-02-24T17:00:35Z", "content": "Sensex tanks 807 points as coronavirus alarm spreads, Nifty sheds 251 points; Tata Steel, ONGC, Maruti Suzuki among top losers"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FirstCricket Staff", "title": "Shafali Verma, Poonam Yadav help India see off Bangladesh in second Women’s T20 World Cup Group A match", "description": "Here are the best photos from India's 18-run win over Bangladesh in the ICC Women's T20 World Cup. The post Shafali Verma, Poonam Yadav help India see off Bangladesh in second Women’s T20 World Cup Group A match appeared first on Firstpost.", "url": "https://www.firstpost.com/firstcricket/photo-gallery/shafali-verma-poonam-yadav-help-india-see-off-bangladesh-in-second-womens-t20-world-cup-group-a-match-8081911.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/assets/images/cricket/firstcricket_300x250.jpg", "publishedAt": "2020-02-24T16:21:55Z", "content": "Sensex tanks 807 points as coronavirus alarm spreads, Nifty sheds 251 points; Tata Steel, ONGC, Maruti Suzuki among top losers"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Silver Daily Forecast – Silver Gains Ground, Closing in on $19.00", "description": "Silver has started the week with gains, as the metal is close to the $19 level. The coronavirus has weighed heavily on risk appetite, which has boosted silver prices.", "url": "https://finance.yahoo.com/news/silver-daily-forecast-silver-gains-165820942.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/r6o_hGuK_.8Mn0iHcOa81g--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/2f20c71e160ecaf64a97bdc5825901d6", "publishedAt": "2020-02-24T16:58:20Z", "content": "Silver has posted slight gains in the Monday session. Currently, silver is trading at $18.76, up $0.28 or 1.56% the day. \r\nCorona Jitters Boost Silver, Gold\r\nSilver enjoyed an excellent week, gaining 4.2 percent. This marked silvers strongest week since the f… [+1876 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Riccardo Bastianello", "title": "After the floods, Venice struggles with coronavirus hit", "description": "Scarcely have floods that hit Venice last year receded than the coronavirus has posed a new threat to the lagoon city's billion-euro tourism industry, shutting carnival for the first time in 50 years and fuelling fears of a second \"economic\" virus.", "url": "https://www.reuters.com/article/us-china-health-italy-venice-idUSKCN20I1YM", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200224&t=2&i=1494634345&w=1200&r=LYNXNPEG1N1ML", "publishedAt": "2020-02-24T16:57:05Z", "content": "VENICE, Italy (Reuters) - Scarcely have floods that hit Venice last year receded than the coronavirus has posed a new threat to the lagoon city’s billion-euro tourism industry, shutting carnival for the first time in 50 years and fuelling fears of a second “e… [+2777 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "Fidelity and Charles Schwab say some users ran into technical issues in early trading as stocks tanked the most since August", "description": "Fidelity and Charles Schwab apologized to clients Monday morning after technical issues kept users from executing trades during the worst market slump in months. Users took to Twitter with complaints about login errors, their accounts incorrectly showing a $0…", "url": "https://markets.businessinsider.com/news/stocks/fidelity-charles-schwab-brokerage-users-technical-errors-market-tumble-coronavirus-2020-2-1028932443", "urlToImage": "https://images.markets.businessinsider.com/image/5e53ef54fee23d7e8f33dba7-2400/2016-10-05t120000z40274713tm3ec9s17rh01rtrmadp3usa-fidelity-family.jpg", "publishedAt": "2020-02-24T17:01:26Z", "content": "REUTERS/Brian Snyder\r\n<ul><li>Fidelity and Charles Schwab apologized to clients Monday morning after technical issues kept users from executing trades during the worst market slump in months.</li><li>Users took to Twitter with complaints about login errors, t… [+2775 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "none@none.com (AP | Naveed Siddiqui)", "title": "Iran reports highest cornavirus death toll outside of China", "description": "The Iranian health ministry confirmed on Monday that 12 people from the city of Qom have died from the novel coronavirus — the highest number outside of China. According to the health ministry, total infections have risen to 61 while death toll rose to 12. Me…", "url": "https://www.dawn.com/news/1536408", "urlToImage": "https://i.dawn.com/large/2020/02/5e53ecf297116.jpg", "publishedAt": "2020-02-24T16:12:34Z", "content": "The Iranian health ministry confirmed on Monday that 12 people from the city of Qom have died from the novel coronavirus the highest number outside of China.\r\nAccording to the health ministry, total infections have risen to 61 while death toll rose to 12. Mea… [+2474 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Governmental Public Health Leaders Request Emergency Supplemental Funding for COVID-19 Preparedness and Response Efforts", "description": "In response to the U.S. Department of Health and Human Services (HHS) secretary's declaration that the 2019 novel coronavirus (COVID-19) outbreak is a public health emergency, leaders of national public health organizations, including the Association of State…", "url": "https://news.yahoo.com/governmental-public-health-leaders-request-170000327.html", "urlToImage": null, "publishedAt": "2020-02-24T17:00:00Z", "content": null}, {"source": {"id": null, "name": "247wallst.com"}, "author": "Jon C. Ogg", "title": "Hope for Gilead’s Remdesivir to Beat the Coronavirus", "description": "Gilead Sciences stock surged while the broader market was battered on reports that a senior official from the World Health Organization said that Gilead's remdesivir may currently be the best bet on defeating the coronavirus.", "url": "https://247wallst.com/healthcare-business/2020/02/24/hope-for-gileads-remdesivir-to-beat-the-coronavirus/", "urlToImage": "https://s2.wp.com/wp-content/themes/vip/247wallst/images/247-50x50.png", "publishedAt": "2020-02-24T16:15:34Z", "content": "Mondays trading session was rather brutal for most stocks in the market. The spread of the coronavirus beyond China into South Korea and more cases in Italy have the markets spooked that the Covid-19 outbreak will become a pandemic. When outbreaks occur, some… [+3779 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jesse Pound", "title": "Blackstone's Byron Wien says Monday's sell-off is not the start of a bear market", "description": "Byron Wien said this is not the start of a bear market as U.S. equity markets trade lower after a weekend of reports that the coronavirus was spreading more rapidly outside of mainland China.", "url": "https://www.cnbc.com/2020/02/24/blackstones-byron-wien-says-sell-off-is-not-start-of-a-bear-market.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105134559-IMG_6152.JPG?v=1578401658", "publishedAt": "2020-02-24T16:45:00Z", "content": "Blackstone Vice Chairman Byron Wien said on CNBC's \"Squawk Alley\" that Monday's sell-off amid the spreading coronavirus outbreak was not the start of a bear market.\r\n\"It's not the beginning of a bear market. It's a serious correction related to a fundamental … [+1261 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Oil markets see worst contraction in February since the 2009 Great Recession", "description": "Oil markets continue to take a hit as fears of the coronavirus continue to rattle global markets. Yahoo Finance's Julie Hyman, Adam Shapiro, Andy Serwer, Tom Forte D.A. Davidson Sr. Research Analyst and Claudio Galimberti, Head of Demand, Refining and Agricul…", "url": "https://finance.yahoo.com/video/oil-markets-see-worst-contraction-164229024.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/mr2LTl6exKRbC0kW6c0CWQ--~B/aD00MTM1O3c9NzM2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/24/5e53fcf82d85407f2402c74c/5e53fcf82d85407f2402c74d_o_U_v2.jpg", "publishedAt": "2020-02-24T16:42:29Z", "content": "Oil markets continue to take a hit as fears of the coronavirus continue to rattle global markets. Yahoo Finance's Julie Hyman, Adam Shapiro, Andy Serwer, Tom Forte D.A. Davidson Sr. Research Analyst and Claudio Galimberti, Head of Demand, Refining and Agricul… [+30 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Jim Geraghty, Jim Geraghty", "title": "What Happens When a Nation of Elderly Smokers Faces a Viral Respiratory Illness?", "description": "If the coronavirus death rate is connected to smoking, China is confronting a colossal problem.", "url": "https://www.nationalreview.com/corner/what-happens-when-a-nation-of-elderly-smokers-faces-a-viral-respiratory-illness/", "urlToImage": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/smoke-.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-02-24T16:45:36Z", "content": null}, {"source": {"id": null, "name": "Vancouversun.com"}, "author": "Stephanie Ip", "title": "B.C. health officials to share update on COVID-19 on Monday", "description": "Health Minister Adrian Dix and provincial health officer Dr. Bonnie Henry will speak in a teleconference at 9 a.m.", "url": "https://vancouversun.com/news/local-news/b-c-health-officials-to-share-update-on-covid-19-on-monday", "urlToImage": "https://postmediavancouversun2.files.wordpress.com/2020/02/png-0204n-coronovirus-206.jpg", "publishedAt": "2020-02-24T16:41:53Z", "content": "B.C. health minister and provincial health officer are set to share an update on the coronavirus on Monday morning.\r\nHealth Minister Adrian Dix and provincial health officer Dr. Bonnie Henry will speak in a teleconference at 9 a.m. We will share updates as th… [+1588 chars]"}, {"source": {"id": null, "name": "Globalresearch.ca"}, "author": "Global Research News", "title": "Selected Articles: Bioweapons as Weapons of Modern Warfare?", "description": "Online independent analysis of US-led wars, rampant corruption, corporate greed, civil rights and fraudulent monetary transactions is invariably relegated to the bottom rung of search engine results. As a result we presently do not cover our monthly running c…", "url": "https://www.globalresearch.ca/selected-articles-bioweapons-weapons-modern-warfare/5704581", "urlToImage": "https://www.globalresearch.ca/wp-content/uploads/2018/01/bioweapons.jpg", "publishedAt": "2020-02-24T16:19:49Z", "content": "Online independent analysis of US-led wars, rampant corruption, corporate greed, civil rights and fraudulent monetary transactions is invariably relegated to the bottom rung of search engine results. \r\nAs a result we presently do not cover our monthly running… [+4831 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steven T. Wright", "title": "Kojima Productions Pulls Out Of GDC, Citing Coronavirus Concerns", "description": "Kojima Productions is the latest gaming company to announce that it will not be attending the Game Developers Conference in San Francisco in March due to the ongoing outbreak of the coronavirus (COVID-19). Studio founder Hideo Kojima was slated to give an hou…", "url": "https://www.gamespot.com/articles/kojima-productions-pulls-out-of-gdc-citing-coronav/1100-6474019/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1596/15969599/3638812-deathstranding.jpg", "publishedAt": "2020-02-24T16:12:00Z", "content": "Kojima Productions is the latest gaming company to announce that it will not be attending the Game Developers Conference in San Francisco in March due to the ongoing outbreak of the coronavirus (COVID-19). Studio founder Hideo Kojima was slated to give an hou… [+2241 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "The White House is preparing to ask Congress for emergency funding as coronavirus hits the US", "description": "The Trump administration is preparing to ask Congress for an emergency funding package to battle the coronavirus. But the administration remained undecided on Monday on the amount of funding it would request to counter the outbreak. \"This stuff is always mess…", "url": "https://www.businessinsider.com/white-house-preparing-request-coronavirus-funding-emergency-fight-omb-congress-2020-2", "urlToImage": "https://i.insider.com/5e53fc32fee23d110d508a34?width=1200&format=jpeg", "publishedAt": "2020-02-24T16:52:36Z", "content": "<ul><li>The Trump administration is preparing to ask Congress for an emergency funding package to battle the coronavirus.</li><li>But the administration remained undecided on Monday on the amount of funding it would request to counter the outbreak.</li><li>\"T… [+2049 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Kamesh Srinivasan", "title": "Indians will be eager to fire in World Cup", "description": "Final chance to impress selectors; China not in the fray due to travel restrictions", "url": "https://www.thehindu.com/sport/other-sports/indians-will-be-eager-to-fire-in-world-cup/article30905966.ece", "urlToImage": "https://www.thehindu.com/sport/other-sports/weowjb/article30905965.ece/ALTERNATES/LANDSCAPE_615/TH25CHINKI", "publishedAt": "2020-02-24T16:13:33Z", "content": "Host India will field a 55-member team, including around 20 shooters in the MQS section, while Olympic powerhouse China will not take part in the World Cup scheduled to be held at the Dr. Karni Singh Range, Tughlakabad, from March 16 to 25.\r\nWith travel restr… [+1700 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "World must prepare for 'potential pandemic': WHO chief", "description": "BEIJING: The World Health Organization warned countries on Monday (Feb 24) to be ready for a \"potential pandemic\" as new deaths and infections in Europe, the Middle East and Asia triggered more drastic efforts to contain the new coronavirus. The number of fat…", "url": "https://www.channelnewsasia.com/news/world/world-must-prepare-for-potential-pandemic-who-chief-12466508", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12466576/16x9/991/557/11853cd2b3c6293ceae4749435bca913/zy/skorea-virus.jpg", "publishedAt": "2020-02-24T16:50:37Z", "content": "BEIJING: The World Health Organization warned countries on Monday (Feb 24) to be ready for a \"potential pandemic\" as new deaths and infections in Europe, the Middle East and Asia triggered more drastic efforts to contain the new coronavirus.\r\nThe number of fa… [+4847 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Pandemic fears grip Wall Street, Dow dives 800 points", "description": "The Dow Jones Industrials fell more than 800 points and the S&P 500 as well as the Nasdaq hit three-week lows on Monday as a surge in coronavirus cases outside China fueled global growth worries and pushed investors to safer assets.", "url": "https://www.channelnewsasia.com/news/business/pandemic-fears-grip-wall-street--dow-dives-800-points-12466046", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12466588/16x9/991/557/bbd423411910501364d895ad76165ae9/eD/specialist-trader-works-at-his-post-on-the-floor-at-the-nyse-in-new-york-1.jpg", "publishedAt": "2020-02-24T16:45:40Z", "content": "REUTERS: The Dow Jones Industrials fell more than 800 points and the S&amp;P 500 as well as the Nasdaq hit three-week lows on Monday as a surge in coronavirus cases outside China fueled global growth worries and pushed investors to safer assets.\r\nAn increase … [+2600 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "COVID-19 scare drags equities", "description": "ICICI Bank, HDFC among top losers in Sensex pack; Nifty down over 2%", "url": "https://www.thehindu.com/business/markets/covid-19-scare-drags-equities/article30906314.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-02-24T16:48:51Z", "content": "Indian benchmark equity indices lost around 2% on Monday amid an overall weak trend in most markets, as investors remained jittery over concerns related to the global impact of coronavirus outbreak after South Korea reported a rise in the number of cases.\r\nTh… [+2089 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Sam Bourgi", "title": "The Real Reason the Stock Market Is Crashing", "description": "U.S. stocks plunged on Monday over mounting recession risks. Tech stocks were the hardest hit, with the Nasdaq crashing by as much as 4.3%. The post The Real Reason the Stock Market Is Crashing appeared first on CCN.com", "url": "https://www.ccn.com/the-real-reason-the-stock-market-is-crashing/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/Stock-market-3.jpg", "publishedAt": "2020-02-24T17:09:14Z", "content": "<ul><li>The major U.S. indexes plunged on Monday, as wildly overpriced technology shares sold off over fears of a long-overdue recession.</li><li>The technology-focused Nasdaq Composite Index declined by as much as 4.3%.</li><li>Global recession risks could l… [+3673 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Hanna Lustig)", "title": "PewDiePie spoke in mock-Chinese and made coronavirus jokes his comeback video, and he doubled down in his latest post", "description": "In a video, Kjellberg made jokes about the outbreaks currently threatening lives in China, South Korea, Italy, and Iran. Now he's facing backlash.", "url": "https://news.yahoo.com/pewdiepie-spoke-mock-chinese-made-170519752.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0ppiOgj2f7de5pxOkasx.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NTkuNzIxMDExMzMzOTE0Ng--/https://s.yimg.com/uu/api/res/1.2/00jOFH1t_lgWbobTHzn2Rg--~B/aD04NjA7dz0xMTQ3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/EN/insider_articles_922/34d66d3f5602e43c11530b34a3194895", "publishedAt": "2020-02-24T17:05:19Z", "content": "Felix \"Pewdiepie\" Kjellberg is among YouTube's most popular creators.\r\nPewdiepie/YouTube\r\n<ul><li>YouTuber and gamer Felix \"PewDiePie\" Kjellberg is once again at the center of internet controversy. \r\n</li><li>In his first video following his month-long hiatus… [+3323 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Live from a Lounge", "title": "COVID19 Outbreak: Singapore Airlines cuts more services to India, GoAir, Air India and others follow", "description": "Air India and GoAir have followed Singapore Airlines into cancelling flights and there is a fairly limited number of flights to Singapore at the moment due to falling demand. The post COVID19 Outbreak: Singapore Airlines cuts more services to India, GoAir, Ai…", "url": "https://livefromalounge.boardingarea.com/2020/02/24/singapore-airlines-flights-cut/", "urlToImage": "https://livefromalounge.boardingarea.com/wp-content/uploads/2017/12/Singapore_3-1024x768.jpg", "publishedAt": "2020-02-24T17:03:29Z", "content": "The CoronaVirus situation is affecting the operations of many airlines, who firstly cut short their schedules into China and other territories where the outbreak centred, and have now seen such a loss of demand that they are cutting schedules all over the pla… [+2677 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "Iran says 12 dead from new virus, rejects higher death toll", "description": "DUBAI, United Arab Emirates (AP) — Iran's government said Monday that 12 people had died nationwide from the new coronavirus, rejecting claims of a much higher death toll by a lawmaker from the city of Qom that has been at the epicenter of the virus in the co…", "url": "https://www.bostonherald.com/2020/02/24/iran-says-12-dead-from-new-virus-rejects-higher-death-toll/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/02/Iran_Virus_Outbreak_02716-1-1.jpg?w=1024&h=683", "publishedAt": "2020-02-24T16:41:53Z", "content": "By AYA BATRAWY\r\nDUBAI, United Arab Emirates (AP) Irans government said Monday that 12 people had died nationwide from the new coronavirus, rejecting claims of a much higher death toll by a lawmaker from the city of Qom that has been at the epicenter of the vi… [+7295 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Intel unveils new data center processor, 5G chip", "description": "Intel Corp on Monday launched new microprocessors, including a second generation Xeon processor for data centers and a 10nm chip for wireless 5G base stations.", "url": "https://www.channelnewsasia.com/news/business/intel-unveils-new-data-center-processor--5g-chip-12466638", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12466636/16x9/991/557/d227c98c4dcc9c27da75368008b3a5e9/Pq/u-s--chipmaker-intel-corp-s-logo-is-seen-on-their--quot-smart-building-quot--in-petah-tikva--near-tel-aviv-8.jpg", "publishedAt": "2020-02-24T17:01:41Z", "content": "REUTERS: Intel Corp on Monday launched new microprocessors, including a second generation Xeon processor for data centers and a 10nm chip for wireless 5G base stations.\r\nDemand from cloud computing companies have boosted sales of server chips, leading to stro… [+1434 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Price", "title": "Monday evening news briefing: Is it safe to travel as coronavirus takes hold in Europe?", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here. For two-minute audio updates, try The Briefing - on podcasts, smart speakers and WhatsApp. Travel advice updated as coronavirus grips continent Seven p…", "url": "https://news.yahoo.com/monday-evening-news-briefing-safe-161549765.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ZXfJNjf7CylxpCRHZdKh0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/h0za5nrpu6ocFVvNGKUImw--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/85f65bb6d121afa8bbb002cea7f20513", "publishedAt": "2020-02-24T16:15:49Z", "content": "Military officers outside Milan cathedral - FLAVIO LO SCALZO/REUTERS\r\nIf you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here. For two-minute audio updates, try The Briefing - on podcasts, smart speakers and … [+5056 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Business Standard", "title": "Coronavirus woes: Sensex falls over 800 points, all Nifty stocks end in red", "description": "The last time all Nifty components had ended with losses was in November 2013", "url": "https://www.business-standard.com/article/economy-policy/coronavirus-woes-sensex-falls-over-800-points-all-nifty-stocks-end-in-red-120022401455_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-01/06/full/1578325552-2465.jpg", "publishedAt": "2020-02-24T17:02:00Z", "content": "The benchmark indices logged their largest single-day drop since the Union Budget, amid fears that the outbreak has now become a global pandemic. With an increase in the number of cases outside China, market players said investors are worried over a prolonged… [+2769 chars]"}, {"source": {"id": null, "name": "Thenewhumanitarian.org"}, "author": null, "title": "In the news: Coronavirus cases surge outside China", "description": "Iran’s neighbours shut their borders as Covid-19 reaches new countries in the Middle East. But closures can also push migrants to underground networks.", "url": "http://www.thenewhumanitarian.org/news/2020/02/24/coronavirus-spread-border-closures-covid-19-iran-middle-east-kuwait-bahrain-afghanistan-migrants", "urlToImage": "http://assets.irinnews.org/s3fs-public/styles/responsive_large/public/tnh-coronavirus-spread-border-closures-covid-19-iran-middle-east-kuwait-bahrain-afghanistan-migrants-thumbnail.jpg?Lg4iTyaLh9T89mK2AeaV2nvKTLGuSQje", "publishedAt": "2020-02-24T16:22:53Z", "content": "Countries in the Middle East and South Asia ratcheted up border closures on Monday amid a surge of coronavirus cases in Iran and fears that an outbreak once largely limited to China is gaining a global foothold.\r\nAfter denying the existence of coronavirus wit… [+2127 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Ang Hwee Min", "title": "Singapore universities suspend student exchange programmes to South Korea after COVID-19 outbreak", "description": "SINGAPORE: The National University of Singapore (NUS), Nanyang Technological University (NTU) and Singapore Management University (SMU) have suspended all student exchange programmes to South Korea after an outbreak of COVID-19 cases there. This comes after S…", "url": "https://www.channelnewsasia.com/news/singapore/covid19-coronavirus-nus-ntu-smu-singapore-south-korea-12466308", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/11467860/16x9/991/557/4e6b74f2d3dd67bb2f878472c9c42495/qY/nus-hall-file-photo-3.jpg", "publishedAt": "2020-02-24T16:18:03Z", "content": "SINGAPORE: The National University of Singapore (NUS), Nanyang Technological University (NTU) and Singapore Management University (SMU) have suspended all student exchange programmes to South Korea after an outbreak of COVID-19 cases there.\r\nThis comes after … [+4354 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Helen Coffey, Helen Coffey", "title": "Mother and daughter accused of starting 'full-on fight' on easyJet flight", "description": "Pair sparks 'riot' after drinking pink gin", "url": "https://www.independent.co.uk/travel/news-and-advice/easyjet-fight-punch-cabin-crew-riot-drunk-manchester-plane-trial-karin-carrie-parkes-a9355586.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/15/00/2020-01-20T123548Z-2014027325-RC2OJE9H1EUT-RTRMADP-3-EASYJET-OUTLOOK.JPG", "publishedAt": "2020-02-24T17:00:20Z", "content": "A mother and daughter allegedly started a full on fight on a flight after verbally abusing cabin crew and even taking a swing at a flight attendant.\r\nKarin Parkes, 56, and daughter Carrie, 36, are currently on trial at Manchester Magistrates Court having been… [+28437 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "Nick Kindelsperger", "title": "Chinatown food crawl organized for tonight to help restaurants struggling because of coronavirus fears", "description": "Few places are packed with as many great restaurants as Chicago’s Chinatown. There are so many places, it took our whole department more than a month to try and visit them all. Unfortunately, many of these restaurants have seen dramatic drops in visitors over…", "url": "https://www.chicagotribune.com/dining/ct-food-chinatown-food-crawl-coronavirus-20200224-ypw2vvqyszfmxn6xx4upuikupe-story.html", "urlToImage": "https://www.chicagotribune.com/resizer/VAox2dg2DCyAPeOeJcTuBIsVh9A=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/BJRXEMDHVFH2DGHALXNULUSSAA.jpg", "publishedAt": "2020-02-24T16:14:54Z", "content": null}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Kim Bielenberg", "title": "Choose the window seat and bring your own hand sanitiser - how to protect yourself from coronavirus", "description": "With the global death toll heading towards 3,000 and almost 80,000 people infected, how can we protect ourselves from the spread of the virus known as Covid-19?", "url": "https://www.independent.ie/world-news/coronavirus/choose-the-window-seat-and-bring-your-own-hand-sanitiser-how-to-protect-yourself-from-coronavirus-38985797.html", "urlToImage": "https://www.independent.ie/incoming/afe11/38985908.ece/alternates/w700/LTH-ITALY-80.jpg", "publishedAt": "2020-02-24T17:04:06Z", "content": "With the global death toll heading towards 3,000 and almost 80,000 people infected, how can we protect ourselves from the spread of the virus known as Covid-19?The World Health Organisation and other medical experts have issued guidelines for members of the p… [+3243 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Two more Indians on board cruise ship test positive for coronavirus: Embassy", "description": "Two more Indian crew members on board a cruise ship moored off the Japan coast have tested positive for coronavirus, taking the total number of infected Indians on the vessel to 14, the Indian embassy here said on Monday. The mission also expressed hope that …", "url": "https://timesofindia.indiatimes.com/india/two-more-indians-on-board-cruise-ship-test-positive-for-coronavirus-embassy/articleshow/74289953.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74289932,width-1070,height-580,imgsize-199587,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-24T16:47:22Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Commondreams.org"}, "author": null, "title": "Health Experts Warn World Is Approaching 'Tipping Point' In Spread of Coronavirus as Outbreaks Erupt in Italy and Iran", "description": "Julia Conley, staff writer Even as world health officials were encouraged Monday by reports out of China that the spread of coronavirus first detected in Wuhan is slowing, two months after outbreaks first began, authorities warned that the virus is now spread…", "url": "https://www.commondreams.org/news/2020/02/24/health-experts-warn-world-approaching-tipping-point-spread-coronavirus-outbreaks", "urlToImage": "https://www.commondreams.org/sites/default/files/headline/thumbs/gettyimages-1202993197.png", "publishedAt": "2020-02-24T16:42:38Z", "content": "World health officials warned Monday that the coronavirus that started in China two months ago is now spreading rapidly in other countries and that the world is fast approaching a \"tipping point\" with the virus.\r\n\"The tipping point after which our ability to … [+4962 chars]"}, {"source": {"id": null, "name": "Lawfareblog.com"}, "author": "Elliot Setzer", "title": "Today’s Headlines and Commentary", "description": "U.S. District Court Judge Amy Berman Jackson, who sentenced President Trump’s advisor Roger Stone to more than three years in prison on Friday, has rejected Stone’s request that she withdraw from the case before ruling on a pending new trial motion challengin…", "url": "https://www.lawfareblog.com/todays-headlines-and-commentary-2015", "urlToImage": "https://www.lawfareblog.com/lawfare-default.png", "publishedAt": "2020-02-24T16:48:58Z", "content": "U.S. District Court Judge Amy Berman Jackson, who sentenced President Trumps advisor Roger Stone to more than three years in prison on Friday, has rejected Stones request that she withdraw from the case before ruling on a pending new trial motion challenging … [+2698 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, USA TODAY", "title": "Italy coronavirus outbreak causes Italians to empty supermarket shelves as epidemic spreads", "description": "Northern Italy residents cleared the shelves at a supermarket amid fears around the coronavirus outbreak.", "url": "https://www.usatoday.com/videos/news/health/2020/02/24/italy-coronavirus-outbreak-residents-clear-grocery-shelves/4856518002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/24/USAT/282def9e-c8c8-4be5-8f7b-740112933759-VPC_EMPTY_SHELVES_CORONAVIRUS_DESK_THUMB.00_02_30_09.Still006.jpg?quality=10", "publishedAt": "2020-02-24T16:21:48Z", "content": null}, {"source": {"id": null, "name": "Marketplace.org"}, "author": "Marketplace / David Brancaccio", "title": "Markets worldwide slide with new coronavirus cases", "description": "Bahrain, Kuwait and Afghanistan report first-time infections, while South Korea and Italy see sharp increases in cases. Lowes and Home Depot will be releasing their quarterly earnings. The SCOTUS hears a case over the contested $8 billion Atlantic Coast Pipel…", "url": "https://www.marketplace.org/shows/marketplace-morning-report/markets-worldwide-slide-with-new-coronavirus-cases", "urlToImage": "https://www.marketplace.org/wp-content/uploads/2020/02/GettyImages-1202994373-16x9-1.jpg?w=1200", "publishedAt": "2020-02-24T16:17:49Z", "content": "Latest Episodes\r\nSign up for \"Econ Extra Credit\"Here"}]