[{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Gupta on Trump's claim: Here's the real information", "description": "CNN's Dr. Sanjay Gupta provides data on the coronavirus after President Trump said he has a \"hunch\" that the death rate is lower than 3.4%.", "url": "https://www.cnn.com/videos/health/2020/03/05/trump-coronavirus-fatality-rate-hunch-gupta-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305095044-sanjay-gupta-newsroom-3-5-2020-super-tease.jpg", "publishedAt": "2020-03-05T15:14:06Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Danny Crichton", "title": "South Korea passes one of the world’s first comprehensive cryptocurrency laws", "description": "The South Korean National Assembly passed new legislation today that will provide a framework for the regulation and legalization of cryptocurrencies and crypto exchanges. In a unanimous vote during a special session of the legislature convened amidst the cou…", "url": "http://techcrunch.com/2020/03/05/south-korea-passes-one-of-the-worlds-first-comprehensive-cryptocurrency-laws/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/8496230391_58e1c0f1ab_o.jpg?w=648", "publishedAt": "2020-03-05T16:07:24Z", "content": "The South Korean National Assembly passed new legislation today that will provide a framework for the regulation and legalization of cryptocurrencies and crypto exchanges.\r\nIn a unanimous vote during a special session of the legislature convened amidst the co… [+2878 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Nicole Gallucci", "title": "Trump criticized after making careless comments about the coronavirus on Fox News", "description": "Please, do some research before listening to anything Donald Trump says about the coronavirus. In an interview with Fox News on Wednesday night, Trump spoke very freely about the new coronavirus (which results in the disease that's been officially named COVID…", "url": "https://mashable.com/article/donald-trump-coronavirus-sick-work-from-home/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F05%252F41%252F0b0805eafadf4812b685a84d1b0f4a37.2be64.png%252F1200x630.png?signature=0kyVPnaFH-NqTLbfvdQEYghLH4I=", "publishedAt": "2020-03-05T15:42:43Z", "content": "Please, do some research before listening to anything Donald Trump says about the coronavirus.\r\nIn an interview with Fox News on Wednesday night, Trump spoke very freely about the new coronavirus (which results in the disease that's been officially named COVI… [+3137 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "The Rich Are Preparing for Coronavirus Differently", "description": "The new coronavirus knows no national borders or social boundaries. That doesn't mean that social boundaries don't exist. An anonymous reader shares a report: \"En route to Paris,\" Gwyneth Paltrow wrote on Instagram last week, beneath a shot of herself on an a…", "url": "https://slashdot.org/story/20/03/05/1446220/the-rich-are-preparing-for-coronavirus-differently", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2020-03-05T16:01:00Z", "content": "\"En route to Paris,\" Gwyneth Paltrow wrote on Instagram last week, beneath a shot of herself on an airplane heading to Paris Fashion Week and wearing a black face mask. \"I've already been in this movie,\" she added, referring to her role in the 2011 disease th… [+2132 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "dgoldfinger9", "title": "2 new COVID-19 cases confirmed in Ontario, bringing province’s total to 22 - Global News", "description": "2 new COVID-19 cases confirmed in Ontario, bringing province’s total to 22 Global News Two new coronavirus cases in Ontario, pushing provincewide total to 22 Kamloops Matters Two new cases of COVID-19 confirmed in Ontario, total rises to 22 CTV News Coronavir…", "url": "http://globalnews.ca/news/6635014/2-new-covid-19-cases-ontario-province-total-22/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/cpt10749761-5.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-05T16:01:02Z", "content": "Two new cases of COVID-19 have been confirmed in Ontario, bringing the province’s total number to 22.\r\nOf all the cases, the first four in the province have been resolved, with each of those patients testing negative consecutively at least 24 hours apart.\r\nA … [+1869 chars]"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Chris Herhalt", "title": "Ontario confirms three new cases of COVID-19, one more patient recovers - CP24 Toronto's Breaking News", "description": "Ontario confirms three new cases of COVID-19, one more patient recovers CP24 Toronto's Breaking News Person who travelled to Vegas tests positive for coronavirus; Toronto Public Health monitoring Toronto Star Some Ontario hospitals ready to create stand-alone…", "url": "https://www.cp24.com/news/province-confirms-three-new-cases-of-covid-19-raising-total-to-23-1.4840054", "urlToImage": "https://www.cp24.com/polopoly_fs/1.4829892.1582811303!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-05T15:41:00Z", "content": null}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Medha Singh and Sanjana Shivdas", "title": "Markets tumble as California declares coronavirus emergency - Global News", "description": "Markets tumble as California declares coronavirus emergency Global News Wall Street set to continue wild week as Dow futures point to around 200 point opening drop CNBC Stock market seesaw continues as TSX and Dow Jones sell off Thursday CBC.ca The stock mark…", "url": "http://globalnews.ca/news/6635017/wall-street-tsx-california-emergency-coronavirus/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/nyrd103-35_2020_130507-2.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-05T16:05:13Z", "content": "U.S. stock markets dropped more than 2% on Thursday as the swift spread of the coronavirus in the United States led California to declare an emergency, while airline stocks were hammered by crippled travel demand.\r\nDown almost 12% last week – its worst since … [+2947 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Plunges 800 Points, As Coronavirus Stock Market Correction Continues; 10-Year Yield Slides Below 1% - Investor's Business Daily", "description": "Dow Jones Plunges 800 Points, As Coronavirus Stock Market Correction Continues; 10-Year Yield Slides Below 1% Investor's Business Daily Dow plunges 950 points on coronavirus fears, giving up most of Wednesday's gains CNBC Dow drops again, continuing a wild we…", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-plunges-coronavirus-stock-market-correction-apple-stock/", "urlToImage": "https://www.investors.com/wp-content/uploads/2017/07/SMT0300_bear_072717_adobe.jpg", "publishedAt": "2020-03-05T15:14:00Z", "content": "The Dow Jones Industrial Average plunged as much as 841 points early Thursday before sharply rebounding in midmorning trade, as the coronavirus stock market correction continued. The 10-year Treasury yield slid back below 1% amid the flight to safer assets.\r\n… [+4882 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Sophia Ankel), Sophia Ankel", "title": "From school bans to death penalties: Here's how seriously different countries are taking the coronavirus outbreak", "description": "China Daily via Reuters As thousands of coronavirus cases are being recorded across the world, governments are trying everything to clamp down on its rapid spread. China has borne the brunt of the epidemic, and has the most extreme response. Other countries h…", "url": "https://www.businessinsider.com/coronavirus-how-us-china-italy-other-countries-handling-outbreaks-2020-3", "urlToImage": "https://i.insider.com/5e5f7a54fee23d6dc82a4166?width=1200&format=jpeg", "publishedAt": "2020-03-05T15:46:16Z", "content": "As the number of global coronavirus cases approaches 95,000, the world is struggling to cope with its spread.\r\nFrom Saudi Arabia to Japan and France, governments have taken a range of measures to stop the spread of the virus as quickly as possible.\r\nTravel re… [+281 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Haven Orecchio-Egresitz), Haven Orecchio-Egresitz", "title": "Businesses are selling face masks for hundreds of dollars to profit off of the coronavirus and authorities are cracking down", "description": "Getty Images Face masks are being sold for hundreds of dollars and New York City has cracked down on predatory pricing. Businesses found to be taking advantage of coronavirus fears by price gouging sanitary items can be fined up to $500. Online retailers have…", "url": "https://www.businessinsider.com/businesses-selling-masks-ridiculous-prices-nyc-says-no-more-2020-3", "urlToImage": "https://i.insider.com/5e611a33fee23d1912353cb4?width=1200&format=jpeg", "publishedAt": "2020-03-05T15:45:28Z", "content": "Unless you're sick, you're not supposed to be buying facemasks (there is a shortage.) \r\nStill, people are stocking up in fear and businesses have been taking advantage of the coronavirus panic by charging worried shoppers hundreds of dollars per box.\r\nIn New … [+2222 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "rmahbubani@businessinsider.com (Rhea Mahbubani), Rhea Mahbubani", "title": "'Whether healthy or sick, please don't lick': Washington state urges voters to avoid licking the envelopes of mail-in ballots amid coronavirus outbreak", "description": "REUTERS/Brian Snyder/File Photo Amid the ongoing coronavirus outbreak, Washington state voters are being asked not to lick the envelopes that contain their mail-in ballots for the March 10 primary election. On Twitter, Secretary of State Kim Wyman appealed to…", "url": "https://www.businessinsider.com/washington-state-asks-voters-no-licking-mail-in-ballots-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e6118a1fee23d07ff332134?width=1200&format=jpeg", "publishedAt": "2020-03-05T15:48:33Z", "content": "Health officials in Washington are asking people to break from the habit of sealing an envelope by licking it. Particularly, ahead of the March 10 primary.\r\nThe state has been the worst hit by the coronavirus outbreak in the United States: 39 people have been… [+1343 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Hyung-Jin Kim / AP", "title": "Kim Jong Un Expresses ‘Condolences’ Over Coronavirus Outbreak in South Korea", "description": "The North Korean leader sent a personal letter to South Korean President Moon Jae-in to express condolences over the coronavirus outbreak", "url": "https://time.com/5797181/kim-jong-un-coronavirus-south-korea/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/kim-jongun-coronavirus-condolences.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-05T15:34:38Z", "content": "(SEOUL, South Korea) — North Korean leader Kim Jong Un sent a personal letter to South Korean President Moon Jae-in to express his condolences over a soaring viral outbreak, Seoul officials said Thursday.\r\nIt wasn’t immediately clear if Kim’s letter was an at… [+2222 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Teresa Wright", "title": "Trudeau warns against 'knee-jerk' reactions to coronavirus outbreak - The Globe and Mail", "description": "Misinformation being spread about the virus is having negative impacts on some communities’ ability to keep their populations safe, the Prime Minister said", "url": "https://www.theglobeandmail.com/canada/article-global-affairs-upgrades-advisory-warns-against-all-travel-to-iran-due/", "urlToImage": "https://www.theglobeandmail.com/resizer/vGso-S45IVQoABAtV4QdCW44qEo=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/QWKMRKXBPFAKRI5537ZET2XDBY.jpg", "publishedAt": "2020-03-05T15:12:58Z", "content": "Prime Minister Justin Trudeau speaks to the media while touring the Lion Electric bus factory, in St-Jerome, Que., on March 4, 2020.\r\nRyan Remiorz/The Canadian Press\r\nOn Friday, health columnist Andre Picard will take reader questions during a live Facebook Q… [+3814 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Another global authority slashes its growth forecast to near-standstill levels, as experts brace for the worst economy since the financial crisis", "description": "The coronavirus outbreak could push the global economy to grow at its slowest pace since the financial crisis a decade ago, a new report said Thursday. The respiratory illness COVID-19 has spread to at least 76 countries, upending global supply chains and bro…", "url": "https://markets.businessinsider.com/news/stocks/global-growth-forecast-coronavirus-worst-pace-financial-crisis-cut-iif-2020-3-1028969145", "urlToImage": "https://images.markets.businessinsider.com/image/5e57ee5afee23d651c60ef23-2400/gettyimages-1199934178.jpg", "publishedAt": "2020-03-05T15:52:01Z", "content": "GLYN KIRK/AFP/Getty Images\r\n<ul><li>The coronavirus outbreak could push the global economy to grow at its slowest pace since the financial crisis a decade ago, a new report said Thursday. </li><li>The respiratory illness COVID-19 has spread to at least 76 cou… [+1817 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Boris Veldhuijzen van Zanten", "title": "Lessons learned from my company’s crisis", "description": "Boris is the wise ol’ CEO of TNW who writes a weekly column on everything about being an entrepreneur in tech — from managing stress to embracing awkwardness. You can get his musings straight to your inbox by signing up for his newsletter! Last Tuesday, we an…", "url": "https://thenextweb.com/growth-quarters/2020/03/05/lessons-learned-from-my-companys-crisis/", "urlToImage": "https://img-cdn.tnwcdn.com/image/growth-quarters?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fthenextweb.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2Fboris-crisis.png&signature=6a2a2e6b2743ed35aec25daf3675fbf4", "publishedAt": "2020-03-05T15:44:24Z", "content": "Boris is the wise ol CEO of TNW who writes a weekly column on everything about being an entrepreneur in tech from managing stress to embracing awkwardness. You can get his musings straight to your inbox by signing up for his newsletter!\r\nLast Tuesday, we anno… [+5772 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Kevin Nielsen", "title": "Public Health confirms 1st COVID-19 case in Waterloo Region - Global News", "description": "Region of Waterloo Public Health says a woman in her 50s contracted the virus during a recent trip to Italy.", "url": "http://globalnews.ca/news/6635112/1st-covid-19-case-waterloo/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/cpt10749761-4.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-05T16:10:01Z", "content": "COVID-19 has arrived in Waterloo Region, according to public health officials.\r\n“Last evening, we received mandatory confirmation of our first case of COVID19, also known as novel coronavirus in Waterloo region,” Dr. Hsiu-Li Wang, the Regions Acting Medical O… [+2505 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Justin T. Westbrook", "title": "Ram CEO Quits After Uncovering Decades-Long Sales Scandal", "description": "Ram ’s CEO is out, more automakers are going on Coronavirus lock down, farmers are still fighting John Deere, and much, much more in The Morning Shift for March 5, 2020. Read more...", "url": "https://jalopnik.com/ram-ceo-quits-after-uncovering-decades-long-sales-scand-1842117470", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/age32gsh2xmvr9tpfnv4.png", "publishedAt": "2020-03-05T15:26:00Z", "content": "Rams CEO is out, more automakers are going on Coronavirus lock down, farmers are still fighting John Deere, and much, much more in The Morning Shift for March 5, 2020. \r\n1st Gear: Whistleblowing Out The Door\r\nReid Bigland, the CEO of FCAs Ram, is quitting at … [+8370 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Zach Epstein", "title": "Apple’s iPhone 9 is reportedly delayed due to coronavirus", "description": "There's no question whatsoever that Apple's upcoming iPhone 12 series is the most hotly anticipated launch of 2020. We're still six months away from Apple making the new iPhone 12 and iPhone 12 Pro models official and yet there are already rumors flying left …", "url": "https://bgr.com/2020/03/05/iphone-9-release-date-delayed-coronavirus/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/02/iphone-9.jpg?quality=98&strip=all", "publishedAt": "2020-03-05T16:02:01Z", "content": "There’s no question whatsoever that Apple’s upcoming iPhone 12 series is the most hotly anticipated launch of 2020. We’re still six months away from Apple making the new iPhone 12 and iPhone 12 Pro models official and yet there are already rumors flying left … [+4306 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "NYT News Service", "title": "Inside China's all-out war on coronavirus", "description": "China News: As the leader of the World Health Organization team that visited China, Dr Bruce Aylward feels he has been to the mountaintop — and has seen what's po.", "url": "https://timesofindia.indiatimes.com/world/china/inside-chinas-all-out-war-on-coronavirus/articleshow/74498930.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74499033,width-1070,height-580,imgsize-361810,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-05T16:10:49Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Tom Breihan", "title": "MGMT’s Andrew VanWynGarden Apparently Wrote An Upbeat Dance Song About Coronavirus", "description": "Right now, the coronavirus pandemic is scaring the fuck out of the entire world. It's causing music-festival cancellations and blockbuster-movie-release delays. It's convincing millions of us that we need to hoard bottled water and anti-bacterial wipes. It's …", "url": "https://www.stereogum.com/2075774/andrew-vanwyngarden-mgmt-coronavirus-song/news/", "urlToImage": "https://static.stereogum.com/uploads/2020/03/Andrew-VanWyngarden-1583420573-608x405.jpg", "publishedAt": "2020-03-05T15:35:55Z", "content": "Right now, the coronavirus pandemic is scaring the fuck out of the entire world. It’s causing music-festival cancellations and blockbuster-movie-release delays. It’s convincing millions of us that we need to hoard bottled water and anti-bacterial wipes. It’s … [+1719 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Ruairi Casey", "title": "All you need to know about travelling during coronavirus outbreak", "description": "Here is all you need to know if you are planning on travelling during the coronavirus epidemic.", "url": "https://www.aljazeera.com/news/2020/03/travelling-coronavirus-outbreak-200305125619635.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/22/bc47958957f346478a4157c72acfde1e_18.jpg", "publishedAt": "2020-03-05T15:51:17Z", "content": "The rapid spread of COVID-19 around the globe has thrown the international travel industry into chaos.\r\nIncreasing numbers of travellers are opting to stay home amid fear of exposure to the new coronavirus, which has spread to 79 countries since late December… [+6660 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steven Petite", "title": "Baby Yoda Toys Could Be Impacted As Hasbro Deals With Coronavirus", "description": "Hasbro's lineup of Baby Yoda toys could experience production delays due to the outbreak of COVID-19, commonly referred to as the coronavirus. In an SEC filing, the toy manufacturer explained that because the disease has caused factory closures in China--wher…", "url": "https://www.gamespot.com/articles/baby-yoda-toys-could-be-impacted-as-hasbro-deals-w/1100-6474431/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1595/15950357/3641614-3638070-baby%20yoda%20thumbnail.jpg", "publishedAt": "2020-03-05T15:27:00Z", "content": "Hasbro's lineup of Baby Yoda toys could experience production delays due to the outbreak of COVID-19, commonly referred to as the coronavirus. In an SEC filing, the toy manufacturer explained that because the disease has caused factory closures in China--wher… [+2067 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "John Follain", "title": "Italy Prepares $8.4 billion Stimulus to Counter Coronavirus", "description": "Italy has earmarked 7.5 billion euros ($8.4 billion) to counter the impact of the coronavirus epidemic in Europe’s virus epicenter.", "url": "https://www.bloomberg.com/news/articles/2020-03-05/italy-prepares-eu7-5-billion-stimulus-to-counter-coronavirus", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/it78_HMaNlsA/v1/1200x799.jpg", "publishedAt": "2020-03-05T15:58:12Z", "content": "Waiters stand in front of a empty restaurant at Piazza Navona in Rome on March 5.\r\nPhotographer: Alberto Pizzoli/AFP via Getty Images\r\nItaly has earmarked 7.5 billion euros ($8.4 billion) to counter the impact of the coronavirus epidemic in Europe’s virus epi… [+485 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jon Blistein", "title": "Hillary Clinton Criticizes Trump for Downplaying Coronavirus on ‘Fallon’", "description": "\"This is something that you can’t just insult or pretend it’s a hoax, despite how hard he’s trying\"", "url": "https://www.rollingstone.com/tv/tv-news/hillary-clinton-coronavirus-donald-trump-jimmy-fallon-tonight-show-962649/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/hillary-clinton-on-fallon.jpg", "publishedAt": "2020-03-05T15:37:05Z", "content": "Hillary Clinton said she hoped President Donald Trump would stop calling the coronavirus outbreak a hoax during an interview with Jimmy Fallon on The Tonight Show Wednesday.\r\nThe former Democratic presidential candidate said she wasn’t surprised by how the Tr… [+884 chars]"}, {"source": {"id": null, "name": "Economist.com"}, "author": "The Economist", "title": "Business this week", "description": "", "url": "https://www.economist.com/the-world-this-week/2020/03/07/business-this-week", "urlToImage": "https://www.economist.com/sites/default/files/20200307_WWP001.jpg", "publishedAt": "2020-03-05T16:09:45Z", "content": "Stockmarkets swung wildly following the worst sell-off over a week for more than a decade. The Federal Reserve made an emergency half-a-percentage-point cut to its benchmark interest rate, to a range of 1-1.25%. The Fed last cut rates by half a point in Octob… [+4668 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rick Munarriz)", "title": "3 Coronavirus Winners Hitting New Lows", "description": "A marketplace for contractors, a ridesharing specialist, and a proactive tech support provider are hitting new lows despite models that should be resilient to the COVID-19 worries.", "url": "https://www.fool.com/investing/2020/03/05/3-coronavirus-winners-hitting-new-lows.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561640/lyftfoursome.jpg", "publishedAt": "2020-03-05T15:22:00Z", "content": "You don't need to be a distributor of hand sanitizer or a promising biotech racing against the clock to find a COVID-19 vaccine to be seen by the market as an all-weather investment in this challenging climate. Some of the stocks bucking last week's sell-off … [+3567 chars]"}, {"source": {"id": null, "name": "Dailystar.co.uk"}, "author": "Michael Moran", "title": "Mysterious black rain falls on Japan...", "description": "A social media user asked \"are they secretly burning bodies of coronavirus victims?\" after the dark-coloured rain fell overnight just north of the Japanese capital Tokyo", "url": "https://www.dailystar.co.uk/news/weird-news/mysterious-black-rain-falls-japanese-21638038", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article21638042.ece/ALTERNATES/s1200/0_ESEfcRzUEAAMTip.jpg", "publishedAt": "2020-03-05T15:52:37Z", "content": "Days after one of the fiercest lightning storms on record struck Tokyo a mysterious black rain has fallen in Japan.\r\nThe rain, which looked like thin black paint, was not found to be radioactive and the cause of the strange colouration is currently being inve… [+2332 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "How Biotech ETFs Are Weathering the Coronavirus Storm", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-05/how-biotech-etfs-are-weathering-the-coronavirus-storm", "urlToImage": null, "publishedAt": "2020-03-05T16:01:07Z", "content": null}, {"source": {"id": null, "name": "Vox.com"}, "author": "Aaron Rupar", "title": "“This is just my hunch”: Trump goes on Fox News and spreads misinformation about the coronavirus", "description": "“This is just my hunch.”", "url": "https://www.vox.com/2020/3/5/21166031/trump-hannity-coronavirus-who-death-rate", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-pHiOTd9jXpeYsEk-An-sUmNUXc=/0x0:3954x2070/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19769546/1210172363.jpg.jpg", "publishedAt": "2020-03-05T15:45:00Z", "content": "Trump speaks to reporters outside the White House on Wednesday. | Mark Wilson/Getty Images Trump’s dangerous efforts to downplay the Covid-19 threat are out of step with experts from his own government. On the same day that the World Health Organization (WHO)… [+8676 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Supplies sell out at retailers amid coronavirus fears l ABC News - ABC News", "description": "Supplies sell out at retailers amid coronavirus fears l ABC News ABC News NYC Urges Self-Isolation for Visitors to 5 Nations: Virus Update Bloomberg Coronavirus UK news LIVE: Downing Street warns of ‘significant’ spread as Brit cases hit 116 The Sun Coronavir…", "url": "https://www.youtube.com/watch?v=I8x0QSCUFdg", "urlToImage": "https://i.ytimg.com/vi/I8x0QSCUFdg/maxresdefault.jpg", "publishedAt": "2020-03-05T15:22:57Z", "content": "Big box stores across the country are facing long lines and more demand for products like hand sanitizer, bottled water, baby wipes and toilet paper.\r\nKeep up with our latest on the developing novel coronavirus outbreak (COVID-19): https://abcnews.go.com/Heal… [+281 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By John Kemp", "title": "COLUMN-China and the world economy's shifting centre of gravity: Kemp", "description": "Most western policymakers and journalists view the world economy through a framework that is 10-15 years out of date, failing to account fully for the enormo...", "url": "https://news.yahoo.com/column-china-world-economys-shifting-152923338.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-05T15:29:23Z", "content": "(John Kemp is a Reuters market analyst. The views expressed are his own)\r\n* Chartbook: https://tmsnrt.rs/3cDGhkr\r\nBy John Kemp\r\nLONDON, March 5 (Reuters) - Most western policymakers and journalists view the world economy through a framework that is 10-15 year… [+8177 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "Coronavirus confirmed in Tennessee - AL.com", "description": "Coronavirus confirmed in Tennessee AL.com Williamson County, Franklin Special cancel school after coronavirus case confirmed in area; part of 'preparedness plan' Tennessean Tennessee Senate committee advances Gov. Bill Lee's wide-ranging abortion bill Tenness…", "url": "https://www.al.com/news/2020/03/coronavirus-confirmed-in-tennessee.html", "urlToImage": "https://www.al.com/resizer/W2uZaAfjoPexoUGPmtNeCbx4moI=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/4VJ7B6GDDNBQFPZQXJIXX4BMZ4.jpg", "publishedAt": "2020-03-05T16:04:00Z", "content": "Tennessee has confirmed its first case of coronavirus.\r\nGov. Bill Lee announced Thursday morning testing had confirmed a case in Williamson County, Tennessee. Williamson County is located south of Nashville, close to the area currently dealing with deadly tor… [+1282 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Tim Ingham", "title": "Coronavirus Has Hammered the Stock Market — But It Could Be Good for Warner Music Group’s IPO", "description": "\"Music is evergreen and songs are one of the very few precious assets that have little or no correlation to the wider stock market,\" explains music investor Merck Mercuriadis", "url": "https://www.rollingstone.com/music/music-features/coronavirus-stocks-warner-music-groups-ipo-962586/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/shutterstock_1427125169W.jpg", "publishedAt": "2020-03-05T15:36:37Z", "content": "You don’t have to be Gordon Gekko to see how spiraling anxiety over coronavirus has already wrought damage upon global industries. The arrival of James Bond’s latest outing, No Time To Die, is being delayed by six months after its backers decided that stay-at… [+6273 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Ulf Laessing", "title": "Coronavirus and protests wreck Iraq's pilgrimage industry", "description": "Iraqi hotel manager Badr al-Jilawi needs to think for a moment to remember when the last guest checked in to visit the holy Shi'ite Muslim city of Najaf, once a prime destination for millions of pilgrims.", "url": "https://www.reuters.com/article/us-health-coronavirus-iraq-pilgrimage-idUSKBN20S1ZO", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200305&t=2&i=1499156467&w=1200&r=LYNXMPEG241B5", "publishedAt": "2020-03-05T15:27:28Z", "content": "NAJAF, Iraq (Reuters) - Iraqi hotel manager Badr al-Jilawi needs to think for a moment to remember when the last guest checked in to visit the holy Shi’ite Muslim city of Najaf, once a prime destination for millions of pilgrims. \r\nWith the coronavirus spreadi… [+3924 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "With over 150 reserved beds, ICU facilties, face masks for medical personnel, Pune gets ready to tackle coronavirus", "description": "The civic body has also bought medicines worth Rs 15 lakh for the patients. A total of 306 passengers have arrived in Pune from countries affected by coronavirus", "url": "https://indianexpress.com/article/cities/pune/with-over-150-reserved-beds-icu-facilties-face-masks-for-medical-personnel-pune-gets-ready-to-tackle-coronavirus-6301334/", "urlToImage": "https://images.indianexpress.com/2020/03/eye.jpg?w=759", "publishedAt": "2020-03-05T15:38:52Z", "content": "Till now, 90 patients have been admitted to Naidu hospital and kept in the isolation ward (Representational: Express Photo by Anoop K Venu)Stepping up its preparedness to tackle any likely cases of novel coronavirus in the city, the Pune Municipal Corporation… [+3056 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Abner Li", "title": "Play Store suggests apps to ‘stay informed’ about coronavirus as search still disabled", "description": "Google Play earlier this week disabled Android app and game searches for COVID-19. That’s still the case today, but the Play Store is now offering a curated list of apps to “Stay informed” about the coronavirus. more… The post Play Store suggests apps to ‘sta…", "url": "https://9to5google.com/2020/03/05/play-store-coronavirus-apps/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2019/10/Google-Play-Store.jpg?quality=82&strip=all", "publishedAt": "2020-03-05T16:00:59Z", "content": "Google Play earlier this week disabled Android app and game searches for COVID-19. That’s still the case today, but the Play Store is now offering a curated list of apps to “Stay informed” about the coronavirus.\r\nVisitors of the primary “Apps” tab today are e… [+1660 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Pierre Briançon", "title": "Finance trade group forecasts weakest global growth since the recession", "description": "IIF says global growth in 2020 could be “the weakest since the financial crisis”", "url": "http://www.marketwatch.com/story/finance-trade-group-forecasts-weakest-global-growth-since-the-recession-2020-03-05", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB527_Growth_ZG_20200305095741.jpg", "publishedAt": "2020-03-05T15:12:04Z", "content": "The Chinese economy will grow by just 4% this year, and the U.S. gross domestic product will only expand by 1.3% because of the impact of the coronavirus outbreak, the Institute for International Finance said in a report Thursday.The IIF, the international tr… [+1380 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: WHO officials give update on COVID-19 response | LIVE - Global News", "description": "Coronavirus outbreak: WHO officials give update on COVID-19 response | LIVE Global News Coronavirus confirmed cases and fatalities, state by state Fox News Coronavirus Q&A: Expert answers your questions on Covid-19 Channel 4 News Here's how nanoparticles coul…", "url": "https://www.youtube.com/watch?v=1IQw6eeFPBk", "urlToImage": "https://i.ytimg.com/vi/1IQw6eeFPBk/maxresdefault_live.jpg", "publishedAt": "2020-03-05T15:29:21Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Ontario confirms 3 new cases of coronavirus, bringing total to 23 in province", "description": "Ontario health officials are confirming 3 more cases of novel coronavirus, on the same day they revealed another person has recovered from the illness.", "url": "https://www.cbc.ca/news/canada/toronto/ontario-confirms-3-new-cases-coronavirus-1.5486670", "urlToImage": "https://i.cbc.ca/1.5467781.1582208884!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/coronavirus-outbreak.jpg", "publishedAt": "2020-03-05T15:33:05Z", "content": "Ontario health officials are confirming 3 more cases of COVID-19, on the same day they revealed another person has recovered from the illness.\r\nLate on Thursday, Public Health confirmed the first positive case of the coronavirus in Peel region. The affected i… [+1772 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Davies", "title": "One million coronavirus test kit promise gets a reality check", "description": "The ambitious coronavirus testing target of a million kits ready by the end of the week isn’t going to be met, US lawmakers have admitted today, confirming that only a fraction of the COVID-19 tests will be ready by Friday. The Trump administration had previo…", "url": "https://www.slashgear.com/one-million-coronavirus-test-kit-promise-gets-a-reality-check-05612263/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/coronavirus-testkit-sample-5-1.jpg", "publishedAt": "2020-03-05T15:59:37Z", "content": "The ambitious coronavirus testing target of a million kits ready by the end of the week isn’t going to be met, US lawmakers have admitted today, confirming that only a fraction of the COVID-19 tests will be ready by Friday. The Trump administration had previo… [+3633 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Elizabeth Warren quits race", "description": "Democratic candidate Elizabeth Warren is dropping out of the race to challenge President Trump in november's general election. After a disappointing Super Tuesday saw Joe Biden and Bernie Sanders split the lions' share of delegates, no path to the nomination …", "url": "https://boingboing.net/2020/03/05/elizabeth-warren-quits-race.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/warren-and-bernie.jpg?fit=1125%2C671&ssl=1", "publishedAt": "2020-03-05T16:03:35Z", "content": "Democratic candidate Elizabeth Warren is dropping out of the race to challenge President Trump in november's general election. After a disappointing Super Tuesday saw Joe Biden and Bernie Sanders split the lions' share of delegates, no path to the nomination … [+2735 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "Bob Frisch, Cary Greene", "title": "What It Takes to Run a Great Virtual Meeting", "description": "Twelve keys to success.", "url": "https://hbr.org/2020/03/what-it-takes-to-run-a-great-virtual-meeting", "urlToImage": "https://hbr.org/resources/images/article_assets/2020/03/Mar20_05_157649554.jpg", "publishedAt": "2020-03-05T16:00:00Z", "content": "As companies scramble to protect employees from the spreading coronavirus with travel restrictions and remote work arrangements, theres a distinct possibility that in-person meetings with teams, customers, or suppliers may be canceled for days or potentially … [+5508 chars]"}, {"source": {"id": null, "name": "Economist.com"}, "author": "The Economist", "title": "A novel pandemic security is no match for a novel virus", "description": "Catastrophe finance is a work in progress", "url": "https://www.economist.com/finance-and-economics/2020/03/07/a-novel-pandemic-security-is-no-match-for-a-novel-virus", "urlToImage": "https://www.economist.com/sites/default/files/images/print-edition/20200307_FNP003_0.jpg", "publishedAt": "2020-03-05T16:09:29Z", "content": "IN SEPTEMBER 2017 Mexicos strongest earthquake in a century killed scores of people, flattened hundreds of buildings and left millions without power. The quake was also bad news for the holders of $150m-worth of catastrophe bonds, issued only a month before b… [+3335 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Steph Willems", "title": "2021 Genesis G80: Going Streakin’", "description": "Lexus has the spindle grille, BMW has kidneys, and Genesis now has twin horizontal streaks as its signature styling cue. Front and back and even on the sides, illuminated parallel lines are the next-generation G80 sedan’s defining design flourish. Revealed la…", "url": "https://www.thetruthaboutcars.com/2020/03/2021-genesis-g80-going-streakin/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2020/03/ag80.jpg", "publishedAt": "2020-03-05T15:31:10Z", "content": "Lexus has the spindle grille, BMW has kidneys, and Genesis now has twin horizontal streaks as its signature styling cue. Front and back and even on the sides, illuminated parallel lines are the next-generation G80 sedan’s defining design flourish.\r\nRevealed l… [+1710 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Scaramucci on the coronavirus: 'This could be President Trump's Hurricane Katrina'", "description": "SkyBridge Founder and Managing Partner Anthony Scaramucci says the coronavirus \"could be President Trump's Hurricane Katrina\". He joins Yahoo Finance's Julia La Roche to discuss President Trump's response to the coronavirus and the markets.", "url": "https://finance.yahoo.com/video/scaramucci-coronavirus-could-president-trumps-160921082.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/apAGNcyoeP7yHr39ngZySA--~B/aD0xMDg0O3c9MTkzMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/05/5e612436cbde736af98d1b71/5e612436cbde736af98d1b72_o_U_v2.jpg", "publishedAt": "2020-03-05T16:09:21Z", "content": "SkyBridge Founder and Managing Partner Anthony Scaramucci says the coronavirus \"could be President Trump's Hurricane Katrina\". He joins Yahoo Finance's Julia La Roche to discuss President Trump's response to the coronavirus and the markets."}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Evie Fordham", "title": "Coronavirus toilet paper shortage has U.S. retailers limiting purchases - Fox Business", "description": "Coronavirus toilet paper shortage has U.S. retailers limiting purchases Fox Business", "url": "https://www.foxbusiness.com/lifestyle/coronavirus-toilet-paper-australia-shortage-costco-buying", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/AP20063011881455.jpg?ve=1&tl=1", "publishedAt": "2020-03-05T16:10:30Z", "content": "Australians worried by the global coronavirus outbreak have bought so much toilet paper companies are limiting their purchases, and in the U.S. retailers are preparing for a similar reaction.\r\nAustralia's largest grocery chain, Woolworths, and Costco have cap… [+1929 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Victoria Murphy", "title": "Prince William Gushed About His Love for His Wife, Kate Middleton, to Crowds in Ireland - Yahoo Lifestyle", "description": "Prince William Gushed About His Love for His Wife, Kate Middleton, to Crowds in Ireland Yahoo Lifestyle Prince William calls on post-Brexit UK and Ireland to 'recommit to path of friendship' The Sun Kate Middleton Strikes a Pose in Her Chicest Photo Yet While…", "url": "https://www.yahoo.com/lifestyle/prince-william-gushed-love-wife-154100235.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/mroipLcipVNeS9eWbRI5rA--~B/aD04Njg7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/good_housekeeping_561/e1338189a415a0596d867e49028052bb", "publishedAt": "2020-03-05T15:41:00Z", "content": "From Good Housekeeping\r\nYesterday, the Duke and Duchess of Cambridge enjoyed a romantic clifftop walk through rural Ireland. And today William didnt miss the chance to tell the public how much he loves his wife as the couple met the crowds in Galway.\r\nOn the … [+2590 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Cortney Moore", "title": "Coronavirus hand sanitizer you can make at home — and it's doctor-approved - Fox Business", "description": "Coronavirus hand sanitizer you can make at home — and it's doctor-approved Fox Business", "url": "https://www.foxbusiness.com/lifestyle/diy-coronavirus-hand-sanitizer", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/Hand-Sanitizer.jpg?ve=1&tl=1", "publishedAt": "2020-03-05T15:33:11Z", "content": "As the number of confirmed coronavirus cases has surpassed 95,260 around the globe, shoppers have flooded stores of all types to snag a few bottles of hand sanitizer, which has left some shelves completely bare.\r\nAdd in the fact that supply chains have been s… [+3899 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Gabe Gurwin", "title": "Pokemon Go Battle League's Inaugural Season Begins Next Week", "description": "If you want to be the very best like no one ever was, then get ready for the inaugural season of Pokemon Go's Battle League. It begins on March 13 and offers trainers the chance to compete against the best players from around the globe and rise to the top. Be…", "url": "https://www.gamespot.com/articles/pokemon-go-battle-leagues-inaugural-season-begins-/1100-6474427/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1597/15971423/3641584-pokemon%20go%20battle%20league.jpg", "publishedAt": "2020-03-05T15:15:00Z", "content": "If you want to be the very best like no one ever was, then get ready for the inaugural season of Pokemon Go's Battle League. It begins on March 13 and offers trainers the chance to compete against the best players from around the globe and rise to the top.\r\nB… [+1382 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Ross Barkan", "title": "Albany's Dead-Of-Night Coronavirus Vote Gives Cuomo Sweeping New Emergency Powers", "description": "“We don’t fully understand the implications of the new powers versus the old ones.\" [ more › ]", "url": "https://gothamist.com/news/ny-coronavirus-cuomo-new-emergency-powers", "urlToImage": "https://cms.prod.nypr.digital/images/301654/fill-1200x650/", "publishedAt": "2020-03-05T16:11:20Z", "content": "In the wee hours of Tuesday morning, the state legislature approved $40 million in emergency funding to help contain the COVID-19 outbreak in New York. Buried within the legislation is a provision that has alarmed progressive lawmakers and advocates: an extra… [+5420 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Johnny Dodd", "title": "Surviving Coronavirus: 'It's Been A Life-Changing Experience,' Says Diamond Princess Passenger", "description": "After Carl Goldman’s fever broke, he spent hours isolated, pacing back and forth in his sealed-off room of Nebraska Medical Center’s biocontainment unit, where he’s been quarantined since testing positive for the new coronavirus. “Every seven steps I’d hit a …", "url": "https://people.com/health/surviving-coronavirus-its-been-a-life-changing-experience-says-diamond-princess-passenger/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcarl-goldman-4.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-05T16:00:32Z", "content": "After Carl Goldman’s fever broke, he spent hours isolated, pacing back and forth in his sealed-off room of Nebraska Medical Center’s biocontainment unit, where he’s been quarantined since testing positive for the new coronavirus.\r\n“Every seven steps I’d hit a… [+3359 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Danny Crichton", "title": "South Korea passes one of the world’s first comprehensive cryptocurrency laws", "description": "The South Korean National Assembly passed new legislation today that will provide a framework for the regulation and legalization of cryptocurrencies and crypto exchanges. In a unanimous vote during a special session of the legislature convened amidst the cou…", "url": "https://finance.yahoo.com/news/south-korea-passes-one-world-160724169.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/eME.920u9pRSHfXQPeUwhA--~B/aD0yNjQ0O3c9NDI4MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/15bcf0abf6dbc1557ac9b87f9f20fd6d", "publishedAt": "2020-03-05T16:07:24Z", "content": "The South Korean National Assembly passed new legislation today that will provide a framework for the regulation and legalization of cryptocurrencies and crypto exchanges.\r\nIn a unanimous vote during a special session of the legislature convened amidst the co… [+2878 chars]"}, {"source": {"id": null, "name": "Techrepublic.com"}, "author": "Natalie Eckerle", "title": "Coronavirus: What business pros need to know - TechRepublic", "description": "The coronavirus is spurring questions and concerns in the tech industry. Get tips on remote work, interviewing and hiring, travel, and cybersecurity, as well as the latest news about COVID-19.", "url": "https://www.techrepublic.com/article/covid-19-what-business-pros-need-to-know/", "urlToImage": "https://tr1.cbsistatic.com/hub/i/r/2020/03/04/9e27bb52-2b9b-4b28-97ac-1ab4b6ff6a7a/thumbnail/770x578/34cc7c31ccc275eb0ecfa3e616614e05/istock-1205872351.jpg", "publishedAt": "2020-03-05T15:30:00Z", "content": "The coronavirus is spurring questions and concerns in the tech industry. Get tips on remote work, interviewing and hiring, travel, and cybersecurity, as well as the latest news about COVID-19.\r\n COVID-19 is an infectious disease caused by a strain of coronavi… [+7148 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Evie Fordham", "title": "Coronavirus vaccine will be affordable, Moderna CEO says - Fox Business", "description": "The commitment comes as the U.S. has seen at least 11 deaths from the virus.", "url": "https://www.foxbusiness.com/lifestyle/coronavirus-vaccine-moderna-usa-trump", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/AP20050812837300.jpg?ve=1&tl=1", "publishedAt": "2020-03-05T15:11:59Z", "content": "Massachusetts-based biotech firm Moderna was the first U.S. company to get a coronavirus vaccine ready for human testing, and its CEO said the company would put the vaccine at the same price point as similar existing vaccines.\r\n\"We are highly aware this is a … [+2189 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. factory orders fall more than expected in January", "description": "New orders for U.S.-made goods fell more than expected in January and could drop further as a worldwide coronavirus outbreak strains supply chains and undercuts the manufacturing sector, which had recently shown signs of stabilizing after a prolonged slump.", "url": "https://www.reuters.com/article/us-usa-economy-factory-idUSKBN20S1YA", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-05T15:26:57Z", "content": "WASHINGTON (Reuters) - New orders for U.S.-made goods fell more than expected in January and could drop further as a worldwide coronavirus outbreak strains supply chains and undercuts the manufacturing sector, which had recently shown signs of stabilizing aft… [+2529 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Olivia Messer", "title": "New York City Is Prepping for Coronavirus Mayhem", "description": "Timothy A Clary/Getty Images On Sunday night, New York officials reported the first Manhattan case of the 2019 novel coronavirus. By Wednesday, Gov. Andrew Cuomo had announced four more cases in a 50-year-old lawyer, his wife, his son, his daughter, and the n…", "url": "https://www.thedailybeast.com/new-york-city-is-prepping-for-coronavirus-mayhem", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583422219/200304-messer-nyc-tease_o4spib", "publishedAt": "2020-03-05T15:38:10Z", "content": "On Sunday night, New York officials reported the first Manhattan case of the 2019 novel coronavirus. \r\nBy Wednesday, Gov. Andrew Cuomo had announced four more cases in a 50-year-old lawyer, his wife, his son, his daughter, and the neighbor who drove him to th… [+8774 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Shareholders Unite", "title": "Unanswered Coronavirus Questions, Now Is Not The Time For Heroics", "description": "The good news is that the situation in China is improving albeit at exorbitant economic cost, and the virus spreads mostly through family.However, experiences from South Korea show that under unfortunate conditions, few infected people can wreak havoc.On a wo…", "url": "https://seekingalpha.com/article/4329881-unanswered-coronavirus-questions-now-is-not-time-for-heroics", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/3/3/saupload_China-official-non-manufacturing-PMI-2020-02-red.png", "publishedAt": "2020-03-05T16:08:35Z", "content": "So the markets rallied in the last 15 minutes, and on Monday, they were due for at least a technical bounce. Hopes of monetary expansion and other economic measures seem to have been another driver.\r\nInvestors want to know whether we can all sigh with relief … [+18396 chars]"}, {"source": {"id": null, "name": "Blogspot.com"}, "author": "Keir Clarke", "title": "Is America Ready for Coronavirus?", "description": "Maps Mania is a blog dedicated to tracking the very best digital interactive maps on the internet and the tools used to create them.", "url": "http://googlemapsmania.blogspot.com/2020/03/is-america-ready-for-coronavirus.html", "urlToImage": "https://1.bp.blogspot.com/-NnJtK6X5fis/XmDdbTx5z5I/AAAAAAAA7Kc/1RuequKrFhQfzFWgK25trgcMCv7LiGb4gCLcBGAsYHQ/w1200-h630-p-k-no-nu/Untitled-1.jpg", "publishedAt": "2020-03-05T16:00:00Z", "content": "Last week Donald Trump proudly held up a map from the Global Health Security Index and proclaimed that the United States is the most prepared country in the world for fighting Covid-19.\r\nThe Global Health Security Index assesses the abilities of countries aro… [+4661 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "McDermott Helps Business Leaders Navigate Coronavirus Response", "description": "McDermott Will & Emery, an international law firm, today announced the launch of its Coronavirus Resource Center, an online platform dedicated to helping business leaders navigate their response to the complex and evolving Coronavirus situation.", "url": "https://news.yahoo.com/mcdermott-helps-business-leaders-navigate-153300494.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/alejP2aVBHkqPccbBEodJA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTI0Mg--/https://s.yimg.com/uu/api/res/1.2/ROg3rwSP95sxL0z7PxI6Zw--~B/aD0xMjE7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/7521ffe09dcdea00b5662417ff8ea5c1", "publishedAt": "2020-03-05T15:33:00Z", "content": "WASHINGTON, March 5, 2020 /PRNewswire/ -- McDermott Will &amp; Emery, an international law firm, today announced the launch of its Coronavirus Resource Center, an online platform dedicated to helping business leaders navigate their response to the complex and… [+1353 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Spencer Kaufman", "title": "Slipknot Postpone Asia Tour and Knotfest Japan in Wake of Coronavirus Outbreak", "description": "Slipknot made the difficult decision in order to ensure the safety of their fans, the band members, and their crew. Slipknot Postpone Asia Tour and Knotfest Japan in Wake of Coronavirus Outbreak Spencer Kaufman", "url": "https://consequenceofsound.net/2020/03/slipknot-postpone-asia-tour-knotfest-japan-coronavirus/", "urlToImage": "https://consequenceofsound.net/wp-content/uploads/2020/03/Slipknot.jpg?quality=80", "publishedAt": "2020-03-05T15:13:05Z", "content": "The coronavirus outbreak has led Slipknot to postpone their upcoming Asian tour, including their own 2020 Knotfest Japan festival. The Iowa metal act revealed the news on social media, citing the safety and well-being of the fans, bands, and crew.\r\nIn additio… [+1882 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Bethlehem’s Storied Nativity Church Closes Amid Virus Fears", "description": "Palestinian officials indefinitely closed the storied Church of the Nativity in the biblical city of Bethlehem over fears of the new coronavirus, weeks ahead of the busy Easter holiday season.", "url": "https://www.snopes.com/ap/2020/03/05/bethlehems-storied-nativity-church-closes-amid-virus-fears/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/AP-Virus-Outbreak-Mideast-Palestinians.jpg?fit=1200,800", "publishedAt": "2020-03-05T15:19:45Z", "content": "BETHLEHEM, West Bank (AP) Palestinian officials indefinitely closed the storied Church of the Nativity in the biblical city of Bethlehem over fears of the new coronavirus, weeks ahead of the busy Easter holiday season.\r\nThe announcement by the Palestinian tou… [+6459 chars]"}, {"source": {"id": null, "name": "Economist.com"}, "author": "The Economist", "title": "Politics this week", "description": "", "url": "https://www.economist.com/the-world-this-week/2020/03/07/politics-this-week", "urlToImage": "https://www.economist.com/sites/default/files/20200307_WWP003.jpg", "publishedAt": "2020-03-05T16:09:45Z", "content": "Joe Bidens campaign bounced back after he won most of the 14 states that voted on Super Tuesday. Barack Obamas vice-president racked up big victories in southern states, where black voters are a large part of the Democratic electorate. Mr Biden earlier scored… [+6283 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Are there two types of COVID-19 viruses? What a new study has found", "description": "As per the preliminary study, one of these strains is more aggressive than the other, and was associated with 70 per cent of the analysed strains.", "url": "https://indianexpress.com/article/explained/are-there-two-types-of-covid-19-viruses-what-a-new-study-has-found-6301356/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus-759-5.jpg?w=759", "publishedAt": "2020-03-05T15:59:50Z", "content": "A man wears a mask in Hyderabad on March 5. India has so far reported 30 confirmed coronavirus cases. (Photo: AP)A preliminary study conducted by researchers from Peking Universitys School of Life Sciences and the Institut Pasteur of Shanghai, which is under … [+3175 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": null, "title": "UK coronavirus cases jump to 115", "description": "The number of coronavirus cases in the UK has increased to 115.", "url": "https://www.independent.co.uk/news/health/coronavirus-uk-cases-test-positive-covid-19-nhs-latest-a9378366.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "publishedAt": "2020-03-05T16:02:08Z", "content": "About The Independent commenting\r\nIndependent Premium Comments can be posted by members of our membership scheme, Independent Premium.\r\n It allows our most engaged readers to debate the big issues, share their own experiences, discuss\r\n real-world solutions, … [+673 chars]"}, {"source": {"id": null, "name": "Housingwire.com"}, "author": "Kathleen Howley", "title": "Mortgage rates fall to an all-time low - HousingWire", "description": "Mortgage rates fall to an all-time low HousingWire Mortgage rates fall to all-time low amid coronavirus concerns — here’s why you should think twice about waiting to refinance MarketWatch Mortgage Rates Hit Record Low, but Coronavirus May Deter Buyers The Wal…", "url": "http://www.housingwire.com/articles/mortgage-rates-fall-to-an-all-time-low/", "urlToImage": "https://www.housingwire.com/wp-content/uploads/2020/03/mortgage-rates-arrow-down.jpeg", "publishedAt": "2020-03-05T15:31:28Z", "content": "The average U.S. rate for a 30-year fixed mortgage fell to 3.29% this week, the lowest ever recorded by Freddie Mac in a series that goes back to 1971.\r\nThe rate fell 16 basis points from the prior week after the worst stock retreat since the 2008 financial c… [+1709 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Jude Terror", "title": "ECCC Reportedly Now Offering Refunds to Artist Alley Exhibitors as Coronavirus Fears Continue", "description": "As the world continues to grapple with the spread of a novel form of coronavirus causing the deadly disease known as COVID-19, Emerald City Comic Con, set to take place in one week in Seattle, at the heart of the largest known outbreak in the U.S., is now rep…", "url": "https://www.bleedingcool.com/2020/03/05/eccc-reportedly-now-offering-refunds-to-artist-alley-exhibitors-as-coronavirus-fears-continue/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/eswjk62u8aasbpi-1200x628.jpeg", "publishedAt": "2020-03-05T15:53:40Z", "content": "As the world continues to grapple with the spread of a novel form of coronavirus causing the deadly disease known as COVID-19, Emerald City Comic Con, set to take place in one week in Seattle, at the heart of the largest known outbreak in the U.S., is now rep… [+2125 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "VITAS® Healthcare Meets With U.S. Vice President Pence And COVID-19 Task Force", "description": "VITAS® Healthcare President & CEO Nick Westfall, along with other leading healthcare executives, met with U.S. Vice President Mike Pence, White House Coronavirus Task Force Coordinator Dr. Deborah Birx and Centers for Medicare & Medicaid Services Administrato…", "url": "https://news.yahoo.com/vitas-healthcare-meets-u-vice-155200247.html", "urlToImage": null, "publishedAt": "2020-03-05T15:52:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Simon Chandler, Contributor, Simon Chandler, Contributor https://www.forbes.com/sites/simonchandler/", "title": "How AI Will Prevent The Next Coronavirus Pandemic", "description": "With BlueDot and various other startups producing AI-powered diagnostic and detection systems, the coronavirus–aka COVID 19–may very well be the last global epidemic we witness.", "url": "https://www.forbes.com/sites/simonchandler/2020/03/05/how-ai-will-prevent-the-next-coronavirus-pandemic/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1210549967%2F0x0.jpg", "publishedAt": "2020-03-05T15:55:03Z", "content": "AI can be used for the early detection of virus outbreaks that might result in a pandemic. (Photo by ... [+] Emanuele Cremaschi/Getty Images)\r\nGetty Images\r\nAI detected the coronavirus before the World Health Organization and the Chinese government. On Decemb… [+6567 chars]"}, {"source": {"id": null, "name": "King5.com"}, "author": null, "title": "Did the coronavirus turn Seattle into a ghost town? Businesses react to recent headline - KING5.com", "description": "An NBC News story quoting a Pike Place business owner calling Seattle a ghost town has plenty of people questioning whether or not that's true.", "url": "https://www.king5.com/article/news/health/coronavirus/is-seattle-a-ghost-town-businesses-react-recent-report/281-cdc72690-cee7-424d-bdd3-474edab22308", "urlToImage": "https://media.king5.com/assets/KING/images/1ceafc4f-a6af-4e21-b28f-36b447310fd8/1ceafc4f-a6af-4e21-b28f-36b447310fd8_1140x641.jpg", "publishedAt": "2020-03-05T16:01:00Z", "content": "SEATTLE A recent story by NBC News calling Seattle a ghost town amid the coronavirus outbreak has received a lot of attention online.\r\nThe Latin Merchant in the heart of one of Seattle's busiest destinations is still open for business, but employees have noti… [+1244 chars]"}, {"source": {"id": null, "name": "Brooklynvegan.com"}, "author": "BrooklynVegan Staff", "title": "SXSW still on despite large companies dropping out", "description": "”Today the threat of community spread is low [in Austin], but we are prepared for that to happen here,” a doctor with Austin Public Health said in a press conference yesterday. Continue reading…", "url": "http://www.brooklynvegan.com/sxsw-still-on-despite-large-companies-dropping-out/", "urlToImage": "http://www.brooklynvegan.com/files/2020/03/sxsw2020.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2020-03-05T15:33:17Z", "content": "With coronavirus fears growing and big conferences and festivals being cancelled or postponed around the the world, many are wondering if SXSW — whose Tech portion begins in just just over a week — will pull the plug on this year’s festival. SXSW and Texas’s … [+2334 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Nate Madden", "title": "Study finds Chinese social media apps have been censoring coronavirus info for months", "description": "Information about the coronavirus — formally known as COVID-19 — has been censored for months on a pair of Chinese-based social media platforms, and that may have made the spread of the disease worse, according to new research. According to a study published …", "url": "https://www.theblaze.com/news/study-finds-chinese-social-media-apps-have-been-censoring-coronavirus-info-for-months", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg0NDE0NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyMDAwNTU1MH0.ssQd2a-RuHT2odUow3z3VSmcqzUayTr_jcJZ3pd1hRk/img.jpg?width=1200&coordinates=0%2C185%2C0%2C185&height=600", "publishedAt": "2020-03-05T15:35:33Z", "content": "Information about the coronavirus formally known as COVID-19 has been censored for months on a pair of Chinese-based social media platforms, and that may have made the spread of the disease worse, according to new research.\r\nAccording to a study published Tue… [+3260 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "William Worrall", "title": "Coronavirus Threatens to Kill E3 Forever – But Should You Even Care?", "description": "Coronavirus could be a very real threat to E3's future. But nostalgia aside, should you even care if it kills E3 forever? The post Coronavirus Threatens to Kill E3 Forever – But Should You Even Care? appeared first on CCN.com", "url": "https://www.ccn.com/coronavirus-threatens-to-kill-e3-forever-but-should-you-even-care/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/e3-borderlands-psycho-reuters.jpg", "publishedAt": "2020-03-05T15:27:26Z", "content": "<ul><li>The coronavirus outbreak is already wreaking havoc on gaming conferences such as GDC 2020.</li><li>Fears are growing that the virus could put a halt to the industrys biggest event of the year, E3 2020.</li><li>If this years E3 is canceled, the knock-o… [+2621 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Ulf Laessing", "title": "Coronavirus and protests wreck Iraq's pilgrimage industry", "description": "Iraqi hotel manager Badr al-Jilawi needs to think for a moment to remember when the last guest checked in to visit the holy Shi'ite Muslim city of Najaf, once a prime destination for millions of pilgrims. With the coronavirus spreading, authorities have banne…", "url": "https://news.yahoo.com/coronavirus-protests-wreck-iraqs-pilgrimage-152728321.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/oaDQ3vPdDvD.eDrLIEfq0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NDQ-/https://s.yimg.com/uu/api/res/1.2/h_v.aHhGnFPvitc5ff4V6g--~B/aD01OTA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/ad228432dd9bb78e2cfab5c3beb2b1a6", "publishedAt": "2020-03-05T15:27:28Z", "content": "By Ulf Laessing\r\nNAJAF, Iraq (Reuters) - Iraqi hotel manager Badr al-Jilawi needs to think for a moment to remember when the last guest checked in to visit the holy Shi'ite Muslim city of Najaf, once a prime destination for millions of pilgrims.\r\nWith the cor… [+3919 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "‘I don’t know that this is necessarily an overreaction’: Young on market", "description": "Despite continued fears of the global spread of the coronavirus, it appears China, the 2nd largest economy, is making a comeback. However, some investors believe that if recovery begins in Q3, the fed will want to hike rates toward the end of the year. Liz Yo…", "url": "https://finance.yahoo.com/video/don-t-know-necessarily-overreaction-160215998.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/HXZ2qP3IkCCpEl0YpY.MVA--~B/aD0yNDE4O3c9NDMwMztzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/05/5e61228b02816b0237816172/5e61228b02816b0237816173_o_U_v2.jpg", "publishedAt": "2020-03-05T16:02:15Z", "content": "Despite continued fears of the global spread of the coronavirus, it appears China, the 2nd largest economy, is making a comeback. However, some investors believe that if recovery begins in Q3, the fed will want to hike rates toward the end of the year. Liz Yo… [+75 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Duprey)", "title": "MGM Resorts Revises $1.25 Billion Stock Buyback Plan", "description": "The casino operator sees its plunging stock price as an even better value now.", "url": "https://www.fool.com/investing/2020/03/05/mgm-resorts-revises-125-billion-stock-buyback-plan.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561666/roulette-casino-gambling-getty.jpg", "publishedAt": "2020-03-05T15:29:00Z", "content": "MGM Resorts(NYSE:MGM) announced it was revising its $1.25 billion share repurchase program after disappointing third-quarter results and the coronavirus outbreak combined to send the casino operator's stock plunging.\r\nShares are down 25% over the past month a… [+1192 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Demitrios Kalogeropoulos)", "title": "Kroger Sees Faster Growth Ahead in 2020", "description": "The retailer's growth outlook leaves the door open for another year of modest market share losses.", "url": "https://www.fool.com/investing/2020/03/05/kroger-sees-faster-growth-ahead-in-2020.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561659/grocery-shopping.jpg", "publishedAt": "2020-03-05T15:23:00Z", "content": "Kroger(NYSE:KR) announced fourth-quarter earnings results on Thursday that indicated stable sales trends, tempered by continued market share losses against its biggest rivals.\r\nWhat happened?\r\nThe supermarket chain's sales growth slowed to 2% in the holiday q… [+1090 chars]"}, {"source": {"id": null, "name": "Muscleandfitness.com"}, "author": "aoreilly", "title": "Key Things to Know About the Coronavirus", "description": null, "url": "https://www.muscleandfitness.com/athletes-celebrities/news/key-things-know-about-coronavirus", "urlToImage": null, "publishedAt": "2020-03-05T15:45:00Z", "content": "American Media Active Lifestyle Group \r\nCopyright © 2020 Weider Publications, LLC, a subsidiary of American Media, Inc. All rights reserved."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Grace Hauck, USA TODAY", "title": "Coronavirus is spreading in the US. Here's everything to know, from symptoms to how to protect yourself", "description": "Coronavirus cases are increasing rapidly across the US. So, how did it start? And how should you prepare? Here's what you need to know about COVID-19.", "url": "https://news.yahoo.com/coronavirus-spreading-us-heres-everything-134318674.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9cg4yFSLW2y.JFRNNEV5aQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xMTY2LjkzMzMzMzMzMzMzMzQ-/https://s.yimg.com/uu/api/res/1.2/TIxkHK9kFgpwa9zpYnIiXg--~B/aD0xMzMwO3c9MTQ1OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/83a3c52970b04af9aee1428c7400afe4", "publishedAt": "2020-03-05T15:23:32Z", "content": "The deadly coronavirus that began as a handful of infections in central China has rapidly become a worldwide outbreak, shutting down entire cities, threatening the health of thousands and testing the strength of the global economy.\r\nMore than 95,700 cases of … [+12713 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Italy shuts down all schools to fight coronavirus spread", "description": "Nations around the world are stepping up their efforts to stop the spread of the coronavirus. CBS News foreign correspondent Charlie D'Agata joined CBSN AM from Italy with a look at how the country is responding.", "url": "https://www.cbsnews.com/video/italy-shuts-down-all-schools-to-fight-coronavirus-spread/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/05/24046a07-b0ff-4433-aee9-262ea7bf32c4/thumbnail/1200x630/383d43c35721a7eab359b47553e21043/0305-cbsn-italyshutsdownschools-2041933-640x360.jpg", "publishedAt": "2020-03-05T15:45:50Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Redmondpie.com"}, "author": "Oliver Haslam", "title": "With Limited iPad Pro Availability, Could We Be About To See A Refresh?", "description": "Coronavirus just won't stay out of the news, and that includes the tech world. And with device and part manufacturers suffering with factory closures and massive shortages in workers, it's likely that we will see some form of impact on the availability of har…", "url": "https://www.redmondpie.com/with-limited-ipad-pro-availability-could-we-be-about-to-see-a-refresh/", "urlToImage": "https://cdn.redmondpie.com/wp-content/uploads/2019/01/ipad-pro-02-1200px.jpg", "publishedAt": "2020-03-05T15:54:01Z", "content": "Coronavirus just won’t stay out of the news, and that includes the tech world. And with device and part manufacturers suffering with factory closures and massive shortages in workers, it’s likely that we will see some form of impact on the availability of har… [+1900 chars]"}, {"source": {"id": null, "name": "Fierceelectronics.com"}, "author": null, "title": "Now, an app that assesses coronavirus risk - FierceElectronics", "description": "Now, an app that assesses coronavirus risk FierceElectronics Coronavirus app coming soon: Check whether you are at risk based on your symptoms Livemint Worried sick over coronavirus? An app could soon come to your rescue Economic Times This AI-Driven App May …", "url": "https://www.fierceelectronics.com/electronics/now-app-assesses-coronavirus-risk", "urlToImage": "https://qtxasset.com/fierceelectronics/1583424535/Screen%20Shot%202020-03-05%20at%2011.07.38%20AM.png/Screen%20Shot%202020-03-05%20at%2011.07.38%20AM.png?F_dHilrdDFPjlWMW.nUriCf53IYb3BZt", "publishedAt": "2020-03-05T15:31:00Z", "content": "With coronavirus concerns growing, telemedicine has been touted as a possible means of helping individuals remotely examine their health conditions. Now, researchers have developed a coronavirus app that, coupled with machine intelligence, could enable an ind… [+3660 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Katie Mettler, Arelis  Hernández, William Wan, Lenny Bernstein", "title": "Health care workers worry about coronavirus protection - The Washington Post", "description": "Health care workers worry about coronavirus protection The Washington Post Nurses: Healthcare providers in California, U.S. 'unprepared' to handle coronavirus KTVU San Francisco View Full Coverage on Google News", "url": "https://www.washingtonpost.com/health/health-care-workers-worry-about-coronavirus-protection/2020/03/05/be04d5a8-5e33-11ea-9055-5fa12981bbbf_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/HSMXkIkMYOSPPbRWkBS89wox_GA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EQN64SC6LAI6VMAUJ6X2QZV3QE.jpg", "publishedAt": "2020-03-05T15:38:00Z", "content": "Our job is to go and take care of people when they're sick. I'm willing to take care of anyone. That's why we got into this line of work, she said. But if too many health-care workers get sick, we aren't going to have a shot at fighting this thing.\r\nAre you a… [+8674 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kathryn Watson", "title": "Trump says he thinks 3.4% coronavirus death rate is a \"false number\"", "description": "That was the rate stated by the director of the World Health Organization. Trump also said people with coronavirus may get better \"by sitting around and even going to work.\"", "url": "https://www.cbsnews.com/news/trump-says-he-thinks-3-4-coronavirus-death-rate-is-a-false-number/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/03/f2543083-42fd-4ca9-b8e6-be50b43f09f0/thumbnail/1200x630/1613e9991a750aaaee91c6888cbad734/gettyimages-1204945462.jpg", "publishedAt": "2020-03-05T15:55:03Z", "content": "President Trump said in an interview Wednesday night that the 3.4% mortality rate cited by the director of the World Health organization is a \"false number,\" and he also said that he thought people infected with coronavirus may get better \"by sitting around a… [+3794 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Amanda Woods", "title": "Grand Princess cruise passengers will be tested for coronavirus", "description": "The Coast Guard is expected to deliver sampling kits to the ship via helicopter.", "url": "https://nypost.com/2020/03/05/grand-princess-cruise-passengers-will-be-tested-for-coronavirus/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/grand-princess-00.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-05T15:57:29Z", "content": "Dozens of people on board the Grand Princess cruise left in limbo off the California coast will be tested for the infection, the cruise liner confirmed in a Thursday morning statement.\r\nPrincess Cruises said in a statement that there are no confirmed cases of… [+3028 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Yaron Steinbuch", "title": "Bethlehem’s storied Church of the Nativity closes amid coronavirus fears", "description": "The Palestinian Authority’s tourism ministry also announced that foreigners would be banned from West Bank hotels during the busy Easter season.", "url": "https://nypost.com/2020/03/05/bethlehems-storied-church-of-the-nativity-closes-amid-coronavirus-fears/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/nativity-church-coronavirus-76.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-05T15:21:51Z", "content": "The Church of the Nativity in the biblical city of Bethlehem was closed indefinitely Thursday amid suspicions that four Palestinians had caught the coronavirus.\r\nThe Palestinian Authoritys tourism ministry also announced that foreigners would be banned from W… [+1780 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kathy Orton", "title": "Mortgage rates plunge to record lows on coronavirus fears - The Washington Post", "description": "Mortgage rates plunge to record lows on coronavirus fears The Washington Post Mortgage Rates Hit All-time Low Other OTC:FMCC GlobeNewswire Helping you break down refinancing your home Wink News Mortgage Rates Hit Record Low, but Coronavirus May Deter Buyers T…", "url": "https://www.washingtonpost.com/business/2020/03/05/mortgage-rates-plunge-record-lows-coronavirus-fears/", "urlToImage": "https://www.washingtonpost.com/resizer/CinGtN7qguDwBRfsp8orgCgrOZg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4O53OLH33RBBDPHK3G7ZE2OJ3E.jpg", "publishedAt": "2020-03-05T15:26:00Z", "content": "The 30-year fixed rate, which started the year at 3.72 percent, has fallen 43 basis points in two months. (A basis point is 0.01 percentage point.) Its previous low was 3.31 percent in November 2012. At the start of 2000, the 30-year fixed-rate average was at… [+5444 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Russell Flannery, Forbes Staff, Russell Flannery, Forbes Staff https://www.forbes.com/sites/russellflannery/", "title": "Here's A Hong Kong Company Still Keeping A Good Grip On Its Sales, Products", "description": "Techtronic's shares have gained some 30% in the past year", "url": "https://www.forbes.com/sites/russellflannery/2020/03/05/heres-a-hong-kong-company-still-keeping-a-good-grip-on-its-sales-products/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F34685909%2F0x0.jpg%3Ffit%3Dscale", "publishedAt": "2020-03-05T15:36:00Z", "content": "Techtronic's billionaire chairman Horst Julius Pudwill back in 2004. Photographer: Paul... [+] Hilton/Bloomberg News.\r\nBLOOMBERG NEWS\r\nSocial unrest and fallout from the coronavirus outbreak in the past several months has left many of Hong Kong's largest comp… [+2286 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Kathryn Krawczyk", "title": "South Africa has its 1st confirmed case of coronavirus", "description": "COVID-19 has reached the southern tip of Africa, extending its spread around the world.\nSouth Africa has confirmed its first case of the new coronavirus, South Africa's health minister Zweli Mkhize announced Thursday. A 38-year-old man who had recently travel…", "url": "https://theweek.com/speedreads/900161/south-africa-1st-confirmed-case-coronavirus", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1205292742.jpg?itok=XHBqubev", "publishedAt": "2020-03-05T16:08:39Z", "content": "MSNBC's Rachel Maddow sat down with Sen. Bernie Sanders (I-Vt.) on Wednesday, after his disappointing Super Tuesday, and she wasn't lobbing softballs. \"I feel like your argument for your electability is flawless,\" she said. But actually \"expanding the elector… [+2090 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "US envoy says Iran 'lied to own people' over coronavirus - Times of India", "description": "US envoy says Iran 'lied to own people' over coronavirus Times of India Iran says 92 dead amid 2,922 cases of new coronavirus Hindustan Times Iran to restrict travel between cities as 3,500 catch coronavirus The Guardian Iran says 92 dead amid 2,922 cases of …", "url": "https://timesofindia.indiatimes.com/world/us/us-envoy-says-iran-lied-to-own-people-over-coronavirus/articleshow/74498219.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74498239,width-1070,height-580,imgsize-329673,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-05T15:23:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Gil Kaufman", "title": "Slipknot Postpone Asian Tour and Knotfest Japan Due to Coronavirus Fears", "description": "Slipknot announced on Wednesday (March 4) that they are postponing shows due to fears over the virus.", "url": "https://www.billboard.com/articles/columns/rock/9328761/slipknot-postpone-asian-tour-knotfest-japan-coronavirus-fears", "urlToImage": "https://static.billboard.com/files/media/Corey-Taylor-of-Slipknot-2019-Festival-Dete-Quebec-billboard-1548.jpg", "publishedAt": "2020-03-05T15:19:05Z", "content": "Slipknot is the latest act to put shows on ice due to fears over the fast-spreading coronavirus. The masked metalers announced on Wednesday (March 4) that they were postponing a tour of Asia that included stops at the Singapore Rock Fest (March 24), Hammerson… [+1979 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sean O'Neill, Skift", "title": "Latin America’s Despegar Will Have to Navigate Coronavirus Currency Impact", "description": "You might think an online travel agency group based in Buenos Aires would be stung by Latin America's ongoing economic woes. But you'd be only partly right. Despegar has navigated troubled times at home by diversifying its product mix and geographic markets a…", "url": "https://finance.yahoo.com/news/latin-america-despegar-navigate-coronavirus-153048052.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xh1hvZMzIkp1Kd2WrcBWlQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuMTY1ODUzNjU4NTM2NQ--/https://s.yimg.com/uu/api/res/1.2/ApkarMPCJmdM_yFaqeZCWQ--~B/aD02ODQ7dz0xMDI1O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/skift_501/f804d3653b3c7b63334cdc37cebe378d", "publishedAt": "2020-03-05T15:30:48Z", "content": "Latin Americas Despegar Will Have to Navigate Coronavirus Currency Impact\r\nYou might think an online travel agency group based in Buenos Aires would be stung by Latin Americas ongoing economic woes. But youd be only partly right. Despegar has navigated troubl… [+3114 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "Karin Brulliard", "title": "A dog has a ‘low-level’ coronavirus infection in first known human-to-animal transmission", "description": "A pet dog in Hong Kong has a “low-level” infection of the coronavirus that causes COVID-19 in people, in what may be the first known human-to-animal transmission of the novel coronavirus that has sickened more than 90,000 people worldwide. The case has raised…", "url": "https://www.seattletimes.com/nation-world/a-dog-has-a-low-level-coronavirus-infection-in-first-known-human-to-animal-transmission/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/03/Coronavirus-dog-virus-TZR-780x502.jpg", "publishedAt": "2020-03-05T15:48:22Z", "content": "A pet dog in Hong Kong has a “low-level” infection of the coronavirus that causes COVID-19 in people, in what may be the first known human-to-animal transmission of the novel coronavirus that has sickened more than 90,000 people worldwide.\r\nThe case has raise… [+5828 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Wales has second case confirmed as UK total hits 91", "description": "The second case in Wales, among 115 positive UK tests for COVID-19, is confirmed in Cardiff.", "url": "https://www.bbc.co.uk/news/uk-wales-51751542", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-05T16:06:27Z", "content": "A second coronavirus case has been confirmed in Wales - and the total number of UK cases has risen 115.\r\nThe UK's chief medical adviser said they were moving towards the second \"delay\" phase of their response to the outbreak.\r\nWales' first coronavirus case wa… [+2951 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Matthew DiLallo)", "title": "Why Units of EnLink Midstream Plummeted 24% in February", "description": "Sinking oil prices have investors growing increasingly concerned about the future of this MLP.", "url": "https://www.fool.com/investing/2020/03/05/why-units-of-enlink-midstream-plummeted-24-in-febr.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561655/a-natural-gas-pipeline-at-sunset.jpg", "publishedAt": "2020-03-05T15:16:00Z", "content": "What happened\r\nUnits of EnLink Midstream (NYSE:ENLC) tumbled 24.3% in February, according to data provided by S&amp;P Global Market Intelligence. Weighing on the midstream company was its 2020 outlook as well as sinking oil prices.  \r\nSo what\r\nEnLink Midstrea… [+1633 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "These maps track the path of coronavirus", "description": "Explore where coronavirus has appeared, in the United States and around the world.", "url": "https://www.bostonglobe.com/2020/03/05/world/these-maps-track-path-coronavirus/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=144", "publishedAt": "2020-03-05T15:42:10Z", "content": "The new coronavirus, also referred to as COVID-19, began in China and has affected tens of thousands of people around the world. Explore the maps below to see where it has been officially identified, where deaths have been reported, as well as where the CDC h… [+93 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Karl Plume", "title": "3M taps regional suppliers to meet soaring demand for masks", "description": "Diversified manufacturer 3M Co has avoided major supply chain disruptions from the coronavirus outbreak by sourcing materials for its protective face masks from regional suppliers instead of far-flung locations, a company official told Reuters. More than 3,20…", "url": "https://finance.yahoo.com/news/3m-taps-regional-suppliers-meet-154843946.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GI0I3Ryg90bj_crjcMFpig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/3rWq.6t3dGFO7OCE4sKJoA--~B/aD01MzQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/5a2c8ebf0763050fa04ae6606ca7bf52", "publishedAt": "2020-03-05T15:48:43Z", "content": "By Karl Plume\r\nMAPLEWOOD, Minn. (Reuters) - Diversified manufacturer 3M Co &lt;MMM.N&gt; has avoided major supply chain disruptions from the coronavirus outbreak by sourcing materials for its protective face masks from regional suppliers instead of far-flung … [+2557 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Karl Plume", "title": "3M taps regional suppliers to meet soaring demand for masks", "description": "Diversified manufacturer 3M Co has avoided major supply chain disruptions from the coronavirus outbreak by sourcing materials for its protective face masks from regional suppliers instead of far-flung locations, a company official told Reuters. More than 3,20…", "url": "https://finance.yahoo.com/news/3m-taps-regional-suppliers-meet-154843443.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6jl8nsz0p8TRmO7W244Dyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/gZst3e.ABZCeMrdnpZaJBg--~B/aD01MzQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/5a2c8ebf0763050fa04ae6606ca7bf52", "publishedAt": "2020-03-05T15:48:43Z", "content": "By Karl Plume\r\nMAPLEWOOD, Minn. (Reuters) - Diversified manufacturer 3M Co &lt;MMM.N&gt; has avoided major supply chain disruptions from the coronavirus outbreak by sourcing materials for its protective face masks from regional suppliers instead of far-flung … [+2557 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Science Says: How Risky Is That Virus? Your Mind May Mislead", "description": "As the viral infections spread across the globe, everybody has to make a decision: How worried should I be about getting infected, and what should I do about it?", "url": "https://www.snopes.com/ap/2020/03/05/science-says-how-risky-is-that-virus-your-mind-may-mislead/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/AP-Virus-Outbreak-Feelings-of-Risk.jpg?fit=1200,799", "publishedAt": "2020-03-05T15:25:09Z", "content": "NEW YORK (AP) Anna Alexander, a property manager in Virginia Beach, Virginia, started the day thinking that she might avoid shaking hands because of the coronavirus outbreak. Then somebody stuck out a hand to shake.\r\nShe took it.\r\nIm a business person, Alexan… [+4151 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "How bad is the coronavirus? Let compare with SARS, Ebola, flu - Livemint", "description": "How bad is the coronavirus? Let compare with SARS, Ebola, flu Livemint Scientists Create Snapshot of How the New Coronavirus Latches Onto Human Cells Gizmodo COVID-19 outbreak: MERS & SARS had higher fatality rates Economic Times Your coronavirus checklist fo…", "url": "https://www.livemint.com/news/world/how-bad-is-the-coronavirus-let-compare-with-sars-ebola-flu-11583420238664.html", "urlToImage": "https://images.livemint.com/img/2020/03/05/600x338/2020-01-29T080759Z_875974601_RC2KPE9EAYP5_RTRMADP_3_CHINA-HEALTH-SOUTHKOREA_1580297140938_1583421918123.JPG", "publishedAt": "2020-03-05T15:30:13Z", "content": "The coronavirus outbreak has been turning a lot of us into amateur epidemiologists. Just listen to Mick Mulvaney, the former real estate developer and member of Congress from South Carolina who is now acting White House chief of staff. The flu kills people,\" … [+7209 chars]"}, {"source": {"id": null, "name": "Retaildive.com"}, "author": "Daphne Howland", "title": "Shoptalk postponed until September on coronavirus concerns", "description": "In a reversal of last week's confirmation, the conference will be held in place of its sibling event, Groceryshop, which is rescheduled to spring 2021.", "url": "https://www.retaildive.com/news/shoptalk-postponed-until-september-on-coronavirus-concerns/573549/", "urlToImage": "https://www.retaildive.com/user_media/cache/df/40/df40e65da1929ec4e6ff026c1ffa7643.jpg", "publishedAt": "2020-03-05T16:05:00Z", "content": "Dive Brief:\r\n<ul><li>Shoptalk, a retail industry conference scheduled for later this month, has been postponed until Sept. 14-17, according to a message sent to media and attendees by email on Thursday. Those dates were slated for the company's sibling event,… [+2036 chars]"}]