[{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: Is coronavirus Trump's Katrina?", "description": "With just 2 days until Super Tuesday 2, the 2020 election is in full swing. Every Sunday, I deliver to your inbox the 5 BIG storylines you need to know to understand the upcoming week on the campaign trail. And they're ranked -- so the No. 1 story is the most…", "url": "https://www.cnn.com/2020/03/08/politics/2020-election-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200205155900-112-trump-lead-image-super-tease.jpg", "publishedAt": "2020-03-08T23:08:20Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Alyse Stanley on Earther, shared by Alyse Stanley to Gizmodo", "title": "The Coronavirus Outbreak Has Airlines Running Empty 'Ghost' Flights", "description": "Europe employs a “use it or lose it” system to determine an airline’s flight slots, so what are operators to do when a global outbreak tanks flight demands? The answer: “ghost” flights. Read more...", "url": "https://earther.gizmodo.com/the-coronavirus-outbreak-has-airlines-running-empty-gho-1842197367", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/xcozkxh2t8t1zdp5nwf3.jpg", "publishedAt": "2020-03-08T22:37:00Z", "content": "Europe employs a use it or lose it system to determine an airlines flight slots, so what are operators to do when a global outbreak tanks flight demands? The answer: ghost flights.\r\nIts exactly what it sounds like: Airlines are currently flying planes devoid … [+1972 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Reuters", "title": "Qatar bans travelers from 14 coronavirus-hit countries, including Philippines - ABS-CBN News", "description": "Qatar bans travelers from 14 coronavirus-hit countries, including Philippines ABS-CBN News Qatar bars arrivals from PH, 13 other countries amid coronavirus jitters INQUIRER.net Qatar bans travelers from PH, 13 other countries amid coronavirus worries CNN Phil…", "url": "https://news.abs-cbn.com/overseas/03/09/20/qatar-traveler-philippines-filipinos-ofws-coronavirus-ncov-covid-19", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/reuters/03/09/ofw.jpg", "publishedAt": "2020-03-08T22:52:00Z", "content": "CAIRO - Qatar has temporarily barred travelers from 14 countries from March 9 as a precaution against the rapidly spreading coronavirus, the government announced on Sunday.\r\nThe ban covers China, Egypt, India, Iran, Iraq, Lebanon, Bangladesh, Nepal, Pakistan,… [+231 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.S. stock futures tumble at open on coronavirus contagion fears", "description": "The price of futures contracts for the S&P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/Hybv2dAI0Gw/u-s-stock-futures-tumble-at-open-on-coronavirus-contagion-fears-idUSKBN20V138", "urlToImage": null, "publishedAt": "2020-03-08T22:23:52Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Wayne Cole", "title": "Asian shares set to tumble, oil prices crash", "description": "Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price.", "url": "https://www.reuters.com/article/us-global-markets-idUSKBN20V149", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500537383&w=1200&r=LYNXMPEG270W5", "publishedAt": "2020-03-08T22:48:04Z", "content": "SYDNEY (Reuters) - Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price. \r\nThe world’s top oil expor… [+3148 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jon Hamilton", "title": "Seattle Health Care System Offers Drive-Through Coronavirus Testing For Workers", "description": "A hospital in Seattle has set up a drive-through coronavirus testing clinic in its garage. The idea is to quickly test workers who have symptoms without putting other staff or patients at risk.", "url": "https://www.npr.org/sections/health-shots/2020/03/08/813501632/seattle-health-care-system-offers-drive-through-coronavirus-testing-for-workers", "urlToImage": "https://media.npr.org/assets/img/2020/03/08/garageguy_20200306_111905_wide-260537171f72e469fad4d7076c5e4442fbbc51bf.jpg?s=1400", "publishedAt": "2020-03-08T22:41:35Z", "content": "Nurse Jeff Gates prepares to assess another patient in UW Medicine's drive-through coronavirus testing clinic in Seattle.\r\nJon Hamilton/NPR\r\nEmployees of the University of Washington's UW Medicine system, can now get tested for coronavirus without leaving the… [+4180 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connor Perrett", "title": "A secret initiative at Amazon known as 'Project Gesundheit' is working to create a cure for the common cold", "description": "A secret project at Amazon known as \"Project Gesundheit\" is working toward developing a cure for the common cold, CNBC reported. The secretive project is part of Amazon's \"Grand Challenge\" R&D initiative lead by Babak Parviz, who previously led an R&D group a…", "url": "https://www.businessinsider.com/amazon-cure-for-the-common-cold-2020-3", "urlToImage": "https://i.insider.com/5e655954fee23d77e34256b3?width=1200&format=jpeg", "publishedAt": "2020-03-08T22:21:11Z", "content": "Amazon has been working on a cure to the common cold as part of a \"years-long\" top-secret project known as \"Project Gesundheit,\" according to CNBC.\r\nCNBC cited three people who had worked on the secret project, over 100 people work on the project that include… [+2167 chars]"}, {"source": {"id": null, "name": "Calculatedriskblog.com"}, "author": "Calculated Risk", "title": "Sunday Night Futures; Oil Prices Collapse", "description": "For health updates please see the CDC website: Coronavirus Disease 2019 .   A huge economic story  is the collapse in oil prices.   Weekend:...", "url": "https://www.calculatedriskblog.com/2020/03/sunday-night-futures-oil-prices-collapse.html", "urlToImage": null, "publishedAt": "2020-03-08T22:18:00Z", "content": "For health updates please see the CDC website: Coronavirus Disease 2019.\r\nA huge economic story is the collapse in oil prices.\r\nWeekend:• Schedule for Week of March 8, 2020\r\n• Fiscal Policies to Address COVID-19\r\nMonday:• No major economic releases scheduled.… [+545 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Shawn Langlois", "title": "Key Words: Pimco: It’s just going to get worse for economy", "description": "Joachim Fels said both the U.S. and Europe face the “distinct possibility” of a technical recession in the first half as investors flock to safe havens amid the continuing spread of the coronavirus.", "url": "http://www.marketwatch.com/story/pimco-its-just-going-to-get-worse-for-economy-2020-03-08", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB773_econom_ZH_20200308191646.jpg", "publishedAt": "2020-03-08T22:42:18Z", "content": "Thats Joachim Fels, Pimcos global chief economic adviser, painting a rather bleak picture for investors in a note to clients cited by Bloomberg on Sunday.He said both the U.S. and Europe face the distinct possibility of a technical recession in the first half… [+1281 chars]"}, {"source": {"id": null, "name": "Hackaday.com"}, "author": "Dan Maloney", "title": "Hackaday Links: March 8, 2020", "description": "A lot of annoying little hacks are needed to keep our integer-based calendar in sync with a floating-point universe, and the big one, leap day, passed us by this week. Aside from the ignominy of adding a day to what’s already the worst month of the year, leap…", "url": "https://hackaday.com/2020/03/08/hackaday-links-march-8-2020/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2020-03-08T23:00:08Z", "content": "A lot of annoying little hacks are needed to keep our integer-based calendar in sync with a floating-point universe, and the big one, leap day, passed us by this week. Aside from the ignominy of adding a day to what’s already the worst month of the year, leap… [+2650 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "William Watts", "title": "The Tell: Coronavirus and OPEC-vs.-Russia oil price war could take crude into the $20s: Goldman Sachs", "description": "Goldman Sachs commodity analysts slash their forecast for crude prices on Sunday after an alliance between Saudi Arabia-led OPEC and Russia collapses, launching a new “price war” between the producers.", "url": "http://www.marketwatch.com/story/coronavirus-and-opec-vs-russia-oil-price-war-could-take-crude-into-the-20s-goldman-sachs-2020-03-08", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HP287_permia_ZG_20190813080623.jpg", "publishedAt": "2020-03-08T22:51:27Z", "content": "Goldman Sachs commodity analysts on Sunday slashed their forecast for crude prices, after an alliance between Saudi Arabia-led OPEC and Russia collapsed late last week launching a new price war that threatens to deliver acute financial stress to shale driller… [+3764 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Northwest Florida Daily News, Wendy Victora, Northwest Florida Daily News", "title": "Plane crashes in Florida neighborhood, 2 men and dog emerge 'without a scratch,' police said", "description": "Police indicated that two men and a yellow Labrador retriever were aboard the plane and all three emerged from the crash \"without a scratch.\"", "url": "https://www.usatoday.com/story/news/nation/2020/03/08/destin-florida-plane-crash-planet-drive-no-injuries-reported/4996441002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/08/USAT/a8be3e5e-8e65-40a8-bf73-d52460daa343-AR-200309064.jpg?crop=959,539,x1,y105&width=1600&height=800&fit=bounds", "publishedAt": "2020-03-08T23:08:58Z", "content": "Nobody was injured when a small plane crashed into a Florida neighborhood while trying to land at Destin Executive Airport on Sunday. Two men and a dog were aboard the plane.\r\n (Photo: Beth Cann/Contributed photo via Northwest Florida Daily News)\r\nDESTIN, Fla… [+2641 chars]"}, {"source": {"id": null, "name": "Fox35orlando.com"}, "author": "FOX 35 Orlando", "title": "Cases of coronavirus in Florida up to 18, including 1 in Central Florida - FOX 35 Orlando", "description": "Cases of coronavirus in Florida up to 18, including 1 in Central Florida FOX 35 Orlando New positive coronavirus case in Broward County, Florida total now 18 WPBF West Palm Beach DeSantis Actives State Emergency Ops Center After Coronavirus Deaths NorthEscamb…", "url": "https://www.fox35orlando.com/news/cases-of-coronavirus-in-florida-up-to-18-including-1-in-central-florida", "urlToImage": "https://images.foxtv.com/static.fox35orlando.com/www.fox35orlando.com/content/uploads/2020/03/724/407/tracking-coronavirus-volusia-county.jpg?ve=1&tl=1", "publishedAt": "2020-03-08T23:07:19Z", "content": "LAKE MARY, Fla. - Several news cases of coronavirus, also known as COVID-19, have been announced in Florida, health officials say.\r\nThe latest case was reported out of Broward County on Sunday.\r\nThe Florida Department of Health said the patient is a 67-year-o… [+2986 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Lizzy Acker | The Oregonian/OregonLive", "title": "Oregon declares coronavirus state of emergency: What does that mean? - OregonLive", "description": "Oregon declares coronavirus state of emergency: What does that mean? OregonLive Coronavirus outbreak: Oregon governor, health officials to give update on COVID-19 response Global News Oregon Gov. Declares State Of Emergency, OHSU Patient Tests Positive For No…", "url": "https://www.oregonlive.com/coronavirus/2020/03/oregon-declares-coronavirus-state-of-emergency-what-does-that-mean.html", "urlToImage": "https://www.oregonlive.com/resizer/fG69x-2GMZqfov2qWZLoBKlAf1o=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/TQT5V6SRQJBTVP7KHM3W2Q6C7E.JPG", "publishedAt": "2020-03-08T23:02:48Z", "content": "As the number of known cases of the novel coronavirus in Oregon doubled Sunday, Gov. Kate Brown said she was declaring a state of emergency to ensure that we are able to swiftly deploy the personnel and resources necessary to address coronavirus in Oregon.\r\nB… [+3244 chars]"}, {"source": {"id": null, "name": "Wfsb.com"}, "author": "Kaitlyn Naples, Olivia Lank, Corey  Pollnow", "title": "Gov. Lamont announces first presumptive positive case of coronavirus in Connecticut - WFSB", "description": "Gov. Lamont announces first presumptive positive case of coronavirus in Connecticut WFSB Coronavirus is probably here already; it’s time for Gov. Lamont — and all of us — to step up our game Hartford Courant Coronavirus in Connecticut: Governor Announces Firs…", "url": "https://www.wfsb.com/news/gov-lamont-announces-first-presumptive-positive-case-of-coronavirus-in/article_feb19760-5ef8-11ea-95f4-6b28701e057a.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wfsb.com/content/tncms/assets/v3/editorial/d/35/d35054f9-3789-560b-a80d-e0739184ea1b/5e65b78ebea26.image.jpg?resize=1120%2C630", "publishedAt": "2020-03-08T22:30:00Z", "content": "HARTFORD, CT (WFSB) -- The Department of Public Health State Laboratory confirmed Connecticut's first presumptive positive case of the coronavirus on Sunday afternoon, according to Governor Ned Lamont.\r\nThe patient is a resident of Wilton between the ages of … [+8491 chars]"}, {"source": {"id": null, "name": "Courant.com"}, "author": "Emily Brindley", "title": "First Connecticut resident tests positive for coronavirus - Trinity students self-quarantined after possible e - Hartford Courant", "description": "First Connecticut resident tests positive for coronavirus - Trinity students self-quarantined after possible e Hartford Courant Coronavirus in Connecticut: Governor Announces First Case of Resident The New York Times Coronavirus is probably here already; it’s…", "url": "https://www.courant.com/breaking-news/hc-br-connecticut-first-resident-coronavirus-20200308-unv6khrzrjbsrojtxd3wtyojne-story.html", "urlToImage": "https://www.courant.com/resizer/1H0EhzSu9t0u-GSrI06SRs-gkWo=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/HH7E3J6NMFDMDP4PAVS4OS76BU.jpg", "publishedAt": "2020-03-08T22:28:14Z", "content": null}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Tyler Cowen", "title": "A simple proposal for boosting health care workers", "description": "One recent report suggests that 10% of the doctors in northern Italy are infected with coronavirus. No matter what the exact figure, that is clearly a problem. In response, Italy is opting for at least two reforms. First, health care workers who are retired a…", "url": "https://marginalrevolution.com/marginalrevolution/2020/03/a-simple-proposal-for-boosting-health-care-workers.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-03-08T22:23:53Z", "content": "One recent report suggests that 10% of the doctors in northern Italy are infected with coronavirus.  No matter what the exact figure, that is clearly a problem.  In response, Italy is opting for at least two reforms.  First, health care workers who are retire… [+541 chars]"}, {"source": {"id": null, "name": "Clickorlando.com"}, "author": null, "title": "Florida Department of Health announced new positive COVID-19 case in Broward County - WKMG News 6 & ClickOrlando", "description": "Florida Department of Health announced new positive COVID-19 case in Broward County WKMG News 6 & ClickOrlando LIVE UPDATES: New positive coronavirus case in Broward County, health officials say WFTV Orlando Cases of coronavirus in Florida up to 18, including…", "url": "https://www.clickorlando.com/news/local/2020/03/08/florida-department-of-health-announced-new-positive-covid-19-case-in-broward-county/", "urlToImage": "https://www.clickorlando.com/resizer/VBnl5Nn2aPzkCpAE_ag_wDhjFQo=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/ZO5IJ2XKD5FKLGGAVBJIERPNWY.jpg", "publishedAt": "2020-03-08T23:07:31Z", "content": "The Florida Department of Health announced Sunday that there is a new positive case for COVID-19 in Broward County. \r\nThe Florida Department of Health said the person who tested positive is a 67-year old man who is currently isolated. \r\nFor more information o… [+113 chars]"}, {"source": {"id": null, "name": "Theolympian.com"}, "author": null, "title": "Washington state coronavirus deaths rise to 18; cases increase to 136, including 4 in Pierce County - The Olympian", "description": "Washington state coronavirus deaths rise to 18; cases increase to 136, including 4 in Pierce County The Olympian 'Scary for everybody': This is what it's like in Seattle and King County, areas under siege from the coronavirus USA TODAY Three more coronavirus …", "url": "https://www.theolympian.com/news/local/article241014096.html", "urlToImage": null, "publishedAt": "2020-03-08T22:26:00Z", "content": null}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": null, "title": "‘Still in triage mode’: More residents, employees of Kirkland nursing home are hospitalized with coronavirus symptoms - Seattle Times", "description": "‘Still in triage mode’: More residents, employees of Kirkland nursing home are hospitalized with coronavirus symptoms Seattle Times This nursing home is at the center of Washington's coronavirus. Here's what one first responder saw there CNN Nursing home grap…", "url": "https://www.seattletimes.com/seattle-news/health/still-in-triage-mode-more-residents-employees-of-kirkland-nursing-home-are-hospitalized-with-coronavirus-symptoms/", "urlToImage": null, "publishedAt": "2020-03-08T22:12:19Z", "content": null}, {"source": {"id": null, "name": "Spokesman.com"}, "author": "Kip Hill", "title": "Coronavirus spreads in Washington state, but local officials confirm no cases in Spokane County - The Spokesman-Review", "description": "Coronavirus spreads in Washington state, but local officials confirm no cases in Spokane County The Spokesman-Review This nursing home is at the center of Washington's coronavirus. Here's what one first responder saw there CNN Nursing home grappling with coro…", "url": "https://www.spokesman.com/stories/2020/mar/08/first-coronavirus-case-confirmed-in-spokane-county/", "urlToImage": "https://media.spokesman.com/photos/2020/03/08/Virus_Outbreak_US_1_f61d38U_t1200.jpg?298603a24e8d51915fce203907ff2746e482a5a6", "publishedAt": "2020-03-08T22:41:15Z", "content": "Local health officials said Sunday there are no positive cases of coronavirus in Spokane County, though the virus continues to spread in Washington state.\r\nInitially, the Washington Health Department reported 136 total cases of the virus on Sunday, including … [+2408 chars]"}, {"source": {"id": null, "name": "Kxly.com"}, "author": null, "title": "Department of Health backpedals, removes Spokane Co. from confirmed COVID-19 case list - KXLY Spokane", "description": "Department of Health backpedals, removes Spokane Co. from confirmed COVID-19 case list KXLY Spokane 'Scary for everybody': This is what it's like in Seattle and King County, areas under siege from the coronavirus USA TODAY Three more coronavirus deaths report…", "url": "https://www.kxly.com/department-of-health-backpedals-removes-spokane-from-confirmed-covid-19-case-list/", "urlToImage": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.kxly.com/content/uploads/2020/03/200306171508-coronavirus-vaccine-lab-germany-pleitgen-pkg-00000000-live-video.jpg", "publishedAt": "2020-03-08T22:27:17Z", "content": "Posted: March 8, 2020 3:21 PM\r\nKING CO., Wash. The Washington State Department of Health backpedaled on its report that Spokane has a confirmed case of COVID-19.\r\nSunday afternoon, the Department released a list of confirmed coronavirus cases, which included … [+597 chars]"}, {"source": {"id": null, "name": "Ktnv.com"}, "author": "https://www.ktnv.com/amy-abdelsayed", "title": "Everything we know so far following 2 new presumptive positive COVID-19 cases in Nevada - KTNV Las Vegas", "description": "Everything we know so far following 2 new presumptive positive COVID-19 cases in Nevada KTNV Las Vegas Person tied to Las Vegas charter school under coronavirus quarantine Las Vegas Review-Journal COVID-19 (Novel Coronavirus) washoecounty.us SSF Bintang Badmi…", "url": "https://www.ktnv.com/news/everything-we-know-so-far-following-2-new-presumptive-positive-covid-19-cases-in-nevada", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/6aa7372/2147483647/strip/true/crop/1000x525+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F53%2F52%2Fc7991d814b2a99105513b45f3b7a%2Fap-20048560090519.jpg", "publishedAt": "2020-03-08T22:57:00Z", "content": "LAS VEGAS (KTNV) The fourth presumptive positive case of COVID-19, a disease caused by coronavirus, has been identified in Nevada. \r\nTwo cases were announced on Sunday. First, a presumed positive case was announced by Washoe County officials in Northern Nevad… [+7397 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Lucknow confidential: China Star", "description": "n the video, Adityanath is heard talking about how yoga can save people from ailments, including the novel coronavirus, which originated in China and has infected people worldwide", "url": "https://indianexpress.com/article/india/lucknow-confidential-china-star-6306000/", "urlToImage": "https://images.indianexpress.com/2020/03/Yogi-Adityanath-759.jpg?w=759", "publishedAt": "2020-03-08T22:16:46Z", "content": "Adityanath had given the speech at the Yoga Mahotsav in Uttarakhands Rishikesh city earlier this month.Chief Minister Yogi Adityanath has made a strong impression on social media users in China. Indian Twitter has been abuzz with news that a video of the chie… [+2301 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will coronavirus go away this summer? - 60 Minutes", "description": "Will coronavirus go away this summer? 60 Minutes Fauci says 'anything is possible' when asked about widespread coronavirus quarantine Fox News Full Fauci: For Coronavirus And Crowds, 'If You're A Vulnerable Person, Take It Seriously' NBC News Not His First Ep…", "url": "https://www.youtube.com/watch?v=DpO04Uic3YQ", "urlToImage": null, "publishedAt": "2020-03-08T22:27:00Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Coronavirus scare: Suspected patient dies in Bengal, test results awaited", "description": "The youth fell sick on Saturday during a bus ride back home after he flew to Kolkata from Saudi Arabia, where he worked as a cleaner.", "url": "https://indianexpress.com/article/india/coronavirus-scare-suspected-patient-dies-in-bengal-test-results-awaited-6306042/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus-759-8.jpg?w=759", "publishedAt": "2020-03-08T22:52:23Z", "content": "Doctors said he was a suspected coronavirus patient and was in the isolation ward. (File Photo)A youth from West Bengals Murshidabad district, who returned from Saudi Arabia on Saturday, died at Murshidabad Medical College and Hospital on Sunday evening, sour… [+1086 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Ben Geman", "title": "Oil prices plunge to four-year lows as market absorbs OPEC-Russia split - Axios", "description": "Oil prices plunge to four-year lows as market absorbs OPEC-Russia split Axios Oil crashes by most since 1991 as Saudi Arabia launches price war CNN Oil plunges 25 percent, markets sink as Russia-Saudi Arabia feud threatens coronavirus-weakened economy Fox New…", "url": "https://www.axios.com/oil-prices-plunge-opec-russia-8bed9c99-d45c-4559-9dd7-ff295cad4f95.html", "urlToImage": "https://images.axios.com/rW_yR2bsXeNfLckZsPUH-NT_gu0=/2020/03/08/1583707767199.jpg", "publishedAt": "2020-03-08T23:05:54Z", "content": "Oil prices nosedived to four-year lows Sunday as trading resumed after Friday's collapse of the OPEC-Russia production-limiting pact, a rupture slated to increase supplies at a time when the novel coronavirus is sapping demand.\r\nDriving the news: The global b… [+1084 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Futures Plunge, Crude Oil Futures Crash On Covid-19 Cases, OPEC Price War As Coronavirus Stock Market Correction Continues - Investor's Business Daily", "description": "Dow Jones Futures Plunge, Crude Oil Futures Crash On Covid-19 Cases, OPEC Price War As Coronavirus Stock Market Correction Continues Investor's Business Daily View Full Coverage on Google News", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-crude-oil-futures-coronavirus-stock-market-correction/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/02/A1MAIN-virus-022820-shutter.jpg", "publishedAt": "2020-03-08T23:05:10Z", "content": "Dow Jones futures plunged Sunday, along with S&amp;P 500 futures and Nasdaq futures, as an all-out crude oil price war adds to coronavirus fears. Covid-19 cases are increasing rapidly in the U.S. and Europe, with northern Italy on lockdown. Meanwhile, crude o… [+8461 chars]"}, {"source": {"id": null, "name": "Newsday.com"}, "author": "Newsday Staff", "title": "Northwell receives federal approval to test for coronavirus - Newsday", "description": "Northwell receives federal approval to test for coronavirus Newsday Gov. Andrew Cuomo urges CDC to allow more local coronavirus testing CNN CDC has tested 1,583 people for coronavirus | TheHill The Hill Coronavirus in N.Y.: Cuomo Attacks C.D.C. Over Delays in…", "url": "https://www.newsday.com/long-island/coronavirus-suny-students-1.42608735", "urlToImage": "https://cdn.newsday.com/polopoly_fs/1.42620821.1583705746!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "publishedAt": "2020-03-08T22:57:15Z", "content": "This story was reported by Vera Chinese, Jesse Coburn, Lisa L. Colangelo and David M. Schwartz. It was written by Colangelo. \r\nThe first confirmed case of coronavirus in Suffolk County is an man in his early 40s, hospitalized and in isolation, officials said … [+5970 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Coronavirus fears have left tourist hotspots empty worldwide via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_5b50c333a2af423367997f3c6e70bb76", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-08T23:10:08Z", "content": "Real Madrid C.F., Real Betis, La Liga, Zinedine Zidane, Karim Benzema\r\nFollow along for Real Betis vs Real Madrid live stream online, TV Channel, lineups preview and score updates of the La Liga 2020 competition...."}, {"source": {"id": null, "name": "Mlive.com"}, "author": "Leada Gore | lgore@al.com", "title": "Coronavirus concerns: Don’t travel on cruise ships, US State Department warns - MLive.com", "description": "Coronavirus concerns: Don’t travel on cruise ships, US State Department warns MLive.com Passengers aboard cruise ship off California amid coronavirus outbreak to be transferred to military posts... Fox News 33 states now have coronavirus as a cruise ship link…", "url": "https://www.mlive.com/coronavirus/2020/03/coronavirus-concerns-dont-travel-on-cruise-ships-us-state-department-warns.html", "urlToImage": "https://www.mlive.com/resizer/8FVdNWzokI1OuDoQydCoB2XW5f8=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/P3MCAJTQD5BK3CW3FFTH7FDO5I.jpg", "publishedAt": "2020-03-08T22:48:46Z", "content": "The U.S. State Department is warning Americans against traveling on cruise ships due to concerns over coronavirus.\r\nIn a tweet, the State Department said: U.S. citizens, especially with underlying conditions, should not travel by cruise ship. CDC notes increa… [+1648 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. stock futures tumble at open on coronavirus contagion fears", "description": "The price of futures contracts for the S&P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen.", "url": "https://www.reuters.com/article/us-usa-stocks-idUSKBN20V138", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500530800&w=1200&r=LYNXMPEG270VG", "publishedAt": "2020-03-08T22:23:52Z", "content": "(Reuters) - The price of futures contracts for the S&amp;P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen. \r\nContracts for the S&amp;P 500 e… [+272 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Five more people diagnosed in NI", "description": "The total number of people diagnosed in Northern Ireland with the virus is now 12.", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-51796305", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BFB6/production/_111187094_33f9b1a0-834d-4f4c-80aa-f6b7bc517349.jpg", "publishedAt": "2020-03-08T22:32:15Z", "content": "Five more cases of coronavirus have been confirmed in Northern Ireland.\r\nThis brings the total number of people in Northern Ireland with the virus to 12 since testing began. \r\nHealth officials are tracing people who may have been in contact with the latest ca… [+20 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rachel Sandler, Forbes Staff, Rachel Sandler, Forbes Staff https://www.forbes.com/sites/rachelsandler/", "title": "Americans Should Not Take Cruises Amid Coronavirus Outbreak, State Department Says", "description": "Health officials warn cruise ships pose an increased risk of infection.", "url": "https://www.forbes.com/sites/rachelsandler/2020/03/08/americans-should-not-take-cruises-amid-coronavirus-outbreak-state-department-says/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206109651%2F0x0.jpg", "publishedAt": "2020-03-08T22:16:07Z", "content": "People look out from aboard the Grand Princess cruise ship, operated by Princess Cruises, as it ... [+] maintains a holding pattern about 25 miles off the coast of San Francisco, California on March 8, 2020.\r\nPhoto by JOSH EDELSON/AFP via Getty Images\r\nToplin… [+2391 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Matt Stieb", "title": "Trump Admin Reportedly Overruled CDC’s Coronavirus Advice for Seniors Not to Fly", "description": "The White House’s mismanagement of the coronavirus outbreak continues, as infighting and misinformation muddle the government’s response.", "url": "http://nymag.com/intelligencer/2020/03/trump-admin-voided-cdc-advice-for-seniors-not-to-fly-report.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/01/09/coronavirus_airport_sf.w1200.h630.jpg", "publishedAt": "2020-03-08T22:34:06Z", "content": "As the federal government moves from a strategy of containment to one of mitigation, the Trump administrations mismanagement of the coronavirus continues to escalate. The most concerning report over the weekend involved the White Houses decision, according to… [+4203 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Coronavirus: Italy to 'quarantine 10 million people' in Lombardy via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_adfde883ac7322722553b49c0cfeca3c", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-08T23:10:08Z", "content": "Real Madrid C.F., Real Betis, La Liga, Zinedine Zidane, Karim Benzema\r\nFollow along for Real Betis vs Real Madrid live stream online, TV Channel, lineups preview and score updates of the La Liga 2020 competition...."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " What you need to know about coronavirus right now - Reuters via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_4b5624c0163dfd627362b9f60e954f06", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-08T23:10:08Z", "content": "Real Madrid C.F., Real Betis, La Liga, Zinedine Zidane, Karim Benzema\r\nFollow along for Real Betis vs Real Madrid live stream online, TV Channel, lineups preview and score updates of the La Liga 2020 competition...."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Will coronavirus go away this summer?", "description": "Dr. Anthony Fauci says there's no way to know just yet.", "url": "https://www.cbsnews.com/video/will-coronavirus-go-away-this-summer/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/08/99d2d0d8-fd99-4a47-8098-37c22ae8998e/thumbnail/1200x630/2519363867c41f048bbb158234b48dff/ot-coronavirus3year-2043832-640x360.jpg", "publishedAt": "2020-03-08T22:27:15Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus: Should you wear a face mask?", "description": "Infectious disease expert Dr. Anthony Fauci tells 60 Minutes: \"There's no reason to be walking around with a mask.\"", "url": "https://www.cbsnews.com/video/coronavirus-should-you-wear-a-face-mask/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/08/df872ede-5808-4350-b1e8-8d61429613de/thumbnail/1200x630/9929e0fa28a9645fe4f4ce8521bd9050/ot-coronavirus1masksfd-ap-2043815-640x360.jpg", "publishedAt": "2020-03-08T22:29:18Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "When will we have a coronavirus vaccine?", "description": "Dr. Anthony Fauci explains the many steps scientists have to take to achieve an effective vaccine.", "url": "https://www.cbsnews.com/video/when-will-we-have-a-coronavirus-vaccine/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/08/2d269dc0-1b90-4ebe-8c5c-6268c2809b48/thumbnail/1200x630/95dbef6666fbc2de82588bce1cb456db/ot-coronavirus2vaccine-2043824-640x360.jpg", "publishedAt": "2020-03-08T22:28:16Z", "content": null}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Chris Enloe", "title": "Top GOP lawmaker accuses Democrats of intentionally delaying coronavirus bill to score political points", "description": "House Minority Leader Kevin McCarthy (R-Calif.) alleged Sunday that Democrats intentionally delayed the coronavirus relief bill in order to run Super Tuesday ads. On Friday, President Donald Trump signed an emergency bill providing $8.3 billion for the govern…", "url": "https://www.theblaze.com/news/top-gop-lawmaker-accuses-democrats-of-intentionally-delaying-coronavirus-bill-to-score-political-points", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg2NjY0Ny9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYxODgxNTIzNX0.-3JXEEvAahA0UlHXl1Acko0LGPmsKs8AALBVJPHnjCw/img.jpg?width=1200&coordinates=0%2C85%2C0%2C85&height=600", "publishedAt": "2020-03-08T22:43:37Z", "content": "House Minority Leader Kevin McCarthy (R-Calif.) alleged Sunday that Democrats intentionally delayed the coronavirus relief bill in order to run Super Tuesday ads.\r\nOn Friday, President Donald Trump signed an emergency bill providing $8.3 billion for the gover… [+1417 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Preventing coronavirus: Should you wear a face mask?", "description": "Dr. Anthony Fauci tells 60 Minutes which precautions don't work against coronavirus—and why a vaccine is still at least a year away.", "url": "https://www.cbsnews.com/news/preventing-coronavirus-facemask-60-minutes-2020-03-08/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/08/58573bff-082f-44f4-bfa3-525e150c7ee6/thumbnail/1200x630/26db1612b7b58fda4781866c302dc99a/ot-coronavirus1masksfd-ap.jpg", "publishedAt": "2020-03-08T23:02:33Z", "content": "When it comes to preventing coronavirus, public health officials have been clear: Healthy people do not need to wear a face mask to protect themselves from COVID-19.\r\n\"There's no reason to be walking around with a mask,\" infectious disease expert Dr. Anthony … [+3100 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Oil futures CRASH 20% over OPEC deal failure & coronavirus fears", "description": "Read Full Article at RT.com", "url": "https://www.rt.com/business/482631-oil-futures-brent-wti-crash/", "urlToImage": "https://cdni.rt.com/files/static.en/article/urgent.jpg", "publishedAt": "2020-03-08T22:32:48Z", "content": "Wow. Oil prices falls 30% immediately after market opens as Saudi Arabia launches oil price war. Brent crude falls to low of 31.52 a barrel. It traded at $70 as recently as January #OOTT#OPECpic.twitter.com/QJZhRNnlPg\r\n— David Sheppard (@OilSheppard) March 8,… [+4 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "GOOD: Gates-funded program will soon offer home-testing kits for new coronavirus….", "description": "GOOD: Gates-funded program will soon offer home-testing kits for new coronavirus.", "url": "https://pjmedia.com/instapundit/360751/", "urlToImage": null, "publishedAt": "2020-03-08T22:24:38Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Empty streets and paranoia as northern Italy goes into lockdown", "description": "Italy’s interior ministry said anyone flouting the lockdown risked at least three months in jail or a 206 euro ($233) fine", "url": "https://www.thehindu.com/news/international/empty-streets-and-paranoia-as-northern-italy-goes-into-lockdown/article31019849.ece", "urlToImage": "https://www.thehindu.com/news/international/2t5dfe/article31019848.ece/ALTERNATES/LANDSCAPE_615/1206116242", "publishedAt": "2020-03-08T23:03:34Z", "content": "The sun shone on deserted squares in Milan and empty gondolas in Venice on Sunday as a quarter of Italys population came to grips with being cut off from the rest of the country, under new rules strictly limiting movement in and out of the new red zone.\r\n Whi… [+4339 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Michelle Baddeley Ph.D.", "title": "Loo Paper Mania", "description": "How behavioural economics can explain why people are stockpiling toilet paper.", "url": "https://www.psychologytoday.com/ca/blog/copycats-and-contrarians/202003/loo-paper-mania", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/noloorolls.jpg?itok=yY62NrGb", "publishedAt": "2020-03-08T22:41:51Z", "content": "One of the relatively predictable outcomes from Coronavirus  - especially given likely impacts on global supply chains, travel plans and government finances -  has been the turbulence on financial markets. Few pundits, however, would have predicted that the C… [+5182 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "U.S. stock futures tumble at open on coronavirus contagion fears", "description": "Contracts for the S&P 500 emini were down 4.4% to 2834.25. Fear of the economic damage the coronavirus epidemic poses sent stocks lower on Friday, with the benchmark S&P 500 notching its 10th decline in 12 sessions.", "url": "https://finance.yahoo.com/news/u-stock-futures-tumble-open-222352938.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LocvE_vzaHVb6MF9a9eGXQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/bmuvDEl4Lnwm4PN0jkK_YA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/802b5172238c0ad46f3eccae84e795d8", "publishedAt": "2020-03-08T22:23:52Z", "content": "(Reuters) - The price of futures contracts for the S&amp;P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen.\r\nContracts for the S&amp;P 500 em… [+287 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "U.S. stock futures tumble at open on coronavirus contagion fears", "description": "Contracts for the S&P 500 emini were down 4.4% to 2834.25. Fear of the economic damage the coronavirus epidemic poses sent stocks lower on Friday, with the benchmark S&P 500 notching its 10th decline in 12 sessions.", "url": "https://news.yahoo.com/u-stock-futures-tumble-open-222352276.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/4BZ4kQJBB58e.L5vWmfi9Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/fEcc5vcrxjeGyhm6lcOFvQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/802b5172238c0ad46f3eccae84e795d8", "publishedAt": "2020-03-08T22:23:52Z", "content": "(Reuters) - The price of futures contracts for the S&amp;P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen.\r\nContracts for the S&amp;P 500 em… [+287 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists may have found a way to prevent coronavirus spread - The Medical News", "description": "Scientists may have found a way to prevent coronavirus spread The Medical News Opinion | It makes no sense for us to panic over the coronavirus Livemint COVID-19: An infection without borders Arab News Here’s Why Coronavirus Deaths Will Dramatically Decrease …", "url": "https://www.news-medical.net/news/20200308/Scientists-may-have-found-a-way-to-prevent-coronavirus-spread.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f3%2f226254_web_b70788add9364a40958293a0fa750b4b-620x480.jpg", "publishedAt": "2020-03-08T23:11:27Z", "content": "Just like any other virus, the coronavirus needs a host to survive. Viruses enter the cells of the human body to cause disease by attaching to a specific receptor site on the host cell membrane. To do this, they attach to proteins in the capsid through glycop… [+3863 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "CBS News Videos", "title": "California Governor Gavin Newsom gives update on coronavirus outbreak", "description": "California Governor Gavin Newsom gave an update on the outbreak of coronavirus in the state and on the disease-stricken cruise ship off the coast of Oakland. Watch his remarks here.", "url": "https://news.yahoo.com/california-governor-gavin-newsom-gives-224103175.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Y4WiYIxuQ1DLNNnz4GVW6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/XFo6dVQJF4.SAHpW_e_SSg--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/08/5e65759ab1172c645e16ba2c/5e65759ab1172c645e16ba2d_o_U_v2.jpg", "publishedAt": "2020-03-08T22:41:03Z", "content": "California Governor Gavin Newsom gave an update on the outbreak of coronavirus in the state and on the disease-stricken cruise ship off the coast of Oakland. Watch his remarks here."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Asian shares set to tumble, oil prices crash", "description": "Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price. The world's top oil exporter plans to raise it…", "url": "https://news.yahoo.com/asian-shares-set-tumble-oil-224804462.html", "urlToImage": null, "publishedAt": "2020-03-08T22:48:04Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Alyse Stanley on Earther, shared by Alyse Stanley to Gizmodo", "title": "The Coronavirus Outbreak Has Airlines Running Empty 'Ghost' Flights", "description": "Europe employs a “use it or lose it” system to determine an airline’s flight slots, so what are operators to do when a global outbreak tanks flight demands? The answer: “ghost” flights. More »", "url": "https://www.gizmodo.com.au/2020/03/the-coronavirus-outbreak-has-airlines-running-empty-ghost-flights/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/xcozkxh2t8t1zdp5nwf3.jpg", "publishedAt": "2020-03-08T22:37:00Z", "content": "Europe employs a use it or lose it system to determine an airlines flight slots, so what are operators to do when a global outbreak tanks flight demands? The answer: ghost flights.\r\nIts exactly what it sounds like: Airlines are currently flying planes devoid … [+1986 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "U.S. stock futures tumble at open on coronavirus contagion fears - Investing.com", "description": "U.S. stock futures tumble at open on coronavirus contagion fears Investing.com View Full Coverage on Google News", "url": "https://www.investing.com/news/stock-market-news/us-stock-futures-tumble-at-open-on-coronavirus-contagion-fears-2104268", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEG270VG_L.jpg", "publishedAt": "2020-03-08T22:41:30Z", "content": "(Reuters) - The price of futures contracts for the S&amp;P 500 index fell more than 4% on Sunday as trading for U.S. equity markets resumed, a sign that investors fear the toll from the fast-spreading coronavirus will deepen.\r\nContracts for the S&amp;P 500 em… [+204 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Oil futures fall over 20% after Saudi Arabia slashes selling prices", "description": "Oil futures dropped more than 20% on Sunday to their lowest since 2016 after Saudi Arabia slashed its official selling price (OSP), signaling the start of a price war after OPEC talks with Russia failed to produce an agreement on production cuts.", "url": "https://www.reuters.com/article/us-global-oil-idUSKBN20V131", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500529506&w=1200&r=LYNXMPEG270VC", "publishedAt": "2020-03-08T22:28:09Z", "content": "(Reuters) - Oil futures dropped more than 20% on Sunday to their lowest since 2016 after Saudi Arabia slashed its official selling price (OSP), signaling the start of a price war after OPEC talks with Russia failed to produce an agreement on production cuts. … [+557 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Ralph Flores", "title": "Financial institutions around the world buckle up for coronavirus outbreak", "description": "(Natural News) Major banks in the U.S. have started rolling out measures to deal with the impending coronavirus (COVID-19) epidemic, banking sources with knowledge of the matter told AFP. JPMorgan Chase, which employs over 250,000 employees worldwide, told it…", "url": "https://www.naturalnews.com/2020-03-08-financial-institutions-brace-for-coronavirus.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Market-Stock-Graph-Recession-Down-Crash-Finance.jpg", "publishedAt": "2020-03-08T22:12:44Z", "content": null}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump May Have Been Exposed To Coronavirus At CPAC (Jason Easley/POLITICUSUSA)", "description": "Jason Easley / POLITICUSUSA : Trump May Have Been Exposed To Coronavirus At CPAC — The organizer of CPAC interacted with the conference attendee who tested positive for coronavirus, and then he shook Trump's hand on stage. — Via The Washington Post: … Trump h…", "url": "https://www.memeorandum.com/200308/p64", "urlToImage": "https://www.politicususa.com/wp-content/uploads/2016/08/Trump-sick.jpg", "publishedAt": "2020-03-08T22:20:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Dow futures down more than 900 points, kicking off another rough week for the markets", "description": "Stock futures were down again Sunday evening as the novel coronavirus outbreak continues to roil financial markets.", "url": "https://www.cnn.com/2020/03/08/investing/stock-dow-futures-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200308183945-02-dow-futures-0308-super-tease.jpg", "publishedAt": "2020-03-08T23:02:15Z", "content": null}, {"source": {"id": null, "name": "Cbs12.com"}, "author": "Kyle Spinner", "title": "New case of coronavirus confirmed in Broward County - WPEC", "description": "New case of coronavirus confirmed in Broward County WPEC Cases of coronavirus in Florida up to 18, including 1 in Central Florida FOX 35 Orlando Third Broward Resident Tests Positive For Coronavirus, State Health Officials Say WLRN Coronavirus in Florida: Cru…", "url": "http://cbs12.com/news/local/new-case-of-coronavirus-confirmed-in-broward-county", "urlToImage": "http://static-22.sinclairstoryline.com/resources/media/29a367ea-d852-4634-bcb3-378676373590-large16x9_Coronavirus.JPG?1583708479843", "publishedAt": "2020-03-08T23:02:00Z", "content": null}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Tom Chang", "title": "\"Black Adam\": Dwayne Johnson Goes Beast Mode for DCEU Role", "description": "With the Netflix heist film Red Notice put on hold due to the coronavirus, Dwayne Johnson prepping for his next role as Black Adam for DC Extended Universe. The actor took to Instagram with a gym selfie ripped and bulging. \"The hierarchy of power in the DC Un…", "url": "https://www.bleedingcool.com/2020/03/08/black-adam-dwayne-johnson-goes-beast-mode-for-dceu-role/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2018/10/dwaynetherockjohnson.jpg", "publishedAt": "2020-03-08T22:45:39Z", "content": "With the Netflix heist film Red Notice put on hold due to the coronavirus, Dwayne Johnson prepping for his next role as Black Adam for DC Extended Universe. The actor took to Instagram with a gym selfie ripped and bulging.\r\nDwayne \"The Rock\" Johnson at the wo… [+1670 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Derek Hawkins, William Wan", "title": "Health agencies’ funding cuts challenge coronavirus response - The Washington Post", "description": "Almost 60,000 positions have been lost from local public health agencies since 2008", "url": "https://www.washingtonpost.com/health/health-agencies-funding-cuts-challenge-coronavirus-response/2020/03/08/73953314-5f0a-11ea-b014-4fafa866bb81_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/xDyfiZofpyYSPEilaJdMbQ4O48Q=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5ZWL5AS74UI6VECVL6QSTAN3X4.jpg", "publishedAt": "2020-03-08T22:42:45Z", "content": "When an outbreak hits, public health departments are Americas front line of defense. They investigate the infected and trace their contacts with other people, take passengers temperatures at the airport, harangue the public to wash their hands. They advise lo… [+7703 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "101 Countries Now Affected by Coronavirus, Death Toll Outside of China Surpasses 480 - WHO", "description": "MOSCOW (Sputnik) – Over 100 countries are now affected by the coronavirus disease (COVID-19) with the total number of confirmed cases worldwide having surpassed 105,580, the latest situation report of the World Health Organization (WHO) says.", "url": "https://sputniknews.com/world/202003081078514690-101-countries-now-affected-by-coronavirus-death-toll-outside-of-china-surpasses-480---who/", "urlToImage": "https://cdn2.img.sputniknews.com/images/103408/12/1034081208.jpg", "publishedAt": "2020-03-08T22:52:05Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "UEFA Bans Pre-Match Handshakes in All Competitions Amid Coronavirus Outbreak", "description": "MOSCOW (Sputnik) - The Union of European Football Associations (UEFA) announced a ban on pre-match handshakes between players and referees in all of its competitions amid the coronavirus outbreak, UEFA said on Sunday in a press release.", "url": "https://sputniknews.com/world/202003081078514571-uefa-bans-pre-match-handshakes-in-all-competitions-amid-coronavirus-outbreak/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107851/45/1078514595.jpg", "publishedAt": "2020-03-08T22:21:52Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ed Cara", "title": "Your Coronavirus FAQs, Answered: Wearing Masks, Cancelling Air Travel, And More", "description": "The ongoing outbreak of a newly discovered, sometimes fatal coronavirus has many people wondering how much they should be altering their daily lives to avoid infection. As the disease known as COVID-19 has begun spreading locally in parts of the U.S., we’ve c…", "url": "https://www.gizmodo.com.au/2020/03/your-coronavirus-faqs-answered-wearing-masks-canceling-air-travel-and-more/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ubxfbsplzmfulfgsoi6a.jpg", "publishedAt": "2020-03-08T22:23:00Z", "content": "The ongoing outbreak of a newly discovered, sometimes fatal coronavirus has many people wondering how much they should be altering their daily lives to avoid infection. As the disease known as COVID-19 has begun spreading locally in parts of the U.S., weve co… [+9010 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "How Trump Made Coronavirus Crisis Worse", "description": "Politico: “For six weeks behind the scenes, and now increasingly in public, Trump has undermined his administration’s own efforts to fight the coronavirus outbreak — resisting attempts to plan for worst-case scenarios, overturning a public-health plan upon re…", "url": "https://politicalwire.com/2020/03/08/how-trump-made-coronavirus-crisis-worse/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-08T22:14:14Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bloomberg News", "title": "U.S. Targets Cruise Lines; France Bars Big Events: Virus Update", "description": "(Bloomberg) -- U.S. travelers with health problems are being told to avoid cruise ships as the nation prepares for more disruptions. Italy’s coronavirus deaths rose by 57%, eclipsing South Korea.Seattle said two more nursing home residents died, pushing the l…", "url": "https://finance.yahoo.com/news/u-targets-cruise-lines-france-221535361.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uv6oi4iTpqhEnMmUgT0.wQ--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/35d4294be4f2989028caed68f63f04a2", "publishedAt": "2020-03-08T22:15:35Z", "content": "(Bloomberg) -- U.S. travelers with health problems are being told to avoid cruise ships as the nation prepares for more disruptions. Italys coronavirus deaths rose by 57%, eclipsing South Korea.\r\nSeattle said two more nursing home residents died, pushing the … [+7246 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Norihiko Shirouzu and Yilei Sun", "title": "As one of China's 'Detroits' reopens, world's automakers worry about disruptions", "description": "Automakers across the world face the possibility of extended supply chain disruptions as factories in China stutter back to life after closures due to the coronavirus outbreak. The car industry is especially exposed as Wuhan - the epicenter of the outbreak - …", "url": "https://finance.yahoo.com/news/one-chinas-detroits-reopens-worlds-230407836.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/n9hD2b45nUEyohU3u5CEgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/Zm.IFdVuGpC48Y6ndN3c4g--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/8bd3e1ad55f4d9df844268df199d0833", "publishedAt": "2020-03-08T23:04:07Z", "content": "By Norihiko Shirouzu and Yilei Sun\r\nBEIJING (Reuters) - Automakers across the world face the possibility of extended supply chain disruptions as factories in China stutter back to life after closures due to the coronavirus outbreak.\r\nThe car industry is espec… [+5194 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Wayne Cole", "title": "Asian shares slammed in panicked trade, oil prices crash", "description": "Asian shares were set for a pounding on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price. The world's top oil exporter plans to raise its prod…", "url": "https://news.yahoo.com/asian-shares-set-tumble-oil-224804905.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NFHtS.5ng.qRrR76gEj2ZQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/MJ4HBHOWABXc4sXbcKH6kA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/67ad37fc0a0a6ee7567649bf2de40421", "publishedAt": "2020-03-08T22:48:04Z", "content": "By Wayne Cole\r\nSYDNEY (Reuters) - Asian shares were set for a pounding on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price.\r\nThe world's top o… [+3905 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Dow futures tumble 900 points as all-out oil price war adds to coronavirus stress (Yun Li/CNBC)", "description": "Yun Li / CNBC : Dow futures tumble 900 points as all-out oil price war adds to coronavirus stress — Stock futures tumbled in overnight trading Sunday as investors continued to brace for the economic fallout from the spreading coronavirus, while a shocking all…", "url": "https://www.memeorandum.com/200308/p65", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106422106-15832464032602020-03-02t213936z_125693340_rc2xbf9yv2ow_rtrmadp_3_usa-stocks.jpg?v=1583246454", "publishedAt": "2020-03-08T22:50:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Sarah K. Burris", "title": "State Department issues warning to stay off cruise ships if you have health issues", "description": "The coronavirus seems to be single-handedly taking down the cruise line industry. Sunday afternoon, the State Department issued an official warning to those with underlying health issues should stay away from cruise ships. “U.S. citizens, particularly travele…", "url": "https://www.rawstory.com/2020/03/state-department-issues-warning-to-stay-off-cruise-ships-if-you-have-health-issues/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/california-cruise-ship-1000x600.jpeg", "publishedAt": "2020-03-08T22:30:34Z", "content": "The coronavirus seems to be single-handedly taking down the cruise line industry. Sunday afternoon, the State Department issued an official warning to those with underlying health issues should stay away from cruise ships. \r\nU.S. citizens, particularly travel… [+849 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Ethan Huff", "title": "Trump administration's promise of \"one million\" coronavirus test kits turns out to be empty words... why can't the USA test people like South Korea does?", "description": "(Natural News) The Trump administration made a lofty promise the other day to deliver about a million new tests for the Wuhan coronavirus (CoVid-19) by the end of the week, despite ongoing shortages. And as to be expected, there was just one glaring problem: …", "url": "https://www.naturalnews.com/2020-03-08-trump-administration-promise-one-million-coronavirus-test-kits-empty-words.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/trump-situation-room.jpg", "publishedAt": "2020-03-08T22:11:42Z", "content": null}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Mike Adams", "title": "Leaked medical conference documents reveal US hospitals preparing for 96 million coronavirus infections and 480,000 deaths", "description": "(Natural News) Leaked documents from a lecturer at the American Hospital Association (AHA) conference in February reveal that US hospitals are preparing for: – 96 million coronavirus infections – 4.8 million hospitalizations – 480,000 deaths in the USA This i…", "url": "https://www.naturalnews.com/2020-03-08-leaked-medical-conference-documents-hospitals-preparing-for-96-million-coronavirus-infections.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Hospital-Bed-Ward-Busy-Medical-Clinic-Nurse.jpg", "publishedAt": "2020-03-08T22:40:25Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Need a coronavirus refund for your hotel or vacation rental? It's complicated", "description": "Not all hotels or home rentals will automatically give you a refund if your conference is canceled because of coronavirus concerns, or if the virus spreads to your vacation spot.", "url": "https://www.cnn.com/travel/article/coronavirus-refunds-for-hotels-airbnb/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306172549-sxsw-06-file-super-tease.jpg", "publishedAt": "2020-03-08T22:41:06Z", "content": "Jen Rose Smith, CNNPublished 8th March 2020\r\n(CNN) Michael Moldofsky booked a seven-bedroom rental house in Austin, Texas, months in advance using the vacation rental site VRBO.\r\nThe Los Angeles-based consultant planned to attend Zoholics, an annual software … [+5273 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "BCIT grad makes his own site to track COVID-19", "description": "Curtis Kim wants to make information about the ongoing coronavirus outbreak accessible to the masses.", "url": "https://www.cbc.ca/news/canada/british-columbia/covid-19-tracker-bcit-1.5490406", "urlToImage": "https://i.cbc.ca/1.5490408.1583688588!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/curtis-kim.jpeg", "publishedAt": "2020-03-08T22:26:42Z", "content": "When the coronavirus outbreak started making global headlines, Curtis Kim's eyeballs were glued to his computer screen, constantly scanning for the newest information.\r\nThat's when he realised that a lot of the data published by online by journals and major n… [+2163 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "OLGA R. RODRIGUEZ", "title": "California public venues, schools close to stop coronavirus spread; Princess cruise ship soon headed to Oakland", "description": "A cruise ship with at least 21 cases of the new coronavirus is headed to the port of Oakland, Calif., but will remain in international waters for at least another day. Meanwhile, local officials in California began ordering the closure of schools and public s…", "url": "https://www.bostonglobe.com/2020/03/08/nation/california-public-venues-schools-close-stop-coronavirus-spread-princess-cruise-ship-soon-headed-oakland/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/fP813QkWszIv3EQyDchlbR7ClIc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/426EWECJJRCOZGBAKWTWP4ORQQ.jpg", "publishedAt": "2020-03-08T22:24:22Z", "content": "Gov. Gavin Newsom warned Sunday that more closures are likely around the state as the virus spreads as he prepared for the Monday arrival of the Grand Princess carrying more than 3,500 people from 54 countries.\r\nThe port at Oakland was chosen because of its p… [+4908 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Wayne Cole", "title": "Asian shares set to tumble, oil prices crash", "description": "Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price. The world's top oil exporter plans to raise it…", "url": "https://finance.yahoo.com/news/asian-shares-set-tumble-oil-224804462.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/oKZ2orkQf3kgH8FAvait.w--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/67ad37fc0a0a6ee7567649bf2de40421", "publishedAt": "2020-03-08T22:48:04Z", "content": "By Wayne Cole\r\nSYDNEY (Reuters) - Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20% after Saudi Arabia slashed its official selling price.\r\nThe world's… [+3170 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Coronavirus fears, violence hit International Women's Day rallies", "description": "PARIS: Tens of thousands took to the streets across the globe to mark International Women's Day on Sunday (Mar 8) despite many events in Asia being cancelled because of the coronavirus outbreak, and attacks on women at some events in Europe and Asia. Women we…", "url": "https://www.channelnewsasia.com/news/world/coronavirus-fears-violence-hit-international-women-s-day-rallies-12516116", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12516114/16x9/991/557/87a5ac02714fc1bb6d941c683064fcca/tZ/kiev-joined-a-slew-of-other-european-cities-in-holding-a-rally-to-demand-more-respect-for-women-s-rights-1583681419072-4.jpg", "publishedAt": "2020-03-08T23:01:07Z", "content": "PARIS: Tens of thousands took to the streets across the globe to mark International Women's Day on Sunday (Mar 8) despite many events in Asia being cancelled because of the coronavirus outbreak, and attacks on women at some events in Europe and Asia.\r\nWomen w… [+4310 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "SA Eli Hoffmann", "title": "The coronavirus 'tipping point'", "description": "<ul><li>Coronavirus causes <a href=\"https://www.bloomberg.com/news/articles/2020-03-08/coronavirus-nears-fatal-tipping-point-when-lungs-are-inflamed\" target=\"_blank\">little more than a cough</a> if it stays in the nose and throat, which it does for the majori…", "url": "https://seekingalpha.com/news/3549586-coronavirus-tipping-point", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-03-08T23:00:58Z", "content": "Coronavirus causes little more than a cough if it stays in the nose and throat, which it does for the majority of people infected. Danger starts when it reaches the lungs, according to a report by the World Health Organization. At that point, one in seven pat… [+1060 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Asian shares set to tumble, oil prices crash", "description": "Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20per cent after Saudi Arabia slashed its official selling price.", "url": "https://www.channelnewsasia.com/news/business/asian-shares-set-to-tumble--oil-prices-crash-12516926", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12516924/16x9/991/557/4b3303844e668d2c869effd868faf031/yQ/a-man-wearing-a-protective-face-mask-talks-on-his-mobile-phone-in-front-of-a-screen-showing-the-nikkei-index-in-tokyo-1.jpg", "publishedAt": "2020-03-08T22:50:19Z", "content": "SYDNEY: Asian share markets were set for a beating on Monday as investors fled to bonds to hedge the economic shock of the coronavirus, and oil plunged more than 20per cent after Saudi Arabia slashed its official selling price.\r\nThe world's top oil exporter p… [+3253 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "David Jackson", "title": "Coronavirus status -- updated Sunday edition", "description": "<ul><li>Iran: An official <a href=\"https://en.radiofarda.com/a/iran-official-says-200-dead-of-coronavirus-in-one-province-alone/30476161.html\" target=\"_blank\">says</a> 200 people have died of coronavirus in one province alone.</li><li>Israel: The government r…", "url": "https://seekingalpha.com/news/3549584-coronavirus-status-updated-sunday-edition", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-03-08T22:13:39Z", "content": "Iran: An official says 200 people have died of coronavirus in one province alone.\r\nIsrael: The government reported a jump in coronovirus cases from 27 to 39, and said that 100,000 people are in 2 week home-quarantine.\r\nItaly: The death toll from COVID-19 jump… [+598 chars]"}, {"source": {"id": null, "name": "Metafilter.com"}, "author": "Spokane", "title": "Coronavirus resources for institutions?", "description": "Related to coronavirus, (1) Is it fair to say that the lack of US national leadership is slowing adoption of social distancing measures? If so, (2) has anyone put together a resource for those of us with influence on when own workplaces to take action? Most o…", "url": "http://ask.metafilter.com/342578/Coronavirus-resources-for-institutions", "urlToImage": "http://cdn.mefi.us/images/askmefi/apple-touch-icon.png", "publishedAt": "2020-03-08T22:41:38Z", "content": null}, {"source": {"id": null, "name": "Worldsoccertalk.com"}, "author": "AFP", "title": "Closed-door victories take Moroccan clubs to CAF Cup semi-finals", "description": "Johannesburg (AFP) – Moroccan clubs Hassania Agadir and Renaissance Berkane reached the CAF Confederation Cup semi-finals Sunday with victories played behind closed doors owing to the coronavirus. Authorities in the north African kingdom have ordered...", "url": "https://worldsoccertalk.com/2020/03/08/closed-door-victories-take-moroccan-clubs-to-caf-cup-semi-finals/", "urlToImage": "https://worldsoccertalk.com/wp-content/uploads/2020/03/f12b21da92dd169800b15eeba8f6d16d7ddb749a.jpg", "publishedAt": "2020-03-08T22:45:08Z", "content": "Johannesburg (AFP) – Moroccan clubs Hassania Agadir and Renaissance Berkane reached the CAF Confederation Cup semi-finals Sunday with victories played behind closed doors owing to the coronavirus.Authorities in the north African kingdom have ordered all domes… [+2341 chars]"}, {"source": {"id": null, "name": "Theprofessorisin.com"}, "author": "Karen Kelsky", "title": "Coronavirus Post I: Listing Cancelled Conferences and Shaking Hands", "description": "I am determined to use The Professor Is In platform to share as much info as I can about dealing with the impact of Coronavirus on academic environments. Please know that like everyone I’m responding quickly to evolving circumstances, so … Continue reading →", "url": "http://theprofessorisin.com/2020/03/08/coronavirus-post-i-listing-cancelled-conferences-and-shaking-hands/", "urlToImage": null, "publishedAt": "2020-03-08T22:38:42Z", "content": "I am determined to use The Professor Is In platform to share as much info as I can about dealing with the impact of Coronavirus on academic environments. Please know that like everyone I’m responding quickly to evolving circumstances, so if you feel I’ve miss… [+1290 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Marc Deschamps", "title": "TurboGrafx 16 Mini Delayed Due to Coronavirus", "description": "Coronavirus could have a rather disastrous impact on the video game industry, as a whole. The fact of the matter is that a lot of console parts are manufactured in China, where the virus has hit the hardest. As a result, Nintendo Switch units are expected to …", "url": "https://comicbook.com/gaming/2020/03/08/turbografx-16-mini-delayed-coronavirus/", "urlToImage": "https://media.comicbook.com/2019/07/turbografx-16-mini-offiical-1178931-640x320.jpeg", "publishedAt": "2020-03-08T22:24:00Z", "content": "Coronavirus could have a rather disastrous impact on the video game industry, as a whole. The fact of the matter is that a lot of console parts are manufactured in China, where the virus has hit the hardest. As a result, Nintendo Switch units are expected to … [+2728 chars]"}, {"source": {"id": null, "name": "Kidsactivitiesblog.com"}, "author": "Brittanie", "title": "Costco Is No Longer Giving Out Free Samples Due to The Coronavirus", "description": "I just knew this day was coming. On Wednesday of last week my son and I were enjoying some samples of those tasty chicken sausages (and ultimately bought some). By yesterday I had noticed that there weren’t any vendors giving out samples and now I know why. C…", "url": "https://kidsactivitiesblog.com/135373/costco-is-no-longer-giving-out-free-samples-due-to-the-coronavirus/", "urlToImage": "https://kidsactivitiesblog.com/wp-content/uploads/2020/03/shutterstock_1415098049-1024x683.jpg", "publishedAt": "2020-03-08T22:47:01Z", "content": "March 8, 2020 by BrittanieLeave a Comment\r\nI just knew this day was coming. On Wednesday of last week my son and I were enjoying some samples of those tasty chicken sausages (and ultimately bought some). By yesterday I had noticed that there weren’t any vendo… [+1030 chars]"}, {"source": {"id": null, "name": "Nj1015.com"}, "author": "davidmatthau", "title": "Flu activity and danger still high in NJ, especially for kids - New Jersey 101.5 FM Radio", "description": "Flu activity and danger still high in NJ, especially for kids New Jersey 101.5 FM Radio View Full Coverage on Google News", "url": "https://nj1015.com/2020-flu-season-a-rough-one-for-children-2-pediatric-deaths-in-nj/", "urlToImage": "https://townsquare.media/site/385/files/2020/03/RS1133_56499461.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2020-03-08T22:56:00Z", "content": "While much of the focus in New Jersey is on the novel coronavirus, were still dealing with high levels of influenza.\r\nThis year the flu is posing an elevated risk to children and younger adults.\r\nData from the Centers for Disease Control and Prevention shows … [+1933 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Dow Futures Crash 1,000 Points as Saudi Arabia Destroys Oil Prices - CCN.com", "description": "Dow Futures Crash 1,000 Points as Saudi Arabia Destroys Oil Prices CCN.com Coronavirus outbreak: Trading resumes on Dow Jones after massive opening drop | LIVE Global News Dow slumps 2,000 points after oil shock Moneycontrol After brief trading halt, US stock…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiVmh0dHBzOi8vd3d3LmNjbi5jb20vZG93LWZ1dHVyZXMtY3Jhc2gtMTAwMC1wb2ludHMtYXMtc2F1ZGktYXJhYmlhLWRlc3Ryb3lzLW9pbC1wcmljZXMv0gFWaHR0cHM6Ly93d3cuY2NuLmNvbS9kb3ctZnV0dXJlcy1jcmFzaC0xMDAwLXBvaW50cy1hcy1zYXVkaS1hcmFiaWEtZGVzdHJveXMtb2lsLXByaWNlcy8?oc=5", "urlToImage": null, "publishedAt": "2020-03-08T22:23:00Z", "content": null}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Allison DeAngelis", "title": "Biogen's coronavirus cases rise, implicating another Boston health care event", "description": "Approximately 26 employees at Biogen, 23 of whom live in-state, have now tested positive for the coronavirus COVID-19 after attending a company meeting late last month — including one employee who then attended another biotech conference elsewhere in Boston t…", "url": "https://www.bizjournals.com/boston/news/2020/03/08/biogens-coronavirus-cases-rise-implicating-another.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_boston+%28Boston+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-03-08T22:55:06Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Coronavirus Outbreak: 1 more suspected case in Agra, govt deploys additional officials", "description": "One more suspected case of coronavirus has emerged from Agra, the UP health department said on Sunday. The latest case is a contact of the Delhi resident, who was found positive of Covid-19 earlier, the UP Directorate of Health Services said in its latest bul…", "url": "https://indianexpress.com/article/india/coronavirus-outbreak-1-more-suspected-case-in-agragovt-deploys-additional-officials-6306013/", "urlToImage": "https://images.indianexpress.com/2020/03/taj-759.jpg?w=759", "publishedAt": "2020-03-08T22:24:43Z", "content": "Tourists at the Taj Mahal, engulfed in fog, in Agra on Sunday. (PTI)One more suspected case of coronavirus has emerged from Agra, the UP health department said on Sunday. The latest case is a contact of the Delhi resident, who was found positive of Covid-19 e… [+2616 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Rich Lowry, Rich Lowry", "title": "The Coronavirus Is Not a Personal Affront", "description": "Trump cares a lot about numbers — polls numbers, audience size, the Dow Jones, etc. He made it clear in his visit to the CDC that he also cares about coronavirus numbers. He said he opposed bringin…", "url": "https://www.nationalreview.com/corner/the-coronavirus-is-not-a-personal-affront/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/coronavirus.jpg?resize=300%2C300&ssl=1", "publishedAt": "2020-03-08T22:39:07Z", "content": null}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Marisa Ingemi", "title": "Canceled Women’s Worlds decreases already-shortened schedule for some elite players", "description": "No matter the circumstances, the Women's World Championships being cancelled this year would be bad for hockey. That it's happening during one of the lighter schedules ever for some elite players, though, makes it an even tougher pill to swallow. Hockey Canad…", "url": "https://www.bostonherald.com/2020/03/08/canceled-womens-worlds-decreases-already-shortened-schedule-for-some-elite-players/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2019/02/AP_19046081697793.jpg?w=1024&h=682", "publishedAt": "2020-03-08T22:54:05Z", "content": "No matter the circumstances, the Women’s World Championships being canceled this year is bad for hockey.\r\nThat it’s happening during one of the lighter schedules ever for some elite players, though, makes it an even tougher pill to swallow.\r\nHockey Canada and… [+3150 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "MELANIE CARROLL", "title": "Coronavirus worries oil producers, but Kiwi motorists are missing out on petrol price cuts", "description": "The price of oil is falling sharply overseas, but the price at some pumps isn't reflecting that, the AA says.", "url": "https://www.stuff.co.nz/business/industries/120115451/coronavirus-worries-oil-producers-but-kiwi-motorists-are-missing-out-on-petrol-price-cuts", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/i/i/9/f/image.related.StuffLandscapeSixteenByNine.1420x800.1zihob.png/1583707935200.jpg", "publishedAt": "2020-03-08T22:39:24Z", "content": "The price of oil is falling sharply overseas, but that's not reflected at the pump for many New Zealand motorists.\r\n There has been a 15 cent decline in the cost of importing refined petrol to New Zealand so far this year, which would come as news to some peo… [+2835 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sarah Ponczek and Lu Wang", "title": "Rout in U.S. Stock Futures Would Trigger Trading Curbs at 5%", "description": "(Bloomberg) -- Waves of selling in U.S. stock index futures have the potential to trigger Chicago Mercantile Exchange limits that prevent declines from surpassing 5%, as investors braced for the possibility the coronavirus will tip the economy into recession.…", "url": "https://finance.yahoo.com/news/rout-u-stock-futures-trigger-221631295.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/zSdHtK56SIVO7xl1ldJHjg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/1bc2c93afb812b591be5e36c28cf9910", "publishedAt": "2020-03-08T22:16:31Z", "content": "(Bloomberg) -- Waves of selling in U.S. stock index futures have the potential to trigger Chicago Mercantile Exchange limits that prevent declines from surpassing 5%, as investors braced for the possibility the coronavirus will tip the economy into recession.… [+2582 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Jenna Anderson", "title": "Jason Momoa Hand-Washing Meme Goes Viral in Coronavirus Hysteria", "description": "The COVID-19 coronavirus is impacting society in some ever-changing ways, as those throughout the world are worried about contracting or spreading the virus. The concerns have led to closures of major events and public gatherings, the delay of major movies, a…", "url": "https://comicbook.com/dc/2020/03/08/coronavirus-covid-19-hand-washing-tips-meme-jason-momoa-aquaman/", "urlToImage": "https://media.comicbook.com/2017/10/justice-league-aquaman-1038234-640x320.png", "publishedAt": "2020-03-08T22:51:00Z", "content": "The COVID-19 coronavirus is impacting society in some ever-changing ways, as those throughout the world are worried about contracting or spreading the virus. The concerns have led to closures of major events and public gatherings, the delay of major movies, a… [+2854 chars]"}, {"source": {"id": null, "name": "Studiodiy.com"}, "author": "Kelly", "title": "Happy Weekend!", "description": "Hi All! I took a bit of a break from social media this week as the coronavirus talk was becoming really traumatic to hear. I’m one of those people that falls into the “at risk” group since I have a compromised immune system, and since I’ve been sick for about…", "url": "https://studiodiy.com/2020/03/08/happy-weekend-228/", "urlToImage": "https://studiodiy.com/wp-content/uploads/2019/12/Blue-and-Terracotta-Guest-Bathroom-Makeover-8-600x900.jpg", "publishedAt": "2020-03-08T22:48:00Z", "content": "Hi All! I took a bit of a break from social media this week as the coronavirus talk was becoming really traumatic to hear. I’m one of those people that falls into the “at risk” group since I have a compromised immune system, and since I’ve been sick for about… [+1656 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christina Zhao", "title": "Tapper Presses U.S. Surgeon General on Whether Trump Is 'Artificially' Keeping Coronavirus Figures Low", "description": "The president \"doesn't want to bring people in because the numbers will double. That's not a medical decision, that's a public relations decision,\" Tapper said.", "url": "https://www.newsweek.com/tapper-presses-us-surgeon-general-whether-trump-artificially-keeping-coronavirus-figures-low-1491136", "urlToImage": "https://d.newsweek.com/en/full/1572295/jermone-adams.png", "publishedAt": "2020-03-08T22:47:30Z", "content": "CNN host Jake Tapper grilled U.S. Surgeon General Jerome Adams on President Donald Trump and his administration's handling of the coronavirus outbreak on Sunday, asking whether the president's desire is to \"artificially keep the numbers low.\"\r\nMore than 400 c… [+3044 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Aditya Raghunath)", "title": "If You Invested $1,000 in Okta's IPO, Here's How Much You'd Have Today", "description": "The digital-identity company has crushed the broader market since its IPO. Will it manage to outperform in the next decade?", "url": "https://www.fool.com/investing/2020/03/08/if-invested-1000-okta-ipo-heres-how-much-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561895/okta.jpg", "publishedAt": "2020-03-08T22:14:00Z", "content": "Okta (NASDAQ:OKTA) is one of the pioneers in the access-management and digital-identity space. Making its debut on the public markets in April 2017, the company priced its shares at $17. \r\nIt raised nearly $200 million in the IPO and was previously backed by … [+4777 chars]"}, {"source": {"id": null, "name": "Cyclingtips.com"}, "author": "wade wallace", "title": "French rider admits to using EPO, Paris Nice underway: Daily News Digest", "description": "Supported by Usually the talk of the town at this time of the year would be all about Strade Bianche - pro cycling's darling child of the early spring classics. Who would have won? We really have no idea at this time of the season and that’s one of the many s…", "url": "https://cyclingtips.com/2020/03/french-rider-admits-to-using-epo-paris-nice-underway-daily-news/", "urlToImage": "https://cdn-cyclingtips.pressidium.com/wp-content/uploads/2020/03/Kramon_StradeBianche2020_00001.jpg", "publishedAt": "2020-03-08T23:09:20Z", "content": "(Want the Daily News Digest delivered directly to your inbox? Heres the sign-up.)\r\nHello again, CyclingTips readers.\r\nUsually the talk of the town at this time of the year would be all about Strade Bianche – pro cycling’s darling child of the early spring cla… [+5657 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andy Gregory, Andy Gregory", "title": "NYPD orders investigation into video showing violent arrest involving multiple officers", "description": "Force says 20-year-old fled after being spotted smoking cannabis", "url": "https://www.independent.co.uk/news/world/americas/police-brutality-nypd-new-york-black-bill-de-blasio-fitzroy-gayle-a9385666.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/08/20/fitzroy-gayle-arrest.jpg", "publishedAt": "2020-03-08T22:51:36Z", "content": "The NYPD has launched an internal investigation after footage appeared to show at least eight officers violently arresting a young black man.\r\nThe video viewed millions of times on social media has sparked protests outside the local police precinct, and ignit… [+29896 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Sarah Dai, Sarah Dai", "title": "How China's investment in health care AI helps it deal with the coronavirus crisis", "description": "When China announced its initial team of national artificial intelligence (AI) champions in 2017, Tencent Holdings was tasked with leading the development of computer vision for medical diagnosis.Soon after, the company launched an AI medical imaging platform…", "url": "https://www.scmp.com/tech/policy/article/3073929/how-chinas-investment-health-care-ai-helps-it-deal-coronavirus-crisis", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/06/9955cfb6-5f7b-11ea-be3e-43af5536d789_image_hires_152637.JPG?itok=halhs7pU&v=1583479603", "publishedAt": "2020-03-08T22:30:09Z", "content": "Published: 6:30am, 9 Mar, 2020\r\nUpdated: 6:30am, 9 Mar, 2020"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Box Office: Pixar's Onward Does Well In US But Stumbles Internationally Amid Coronavirus Concerns", "description": "The latest box office numbers are in, and Pixar's Onward was unsurprisingly the biggest movie of the weekend in America. The film raked in $40.4 million in the US, which is a huge number, but it's also well below the $50 million that estimates suggested. The …", "url": "https://www.gamespot.com/articles/box-office-pixars-onward-does-well-in-us-but-stumb/1100-6474514/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1179/11799911/3642369-pix.png", "publishedAt": "2020-03-08T22:34:00Z", "content": "The latest box office numbers are in, and Pixar's Onward was unsurprisingly the biggest movie of the weekend in America. The film raked in $40.4 million in the US, which is a huge number, but it's also well below the $50 million that estimates suggested.\r\nThe… [+2338 chars]"}]