[{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters", "title": "American and Delta suspended their 2020 guidance as the coronavirus wreaks havoc on air travel around the world (DAL, UAL, AAL, LUV)", "description": "Clodagh Kilcoyne/Reuters Delta on Tuesday suspended its 2020 financial guidance as the novel coronavirus wreaked havoc on the airline industry. Across the board, American carriers have cut capacity, warned of falling revenues, and instituted pay freezes to gr…", "url": "https://www.businessinsider.com/us-airlines-ditch-2020-outlooks-slash-flights-on-virus-hit-2020-3", "urlToImage": "https://i.insider.com/5c3dff042ab31e394a4856e4?width=1200&format=jpeg", "publishedAt": "2020-03-10T13:06:00Z", "content": "Leading U.S. airlines American and Delta suspended 2020 financial guidance on Tuesday and took drastic further measures to combat the impact of the coronavirus as the head of smaller rival Southwest took a 10% pay cut.\r\nThe sector has been the hardest hit in … [+1788 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Harvard to move to virtual classes amid coronavirus outbreak", "description": "Harvard University asked its students on Tuesday not to return to campus after Spring Break and said it would begin moving to virtual instruction for graduate and undergraduate classes amid the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-health-coronavirus-harvard-idUSKBN20X1T6", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501251581&w=1200&r=LYNXMPEG29153", "publishedAt": "2020-03-10T13:06:58Z", "content": "(Reuters) - Harvard University asked its students on Tuesday not to return to campus after Spring Break and said it would begin moving to virtual instruction for graduate and undergraduate classes amid the coronavirus outbreak. \r\nThe university’s goal is to c… [+293 chars]"}, {"source": {"id": null, "name": "Wsbtv.com"}, "author": "WSBTV.com News Staff", "title": "Delta Air Lines reducing flights, announced other changes amid coronavirus outbreak - WSB Atlanta", "description": "Delta Air Lines reducing flights, announced other changes amid coronavirus outbreak WSB Atlanta American and Delta slash US and overseas flights as coronavirus causes plunge in bookings CNN Delta Air Lines waives change fees for all tickets purchased in March…", "url": "https://www.wsbtv.com/news/local/delta-air-lines-reducing-flights-announces-other-changes-amid-coronavirus-outbreak/RFOQ323PRJBI5IAJVHXVELJBOA/", "urlToImage": "https://www.wsbtv.com/resizer/_vSVPxzvW1tLosX7D6vmEy_dM7E=/1200x628/arc-anglerfish-arc2-prod-cmg.s3.amazonaws.com/public/5IV2PG22V5EMRPKDQHEHPRM7JE.jpg", "publishedAt": "2020-03-10T12:35:14Z", "content": "ATLANTA — As the coronavirus continues to spread in the United States and impact the economy, Atlanta-based Delta Air Lines announce changes. \r\nDelta says it will reduce capacity by 15 points versus its plan, with international capacity reduced by 20-25 perce… [+1136 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Carmen Reinicke), Carmen Reinicke", "title": "Oil bounces back from worst day in 29 years amid prospect of US tax-cut stimulus", "description": "REUTERS/Lee Celano Oil prices rebounded on Tuesday from steep losses on Monday, the worst day for the commodity since 1991, amid the coronavirus outbreak and an unexpected price war. Brent crude, was up more than 10% to $37.84 per barrel in early trading in N…", "url": "https://markets.businessinsider.com/commodities/news/oil-price-rebound-worst-day-1991-potential-tax-cuts-stimulus-2020-3-1028980722", "urlToImage": "https://images.markets.businessinsider.com/image/537c94b26bb3f7d93f57d10e-2400/louisiana-deepwater-oil-rig-1.jpg", "publishedAt": "2020-03-10T13:01:54Z", "content": "REUTERS/Lee Celano\r\n<ul><li>Oil prices rebounded on Tuesday from steep losses on Monday, the worst day for the commodity since 1991, amid the coronavirus outbreak and an unexpected price war.Â </li><li>Brent crude, was up more than 10% to $37.84 per barrel in… [+2414 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Joe Rossignol", "title": "Apple Employee Tests Positive for Coronavirus in Ireland", "description": "Apple today confirmed that an employee has tested positive for the COVID-19 coronavirus at its campus in Cork, Ireland. In a statement issued to Independent.ie, Apple said the individual has gone into and remains in self-isolation. Apple employees working at …", "url": "https://www.macrumors.com/2020/03/10/apple-employee-coronavirus-ireland/", "urlToImage": "https://images.macrumors.com/article-new/2020/03/cork_campus_ireland_team_members_working_on_two_floors_20171106_carousel.jpg.large_2x.jpg", "publishedAt": "2020-03-10T12:28:26Z", "content": "Apple today confirmed that an employee has tested positive for the COVID-19 coronavirus at its campus in Cork, Ireland. In a statement issued to Independent.ie, Apple said the individual has gone into and remains in self-isolation.\r\nApple employees working at… [+1575 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Saudi energy minister: no need for OPEC+ meet if no agreement on handling oil market crisis", "description": "Saudi Arabia’s energy minister said on Tuesday he does not see a need to hold an OPEC+ meeting in May-June if there was no agreement on what measures should be taken to deal with the impact of the coronavirus on oil demand and prices.", "url": "https://www.reuters.com/article/us-saudi-oil-minister-idUSKBN20X19L", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501249667&w=1200&r=LYNXMPEG290RC", "publishedAt": "2020-03-10T13:01:20Z", "content": "DUBAI (Reuters) - Saudi Arabia’s energy minister said on Tuesday he does not see a need to hold an OPEC+ meeting in May-June if there was no agreement on what measures should be taken to deal with the impact of the coronavirus on oil demand and prices. \r\n“I f… [+741 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Secon", "title": "The coronavirus poses a major threat to homeless populations in San Francisco, LA, and Seattle — the two crises could soon intersect", "description": "San Francisco and Los Angeles have growing numbers of coronavirus cases, and they also have large homeless populations. The risk of contracting infectious diseases is high among people living on the streets or in shelters. Advocates say cities need to do more…", "url": "https://www.businessinsider.com/coronavirus-risk-homeless-people-san-francisco-la-2020-3", "urlToImage": "https://i.insider.com/5e62c2d7fee23d16c76e7894?width=1200&format=jpeg", "publishedAt": "2020-03-10T12:19:00Z", "content": "California has more than 130 cases of coronavirus — a number increasing by the day. The best ways to avoid contracting the virus are washing your hands frequently, avoiding touching your face, and keeping your distance from sick people. But for the over 150,0… [+5513 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson", "title": "Italians have been told they won't have to pay their mortgage payments while the country goes into coronavirus lockdown", "description": "Mortgage payments will be suspended across the whole of Italy as the country struggles to deal with the coronavirus outbreak. Italy's coronavirus death toll jumped from 366 to 463 on Monday, making it the worst-hit country after China. The Italian government …", "url": "https://www.businessinsider.com/coronavirus-covid-19-italy-mortgage-payments-suspended-during-lockdown-2020-3", "urlToImage": "https://i.insider.com/5e677f2554f25c71b516da25?width=1200&format=jpeg", "publishedAt": "2020-03-10T12:30:00Z", "content": "Payments on mortgages will be suspended across the whole of Italy after the Italian government placed the entire population on lockdown due to the coronavirus outbreak.\r\nAsked about the possibility of mortgage payments being temporarily frozen, the country's … [+1803 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier and Reuters", "title": "A Boeing employee has tested positive for coronavirus in Washington (BA)", "description": "A Boeing employee in Washington has tested positive for the coronavirus, the company said late Monday. Coworkers of the affected employee have been asked to self-quarantine and monitor for any symptoms, Boeing said. Any other workers who are able to telecommu…", "url": "https://www.businessinsider.com/boeing-says-employee-tests-positive-for-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e678a75e4f9fe0176287ab4?width=1200&format=jpeg", "publishedAt": "2020-03-10T12:44:00Z", "content": "Boeing said late on Monday an employee at its Everett facility in Washington state has tested positive for the coronavirus and has now been quarantined.\r\n\"As a precaution, we've asked all coworkers of the employee who were in close contact to remain home to s… [+888 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andrew Dunn", "title": "There are at least 35 potential coronavirus vaccines in the works. Here are the top efforts to watch and what to expect in 2020 and beyond.", "description": "There are several dozen ongoing research efforts to develop a coronavirus vaccine, as the World Health Organization listed 35 candidates in a recent report. A top US health official has said it will take at least 12 months to 18 months to determine if any vac…", "url": "https://www.businessinsider.com/coronavirus-vaccine-timeline-what-to-watch-leading-research-2020-3", "urlToImage": "https://i.insider.com/5e669a74bbd7f3308676e6c4?width=1200&format=jpeg", "publishedAt": "2020-03-10T12:54:00Z", "content": "There are several dozen research efforts to develop a coronavirus vaccine, ranging from pharmaceutical giants and tiny biotechs to academic centers and nonprofit groups.\r\nVaccine development has historically been a challenging multiyear process, requiring hun… [+6062 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shoshy Ciment", "title": "These are the sneakers most likely to skyrocket in value when the coronavirus panic dies down, according to the founder of the largest sneaker event in the world", "description": "Alan Vinogradov is the cofounder and organizer of Sneaker Con, the largest sneaker event in the world. He's in contact with hundreds of sneaker vendors and has a sense for what type of shoes generally do well on the market. Though the coronavirus situation is…", "url": "https://www.businessinsider.com/these-sneakers-will-explode-in-value-after-coronavirus-expert-says-2020-3", "urlToImage": "https://i.insider.com/5e66b2a5e4f9fe1bff057b64?width=1200&format=jpeg", "publishedAt": "2020-03-10T12:31:22Z", "content": "Though he runs the largest sneaker event in the world, Alan Vinogradov says he and his Sneaker Con team consider themselves to be sneakerheads more than event planners.\r\n\"We're sneaker guys,\" Vinogradov told Business Insider in an interview. \"We just happen t… [+2343 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Irish Apple HQ employee contracts coronavirus", "description": "A worker at Apple's European headquarters in Cork, Ireland has reportedly been tested positive for the coronavirus, a medical situation that has prompted the iPhone maker to perform a deep clean of the offices and to warn employees to self-isolate.", "url": "https://appleinsider.com/articles/20/03/10/irish-apple-hq-employee-contracts-coronavirus", "urlToImage": "https://photos5.appleinsider.com/gallery/34843-63241-apple-ireland-head-xl.jpg", "publishedAt": "2020-03-10T12:20:12Z", "content": "A worker at Apple's European headquarters in Cork, Ireland has reportedly been tested positive for the coronavirus, a medical situation that has prompted the iPhone maker to perform a deep clean of the offices and to warn employees to self-isolate. An employe… [+1422 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Joan Summers", "title": "Coronavirus Has Now Killed Intimacy Too!", "description": "Because of the extremely isolating world young professionals now live in, it’s unsurprising that “cuddle parties,” supposedly non-sexual events where strangers “practice consent” and intimacy by smashing clothed flesh together, are quite popular in places lik…", "url": "https://jezebel.com/coronavirus-has-now-killed-intimacy-too-1842222074", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/lygkjrqf9czv8o7rzf3y.jpg", "publishedAt": "2020-03-10T13:00:00Z", "content": "Because of the extremely isolating world young professionals now live in, its unsurprising that cuddle parties, supposedly non-sexual events where strangers practice consent and intimacy by smashing clothed flesh together, are quite popular in places like San… [+3244 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "'Headed for permanent recession': Paul Krugman sounds the alarm after Treasury yields tumble and interest rates plunge", "description": "Investors expect the US economy to suffer a prolonged downturn, Paul Krugman argued on Monday. \"Mr Market is basically saying that we're headed for permanent recession,\" the Nobel Memorial Prize-winning economist tweeted on Monday, pointing to record-low Trea…", "url": "https://markets.businessinsider.com/news/stocks/paul-krugman-economist-warns-yields-interest-rates-signal-permanent-recession-2020-3-1028980510", "urlToImage": "https://images.markets.businessinsider.com/image/5e6780bc54f25c738750da83-2200/rtx9ij6.jpg", "publishedAt": "2020-03-10T12:27:39Z", "content": "Reuters/Tim Shaffer\r\nInvestors expect the US economy to plunge into recession and stay there, according to Paul Krugman.\r\n\"Mr Market is basically saying that we're headed for permanent recession,\" the New York Times columnist and Nobel Memorial Prize-winning … [+1691 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Peter Nicholas", "title": "There Are No Libertarians in an Epidemic", "description": "Donald Trump is running for reelection on an anti-socialist message. But the COVID-19 outbreak demonstrates the emptiness of ideological labels.", "url": "https://www.theatlantic.com/politics/archive/2020/03/trump-socialism-and-coronavirus-epidemic/607681/", "urlToImage": "https://cdn.theatlantic.com/thumbor/ynKviYja1tAphsWK1li3xvviavY=/0x341:3994x2421/960x500/media/img/mt/2020/03/_D2A8415/original.jpg", "publishedAt": "2020-03-10T13:04:28Z", "content": "“America vs. Socialism” was the theme of the Conservative Political Action Conference last month, though as fights go this one was pretty one-sided. An anti-socialist message thrummed through the halls while the crowds celebrated free-market capitalism over $… [+4845 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Rebecca Jennings", "title": "This week in TikTok: All coronavirus, all the time", "description": "Hello from The Goods’ twice-weekly newsletter! For the next few Tuesdays, internet culture reporter Rebecca Jennings will be using this space to update you all on what’s been going on in the world...", "url": "https://www.vox.com/the-goods/2020/3/10/21172210/tiktok-coronavirus", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4QaOFl1TGsglaBXw9DDe5zOz2j8=/0x24:474x272/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19780312/Screen_Shot_2020_03_09_at_4.27.10_PM.png", "publishedAt": "2020-03-10T13:00:00Z", "content": "Hello from The Goods’ twice-weekly newsletter! For the next few Tuesdays, internet culture reporter Rebecca Jennings will be using this space to update you all on what’s been going on in the world of TikTok. Is there something you want to see more of? Less of… [+7520 chars]"}, {"source": {"id": null, "name": "Designboom.com"}, "author": "birgit lohmann I designboom", "title": "why we don’t write about COVID-19 coronavirus", "description": "designboom is an italian publication, our headquarters are in milan, with teams working from beijing, tokyo and new york and you might wonder why there is such a silence from our part? the novel coronavirus has infected more than 113000 people and it’s a norm…", "url": "https://www.designboom.com/design/why-we-dont-write-about-covid-19-coronavirus-03-10-2020/", "urlToImage": "https://www.designboom.com/wp-content/uploads/2020/03/why-we-dont-write-about-covid-19-coronavirus-designboom-1200.jpg", "publishedAt": "2020-03-10T12:32:29Z", "content": "designboom is an italian publication, our headquarters are in milan, with teams working from beijing, tokyo and new york and you might wonder why there is such a silence from our part? the novel coronavirus has infected more than 113000 people and it’s a norm… [+1434 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (David Haen)", "title": "Will Coronavirus Harm Health Insurers?", "description": "Key developments by the U.S. government could have a profound impact on the country's health insurers.", "url": "https://www.fool.com/investing/2020/03/10/will-coronavirus-harm-health-insurers.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561840/gettyimages-1205778458.jpg", "publishedAt": "2020-03-10T12:30:00Z", "content": "At the end of 2019, coronavirus was barely on the radar for major health insurers, including UnitedHealth Group (NYSE:UNH), Anthem(NYSE:ANTM), CVS Health(NYSE:CVS), and Cigna(NYSE:CI). Transcripts of each company's earnings calls held between Jan. 15 and Feb.… [+4801 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Italy under coronavirus lockdown: Four things to know", "description": "What is happening, why and how are Italians reacting? Your questions about the Italian lockdown answered.", "url": "https://www.aljazeera.com/news/2020/03/italy-coronavirus-lockdown-200310085004374.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/10/8532e2dab012458e92c0d3b548365dcb_18.jpg", "publishedAt": "2020-03-10T12:15:09Z", "content": "All of Italy, a country of 60 million people, is currently under lockdown and the government has called on people to respect the restrictive measures until at least April 3. \r\nThe extraordinary move, announced late on Monday, marks the most radical step a Wes… [+5111 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Allyson Chiu", "title": "Fox’s dueling coronavirus takes: Tucker Carlson hits U.S. response. Trish Regan calls criticism ‘impeachment scam.’ - The Washington Post", "description": "Fox’s dueling coronavirus takes: Tucker Carlson hits U.S. response. Trish Regan calls criticism ‘impeachment scam.’ The Washington Post Fox Business Network says coronavirus is a ‘scam’ to ‘destroy’ Trump cleveland.com Gutfeld on the media and Democrats on th…", "url": "https://www.washingtonpost.com/nation/2020/03/10/coronavirus-tucker-carlson-fox/", "urlToImage": "https://www.washingtonpost.com/resizer/z0ARrcRdPtXUC3c2wUQo1v0oscg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QJVM3DIM55GFXPAMWESNKNL4N4.png", "publishedAt": "2020-03-10T12:32:26Z", "content": "But as Carlson was addressing his audience, a very different message was being aired on Fox Business.\r\nThe chorus of hate being leveled at the president is nearing a crescendo as Democrats blame him and only him for a virus that originated halfway around the … [+5346 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Germany Weighs Bank Capital Relief to Counter Coronavirus Damage", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/germany-weighs-bank-capital-relief-to-counter-coronavirus-damage", "urlToImage": null, "publishedAt": "2020-03-10T12:51:55Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Delta, American Abandon 2020 Forecasts on Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/delta-american-join-rush-to-cut-flight-schedules-on-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T12:28:37Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Billy Duberstein)", "title": "1 Dividend-Paying Cable Company to Buy Amid the Coronavirus Selloff", "description": "This steady, mostly coronavirus-proof stock with a solid yield and a history of dividend growth will get you through the hard times.", "url": "https://www.fool.com/investing/2020/03/10/1-dividend-paying-cable-company-to-buy-on-the-coro.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562153/gettyimages-1055475414.jpg", "publishedAt": "2020-03-10T12:45:00Z", "content": "Obviously, travel, transport, bank, and oil stocks are getting hammered in this current market sell-off. However, there are also several high-quality stocks in other sectors that are likely to benefit from both the \"stay-at-home\" economy, low oil prices, and … [+5070 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "Delta cuts global capacity by at least 15% on coronavirus impact", "description": "Delta Air Lines is cutting global capacity by at least 15% following a drop of more than a quarter in bookings worldwide due to fears of the novel coronavirus. The SkyTeam Alliance carrier will make the most drastic reductions across the Pacific where capacit…", "url": "http://thepointsguy.com/news/delta-cuts-global-capacity-by-at-least-15-on-coronavirus-impact/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2019/01/1_ALB_6794.jpg?fit=1400%2C955px&ssl=1", "publishedAt": "2020-03-10T13:10:16Z", "content": "Delta Air Lines is cutting global capacity by at least 15% following a drop of more than a quarter in bookings worldwide due to fears of the novel coronavirus.\r\nThe SkyTeam Alliance carrier will make the most drastic reductions across the Pacific where capaci… [+2351 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Emily McNutt", "title": "Qantas postpones Brisbane-Chicago route, grounds most Airbus A380s", "description": "Qantas has altered its operations as a result of the ongoing coronavirus outbreak, which shows no sign of slowing down. On Tuesday Australia time, the national flag carrier announced that it was reducing capacity by almost 25% for the next six months, as well…", "url": "http://thepointsguy.com/news/qantas-grounding-a380s-coronavirus/", "urlToImage": "https://i2.wp.com/thepointsguy.com/wp-content/uploads/2019/10/20191028_DFW-Airport_Qantas-A380-taxiing-in-DFW-9_JTGenter.jpg?fit=1600%2C1067px&ssl=1", "publishedAt": "2020-03-10T12:15:01Z", "content": "Qantas has altered its operations as a result of the ongoing coronavirus outbreak, which shows no sign of slowing down. On Tuesday Australia time, the national flag carrier announced that it was reducing capacity by almost 25% for the next six months, as well… [+5241 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Elizabeth Kim", "title": "Coronavirus Updates: FDNY EMS Worker Tests Positive For COVID-19", "description": "New York City now has 25 confirmed cases. [ more › ]", "url": "https://gothamist.com/news/coronavirus-updates-fdny-ems-positive-covid-19", "urlToImage": "https://cms.prod.nypr.digital/images/301878/fill-1200x650/", "publishedAt": "2020-03-10T13:08:06Z", "content": "This is our daily update of breaking COVID-19 news for Tuesday, March 10th, 2020. Previous daily updates can be foundhere. Our guide topreparing for the spread of coronavirus is here, and if you have lingering questions about the virus, here is ourregularly u… [+3089 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Reuters", "title": "Tesla plans to expand car parts production capacity in Shanghai, according to government document", "description": "Filed under: Green, Plants/Manufacturing, Tesla, Electric Tesla Inc plans to increase its production capacity for certain car parts at its $2 billion factory in China, according to a government document seen by Reuters, as it pushes to localize its supply cha…", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/03/10/tesla-parts-production-capacity-china/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/6000x3375+0+625/resize/800x450!/format/jpg/quality/85/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/9550cd30-4c1b-11ea-bf37-710219bd5af9", "publishedAt": "2020-03-10T12:40:00Z", "content": "BEIJING Tesla plans to increase its production capacity for certain car parts at its $2 billion factory in China, according to a government document seen by Reuters, as it pushes to localize its supply chain in the world's biggest auto market.\r\nThe U.S. autom… [+1725 chars]"}, {"source": {"id": null, "name": "Scmagazine.com"}, "author": null, "title": "Fake Coronavirus Emails Impersonate The WHO", "description": "A phishing scam that pretends to offer coronavirus info from the WHO in reality distributes the GuLoader downloader, which installs the FormBook trojan.", "url": "https://www.scmagazine.com/home/security-news/phishing/dont-get-fooled-again-fake-coronavirus-emails-impersonate-the-who-to-trigger-formbook-infection/", "urlToImage": "https://www.scmagazine.com/wp-content/uploads/sites/2/2018/08/malware6_987491-1.jpg", "publishedAt": "2020-03-10T12:56:27Z", "content": "Fears over the novel coronavirus have triggered mass quarantines, Purell and Clorox shortages and financial market turmoil. As global concerns continue to mount with the latest headlines just today, it was reported that the head of the Port Authority of New Y… [+2926 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus vs. flu: What's the difference? - CBS This Morning", "description": "President Trump drew criticism from some health experts for comparing coronavirus to the common flu. In a Monday tweet, Mr. Trump compared the number of flu ...", "url": "https://www.youtube.com/watch?v=v6Q0xGgmr0A", "urlToImage": "https://i.ytimg.com/vi/v6Q0xGgmr0A/maxresdefault.jpg", "publishedAt": "2020-03-10T12:13:20Z", "content": "President Trump drew criticism from some health experts for comparing coronavirus to the common flu. In a Monday tweet, Mr. Trump compared the number of flu deaths in 2019 to the number of coronavirus deaths as of now. Dr. Jon LaPook joins CBS This Morning to… [+1354 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Coronavirus detected at Apple's European HQ in Ireland", "description": "A worker at Apple Inc.'s European headquarters in Ireland has tested positive for coronavirus.", "url": "http://feeds.reuters.com/~r/reuters/businessNews/~3/0JnAOTtaKjI/coronavirus-detected-at-apples-european-hq-in-ireland-idUSKBN20X1QT", "urlToImage": null, "publishedAt": "2020-03-10T12:43:33Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Grater", "title": "Euro Nations Grappling With Coronavirus: French Culture Minister Tests Positive; Prague Film Fest Postponed", "description": "France’s culture minister Franck Riester has tested positive for the coronavirus, becoming one of the country’s most high-profile cases to date. Reuters reported that Riester had most likely contracted the virus from five French parliamentarians who have also…", "url": "https://deadline.com/2020/03/french-culture-minister-coronavirus-major-events-cancelled-death-toll-jumps-30-1202878219/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/franck-riester-.jpg?w=1024", "publishedAt": "2020-03-10T12:16:09Z", "content": "France’s culture minister Franck Riester has tested positive for the coronavirus, becoming one of the country’s most high-profile cases to date.\r\nReuters reported that Riester had most likely contracted the virus from five French parliamentarians who have als… [+2116 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Reuters", "title": "Nissan to pull out of venture fund with Renault in cost-cutting drive, insiders say", "description": "Filed under: Earnings/Financials, Mitsubishi, Nissan, Renault Nissan Motor Co is likely to pull out from a venture capital fund it runs with alliance partners Renault SA and Mitsubishi Motors, as part of the Japanese automaker's drive to cut costs and conserv…", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/03/10/nissan-pulling-out-renault-venture-fund/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/4719x2655+0+94/resize/800x450!/format/jpg/quality/85/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/19e16860-62ca-11ea-9fee-78bd342cb5c0", "publishedAt": "2020-03-10T12:25:00Z", "content": "TOKYO Nissan is likely to pull out from a venture capital fund it runs with alliance partners Renault and Mitsubishi Motors, as part of the Japanese automaker's drive to cut costs and conserve cash, two sources said.\r\nNissan will formally take a decision on w… [+2165 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Coronavirus detected at Apple's European HQ in Ireland", "description": "A worker at Apple Inc.'s European headquarters in Ireland has tested positive for coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-apple-idUSKBN20X1QT", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501244211&w=1200&r=LYNXMPEG2913U", "publishedAt": "2020-03-10T12:43:33Z", "content": "DUBLIN (Reuters) - A worker at Apple Inc.’s European headquarters in Ireland has tested positive for coronavirus. \r\nThe company said it is coordinating closely with local health authorities and they feel the risk to others is low. \r\nIn a statement, the tech g… [+580 chars]"}, {"source": {"id": null, "name": "Brooklynvegan.com"}, "author": "Andrew Sacher", "title": "KISS cancel meet and greets due to coronavirus fears", "description": "KISS' tour is still on, but since coronavirus fears are escalating, you won't be able to get up close and personal with them. Continue reading…", "url": "http://www.brooklynvegan.com/kiss-cancel-meet-and-greets-due-to-coronavirus-fears/", "urlToImage": "http://www.brooklynvegan.com/files/2019/03/kiss-madisonsquaregarden-31.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2020-03-10T12:53:39Z", "content": "KISS at MSG in 2019 (more by P Squared)\r\nBands and music festivals continue to cancel/postpone due to coronavirus fears, and though KISS‘ 2020 farewell tour with David Lee Roth is still on, the band is taking one new precaution: no more meet and greets with v… [+946 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jeremy Bogaisky, Forbes Staff, Jeremy Bogaisky, Forbes Staff https://www.forbes.com/sites/jeremybogaisky/", "title": "Delta, American Slash Flights Amid Coronavirus Travel Slump", "description": "Delta will reduce its system capacity by 15 percentage points compared to its previous plans and take cost-cutting measures while American is dropping flights internationally and in the U.S.", "url": "https://www.forbes.com/sites/jeremybogaisky/2020/03/10/delta-american-slash-flights-amid-coronavirus-travel-slump/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1205294833%2F0x0.jpg", "publishedAt": "2020-03-10T12:59:58Z", "content": "An almost empty British Airways passenger plane flies from Milan to London on March 5.\r\nGetty Images\r\nWith business and leisure travel ebbing over fears of the coronavirus, Delta Air Lines and American Airlines are throttling back their flight schedules domes… [+1096 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": null, "title": "Amazon to grant $5 million to small businesses near its headquarters struggling due to coronavirus - Seattle Times", "description": "Amazon to grant $5 million to small businesses near its headquarters struggling due to coronavirus Seattle Times", "url": "https://www.seattletimes.com/business/amazon/amazon-to-grant-5-million-to-small-businesses-near-its-headquarters-struggling-due-to-coronavirus/", "urlToImage": null, "publishedAt": "2020-03-10T13:00:00Z", "content": null}, {"source": {"id": "spiegel-online", "name": "Spiegel Online"}, "author": "Martin Schlak", "title": "“I Don’t Think the Virus Can Be Stopped Anymore”", "description": "In an interview, Harvard Epidemiologist Marc Lipsitch explains why the novel coronavirus is so dangerous – and the need for drastic measures to stop its spread.", "url": "https://www.spiegel.de/international/world/i-don-t-think-the-virus-can-be-stopped-anymore-a-03d404e6-762b-42fb-ac48-e4a8f03a2f2b", "urlToImage": "https://cdn.prod.www.spiegel.de/images/fcc45ae1-6829-4ae4-935e-62ec1434ad40_w1280_r1.77_fpx45_fpy41.jpg", "publishedAt": "2020-03-10T12:15:00Z", "content": null}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Prisons Worldwide Face Coronavirus Crisis: Overcrowding, Lack of Sanitation & Labor at Slave Wages", "description": "As Italy went on lockdown, nearly 30 prisons across the country broke into riots Sunday and Monday after visitation rights were suspended in response to the outbreak. In a prison in southern Italy, a riot left at least six incarcerated people dead and caused …", "url": "http://www.democracynow.org/2020/3/10/coronavirus_in_prisons_jails", "urlToImage": null, "publishedAt": "2020-03-10T12:43:31Z", "content": null}, {"source": {"id": null, "name": "Neowin.net"}, "author": "Rajesh Pandey", "title": "Huawei P40 series will be announced online, Paris launch event canceled", "description": "Huawei has canceled the physical launch event of the P40 series on March 26 in Paris due to the coronavirus outbreak. The company will now be announcing the phone via an online-only event. Read more...", "url": "https://www.neowin.net/news/huawei-p40-series-will-be-announced-online-paris-launch-event-canceled/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2020/03/1583842865_p40-series-teaser_story.jpg", "publishedAt": "2020-03-10T12:46:01Z", "content": "Back in February, Huawei had sent out invites for the announcement of the P40 series at an event in Paris on March 26. That event has now been canceled due to the coronavirus outbreak. Instead, Huawei will now be holding an online-only event to announce its n… [+1034 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "David Giambusso", "title": "De Blasio claims Biden hasn't been vetted", "description": "The mayor endorsed Bernie Sanders in February.", "url": "https://www.politico.com/states/new-york/city-hall/whiteboard/2020/03/10/de-blasio-claims-biden-hasnt-been-vetted-1266300", "urlToImage": "https://static.politico.com/f3/7b/3bc23b6d47c1945c14aaa37fe51e/gettyimages-1204736798.jpg", "publishedAt": "2020-03-10T12:24:00Z", "content": "New York City Mayor Bill DeBlasio speaks during a news conference | Getty Images\r\nMayor Bill de Blasio said today former Vice President Joe Biden has not been sufficiently vetted by voters, despite having been in national politics since 1973 and having run fo… [+1271 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "iOS 14 reveals iPhone 9 and updated iPad Pro details, new Apple TV remote, AirTags, more", "description": "Leaked iOS 14 code obtained by 9to5Mac corroborates many details about what to expect from Apple’s upcoming hardware refreshes, including the new iPad Pro, iPhone 9, and AirTags. Apple is also developing a new Apple TV remote, the code indicates. more… The po…", "url": "https://9to5mac.com/2020/03/10/ios-14-iphone-9-ipad-pro-apple-tv/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/apple-tv-with-tv-set.jpg?quality=82&strip=all", "publishedAt": "2020-03-10T13:08:45Z", "content": "Leaked iOS 14 code obtained by 9to5Mac corroborates many details about what to expect from Apples upcoming hardware refreshes, including the new iPad Pro, iPhone 9, and AirTags. Apple is also developing a new Apple TV remote, the code indicates.\r\nAccording to… [+2607 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Lisette Voytko, Forbes Staff, Lisette Voytko, Forbes Staff https://www.forbes.com/sites/lisettevoytko/", "title": "‘Despicable Practice’: China, And Critics, Reject Calling COVID-19 The ‘Wuhan Virus’", "description": "The World Health Organization named the coronavirus COVID-19 in order to avoid discrimination and stigmatization.", "url": "https://www.forbes.com/sites/lisettevoytko/2020/03/10/despicable-practice-china-and-critics-reject-calling-covid-19-the-wuhan-virus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1203807634%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D5655%26cropY1%3D0%26cropY2%3D3181", "publishedAt": "2020-03-10T13:07:54Z", "content": "Illustration of the COVID-19 coronavirus from the Centers for Disease Control.\r\nPhoto by Smith Collection/Gado/Getty Images\r\nTopline: Chinese officials are pushingback on people calling the COVID-19 coronavirus the Wuhan virus, which they and other critics sa… [+2529 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " When you have six words for 'advance', but none for 'retreat' via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_dd7d8c227bd28265afdc87de34b3ac15", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T12:40:09Z", "content": "The Ohio State University, Coronavirus\r\nCOLUMBUS, Ohio (WJW) - Ohio State University is suspending classroom instruction through at least March 30 because of coronavirus, the school..."}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "WUHAN CORONAVIRUS UPDATE: Italians barred from Austria to stop spread. Global coronavirus cases …", "description": "WUHAN CORONAVIRUS UPDATE: Italians barred from Austria to stop spread. Global coronavirus cases exceed 114,000. As Italy locks down 60 million people over coronavirus, parts of China return to normalcy. China’s President Xi visits Wuhan as number of new coron…", "url": "https://pjmedia.com/instapundit/360919/", "urlToImage": null, "publishedAt": "2020-03-10T12:21:04Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Angie Martoccio", "title": "Santana Cancel European Tour Amid COVID-19 Outbreak", "description": "Band is just one of the many acts canceling or postponing shows", "url": "https://www.rollingstone.com/music/music-news/santana-cancel-european-tour-coronavirus-964955/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2018/06/santana-plots-tour-2017-c720ad35-d20e-418b-b2b3-cdc28425950e.jpg", "publishedAt": "2020-03-10T13:04:52Z", "content": "“It is with great disappointment that I have to inform our fans that we are canceling our upcoming Europe Tour,” President of Universal Tone Management, Michael Vrionis said in a statement. “Many countries have made the decision to restrict public gatherings … [+1168 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ryan Derousseau, Contributor, Ryan Derousseau, Contributor https://www.forbes.com/sites/ryanderousseau/", "title": "Here’s How New Retirees Are Reacting To The Market Turmoil From Coronavirus", "description": "With stocks plunging, experiencing the worst day since December 2008, it's new retirees most at risk. Here's how some within the FIRE movement who just stepped away from the day job are reacting.", "url": "https://www.forbes.com/sites/ryanderousseau/2020/03/09/heres-how-new-retirees-reacting-coronavirus-market-turmoil/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204694496%2F0x0.jpg", "publishedAt": "2020-03-10T12:18:58Z", "content": "As Warren Buffett says when the market starts to struggle, its good news for his investing strategy. Thats because hes constantly on the look out for more shares, seeking opportunities that the short-term market may leave cheap. \r\nHe feels that way because as… [+7098 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ryan Derousseau, Contributor, Ryan Derousseau, Contributor https://www.forbes.com/sites/ryanderousseau/", "title": "Here’s How New Retirees Are Reacting To The Market Turmoil From Coronavirus", "description": "With stocks plunging, experiencing the worst day since December 2008, it's new retirees most at risk. Here's how some within the FIRE movement who just stepped away from the day job are reacting.", "url": "https://www.forbes.com/sites/ryanderousseau/2020/03/10/heres-how-new-retirees-reacting-coronavirus-market-turmoil/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204694496%2F0x0.jpg", "publishedAt": "2020-03-10T12:18:58Z", "content": "As Warren Buffett says when the market starts to struggle, its good news for his investing strategy. Thats because hes constantly on the look out for more shares, seeking opportunities that the short-term market may leave cheap. \r\nHe feels that way because as… [+7050 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kelly Phillips Erb, Contributor, Kelly Phillips Erb, Contributor https://www.forbes.com/sites/kellyphillipserb/", "title": "After Coronavirus-Fueled Stock Market Drop, Trump Considers Payroll Tax Relief", "description": "President Donald Trump announced on March 9, 2020, that he would be meeting with Congressional Republicans on Tuesday to discuss potential tax relief.", "url": "https://www.forbes.com/sites/kellyphillipserb/2020/03/10/after-coronavirus-fueled-stock-market-drop-trump-considers-payroll-tax-relief/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206290711%2F0x0.jpg", "publishedAt": "2020-03-10T13:05:20Z", "content": "NEW YORK, NEW YORK - MARCH 09: People walk by the New York Stock Exchange (NYSE) on March 09, 2020 ... [+] in New York City. The Dow Jones Industrial Average fell more than 2,000 points as investors concerns over the spreading coronavirus continue to affect g… [+5622 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Kate Kelland", "title": "Epidemic response group ups coronavirus vaccine funding to $23.7 mln", "description": "The CEPI global epidemic response coalition said on Tuesday it will put a further $4.4 million into deals with the biotech firm Novavax and Britain's University of Oxford to rapidly develop potential vaccines against COVID-19.  The Coalition for Epidemic Prep…", "url": "https://finance.yahoo.com/news/epidemic-response-group-ups-coronavirus-122817013.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-10T12:28:17Z", "content": "By Kate Kelland\r\nLONDON, March 10 (Reuters) - The CEPI global epidemic response coalition said on Tuesday it will put a further $4.4 million into deals with the biotech firm Novavax and Britain's University of Oxford to rapidly develop potential vaccines agai… [+1909 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Royal Caribbean withdraws 2020 forecast, boosts liquidity amid coronavirus fears", "description": "Cruise operators are among the worst hit by the epidemic, which originated in mainland China and has killed more than 3,800 people, as travel restrictions and fears of the virus spreading have led to cancellations of trips. Royal Caribbean said it would cut s…", "url": "https://finance.yahoo.com/news/royal-caribbean-increases-borrowing-capacity-130320880.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2vM9c6vF1RLFx3.WObitbg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/5d5788e9ce36b469c09ad4d784eae56d", "publishedAt": "2020-03-10T13:03:20Z", "content": "(Reuters) - Royal Caribbean Cruises Ltd &lt;RCL.N&gt; on Tuesday withdrew its first-quarter and full-year forecast, and increased its credit capacity by $550 million to boost liquidity amid concerns around the rapid spreading of coronavirus.\r\nCruise operators… [+1401 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Italy Is Now a Red Zone: Student at Bocconi U. Describes Strict Measures Taken to Contain COVID-19", "description": "The entire country of Italy has been placed on lockdown in an attempt to stop the spread of the COVID-19 coronavirus, impacting 60 million people. People in the nationwide Red Zone will only be allowed to travel for work, medical reasons or emergencies until …", "url": "https://www.democracynow.org/2020/3/10/italy_red_zone", "urlToImage": "https://www.democracynow.org/images/story/40/51540/full_hd/SEG2-CoronaItaly.jpg", "publishedAt": "2020-03-10T12:32:19Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nThe entire country of Italy has been placed on lockdown in an attempt to stop the spread of the COVID-19 coronavirus, impacting 60 million people. People in the nationwide Red Zone will only b… [+770 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Immigrants in WA Detention Center Demand Protection from Coronavirus, Not Posters in English", "description": "As the world responds to the COVID-19 outbreak, we look at how the Trump administration's immigration policies may put everyone at risk. We go to Seattle, Washington, not far from the Life Care Center in the suburb of Kirkland, which was the epicenter of the …", "url": "https://www.democracynow.org/2020/3/10/coronavirus_ice", "urlToImage": "https://www.democracynow.org/images/story/42/51542/full_hd/SEG4-CoronaImmigration.jpg", "publishedAt": "2020-03-10T12:54:11Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nAs the world responds to the COVID-19 outbreak, we look at how the Trump administration’s immigration policies may put everyone at risk. We go to Seattle, Washington, not far from the Life Car… [+665 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Anti-Science GOP Lawmaker Won’t Self-Quarantine Despite Coronavirus Exposure", "description": "Why would Rep. Louie Gohmert listen to scientists now? He never has before.", "url": "https://friendlyatheist.patheos.com/2020/03/10/anti-science-gop-lawmaker-wont-self-quarantine-despite-coronavirus-exposure/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/03/LouieGohmertCSPAN-768x426.png", "publishedAt": "2020-03-10T12:30:56Z", "content": "Several Republican politicians were exposed to someone at CPAC who tested positive for COVID-19, and they have chosen to quarantine themselves so as to not get anyone else infected. Why even take the risk of possibly transmitting the disease to your colleague… [+1374 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Coronavirus Pandemic in U.S. Fueled by Stunted CDC Budget & Lack of Access to Healthcare, Insurance", "description": "The coronavirus pandemic has now infected more than 113,000 people worldwide, and killed more than 4,000. We are joined by two epidemiologists to examine the response so far around the world and in the United States. Thomas Bollyky is director of the global h…", "url": "https://www.democracynow.org/2020/3/10/coronavirus_policy", "urlToImage": "https://www.democracynow.org/images/story/39/51539/full_hd/SEG1-CoronavirusPolicy.jpg", "publishedAt": "2020-03-10T12:12:37Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nThe coronavirus pandemic has now infected more than 113,000 people worldwide, and killed more than 4,000. We are joined by two epidemiologists to examine the response so far around the world a… [+526 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Brittany Vincent", "title": "A St. Louis \"Pokémon Go\" Event Was Just Delayed Thanks to Coronavirus", "description": "Grab your masks, trainer. The deadly coronavirus has ensured that the crop of fans waiting to check out the Pokémon Go Safari Zone event in St. Louis will have to wait to do so. The post A St. Louis \"Pokémon Go\" Event Was Just Delayed Thanks to Coronavirus ap…", "url": "https://www.bleedingcool.com/2020/03/10/a-st-louis-pokemon-go-event-was-just-delayed-thanks-to-coronavirus/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/st-louis-safari-zone-event-cancelled-coronavirus-pokemon-go-1200x628.jpg", "publishedAt": "2020-03-10T13:10:06Z", "content": "Credit: Niantic\r\nGrab your masks, trainer. The deadly coronavirus has ensured that the crop of fans waiting to check out the Pokémon Go Safari Zone event in St. Louis will have to wait to do so."}, {"source": {"id": null, "name": "Dcist.com"}, "author": "grablick", "title": "Morning Roundup: Coronavirus Is Shifting How Rideshare Drivers Conduct Business", "description": "Plus, a man was spotted riding a horse down a D.C. street, how sports betting will work in Virginia, and more news. The post Morning Roundup: Coronavirus Is Shifting How Rideshare Drivers Conduct Business appeared first on DCist.", "url": "https://dcist.com/story/20/03/10/morning-roundup-coronavirus-is-shifting-how-rideshare-drivers-conduct-business/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/03/49632955296_93335aac02_k-1024x684.jpg", "publishedAt": "2020-03-10T13:06:36Z", "content": null}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Judy Cantor-Navas", "title": "Portugal’s Talkfest Forum and Iberian Festival Awards Postponed Over Coronavirus", "description": "The Portuguese Music Festival Association called off the March events as a precautionary measure in a country where the president has gone into voluntary quarantine.", "url": "https://www.billboard.com/articles/news/international/9331475/portugal-talkfest-international-music-postponed-coronavirus-aporfest", "urlToImage": "https://static.billboard.com/files/media/europe-map-3d-2019-billboard-1548-1024x677.jpg", "publishedAt": "2020-03-10T12:41:33Z", "content": "BARCELONA Portugals Talkfest International Music Festivals Forum and the Iberian Festival Awards in Lisbon have been postponed by the Portuguese Music Festival Association (Aporfest) in the wake of precautionary measures advised by the countrys health officia… [+1154 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Beth McKenna)", "title": "Stitch Fix Stock Plunges 38% on Revenue Miss and Guidance Cut", "description": "Hell hath no fury like investors dealt a full-year revenue guidance cut -- especially during a major market sell-off.", "url": "https://www.fool.com/investing/2020/03/10/stitch-fix-stock-plunges-38-on-revenue-miss-and-gu.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562446/sfix-stock-sfix-earnings-coronavirus-q2-earnings.jpg", "publishedAt": "2020-03-10T12:52:00Z", "content": "Stitch Fix (NASDAQ:SFIX) reported second-quarter results for fiscal 2020 after the market closed on Monday, March 9. Investors in need of a good-news fix amid the market's coronavirus-driven sell-off didn't get it from the online personalized apparel retailer… [+5566 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Ballard)", "title": "3 Top Value Stocks to Buy Right Now", "description": "With the markets down, this is a good time to go shopping for deals.", "url": "https://www.fool.com/investing/2020/03/10/3-top-value-stocks-to-buy-right-now.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562016/stock-investing-chart-trading.jpg", "publishedAt": "2020-03-10T13:10:00Z", "content": "The recent volatility in the markets over the COVID-19 outbreak shows that you should always be prepared for anything. Stocks can fall for a variety of reasons, but market history proves that it pays to keep a long-term perspective and stay positive about the… [+5859 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus aid should reflect Wales' older population, says minister", "description": "Wales' \"very large proportion of older people\" should be considered in the fight against the virus.", "url": "https://www.bbc.co.uk/news/uk-wales-politics-51818067", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/15600/production/_110425578_de27-1.jpg", "publishedAt": "2020-03-10T12:32:25Z", "content": "Image caption\r\n Rebecca Evans: \"We are ready for this and it is important that funding is based on need\"\r\nEmergency aid to tackle coronavirus should be based on the demands of Wales' older population, the Welsh Government's finance minister has said.\r\nIt foll… [+2304 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Italy in nationwide coronavirus lockdown: \"We have run out of time\"", "description": "The country has suffered the most deaths from the coronavirus outside of China.", "url": "https://www.cbsnews.com/news/coronavirus-italy-quarantine-lockdown-prime-minister-we-have-run-out-of-time/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/05/d9ad5bdb-f391-427b-964a-e4ddc30d8523/thumbnail/1200x630g8/0fd857b245768e4d24bf156c6ee29e28/gettyimages-1205319427.jpg", "publishedAt": "2020-03-10T12:13:07Z", "content": "In a desperate effort to fight the spread of coronavirus, Italy expanded its quarantine to include the entire country of 60 million people until next month, the country's prime minister announced Monday. Prime Minister Giuseppe Conte quoted Winston Churchill … [+1609 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Watch: Union Minister Ramdas Athawale’s ‘go corona’ chant goes viral", "description": "In the video, Union Minister Ramdas Athawale can be chanting the slogan along with Chinese Consul General in Mumbai, Tang Guocai, and Buddhist monks.", "url": "https://indianexpress.com/article/trending/trending-in-india/union-minister-ramdas-athawales-go-corona-chant-goes-viral-6308114/", "urlToImage": "https://images.indianexpress.com/2020/03/Ramdas-Athawale-go-corona-video-759.jpg?w=759", "publishedAt": "2020-03-10T12:30:43Z", "content": "By: Trends Desk | New Delhi | \r\nPublished: March 10, 2020 6:00:43 pm\r\nAlthough the video was shot last month it only surfaced on the social media last evening.As the novel coronavirus continues to spread across the globe, nations are striving hard to stem the… [+3039 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus vs. flu: What's the difference?", "description": "President Trump drew criticism from some health experts for comparing coronavirus to the common flu. In a Monday tweet, Mr. Trump compared the number of flu deaths in 2019 to the number of coronavirus deaths as of now. Dr. Jon LaPook joins “CBS This Morning” …", "url": "https://www.cbsnews.com/video/coronavirus-vs-flu-whats-the-difference/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/10/eee0375f-be55-4141-9d10-7f48d0d35be1/thumbnail/1200x630/992b479b2107d52051e136aaacdd219d/0310-ctm-cvfluquestions-lapook-2044834-640x360.jpg", "publishedAt": "2020-03-10T12:14:20Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "How to manage anxiety over coronavirus", "description": "Mental health professionals say they are already seeing an increase in patients anxious about the coronavirus. Anxiety, the most common form of mental illness, has affected nearly 30% of adults at some point in their lives, according to the American Psychiatr…", "url": "https://www.cbsnews.com/video/how-to-manage-anxiety-over-coronavirus/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/a5ebb0e8-4de0-45a9-812b-53638f1cdd70/thumbnail/1200x630/870bce82d89f9e2b94a439ce477a01db/0310-ctm-cvirusandanxiety-varma-2044902-640x360.jpg", "publishedAt": "2020-03-10T12:59:13Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Mobilesyrup.com"}, "author": "Aisha Malik", "title": "Google actively removing coronavirus misinformation on Search, YouTube", "description": "Google is attempting to quickly remove misinformation about the coronavirus (COVID-19) from its search engine and YouTube. Searches related to the virus trigger an “SOS Alert” and present information from reliable sources such as the World Health Organization…", "url": "https://mobilesyrup.com/2020/03/10/google-coronavirus-misinformation/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2020/01/google-g-header-NEW-1024x576.jpg", "publishedAt": "2020-03-10T12:55:57Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Julia Dzurillay", "title": "Three More Coronavirus Cases Near Coachella Site Leaves Attendees Wondering If 2020 Festival Will Be Canceled or Postponed - Showbiz Cheat Sheet", "description": "Three More Coronavirus Cases Near Coachella Site Leaves Attendees Wondering If 2020 Festival Will Be Canceled or Postponed Showbiz Cheat Sheet Coachella & Stagecoach in Talks to Move to October Due to Coronavirus Billboard 3 new coronavirus cases reported in …", "url": "https://www.cheatsheet.com/entertainment/coronavirus-coachella-postponed-2020.html/", "urlToImage": "https://www.cheatsheet.com/wp-content/uploads/2020/03/Coachella-Music-Festival.jpg", "publishedAt": "2020-03-10T12:42:49Z", "content": "Up until a few days ago, future Coachella attendees werent worried about coronavirus impacting the music festival. Now, with the first confirmed case of coronavirus in Riverside County, Cali., theres a chance the festival could be canceled. Heres what people … [+3044 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Trump has not been tested for coronavirus", "description": "He has not had \"prolonged close contact with any known confirmed\" coronavirus patients, the White House said.", "url": "https://www.cbsnews.com/news/president-trump-has-not-been-tested-for-coronavirus/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/06/19e332dc-80f3-4843-9f04-ae3d33b44ec9/thumbnail/1200x630g3/cfe200f8e26018edb8b388269af01b83/gettyimages-1210786004.jpg", "publishedAt": "2020-03-10T12:54:09Z", "content": "President Trump has not been tested for coronavirus, White House press secretary Stephanie Grisham said Monday night in a statement. \r\n\"The President has not received COVID-19 testing because he has neither had prolonged close contact with any known confirmed… [+1536 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus could impact Florida's spring break economy", "description": "Florida has declared a state of emergency to help fight the coronavirus outbreak as millions of Americans gear up for spring break. The state is a popular destination and its beaches draw crowds annually, but tourism officials said they are worried about the …", "url": "https://www.cbsnews.com/video/coronavirus-could-impact-floridas-spring-break-economy/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/58a79d0a-bfef-462b-aede-52a985f96e9a/thumbnail/1200x630/93af378e8762996e0167c81cf8baa90f/0310-ctm-springbreak-bojoquez-2044845-640x360.jpg", "publishedAt": "2020-03-10T12:17:00Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Carscoops.com"}, "author": "Sergiu Tudose", "title": "Ford Europe Tech Center Employee Tests Positive For Coronavirus, Other Workers In Quarantine", "description": "Ford decided to quarantine roughly 30 employees from its Merkenich facility near Cologne, Germanly.", "url": "https://www.carscoops.com/2020/03/ford-europe-tech-center-employee-tests-positive-for-coronavirus-other-workers-in-quarantine/", "urlToImage": "https://www.carscoops.com/wp-content/uploads/2020/03/ford-quarantines-workers-cologne-2.jpg", "publishedAt": "2020-03-10T13:02:00Z", "content": "Ford decided to send several workers home from its development center near Cologne, Germany, after one employee tested positive for coronavirus.\r\nAccording to the Koelnische Rundschau newspaper, the automaker sent home about 30 employees from the Merkenich fa… [+1437 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Megumi Fujikawa", "title": "Japan Unveils Multibillion-Dollar Plan to Support Coronavirus-Hit Businesses - The Wall Street Journal", "description": "‘As the top priority for the time being, we have to put all our effort into keeping businesses alive,’ Shinzo Abe says", "url": "https://www.wsj.com/articles/japan-unveils-multibillion-dollar-plan-to-support-coronavirus-hit-businesses-11583841220", "urlToImage": "https://images.wsj.net/im-162598/social", "publishedAt": "2020-03-10T12:54:00Z", "content": "TOKYOThe government of Prime Minister Shinzo Abe said it would offer some $15 billion in financing for businesses hit by the novel coronavirus and spend about $4 billion directly to prop up the economy.\r\nThe measures, unveiled Tuesday, are likely to be imitat… [+227 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Will Leitch", "title": "The American Sports World Is Dragging Its Feet on Coronavirus", "description": "As the rest of society reckons with sweeping changes brought on by the disease, the NBA and other leagues are doing very little.", "url": "http://nymag.com/intelligencer/2020/03/coronavirus-american-sports-world-drags-its-feet.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/03/10/10-lebron-james.w1200.h630.jpg", "publishedAt": "2020-03-10T12:48:55Z", "content": "In disaster movies, you always know a city is done for when the sports stadiums go down. Whether its San Franciscos Oracle Park in San Andreas,the old Giants Stadium in The Day the Earth Stood Still,or Fenway Park in one of those Godzilla sequels, sports aren… [+6924 chars]"}, {"source": {"id": null, "name": "Wishtv.com"}, "author": null, "title": "Tuesday's business headlines - WISHTV.com", "description": "Here's a look at Tuesday's business headlines.", "url": "https://www.wishtv.com/news/business/tuesdays-business-headlines-85/", "urlToImage": "https://i2.wp.com/www.wishtv.com/wp-content/uploads/2019/09/CVS.jpeg?fit=1000%2C681&ssl=1", "publishedAt": "2020-03-10T12:50:00Z", "content": "INDIANAPOLIS (WISH) – Here’s a look at Tuesday’s business headlines.\r\nOnline sportsbook\r\nPointsBet USA says it is providing online and mobile sports betting in the Hoosier state through a partnership with Penn National Gaming, which operates two Indiana Casin… [+1217 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "CBS News Videos", "title": "Coronavirus vs. flu: What's the difference?", "description": "President Trump drew criticism from some health experts for comparing coronavirus to the common flu. In a Monday tweet, Mr. Trump compared the number of flu deaths in 2019 to the number of coronavirus deaths as of now. Dr. Jon LaPook joins “CBS This Morning” …", "url": "https://news.yahoo.com/coronavirus-vs-flu-whats-difference-124103588.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Ndicw2XhlretRtGDsazeAA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/lMX5oUdccZxRwRlFq0XhbQ--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/10/5e678b94da8e8312754c9561/5e678b94da8e8312754c9562_o_U_v2.jpg", "publishedAt": "2020-03-10T12:41:03Z", "content": "President Trump drew criticism from some health experts for comparing coronavirus to the common flu. In a Monday tweet, Mr. Trump compared the number of flu deaths in 2019 to the number of coronavirus deaths as of now. Dr. Jon LaPook joins CBS This Morning to… [+65 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Philip Klein, DC Examiner", "title": "The Trillion-Dollar Coronavirus Question for Markets", "description": "Markets kicked off what promises to be another wild week on Monday, thanks to growing fears about the effect of the coronavirus on the global economy.", "url": "https://www.realclearpolitics.com/2020/03/10/the_trillion-dollar_coronavirus_question_for_markets_557.html", "urlToImage": "https://assets.realclear.com/images/50/503697_5_.jpg", "publishedAt": "2020-03-10T12:36:21Z", "content": "Markets kicked off what promises to be another wild week on Monday, thanks to growing fears about the effect of the coronavirus on the global economy.\r\nRead Full Article »"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amanda Perelli", "title": "Exclusive: All the finalists for this year's Shorty Awards, which won't be a physical event for the first time in 12 years because of the coronavirus", "description": "The Shorty Awards honor the best of social media, from people to organizations, and this year's list of finalists includes YouTube influencer Jeffree Star, actress Sophie Turner, and the internet's favorite memes, like Baby Yoda Sipping Tea. New to this year'…", "url": "https://www.businessinsider.com/finalists-for-2020-shorty-awards-which-wont-have-physical-event-2020-3", "urlToImage": "https://i.insider.com/5e66a76984159f0e7b7e5d54?width=1200&format=jpeg", "publishedAt": "2020-03-10T13:00:00Z", "content": "The list of finalists for the 12th annual Shorty Awards is officially out.\r\nThe Shorty Awards honor the best of social media, from people to organizations. This year's list of finalists include YouTube sensation Jeffree Star (17 million subscribers), Game of … [+1296 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": null, "title": "Coronavirus: Manchester United Europa League game vs LASK to be played behind closed doors", "description": "Manchester United will play their Europa League last-16 first leg away to LASK Linz behind closed doors as Austria attempts to contain the spread of the coronavirus.", "url": "https://www.independent.co.uk/sport/football/european/coronavirus-news-manchester-united-europa-league-lask-fixture-behind-closed-doors-a9390226.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "publishedAt": "2020-03-10T13:07:04Z", "content": "Manchester United will play their Europa League last-16 first leg away to LASK Linz behind closed doors as Austria attempts to contain the spread of the coronavirus.\r\nRudolf Anschober, the Austrian health minister, announced on Tuesday morning that all outdoo… [+495 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Home discomforts: Will coronavirus stadium closures hurt Ronaldo, Messi and Neymar’s Champions League chances?", "description": "As the world grapples with the spread of the coronavirus the question has emerged as to whether its effects will harm the Champions League chances of the likes of Lionel Messi and Cristiano Ronaldo. Read Full Article at RT.com", "url": "https://www.rt.com/sport/482736-coronavirus-closed-doors-effects-champions-league/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e6789f685f5404038692618.jpg", "publishedAt": "2020-03-10T12:45:54Z", "content": "The coronavirus outbreak continues to spread across Europe, with major sporting events are finding themselves far from immune.\r\nThe latest announcement came on Tuesday that Barcelona’s Champions League last 16 second leg against Napoli on March 18 will be pla… [+4802 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Kitiphong Thaichareon and Orathai Sriring", "title": "Thailand unveils $12.7 billion stimulus package to ease coronavirus impact", "description": "Thailand's cabinet approved a stimulus package on Tuesday worth an estimated $12.7 billion to help alleviate the impact of the coronavirus epidemic on already-faltering domestic activity. Thailand is heavily reliant on global demand but its exports have been …", "url": "https://finance.yahoo.com/news/thailand-unveils-12-7-billion-124330289.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/P7urw4aM6T7lNe062II2.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/Wz3YzHsGVDMqhnayGGAwcA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/1a3dca695f7352e0c59ca3776d08b177", "publishedAt": "2020-03-10T12:43:30Z", "content": "By Kitiphong Thaichareon and Orathai Sriring\r\nBANGKOK (Reuters) - Thailand's cabinet approved a stimulus package on Tuesday worth an estimated $12.7 billion to help alleviate the impact of the coronavirus epidemic on already-faltering domestic activity.\r\nThai… [+2057 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "TIM CARNEY ON THE UNANTICIPATED CONSEQUENCES OF SOCIAL CHANGE: Stay-at-home parents could keep us s…", "description": "TIM CARNEY ON THE UNANTICIPATED CONSEQUENCES OF SOCIAL CHANGE: Stay-at-home parents could keep us safer amid coronavirus outbreak. The coronavirus is killing people and spreading rapidly. In Seattle, 14 people have died as of Friday morning amid at least 75 c…", "url": "https://pjmedia.com/instapundit/360836/", "urlToImage": null, "publishedAt": "2020-03-10T12:30:35Z", "content": "The coronavirus is killing people and spreading rapidly. In Seattle, 14 people have died as of Friday morning amid at least 75 confirmed cases. The number of Seattle residents infected with the virus that causes COVID-19 is probably far, far higher because te… [+905 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Trump mulls tax cuts to lessen coronavirus’ economic impact", "description": "Five members of Congress who are close to President Trump have self-quarantined due to contact with someone who tested positive for coronavirus. Mr. Trump himself has not been tested and the White House said he does not have any symptoms. After claiming the U…", "url": "https://www.cbsnews.com/video/trump-mulls-tax-cuts-to-lessen-coronavirus-economic-impact/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/69cb47af-93df-43a3-bd52-ecf6e19ca432/thumbnail/1200x630/f90a3877f685b800165bcb40ea321e17/0310-ctm-fedsteps-reid-2044852-640x360.jpg", "publishedAt": "2020-03-10T12:24:56Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Who is the most at risk for coronavirus?", "description": "The CDC has stated that older adults and people with chronic medical conditions are most at risk for the coronavirus. Dr. Tara Narula joins “CBS This Morning” to explain more about what that means and what groups should be on the lookout.", "url": "https://www.cbsnews.com/video/who-is-the-most-at-risk-for-coronavirus/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/e10d99a1-027a-4d2a-a64d-04a0d115b5f8/thumbnail/1200x630/9a6832445d6834152c04c79840d90247/0310-ctm-mostsusceptible-narula-2044880-640x360.jpg", "publishedAt": "2020-03-10T12:27:53Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Streets deserted as Italy imposes unprecedented coronavirus lockdown - Times of India", "description": "Streets deserted as Italy imposes unprecedented coronavirus lockdown Times of India Whole Of Italy Under Coronavirus Lockdown, Public Gatherings Banned NDTV News Coronavirus: Italy extends emergency measures nationwide BBC News Coronavirus: Italy completely u…", "url": "https://timesofindia.indiatimes.com/world/europe/streets-deserted-as-italy-imposes-unprecedented-coronavirus-lockdown/articleshow/74563911.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74563965,width-1070,height-580,imgsize-443593,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-10T13:06:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Osaka reports 18 new coronavirus cases, including from music venues: NHK", "description": "Japan's Osaka prefecture on Tuesday reported 18 new cases of coronavirus infections including multiple cases linked to live music venues that have been identified as hot spots in the prefecture, public broadcaster NHK said.", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-osaka-idUSKBN20X1R5", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T12:44:33Z", "content": "TOKYO (Reuters) - Japan’s Osaka prefecture on Tuesday reported 18 new cases of coronavirus infections including multiple cases linked to live music venues that have been identified as hot spots in the prefecture, public broadcaster NHK said. \r\nAs of Monday, a… [+165 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Ed Scarce", "title": "Rep. Matt Gaetz Goes Into Self-Quarantine After Being Exposed To The Coronavirus", "description": "Last Wednesday, Rep Matt Gaetz (R-FL) wore a gas mask on the floor of the House to ridicule funding efforts to combat the coronavirus. On Friday, one of his constituents died from the virus. And today it was learned that he may have contracted the virus himse…", "url": "https://crooksandliars.com/2020/03/rep-matt-gaetz-goes-self-quarantine-after", "urlToImage": "https://crooksandliars.com/files/primary_image/20/03/25752454-0-image-a-8_1583785681590.jpg", "publishedAt": "2020-03-10T12:29:04Z", "content": "Last Wednesday, Rep Matt Gaetz (R-FL) wore a gas mask on the floor of the House to ridicule funding efforts to combat the coronavirus. On Friday, one of his constituents died from the virus. And today it was learned that he may have contracted the virus himse… [+1447 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Tom Boggioni", "title": "Brutal Wall Street Journal op-ed blasts Trump for his ‘chaotic’ response to the coronavirus pandemic", "description": "In a startlingly frank attack on Donald Trump, a Wall Street Journal contributor blasted the president for thinking he could bluff his way through the coronavirus pandemic that is currently paralyzing the country. As columnist Walter Russell Mead put it, “The…", "url": "https://www.rawstory.com/2020/03/brutal-wall-street-journal-op-ed-blasts-trump-for-his-chaotic-response-to-the-coronavirus-pandemic/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/01/trump-afp-1.jpg", "publishedAt": "2020-03-10T13:04:20Z", "content": "In a startlingly frank attack on Donald Trump, a Wall Street Journal contributor blasted the president for thinking he could bluff his way through the coronavirus pandemic that is currently paralyzing the country.\r\nAs columnist Walter Russell Mead put it, “Th… [+2224 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus cruise passenger misses cancer treatment due to quarantine", "description": "One passenger evacuated from the Grand Princess cruise ship said she was due to undergo chemotherapy for her stage four neuroendocrine cancer on Tuesday, but is missing her appointment due to the mandatory coronavirus quarantine. David Begnaud shares details …", "url": "https://www.cbsnews.com/video/coronavirus-cruise-passenger-misses-cancer-treatment-due-to-quarantine/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/a3c63764-828a-4dd5-b8f8-93bcba87a67c/thumbnail/1200x630/7043c7f208db3ae9d65c06f11deec94b/0310-ctm-caeavucee-begnaud-2044892-640x360.jpg", "publishedAt": "2020-03-10T13:01:54Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Khn.org"}, "author": null, "title": "Viewpoints: Lessons On Serious Ills In Our Social Safety Net That Spread Covid-19 To The Vulnerable; Do Everything Needed To Slow Down Coronavirus", "description": "Opinion writers weigh in on issues surrounding the coronavirus.", "url": "https://khn.org/morning-breakout/viewpoints-lessons-on-serious-ills-in-our-social-safety-net-that-spread-covid-19-to-the-vulnerable-do-everything-needed-to-slow-down-coronavirus/", "urlToImage": "https://khn.org/wp-content/themes/kaiser-healthnews-2017/static/images/placeholder.jpg", "publishedAt": "2020-03-10T13:01:51Z", "content": "Opinion writers weigh in on issues surrounding the coronavirus.\r\nBoston Globe:\r\nCall Your Mom: The Generational Politics Of Covid-19 Theres a lot we dont know about Covid-19, but one dynamic appears clear: The health danger is highest for older people and tho… [+8514 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Coronavirus infections rise to four in Karnataka after 3 more test positive - Hindustan Times", "description": "Coronavirus infections rise to four in Karnataka after 3 more test positive Hindustan Times Three more people from Karnataka test positive for coronavirus Times of India COVID-19: Three more test positive in Bengaluru The Hindu Number of coronavirus cases in …", "url": "https://www.hindustantimes.com/india-news/coronavirus-infections-rise-to-four-in-karnataka-after-3-more-test-positive/story-B3p4SYZWRHkxY8as3Z6j4I.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/10/Pictures/coronavirus-social-activists-distribute-masks_66bf09ac-62cb-11ea-b9c4-de60b7b69f97.jpg", "publishedAt": "2020-03-10T12:41:38Z", "content": "The total number of people in Karnataka infected with coronavirus tose to four on Tuesday with three more testing positive, Chief Minister B S Yediyurappa said.\r\nAddressing the media after an emergency review meeting, Yediyurappa said that the three additiona… [+1391 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": null, "title": "Threat Of Coronavirus Pandemic 'Has Become Very Real', Says WHO - Kashmir Observer", "description": "Threat Of Coronavirus Pandemic 'Has Become Very Real', Says WHO Kashmir Observer Threat of coronavirus pandemic now 'very real': World Health Organization Livemint Threat of coronavirus pandemic 'very real', says WHO; body claims outbreak can be controlled th…", "url": "https://kashmirobserver.net/2020/03/10/threat-of-coronavirus-pandemic-has-become-very-real-says-who/", "urlToImage": "https://kashmirobserver.net/wp-content/uploads/2020/03/Coronavirus-Map.jpeg", "publishedAt": "2020-03-10T12:32:47Z", "content": "WhatsAppFacebook TwitterEmail0Shares\r\nRepresentational Pic\r\nGENEVA – The coronavirus is closer to causing a pandemic but outbreaks in countries can still be controlled through a combination of containment and mitigation measures, the World Health Organisation… [+600 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Megan Henney", "title": "What Trump’s payroll tax cut would mean for your wallet - Fox Business", "description": "What Trump’s payroll tax cut would mean for your wallet Fox Business", "url": "https://www.foxbusiness.com/money/trump-payroll-tax-us-business", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/Trump-payroll-tax.jpg?ve=1&tl=1", "publishedAt": "2020-03-10T12:43:16Z", "content": "President Trump floated the possibility of working with Congress to cut payroll taxes to address economic fallout from the coronavirus outbreak after the worst stock market drop in more than a decade.\r\nTrying to calm fears ignited over the coronavirus and exa… [+2638 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Iran says new virus kills 54, death toll climbs to 291", "description": "Iran is the hardest-hit country in the Mideast by the new coronavirus, which sickens but largely doesn#39;t kill those afflicted.", "url": "https://www.moneycontrol.com/news/world/iran-says-new-virus-kills-54-death-toll-climbs-to-291-5019611.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/Iran_Coronavirus-770x433.jpg", "publishedAt": "2020-03-10T12:20:05Z", "content": "Iran said March 10 that the new coronavirus killed 54 more people, raising the death toll to 291 amid 8,042 cases in the Islamic Republic. Health Ministry spokesman Kianoush Jahanpour made the announcement in a televised news conference.\r\nIt represented an 18… [+1150 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "grapier@businessinsider.com (Graham Rapier,Reuters)", "title": "A Boeing employee has tested positive for coronavirus in Washington", "description": "The plane maker said any of its workers in the Puget Sound region who are able to work from home have been asked to telecommute.", "url": "https://news.yahoo.com/boeing-employee-tested-positive-coronavirus-125200851.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/PcyulQOir0p5IqkuMJ1AJA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/btqD6hfoKNY8YwN7J5rhRg--~B/aD0xMjI0O3c9MTYzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/b3c11c74b3fe0d1ce7bd1638fed81c81", "publishedAt": "2020-03-10T12:52:00Z", "content": "Boeing 777 factory\r\nAP\r\n<ul><li>A Boeing employee in Washington has tested positive for the coronavirus, the company said late Monday. \r\n</li><li>Coworkers of the affected employee have been asked to self-quarantine and monitor for any symptoms, Boeing said. … [+1361 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Tobias Carroll", "title": "The Best Pandemic Books to Read During Coronavirus", "description": "With stakes so high, it’s easy to see why novelists find outbreaks of disease so compelling. Here are 20 great fictional takes.", "url": "http://www.vulture.com/article/best-pandemic-books.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2020/03/09/9-pandemic-fiction.w1200.h630.jpg", "publishedAt": "2020-03-10T13:00:27Z", "content": "Beauty Salon by Mario Bellatin (1994)\r\nOver time I have realized that the disease comes in spurts, writes the narrator of Bellatins short novel Beauty Salon. Its set in a world devastated by a pandemic affecting only men, leading to their rapid deaths in the … [+284 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "NewsHound Ellen", "title": "Bernie Sanders Scoffs At Trump’s ‘Stupid’ 'Natural Ability' Brag", "description": "Bernie Sanders’ Fox News town hall got off to a raucous start Monday evening when he responded to the first question, “What is your assessment of the Trump administration’s handling of the [coronavirus] outbreak and what would you do differently?” Not surpris…", "url": "https://crooksandliars.com/2020/03/bernie-sanders-scoffs-trump-s-stupid-covid", "urlToImage": "https://crooksandliars.com/files/embeds/2020/03/39456.jpg", "publishedAt": "2020-03-10T12:30:38Z", "content": "Bernie Sanders Fox News town hall got off to a raucous start Monday evening when he responded to the first question, What is your assessment of the Trump administrations handling of the [coronavirus] outbreak and what would you do differently?\r\nNot surprising… [+2310 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Red Cross Urges Healthy Individuals to Give Blood amid Coronavirus Concerns", "description": "Red Cross Urges Healthy Individuals to Give Blood amid Coronavirus ConcernsPR NewswireWASHINGTON, March 10, 2020Low Donor Turnout Could Hurt U.Cold and flu season has already impacted the nation's ability to maintain its blood supply.", "url": "https://news.yahoo.com/red-cross-urges-healthy-individuals-121300531.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/10Ar9kI7TSE00Kkp73lKbg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTM2NA--/https://s.yimg.com/uu/api/res/1.2/dNaFGLezCHCOHD1uMtnPGw--~B/aD0xODI7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/usnewswire.com/d8b4a98bef2a7a89cc19b061a2e7b4c9", "publishedAt": "2020-03-10T12:13:00Z", "content": "Red Cross Urges Healthy Individuals to Give Blood amid Coronavirus Concerns\r\nPR Newswire\r\nWASHINGTON, March 10, 2020\r\nLow Donor Turnout Could Hurt U.S. Blood Supply\r\nWASHINGTON, March 10, 2020 /PRNewswire/ -- The American Red Cross strongly urges healthy, eli… [+6073 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Z Natural Foods Provides Whole Egg Powder and Egg White Powder as Emergency Food Supplies", "description": "Preppers are buying canned foods, water, toilet paper, and other basic items to prepare for the coronavirus outbreak. Store shelves are even showing early signs of shortages at Walmart, Target, Costco, and Whole Foods.", "url": "https://news.yahoo.com/z-natural-foods-provides-whole-123300619.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9Pr8QjPlFAdMjITLZYXelg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTMyO2g9MzI-/https://s.yimg.com/uu/api/res/1.2/SNcdVLsTw2X1iSCzXHjM3w--~B/aD0xNjt3PTE2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/prnewswire.com/0f534bcc0348b3b64ccb6ac7113b34e3", "publishedAt": "2020-03-10T12:33:00Z", "content": "WEST PALM BEACH, Fla., March 10, 2020 /PRNewswire/ -- Preppers are buying canned foods, water, toilet paper, and other basic items to prepare for the coronavirus outbreak. Store shelves are even showing early signs of shortages at Walmart, Target, Costco, and… [+2550 chars]"}, {"source": {"id": null, "name": "Cafehayek.com"}, "author": "Don Boudreaux", "title": "Some Links", "description": "(Don Boudreaux) TweetRyan Bourne appropriately reacts to ‘anti-price-gouging madness’ – this time predictably uncorked by the coronavirus. Here’s his conclusion: In the face of a potentially prolonged and worsening epidemic, muffling the price signals therefo…", "url": "https://cafehayek.com/2020/03/some-links-1519.html", "urlToImage": "http://cafehayek.com/wp-content/uploads/2016/02/hayeklaptop_165.jpg", "publishedAt": "2020-03-10T12:48:37Z", "content": "I eagerly awaited Ms. Warrens announcement that she, too, would drop out of the race. Her contrived energy, those uplifted arms, the too-exuberant hugs, that never slackening self-righteousnessnone of this paid off in votes. Many years ago I coined the term v… [+3603 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "CrowdOptic and National Bioskills Laboratories Provide Remote Training with Video Feeds Directly from Medical Devices for Travel-Restricted Enterprises Due to COVID-19 Outbreak", "description": "CrowdOptic and National Bioskills Laboratories (NBL) today confirmed the organizations' ability to provide remote training for physicians and employees at enterprises affected by the travel restrictions surrounding the recent COVID-19 (coronavirus) outbreak.", "url": "https://news.yahoo.com/crowdoptic-national-bioskills-laboratories-remote-130000744.html", "urlToImage": null, "publishedAt": "2020-03-10T13:00:00Z", "content": null}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Zachary Evans, Zachary Evans", "title": "U.S. Begins Limited Troop Withdrawals from Middle East after Iran Hit Hard by Coronavirus", "description": "Around 1,000 troops have returned from Kuwait over the past two weeks, while an additional 2,000 are expected to return in the near future.", "url": "https://www.nationalreview.com/news/u-s-begins-limited-troop-withdrawals-from-middle-east-after-iran-hit-hard-by-coronavirus/", "urlToImage": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/12/soldiers-1.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-10T12:12:33Z", "content": null}, {"source": {"id": null, "name": "Khn.org"}, "author": null, "title": "Different Takes: Bullying, Bluffing Not Paying Off During Coronavirus; Can Someone Stop Worrying About His Own Image For Once?", "description": "Editorial pages focus on the pros and cons of the administration during the outbreak of coronavirus.", "url": "https://khn.org/morning-breakout/different-takes-bullying-bluffing-not-paying-off-during-coronavirus-can-someone-stop-worrying-about-his-own-image-for-once/", "urlToImage": "https://khn.org/wp-content/themes/kaiser-healthnews-2017/static/images/placeholder.jpg", "publishedAt": "2020-03-10T13:01:51Z", "content": "Editorial pages focus on the pros and cons of the administration during the outbreak of coronavirus.\r\nThe Wall Street Journal:\r\nTrump And The PandemicThe coronavirus pandemic is the greatest challenge Donald Trump has ever faced. As stock markets fall and pat… [+4775 chars]"}]