[{"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, CNN", "title": "Florida reports its first 2 coronavirus deaths", "description": "Two patients who tested positive for the novel coronavirus have died, the Florida Department of Health announced Friday night.", "url": "https://www.cnn.com/2020/03/07/us/florida-coronavirus-deaths/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306171508-coronavirus-vaccine-lab-germany-pleitgen-pkg-00000000-super-tease.jpg", "publishedAt": "2020-03-07T13:08:06Z", "content": "(CNN)Two patients who tested positive for the novel coronavirus have died, the Florida Department of Health announced Friday night.\r\nThe cases mark the first US coronavirus deaths outside California and Washington. \r\nBoth of the deceased in Florida, including… [+572 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Peter Sheridan", "title": "Unstoppable plague, Doomsday is here, and Cruel Meghan, in this week’s dubious tabloids", "description": "If you weren’t yet panicking about the coronavirus, this week’s tabloids will have you stocking up on Depends adult underwear, toilet tissue and face-masks.", "url": "https://boingboing.net/2020/03/07/unstoppable-plague-doomsday-i.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/01/tabloids-1.jpg?fit=1200%2C749&ssl=1", "publishedAt": "2020-03-07T12:55:50Z", "content": "If you werent yet panicking about the coronavirus, this weeks tabloids will have you stocking up on Depends adult underwear, toilet tissue and face-masks.\r\nDoomsday is Here! screams the Globe headline, displaying its usual calm voice of authority with its cov… [+6071 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Secon", "title": "Photos show how people around the world are disinfecting schools, mosques, and streets to stop the coronavirus from spreading", "description": "The coronavirus that originated in Wuhan, China, has spread to 90 other countries. Many cities are disinfecting public surfaces with bleach-and-water mixtures. Experts aren't sure how long the contagious virus can live on surfaces, but say it could range from…", "url": "https://www.businessinsider.com/coronavirus-sanitation-disinfection-around-the-world-in-photos-2020-3", "urlToImage": "https://i.insider.com/5e630037fee23d366c0d6863?width=1200&format=jpeg", "publishedAt": "2020-03-07T13:02:00Z", "content": "One of the most effective ways to fight the spread of the new coronavirus is to disinfect highly touched surfaces. Across the world, disinfection teams have descended upon kindergartens, state capital buildings, markets, mosques, airports, and public roads.\r\n… [+857 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Two test positive for coronavirus at US conference attended by Pence", "description": "Two people have tested positive for the new coronavirus after taking part in a pro-Israel lobby group's conference in Washington which Vice President Mike Pence, Secretary of State Mike Pompeo and dozens of lawmakers also attended. The influential American Is…", "url": "https://news.yahoo.com/coronavirus-confirmed-two-attendees-us-pro-israel-summit-014428574.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jonFWoiL9BnsPgU3tkvGKg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/WopXz18VQ_Li_xUK_BjgRQ--~B/aD01Mjk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/e326af4cd3ef134108d1c02ff3c928140fc1b3c4.jpg", "publishedAt": "2020-03-07T13:02:57Z", "content": "Washington (AFP) - Two people have tested positive for the new coronavirus after taking part in a pro-Israel lobby group's conference in Washington which Vice President Mike Pence, Secretary of State Mike Pompeo and dozens of lawmakers also attended.\r\nThe inf… [+2003 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Around 4,000 New Yorkers are being told to self-quarantine. An 84-year old woman who had contact with a coronavirus patient describes what it's like.", "description": "Around 4,000 people in New York have been asked to self-isolate at home due to the coronavirus. Most of the state's cases are linked to a single patient : a 50-year-old attorney from Westchester. An 84-year-old woman who attends synagogue with that man said s…", "url": "https://www.businessinsider.com/new-york-quarantine-elderly-patient-in-isolation-2020-3", "urlToImage": "https://i.insider.com/5e630130fee23d3b767505c3?width=1200&format=jpeg", "publishedAt": "2020-03-07T12:41:00Z", "content": "Vera Koppel prepared for this Wednesday like any other: She planned to chair a weekly social event at her synagogue in Westchester, New York. A lunch would be followed by a screening of the documentary \"Cuba's Forgotten Jewels,\" about Jewish refugees who esca… [+4873 chars]"}, {"source": {"id": null, "name": "Thekitchn.com"}, "author": "Kelli Foster", "title": "Here Are 5 Weeks’ Worth of Meals You Can Make with Pantry Staples", "description": "With the possibility of a coronavirus quarantine, here are some recipes and tips to stretch your pantry staples into meals. READ MORE...", "url": "https://www.thekitchn.com/pantry-meal-plans-23012495", "urlToImage": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500/k%2Farchive%2Fb24caef91ffbeadaf1aae98104dd14665c10df08", "publishedAt": "2020-03-07T13:00:00Z", "content": "These family-friendly dinners all start with dry goods like lentils, beans, pasta, rice, and broth plus some fresh staples, like chicken sausage, eggs, tortillas, and broccoli that keep well in the fridge for a while. From a hearty lentil and chicken sausage … [+151 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Anmol", "title": "Facebook bans ads related to face masks to prevent price gouging", "description": "The Novel Coronavirus outbreak has taken the world by storm and as countries scramble to fight the virus, the tech giants are fighting a totally different battle. Ever since the outbreak became global, tech companies are fighting to take down fake news and mi…", "url": "https://mspoweruser.com/facebook-bans-face-mask-ads-prevent-price-gouging/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2019/11/Facebook-Corporate-branding.jpg", "publishedAt": "2020-03-07T12:34:45Z", "content": "The Novel Coronavirus outbreak has taken the world by storm and as countries scramble to fight the virus, the tech giants are fighting a totally different battle. Ever since the outbreak became global, tech companies are fighting to take down fake news and mi… [+1754 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Italy's Democratic Party Head Tests Positive for Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-07/head-of-italy-s-democratic-party-tests-postive-for-coronavirus", "urlToImage": null, "publishedAt": "2020-03-07T12:45:57Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "How the rich are preparing for coronavirus", "description": "How the rich are preparing for coronavirusResources like money, transportation and information give people head starts on protective and preventive measures.", "url": "https://economictimes.indiatimes.com/magazines/panache/can-we-get-a-vaccine-early-how-the-rich-are-preparing-for-coronavirus/articleshow/74527603.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74527697,width-1070,height-580,imgsize-609536,overlay-etpanache/photo.jpg", "publishedAt": "2020-03-07T12:27:18Z", "content": "By Max AbelsonOne investor may fly to Idaho with or without family. A doctor in a Colorado ski town is soothing wealthy clients who want a cure. And one New Yorker called up the hospital with his name on it.\r\nLike everyone across the U.S., the rich are bracin… [+7972 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Leader of Italy's co-ruling democratic party tests positive to coronavirus", "description": "The leader of Italy's co-ruling Democratic Party Nicola Zingaretti said on Saturday he had tested positive for coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-pd-idUSKBN20U0IA", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200307&t=2&i=1499984397&w=1200&r=LYNXMPEG260CK", "publishedAt": "2020-03-07T12:31:20Z", "content": "ROME (Reuters) - The leader of Italy’s co-ruling Democratic Party Nicola Zingaretti said on Saturday he had tested positive for coronavirus. \r\n“I have coronavirus too”, Zingaretti said in a video posted on Facebook, adding he was in self-isolation at home and… [+536 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump says he will not stop campaign rallies over coronavirus - CBS This Morning", "description": "Trump says he will not stop campaign rallies over coronavirus CBS This Morning Trump’s Mislaid Blame on Obama for Virus Test Snopes.com Trump’s bogus effort to blame Obama for sluggish coronavirus testing The Washington Post Get political reporters off the co…", "url": "https://www.youtube.com/watch?v=t1PzqP-oolc", "urlToImage": "https://i.ytimg.com/vi/t1PzqP-oolc/maxresdefault.jpg", "publishedAt": "2020-03-07T12:47:16Z", "content": "The Trump administration is working to meet the surging demand for coronavirus test kits as the number of confirmed cases spreads across 29 states. While CDC and U.S. health officials work to inform the public and urge caution, President Trump touted the $8.3… [+1547 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Morrell", "title": "Inside Wall Street's mad dash to keep up with a surge in mortgage demand that could be a rare bright spot after an emergency Fed rate cut", "description": "Banks are scrambling to keep up with surging mortgage demand. Amid falling interest rates, mortgage volumes have been soaring since the second half of 2019. That went into overdrive this week after the Federal Reserve announced a surprise, emergency cut to it…", "url": "https://www.businessinsider.com/banks-scrambling-keep-up-with-mortgage-boom-amid-low-rates-2020-3", "urlToImage": "https://i.insider.com/5d641fb32e22af0cd16e5963?width=1200&format=jpeg", "publishedAt": "2020-03-07T13:00:00Z", "content": "Mortgage rates were already hitting record lows — and then the Federal Reserve unleashed an emergency cut to its benchmark interest rate.\r\nNow lenders, which have already been scrambling to keep up with heightened demand for home loans and refinancings spurre… [+5634 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Pope to give Sunday prayer by livestream amid virus threat - BBC News", "description": "Coronavirus: Pope to give Sunday prayer by livestream amid virus threat BBC News View Full Coverage on Google News", "url": "https://www.bbc.co.uk/news/live/world-us-canada-51781573", "urlToImage": "https://m.files.bbci.co.uk/modules/bbc-morph-news-waf-page-meta/4.1.2/bbc_news_logo.png", "publishedAt": "2020-03-07T12:56:15Z", "content": "Italy says the death toll from the coronavirus outbreak has risen by 36, bringing the total to 233 in the country.\r\nItaly has recorded the most deaths of any country outside China, where the virus originated in the city of Wuhan.\r\nThe number of new coronaviru… [+593 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Stephen King’s post featuring Pennywise from ‘It’ amid coronavirus scare wins the Internet", "description": "People on the internet loved their favourite author's dark sense of humour and couldn't stop appreciating his post, where he changed a popular dialogue from the iconic horror film to capture the mood of people amid coronavirus outbreak.", "url": "https://indianexpress.com/article/trending/trending-globally/coronavirus-stephen-king-pennywise-from-it-post-6303735/", "urlToImage": "https://images.indianexpress.com/2020/03/stephen-king-it-clown-coronavirus-759.jpg?w=759", "publishedAt": "2020-03-07T12:39:57Z", "content": "By: Trends Desk | New Delhi | \r\nUpdated: March 7, 2020 6:27:35 pm\r\nTaking a photo from the introduction scene of Pennywise, the clown interacting with the boy, Georgie in the film, King changed the dialogue to say, “I got hand sanitizer down here…”As coronavi… [+3318 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pope modifies engagements to avoid crowds gathering amid coronavirus outbreak", "description": "Pope Francis has canceled his main public appearances to avoid crowds gathering to see him and will stream them on the internet from inside the Vatican because of the coronavirus outbreak in Italy.", "url": "https://www.reuters.com/article/us-health-coronavirus-pope-idUSKBN20U0JH", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200307&t=2&i=1499995047&w=1200&r=LYNXMPEG260D3", "publishedAt": "2020-03-07T13:08:25Z", "content": "VATICAN CITY (Reuters) - Pope Francis has canceled his main public appearances to avoid crowds gathering to see him and will stream them on the internet from inside the Vatican because of the coronavirus outbreak in Italy. \r\nThe Vatican said that on Sunday he… [+473 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "IE Online", "title": "Face masks, empty streets: What coronavirus is doing to the world", "description": "A viral outbreak that began in China has killed more than more than 3,480 people globally.", "url": "https://indianexpress.com/photos/world-news/coronavirus-china-korea-photos-6304052/", "urlToImage": "https://images.indianexpress.com/2020/03/Coronavirus-1-759-1.jpg?w=759", "publishedAt": "2020-03-07T13:03:56Z", "content": null}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Cashing Out In A Market Downturn: Smart? - Investor's Business Daily", "description": "As the stock market sags amid investor fears about coronavirus, mutual fund shareholders wonder if cashing out of stocks and stock mutual funds is smart.", "url": "https://www.investors.com/etfs-and-funds/personal-finance/cashing-out-market-downturn-smart/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/03/MISS-PERS-030620-adobe.jpg", "publishedAt": "2020-03-07T13:00:00Z", "content": "As the stock market sags amid investor fears about coronavirus, mutual fund shareholders wonder how to avoid becoming collateral damage. Is cashing out of stocks and stock funds a smart way to protect their investments? Or should shareholders stay the course,… [+6186 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andy Serwer with Max Zahn", "title": "The crazy story of Purell and the coronavirus", "description": "The coronavirus is dragging the economy but privately-owned Purell, maker of the famous hand sanitizer, is one company that appears to be benefitting from the outbreak.", "url": "https://finance.yahoo.com/news/the-crazy-story-of-purell-and-the-coronavirus-130056513.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uSnQKd4Ux3i.np40fLCJxw--~B/aD0zNTI3O3c9NTM5OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/52f68fe0-5f0f-11ea-bd8f-897a15c90a11", "publishedAt": "2020-03-07T13:00:56Z", "content": "The drag of the coronavirus on the global economy is massive. While the real tragedy is lives lost, the economic effect is a hugely significant secondary consideration. Businesses around the world are feeling serious pain. A recession might be in the offing.\r… [+7297 chars]"}, {"source": {"id": null, "name": "Cachevalleydaily.com"}, "author": null, "title": "Business as usual at ICON despite international coronavirus disruptions - Cache Valley Daily", "description": "LOGAN – ICON Health &amp; Fitness of Logan is well-positioned to weather the looming economic disruption threatened by the worldwide coronavirus outbreak, according to Colleen Logan, ICON’s vice-president for Marketing.", "url": "https://cachevalleydaily.com/news/archive/2020/03/07/business-as-usual-at-icon-despite-international-coronavirus-disruptions/", "urlToImage": "https://cachevalleydaily.com/wp-content/uploads/2020/03/ICON.PIX_.jpg", "publishedAt": "2020-03-07T12:31:05Z", "content": "LOGAN ICON Health &amp; Fitness of Logan is well-positioned to weather the looming economic disruption threatened by the worldwide coronavirus outbreak, according to Colleen Logan, ICONs vice-president for Marketing.\r\nWe have an adequate inventory of finished… [+2855 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "COVID-19 | Egypt says cruise ship quarantined over new virus cluster", "description": "A Taiwanese-American tourist who had previously been on the same ship tested positive when she returned to Taiwan", "url": "https://www.thehindu.com/news/international/covid-19-egypt-says-cruise-ship-quarantined-over-new-virus-cluster/article31009096.ece", "urlToImage": "https://www.thehindu.com/news/international/xjwaf6/article31009095.ece/ALTERNATES/LANDSCAPE_615/07TH-LT-VIRUSOUTBREAKEGYPT", "publishedAt": "2020-03-07T12:12:06Z", "content": "A cruise ship on Egypts Nile River with over 150 tourists, including Indians, and local crew was in quarantine Saturday in the southern city of Luxor, after 12 people tested positive for the new coronavirus (COVID-19).\r\nA Taiwanese-American tourist who had pr… [+2543 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Hayley C. Cuccinello, Forbes Staff, Hayley C. Cuccinello, Forbes Staff https://www.forbes.com/sites/hayleycuccinello/", "title": "As Coronavirus Outbreak Spreads, 10 Chinese Billionaires Including Tencent’s Pony Ma Defied Odds And Gained Billions In The Past Week", "description": "Despite investor panic across the globe, the Chinese stock market is rebounding, giving a multibillion-dollar boost to several billionaires.", "url": "https://www.forbes.com/sites/hayleycuccinello/2020/03/07/coronavirus-chinese-billionaires-net-worth-pony-ma/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F689241054%2F0x0.jpg%3FcropX1%3D422%26cropX2%3D3000%26cropY1%3D0%26cropY2%3D1449", "publishedAt": "2020-03-07T12:30:00Z", "content": "Pony Ma is China's richest person with a net worth of $44.5 billion.\r\nGetty Images\r\nStock markets across the globe have taken a hit amid investor panic provoked by the coronavirus outbreak. The S&amp;P 500 ended the week up a mere 0.6% and the MSCI Europe sli… [+4930 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Traveling amid coronavirus: What you should know", "description": "As coronavirus cases multiply across the globe causing severe disruptions to day-to-day life, the tourism industry has been among the hardest-hit. Travelers are on high alert as cruise lines, hotels and airlines see demand plummet. Jesse Ashlock, U.S. editor …", "url": "https://www.cbsnews.com/video/traveling-amid-coronavirus-what-you-should-know/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/07/c75b9fe8-7905-4b61-a848-d9c0d057a619/thumbnail/1200x630/54743c7c65ad54da6e14d1f37412e44f/0307-ctm-coronatravel-ashlock-2043170-640x360.jpg", "publishedAt": "2020-03-07T13:07:22Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Techpinions.com"}, "author": "Bob O'Donnell", "title": "Podcast: Coronavirus, Virtual Events, AMD", "description": "This week’s Techpinions podcast features Carolina Milanesi and Bob O’Donnell discussing the ongoing impact of the coronavirus on the tech industry and how it may provide some people with a bit more time to think through the direction the tech industry is head…", "url": "https://techpinions.com/podcast-coronavirus-virtual-events-amd/59436", "urlToImage": null, "publishedAt": "2020-03-07T13:00:55Z", "content": "Reading Time: 1minuteThis week’s Techpinions podcast features Carolina Milanesi and Bob O’Donnell discussing the ongoing impact of the coronavirus on the tech industry and how it may provide some people with a bit more time to think through the direction the … [+321 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Italy's leader of co-ruling Democratic party tests positive to coronavirus", "description": "The leader of Italy’s co-ruling Democratic Party, Nicola Zingaretti, has admitted he had been tested positive for coronavirus as Italy struggles to cope with the health care crisis sparked by the disease. Read Full Article at RT.com", "url": "https://www.rt.com/news/482566-italy-leader-of-co-ruling-coronavirus/", "urlToImage": "https://cdni.rt.com/files/static.en/article/breaking.jpg", "publishedAt": "2020-03-07T12:18:00Z", "content": "“The doctors have told me that I am positive for COVID-19,” the politician said in a video he published on his Facebook page, referring to the official name of the deadly disease that originated from China.\r\nThe man, who is also the president of the central I… [+484 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Keri Blakinger and Beth Schwartzapfel, The Marshall Project", "title": "Soap and sanitizer can keep coronavirus at bay, but many prisoners can't get them", "description": "Cleaning products that could control coronavirus are banned and basic hygiene measures, such as handwashing with soap, can be impossible for inmates.", "url": "https://news.yahoo.com/soap-sanitizer-keep-coronavirus-bay-130016936.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0lL0NV0OKs0dvq2OeWwtgg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDUuNg--/https://s.yimg.com/uu/api/res/1.2/ma0KlMKakapqZbHplI3cyQ--~B/aD0yMzQzO3c9MzMxMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/d12461190f87202a85931a927f91186f", "publishedAt": "2020-03-07T13:00:16Z", "content": "When Lauren Johnson reached for a squirt of hand sanitizer on her way out of the doctors office, she regretted it immediately.\r\nIn the Central Texas prison where she was housed, alcohol-based hand sanitizer was against the rulesand the on-duty officer was qui… [+5827 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Trump says he will not stop campaign rallies over coronavirus", "description": "The Trump administration is working to meet the surging demand for coronavirus test kits as the number of confirmed cases spreads across 29 states. While CDC and U.S. health officials work to inform the public and urge caution, President Trump touted the $8.3…", "url": "https://www.cbsnews.com/video/trump-says-he-will-not-stop-campaign-rallies-over-coronavirus/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/07/8f1a98df-2eec-4564-90b2-085c472709f6/thumbnail/1200x630/7831012015240975bf8c5f51922c6c13/0307-ctm-trumpcorona-jiang-2043132-640x360.jpg", "publishedAt": "2020-03-07T12:47:13Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "EU tells Italy its coronavirus spending will not hurt compliance with budget rules", "description": "The European Commission told Italy on Saturday that its planned extra spending to respond to the country's coronavirus outbreak will not be counted in considering its compliance with European Union budget rules.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-eu-idUSKBN20U0IZ", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200307&t=2&i=1499989466&w=1200&r=LYNXMPEG260CV", "publishedAt": "2020-03-07T12:46:51Z", "content": "ROME (Reuters) - The European Commission told Italy on Saturday that its planned extra spending to respond to the country’s coronavirus outbreak will not be counted in considering its compliance with European Union budget rules. \r\nItalian Economy Minister Rob… [+1008 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "CNET News staff", "title": "9 great reads from CNET this week - CNET", "description": "Why Mars isn't going to be terraformed anytime soon, what Uber and Lyft are doing to guard against coronavirus and how one editor fell for a rollable phone.", "url": "https://www.cnet.com/news/9-great-reads-from-cnet-this-week-030720/", "urlToImage": "https://cnet2.cbsistatic.com/img/oT6PZD1NsGcGZy7Qk2XNuebhGp8=/756x567/2020/02/24/c0f92d3d-3743-48c2-b6d8-0551e0bbd5bf/gettyimages-112717743.jpg", "publishedAt": "2020-03-07T13:00:08Z", "content": "Our week was once again dominated by news of the coronavirus rapidly spreading across the globe and its reverberations in the tech industry, the economy and our own lives. We also saw the Democratic field of US presidential candidatesnarrow abruptly following… [+1286 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Eye Opener: Trump urges calm amid coronavirus panic", "description": "Coronavirus cases spread to 29 U.S. states as President Trump urges “calm.” Also, Mr. Trump replaced acting Chief of Staff Mick Mulvaney with loyalist GOP Rep. Mark Meadows. All that and all that matters in today’s Eye Opener. Your world in 90 seconds.", "url": "https://www.cbsnews.com/video/eye-opener-trump-urges-calm-amid-coronavirus-panic/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/07/b1327cb5-ae09-4251-8653-6b96fbc3ddf7/thumbnail/1200x630/5c3162f07cf1430b51ade34b3fd9e8dc/0307-ctm-eyeopener7am-2043113-640x360.jpg", "publishedAt": "2020-03-07T12:34:01Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Brian Chappatta", "title": "The $100 Trillion Bond Market’s Coronavirus Mayhem in 13 Charts", "description": "(Bloomberg Opinion) -- If I had to summarize this past week in the $100 trillion global bond market, it’d be fairly straightforward: Traders are enormously fearful of what the coronavirus outbreak will mean for the world economy and adjusting their positions …", "url": "https://finance.yahoo.com/news/100-trillion-bond-market-coronavirus-130028832.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UDR4nPPosFODqoV7LMaQ1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MzkuMg--/https://s.yimg.com/uu/api/res/1.2/1n9wQaqyJOZupaTaDozrEQ--~B/aD03NDg7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/8d67b3534288bbfb3cf72f502903f25e", "publishedAt": "2020-03-07T13:00:28Z", "content": "(Bloomberg Opinion) -- If I had to summarize this past week in the $100 trillion global bond market, itd be fairly straightforward: Traders are enormously fearful of what the coronavirus outbreak will mean for the world economy and adjusting their positions a… [+8463 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "The $100 Trillion Bond Market’s Coronavirus Mayhem in 13 Charts", "description": "(Bloomberg Opinion) -- If I had to summarize this past week in the $100 trillion global bond market, it’d be fairly straightforward: Traders are enormously fearful of what the coronavirus outbreak will mean for the world economy and adjusting their positions …", "url": "https://news.yahoo.com/100-trillion-bond-market-coronavirus-130028913.html", "urlToImage": null, "publishedAt": "2020-03-07T13:00:28Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Coronavirus | IndiGo waives rescheduling fee for bookings till March 31", "description": "The fee waiver would only apply to change of dates of flights but not in case of cancellation.", "url": "https://www.thehindu.com/news/national/coronavirus-indigo-waives-rescheduling-fee-for-bookings-till-march-31/article31008477.ece", "urlToImage": "https://www.thehindu.com/news/national/dy81fx/article30783607.ece/ALTERNATES/LANDSCAPE_615/INDIGO", "publishedAt": "2020-03-07T12:53:08Z", "content": "Budget carrier IndiGo on Saturday said it will not charge any fee for rescheduling of domestic and international flights booked for March 12-31, amid coronavirus scare.\r\nThere would also be zero change fee for fresh bookings made between March 12 and 31, the … [+1215 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Tom Boggioni", "title": "‘Trump is so screwed’: Bill Maher panel lists off how the coronavirus will cripple his re-election", "description": "During the “Overtime” segment of HBO’s “Real Time,” panelists speaking with host Bill Maher noted the increasing fallout from the coronavirus as it spreads across the U.S. and how it may cripple Donald Trump’s re-election efforts. As one guest, political anal…", "url": "https://www.rawstory.com/2020/03/trump-is-so-screwed-bill-maher-panel-lists-off-how-the-coronavirus-will-cripple-his-re-election/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/maher_bitecofer.jpg", "publishedAt": "2020-03-07T12:28:59Z", "content": "During the “Overtime” segment of HBO’s “Real Time,” panelists speaking with host Bill Maher noted the increasing fallout from the coronavirus as it spreads across the U.S. and how it may cripple Donald Trump’s re-election efforts.\r\nAs one guest, political ana… [+1146 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Russia Registers 4 New COVID-19 Cases", "description": "MOSCOW (Sputnik) - Russia has four new cases of the coronavirus disease (COVID-19) in people who have recently returned from Italy, the Russian coronavirus response centre said on Saturday.", "url": "https://sputniknews.com/russia/202003071078503360-russia-registers-4-new-covid-19-cases/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107841/09/1078410909.jpg", "publishedAt": "2020-03-07T12:53:55Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "US cruise ship with 21 coronavirus cases waits to dock, but Trump prefers to keep them off land - Livemint", "description": "US cruise ship with 21 coronavirus cases waits to dock, but Trump prefers to keep them off land Livemint \"Would Rather Have Them Stay On\": Trump On 21 Stranded On Coronavirus-Hit Ship NDTV News Cruise ship may be quarantined off San Francisco for two weeks - …", "url": "https://www.livemint.com/news/world/us-cruise-ship-with-21-coronavirus-cases-wait-to-dock-11583581479624.html", "urlToImage": "https://images.livemint.com/img/2020/03/07/600x338/2020-03-07T075614Z_1_LYNXMPEG2606Q_RTROPTP_3_HEALTH-CORONAVIRUS-USA_1583583011578_1583583026376.JPG", "publishedAt": "2020-03-07T12:14:53Z", "content": "Beijing: Officials in California were deciding Saturday where to dock a cruise ship with 21 coronavirus cases aboard and four U.S. universities canceled in-person classes, as Western countries imitate China by imposing travel controls and shutting down public… [+7457 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "blogenfreude", "title": "Mike's Blog Round Up", "description": "Redeye - every life is precious in Alabama! Tell Me a Story - seeds... The New York Crank - if you see something you'd better be a Republican... We Hunted the Mammoth - men's march dude too busy to march; Why Now? - a thousand miles from a coronavirus test...…", "url": "https://crooksandliars.com/2020/03/mikes-blog-round-4", "urlToImage": "https://crooksandliars.com/files/primary_image/17/03/saturday.png", "publishedAt": "2020-03-07T13:01:01Z", "content": "Redeye - every life is precious in Alabama!\r\nTell Me a Story - seeds ...\r\nThe New York Crank - if you see something you'd better be a Republican ...\r\nWe Hunted the Mammoth - men's march dude too busy to march;\r\nWhy Now? - a thousand miles from a coronavirus t… [+199 chars]"}, {"source": {"id": null, "name": "Musicbusinessworldwide.com"}, "author": "Tim Ingham", "title": "SXSW disaster: Event admits it has no insurance for Coronavirus cancellation - Music Business Worldwide", "description": "SXSW disaster: Event admits it has no insurance for Coronavirus cancellation Music Business Worldwide SXSW is canceled over coronavirus concerns CNN Comprehensive Coronavirus Coverage In Texas CBSDFW How fast could COVID-19 spread in a crowd? UT researcher we…", "url": "https://www.musicbusinessworldwide.com/sxsw-disaster-event-admits-it-has-no-insurance-for-coronavirus-cancellation/", "urlToImage": "https://cdn.mbw.44bytes.net/files/2020/03/775312706AP00005_Featured_S-864x576.jpg", "publishedAt": "2020-03-07T12:15:00Z", "content": "It’s been a dreadful 24 hours for live promoters and festival owners.\r\nFirst, late yesterday (March 6), South By Southwest, the annual US film, tech and music festival due to take place in Austin, Texas next week announced its 2020 cancellation due to concern… [+4739 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Asian News International", "title": "Amritsar hospital reports two coronavirus infections based on preliminary tests; samples sent to NIV Pune for confirmation", "description": "Two persons from Hoshiarpur tested positive for COVID-19, the novel coronavirus at the Guru Nanak Dev Hospital in Amritsar, the hospital said on Saturday The post Amritsar hospital reports two coronavirus infections based on preliminary tests; samples sent to…", "url": "https://www.firstpost.com/health/amritsar-hospital-reports-two-coronavirus-infections-based-on-preliminary-tests-samples-sent-to-niv-pune-for-confirmation-8128831.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/coronavirus_940_PTI.jpg", "publishedAt": "2020-03-07T12:23:13Z", "content": null}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "HOW WILL THE DNC-MSM BE ABLE TO EVEN FUNCTION? Amtrak Suspends Acela Nonstop Service Between DC, New…", "description": "HOW WILL THE DNC-MSM BE ABLE TO EVEN FUNCTION? Amtrak Suspends Acela Nonstop Service Between DC, New York Due To Reducing Demand Amid Coronavirus Outbreak. Related: An Insta-reader sends a link to this:", "url": "https://pjmedia.com/instapundit/360634/", "urlToImage": null, "publishedAt": "2020-03-07T12:22:33Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Asian News International", "title": "Amritsar hospital reports two coronavirus infections based on preliminary tests; samples sent to NIV Pune for confirmation", "description": "Two persons from Hoshiarpur tested positive for COVID-19, the novel coronavirus at the Guru Nanak Dev Hospital in Amritsar, the hospital said on Saturday The post Amritsar hospital reports two coronavirus infections based on preliminary tests; samples sent to…", "url": "https://www.firstpost.com/sports/amritsar-hospital-reports-two-coronavirus-infections-based-on-preliminary-tests-samples-sent-to-niv-pune-for-confirmation-8128831.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/coronavirus_940_PTI.jpg", "publishedAt": "2020-03-07T12:23:13Z", "content": "Amritsar: Two persons from Hoshiarpur tested positive for COVID-19, the novel coronavirus at the Guru Nanak Dev Hospital here in Amritsar on Saturday.\r\nMedical Superintendent of Guru Nanak Dev Hospital, Raman Sharma said: \"Both these patients came to the airp… [+1282 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "The Associated Press", "title": "Americans quarantined in Bethlehem hotel over coronavirus scare", "description": "Fifteen Americans have been quarantined in a hotel in Bethlehem as part of precautions against the coronavirus, a Palestinian government spokesperson said on Saturday.", "url": "https://www.cbc.ca/news/world/covid-19-coronavirus-march-7-1.5489784", "urlToImage": "https://i.cbc.ca/1.5489795.1583583946!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1205266116.jpg", "publishedAt": "2020-03-07T12:50:26Z", "content": "The latest:\r\nFifteen Americans have been quarantined in a hotel in Bethlehem as part of precautions against the coronavirus, a Palestinian government spokesperson said on Saturday.\r\nThe city in the West Bank has been in lockdown since nine cases of the virus … [+6533 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Holly Secon)", "title": "Photos show how people around the world are disinfecting schools, mosques, and streets to stop the coronavirus from spreading", "description": "Misting tunnels, spray guns, and robots are sanitizing public places. But experts are still debating the effectiveness.", "url": "https://news.yahoo.com/photos-show-people-around-world-130200909.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.YMoxDoyf7FaHlD7Mf12Vw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/fNRtdCK8RH8Fs0vuxmw_eQ--~B/aD0xNDg3O3c9MTk4MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/69852ee8ed3192efd02b8ddab456cead", "publishedAt": "2020-03-07T13:02:00Z", "content": "A worker disinfects playground equipment at a kindergarten in Ganzhou, China. The students' return was delayed due to the novel coronavirus outbreak, on March 2, 2020.\r\nChina Daily via Reuters\r\n<ul><li>The coronavirus that originated in Wuhan, China, has spre… [+12759 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "Should you skip the gym or a workout class because of the coronavirus outbreak?", "description": "As schools and businesses close to prevent the spread of the coronavirus, here's what experts have to say about working out at the gym amid the outbreak.", "url": "https://www.cnbc.com/2020/03/06/is-it-safe-to-go-to-the-gym-safe-during-coronavirus-outbreak.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106424843-1583352987154yoga-event_t20_znbaeb.jpg?v=1583353045", "publishedAt": "2020-03-07T13:01:01Z", "content": "With close contact, crowded spaces, heavy breathing and frequently-touched equipment, the gym might seem like a minefield for coronavirus infection.\r\nCoronavirus, aka \"COVID-19,\" is believed to spread through inhaling respiratory droplets that are released wh… [+4527 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Michael Bloom", "title": "Analysts upgraded these stocks, saying they're safe from the coronavirus outbreak", "description": "Wall Street analysts see a buying opportunity for these stocks that are safe from the coronavirus outbreak, including Verizon, Oracle, Masimo, and others.", "url": "https://www.cnbc.com/2020/03/07/verizon-oracle-among-stocks-safe-from-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/104196381-GettyImages-615333038.jpg?v=1580388960", "publishedAt": "2020-03-07T12:12:54Z", "content": "(This story is for CNBC PRO subscribers only.)\r\nIt was another week of turbulence for the market, but Wall Street analysts analysts have upgraded a slew of stocks that may provide investors safety amid the COVID-19 fears.\r\nCNBC PRO examined the most recent Wa… [+169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "Wall Street had its wildest week in years", "description": "Wall Street had another volatile week as investors struggled with how to react to the global coronavirus outbreak.", "url": "https://www.cnn.com/2020/03/07/investing/wild-week-wall-street/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306125211-01-nyse-0303-super-tease.jpg", "publishedAt": "2020-03-07T13:11:10Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Coronavirus threat: To the economy, and the presidency", "description": "President Trump spoke to reporters Friday while at the Centers for Disease Control in Atlanta and provided a public health update, as well made remarks around politics and public optics. Vice President Mike Pence said that 21 people aboard a cruise ship that'…", "url": "https://www.msnbc.com/msnbc/watch/coronavirus-threat-to-the-economy-and-the-presidency-80218181870", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/day_that_trump_covid.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-07T12:41:54Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Samuel Osborne, Samuel Osborne", "title": "Coronavirus: Supermarkets say Matt Hancock's promise on food supplies is 'totally made up'", "description": "'I'm not sure the government can guarantee all food supply in all instances,' executive says", "url": "https://www.independent.co.uk/news/uk/politics/coronavirus-uk-supermarkets-supply-food-delivery-matt-hancock-a9384366.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/07/11/Matt-Hancock.jpg", "publishedAt": "2020-03-07T12:16:15Z", "content": "Supermarkets have said Matt Hancocks claim they will deliver food to those who are self isolating over coronavirus fears was totally made up.\r\nThe health secretary said during a Question Time appearance on Thursday that the government was in talks with retail… [+3457 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Elizabeth Koh, Jon Kamp, Melanie Evans", "title": "Nursing Home at Center of Washington Coronavirus Outbreak Target of Criticism - The Wall Street Journal", "description": "Nursing Home at Center of Washington Coronavirus Outbreak Target of Criticism The Wall Street Journal 'Germ-fest' party preceded deadly nursing home outbreak msnNOW ‘You just don’t know who’s going to die next:’ Patient inside Kirkland care facility speaks ou…", "url": "https://www.wsj.com/articles/nursing-home-at-center-of-washington-coronavirus-outbreak-target-of-criticism-11583541247", "urlToImage": "https://images.wsj.net/im-161882/social", "publishedAt": "2020-03-07T12:15:41Z", "content": "KIRKLAND, Wash.Washington state officials are considering taking over a nursing home tied to 10 deaths in the Covid-19 outbreak after the facilitys owners drew criticism from local officials and families for spotty and at times chaotic dissemination of inform… [+194 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Lawrence Fuller", "title": "Preparing For A Bear Market And Recession In 2020", "description": "This is a weekly series focused on analyzing the previous week’s economic data releases.The objective is to concentrate on leading indicators of economic activity to determine whether the economy is strengthening or weakening, and the rate of inflation is inc…", "url": "https://seekingalpha.com/article/4330438-preparing-for-bear-market-and-recession-in-2020", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/3/7375661_15835493799264_rId7.png", "publishedAt": "2020-03-07T12:26:43Z", "content": "Construction Spending\r\nConstruction spending rose an impressive 1.8% in January, and December's decline of 0.2% was revised to a gain of 0.2%. Non-residential spending finally joined the party after five monthly declines, rising 1.6%, while residential spendi… [+8125 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: Deaths mount in Italy and Iran", "description": "The WHO has described the growing number of places outside China reporting their first COVID-19 cases as \"deeply concerning.\" Public health bodies are struggling to contain the epidemic. Follow DW for the latest updates.", "url": "https://www.dw.com/en/coronavirus-updates-deaths-mount-in-italy-and-iran/a-52673911", "urlToImage": "https://www.dw.com/image/52665167_304.jpg", "publishedAt": "2020-03-07T12:41:00Z", "content": "<ul><li>China reports decrease in new cases.</li><li>WHO describes outbreak as \"deeply concerning.\"</li><li>Global death toll rises above 3,400.</li><li>Number of confirmed cases in Germany climbs to 684.</li></ul>Read more: What you need to know about the co… [+5147 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Mitchell Blatt", "title": "Six Chinese Cities End Daily Coronavirus Updates", "description": "Mitchell Blatt Health, They will only make further updates if any new cases develop, but they claim there have not been any new cases for days or weeks. Six cities in China that consider the coronavirus situation to have been locally resolved have announced t…", "url": "https://nationalinterest.org/blog/buzz/six-chinese-cities-end-daily-coronavirus-updates-130827", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/2020-03-05T163541Z_778825884_RC2ODF94UKH1_RTRMADP_3_HEALTH-CORONAVIRUS-CHINA.jpg", "publishedAt": "2020-03-07T12:23:00Z", "content": "Six cities in China that consider the coronavirus situation to have been locally resolved have announced they will no longer publish new daily announcements.\r\nThe six cities are located in Henan province, which borders Hubei to the north, and Anhui province, … [+2829 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Neetu Chandra Sharma", "title": "PM Modi reviews situation of COVID-19 in the country - Livemint", "description": "PM Modi reviews situation of COVID-19 in the country Livemint Coronavirus: 3 more test positive; PM directs officials to make provisions for critical care Times of India \"I See God In You\": Dehradun Woman's Story Turns PM Modi Emotional NDTV News Prime Minist…", "url": "https://www.livemint.com/news/india/pm-modi-reviews-situation-of-covid-19-in-the-country-11583584646817.html", "urlToImage": "https://images.livemint.com/img/2020/03/07/600x338/20200307040L_1583584886620_1583584902668.jpg", "publishedAt": "2020-03-07T12:50:36Z", "content": "New Delhi: As Prime Minister Narendra Modi on Saturday reviewed the situation on coronavirus (COVID 19) and action taken so far by various Ministries, Niti Aayog, governments policy think tank emphasized the need for increasing surge capacity for hospitalizat… [+3878 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Malta Reports First Case of Coronavirus in 12-Year-Old Italian Girl – Health Minister", "description": "MOSCOW (Sputnik) - The first coronavirus infection in Malta has been detected in an Italian teenager who lives in the country, Health Minister Chris Fearne said Saturday.", "url": "https://sputniknews.com/europe/202003071078503049-malta-reports-first-case-of-coronavirus-in-12-year-old-italian-girl/", "urlToImage": "https://cdn1.img.sputniknews.com/images/106299/31/1062993192.jpg", "publishedAt": "2020-03-07T12:12:58Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Put coronavirus awareness messages in place of ringing tones: DoT to telcos", "description": "The Department of Telecom (DoT) in an email to telecom operators on March 6 asked to incorporate audio clip in the ring back tone till further orders.", "url": "https://www.moneycontrol.com/news/trends/health-trends/put-coronavirus-awareness-messages-in-place-of-ringing-tones-dot-to-telcos-5013481.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/03/Telecom-770x433.jpg", "publishedAt": "2020-03-07T12:15:06Z", "content": "Dial any number and chances are high that you might get to hear awareness messages on coronavirus, instead of ringing tones. The move follows an order in this regard from the government which has shared the audio clip of the message with telecom operators.\r\nT… [+2334 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Trump Interrupts Briefing to Ask About His Ratings", "description": "\"President Trump interrupted a Friday press conference on the 2019 novel coronavirus to ask a Fox News reporter whether his town hall show on Fox on Thursday night had good ratings,\" the Daily Beast reports.\"In a rambling briefing that bordered on bizarre, Tr…", "url": "https://politicalwire.com/2020/03/07/trump-interrupts-briefing-to-ask-about-his-ratings/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-07T12:55:21Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "2chblog.jp"}, "author": "ko_jo", "title": "イギリスのイケメン中国人、「コロナウイルス出ていけ」と顔の形が変わるまでブン殴られる", "description": "1：ペラミビル(茸) [US]：2020/03/07(土) 01:14:34 BE:271912485-2BP Before After RACIST ATTACK Boy, 15, arrested after Asian student battered in London by thugs shouting ‘I don’t want your coronavirus in my country’ https://www.th...", "url": "http://news.2chblog.jp/archives/51973191.html", "urlToImage": null, "publishedAt": "2020-03-07T12:48:53Z", "content": null}, {"source": {"id": null, "name": "Soranews24.com"}, "author": "Scott Wilson", "title": "Japanese Internet reacts to ammunition panic-buying in America due to coronavirus fears", "description": "Confusion about what Americans plan to do with it all. Shops in Japan have been sold out of masks, toilet paper, and hand sanitizer for over a week now due to people mass-buying out of coronavirus fears. Even though the rumors about a paper shortage that caus…", "url": "https://soranews24.com/2020/03/07/japanese-internet-reacts-to-ammunition-panic-buying-in-america-due-to-coronavirus-fears/", "urlToImage": "https://sociorocketnewsen.files.wordpress.com/2020/03/yuseiimgl2399_tp_v.jpg?w=1200&h=630&crop=1", "publishedAt": "2020-03-07T13:00:42Z", "content": "Confusion about what Americans plan to do with it all.\r\nShops in Japan have been sold out of masks, toilet paper, and hand sanitizer for over a week now due to people mass-buying out of coronavirus fears.\r\nEven though the rumors about a paper shortage that ca… [+2584 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US Tourists Quarantined in West Bank Hotel as PNA Imposes Emergency Measures Over Covid-19 - Report", "description": "On Thursday, President Mahmoud Abbas announced the introduction of emergency measures across the Palestinian territories to prevent the spread of the novel coronavirus, which has already infected more than a dozen people in the West Bank.", "url": "https://sputniknews.com/middleeast/202003071078503069-us-tourists-quarantined-in-west-bank-hotel-as-pna-imposes-emergency-measures-over-covid-19---report/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107850/30/1078503007.jpg", "publishedAt": "2020-03-07T12:15:01Z", "content": null}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "Coronavirus update: Tests now performed in Alabama; 21 cases on cruise ship; 1 case in Kentucky - AL.com", "description": "Coronavirus update: Tests now performed in Alabama; 21 cases on cruise ship; 1 case in Kentucky AL.com 21 people on Grand Princess cruise ship off California test positive for coronavirus, Pence says Fox News Essential California: What to know about the Grand…", "url": "https://www.al.com/news/2020/03/coronavirus-update-tests-now-performed-in-alabama-21-cases-on-cruise-ship-1-case-in-kentucky.html", "urlToImage": "https://www.al.com/resizer/AE8nXYqLQ1vsjEP0WCWcjontKjc=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/P2OTHNNQENF55CYN2YNDJUUH4U.jpg", "publishedAt": "2020-03-07T13:01:02Z", "content": "The Alabama Department of Public Health can now test for coronavirus at the state laboratory.\r\nThe ADPH Bureau of Clinical Laboratories began testing for COVID-19, the illness caused by coronavirus, on March 5. Physicians have also been provided guidance for … [+3249 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Equity Management Academy", "title": "Gold: The Real Virus Is The Fed", "description": "We had a volatile week last week, but it provided a huge opportunity for traders to take advantage of this collapse.Today, the market has met the targets for the daily signals. The market tested the $1,664 area, with $1,627 the low.Looking ahead, if the marke…", "url": "https://seekingalpha.com/article/4330437-gold-real-virus-is-fed", "urlToImage": "https://static.seekingalpha.com/uploads/2020/3/6/48753845-15835171426849792_origin.png", "publishedAt": "2020-03-07T12:15:14Z", "content": "It may appear that the coronavirus caused the markets to collapse. A deeper analysis shows that the virus merely triggered a decline that has been building since 2008 as the central banks have increased debt to record levels around the world. However, whateve… [+6108 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "AFP, AFP, Entertainment Desk, AFP, AFP, Tech Desk, PCB, Entertainment Desk, AFP, AFP", "title": "Iran reports 21 new coronavirus deaths, raising tally to 145", "description": "With 1,076 fresh cases in the past 24 hours, confirmed COVID-19 infections rise to 5,823 in Iran The post Iran reports 21 new coronavirus deaths, raising tally to 145 appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2171373/3-iran-reports-21-new-coronavirus-deaths-raising-tally-145/", "urlToImage": "https://c.tribune.com.pk/2020/03/2171373-irancoronaviursafpx-1583584833-272-640x480.jpg", "publishedAt": "2020-03-07T12:41:50Z", "content": "A nurse cares for patients in a ward dedicated for people infected with the coronavirus in Iran. PHOTO: AFP \r\nTEHRAN: Iran on Saturday reported 21 new deaths from the novel coronavirus and 1,076 fresh cases in the past 24 hours, bringing the overall tolls to … [+1463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Thousands of meals meant for an Ohio sports festival will instead be sent to Nashville to feed first responders", "description": "Amid coronavirus fears, the annual Arnold Sports Festival was prohibited from allowing general spectators. The change left the festival with a bunch of food, and no one to eat it.", "url": "https://www.cnn.com/2020/03/07/us/arnold-sports-festival-donation-nashville-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160331175321-bottled-water-super-tease.jpg", "publishedAt": "2020-03-07T13:02:39Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Chicago Tribune", "title": "Bernie Sanders responds to Nazi flag being waved at his rally", "description": "Bernie Sanders expressed his dismay Friday after an agitator waved a Nazi banner at one of his campaign rallies, calling the incident “beyond disgusting.”The 78-year-old Vermont senator, who is Jewish, said he was stunned by the stunt at the campaign stop in …", "url": "https://www.rawstory.com/2020/03/bernie-sanders-responds-to-nazi-flag-being-waved-at-his-rally/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/shutterstock_388723837-1000x600.jpg", "publishedAt": "2020-03-07T12:32:07Z", "content": "HBO \"Real Time\" host Bill Maher went off on President Donald Trump's response to the coronavirus epidemic.\r\nMaher had a live studio audience despite California being under a state of emergency due to the outbreak.\r\nThe host noted that Disneyland was still ope… [+317 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Chicago Tribune", "title": "Jill Biden rallies fellow teachers in Chicago as candidates jockey for union backing", "description": "CHICAGO — Standing before rows of Illinois educators wearing “red for ed,” Jill Biden, a community college instructor and former public schoolteacher, offered assurances that her husband has what it takes to beat President Donald Trump and transform the count…", "url": "https://www.rawstory.com/2020/03/jill-biden-rallies-fellow-teachers-in-chicago-as-candidates-jockey-for-union-backing/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/1598640-origin_1.jpg", "publishedAt": "2020-03-07T12:29:39Z", "content": "HBO \"Real Time\" host Bill Maher went off on President Donald Trump's response to the coronavirus epidemic.\r\nMaher had a live studio audience despite California being under a state of emergency due to the outbreak.\r\nThe host noted that Disneyland was still ope… [+317 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Drinking alcohol will not protect you from COVID-19: WHO - Telangana Today", "description": "New Delhi: With 31 individuals diagnosed with the deadly novel coronavirus (COVID-19) in India, everyone seems to be going into a state of panic. And as a fallout, people are believing just about anything and everything they are coming across on the internet.…", "url": "https://telanganatoday.com/drinking-alcohol-will-not-protect-you-from-covid-19-who", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/03/Alcoholic-Drink-401x267.jpg", "publishedAt": "2020-03-07T12:48:00Z", "content": "New Delhi: With 31 individuals diagnosed with the deadly novel coronavirus (COVID-19) in India, everyone seems to be going into a state of panic.\r\nAnd as a fallout, people are believing just about anything and everything they are coming across on the internet… [+1308 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "New York Daily News", "title": "Biden and Sanders expected to be alone in qualifying for next debate", "description": "Bernie Sanders and Joe Biden are likely to go head-to-head for the first time this month.Democratic presidential candidates must have picked up at least 20% of the convention delegates disbursed so far to qualify for this month’s debate, the party announced F…", "url": "https://www.rawstory.com/2020/03/biden-and-sanders-expected-to-be-alone-in-qualifying-for-next-debate/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/1598644-origin_1.jpg", "publishedAt": "2020-03-07T12:30:41Z", "content": "HBO \"Real Time\" host Bill Maher went off on President Donald Trump's response to the coronavirus epidemic.\r\nMaher had a live studio audience despite California being under a state of emergency due to the outbreak.\r\nThe host noted that Disneyland was still ope… [+317 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Reuters", "title": "Leader of Italy's co-ruling democratic party tests positive for coronavirus", "description": "The leader of Italy's co-ruling Democratic Party Nicola Zingaretti said Saturday he had tested positive for coronavirus.", "url": "https://www.cnbc.com/2020/03/07/leader-of-italys-co-ruling-democratic-party-tests-positive-for-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106430430-1583583787248gettyimages-1200547552.jpg?v=1583583907", "publishedAt": "2020-03-07T12:20:00Z", "content": "The leader of Italy's co-ruling Democratic Party Nicola Zingaretti said on Saturday he had tested positive for coronavirus. \r\n \"I have coronavirus too\", Zingaretti said in a video posted on Facebook, adding he was in self-isolation at home and that all the pe… [+438 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Hoya Capital Real Estate", "title": "REITs Surge On Another Wild Week", "description": "The coronavirus-related volatility continued on a wild week for U.S. equity markets. Stocks ended in the green following historic intra-day fluctuations and an emergency rate cut by the Federal Reserve.After sliding 11.3% last week, the S&P 500 finished the w…", "url": "https://seekingalpha.com/article/4330417-reits-surge-on-another-wild-week", "urlToImage": "https://static1.seekingalpha.com/uploads/2019/11/1723581_15738608449996_rId4.jpg", "publishedAt": "2020-03-07T13:00:00Z", "content": "Real Estate Weekly Outlook\r\nFear, incorporated. The coronavirus-related volatility continued on a wild week for U.S. equity markets following the worst week for stocks since the financial crisis. Stocks ended the week with gains following a series of historic… [+14533 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AccuWeather", "title": "Previous coronavirus daily briefing updates, March 5", "description": "China CDC released a report online on Feb. 17 that overall found 2.3% of confirmed cases died. However, the fatality rate was 14.8% in people 80 or older, likely reflecting the presence of other diseases, a weaker immune system, or simply worse overall health…", "url": "https://news.yahoo.com/previous-coronavirus-daily-briefing-updates-122023543.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/z9CpB2Sz49EBO05tDZp0FA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuNzM4NDYxNTM4NDYxNg--/https://s.yimg.com/uu/api/res/1.2/FBIAxflh.pftiPfzG_6FFA--~B/aD0zNjY7dz02NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/accuweather_297/e881e95457cf727963c43f076274ea73", "publishedAt": "2020-03-07T12:20:23Z", "content": "China CDC released a report online on Feb. 17 that overall found 2.3% of confirmed cases died. However, the fatality rate was 14.8% in people 80 or older, likely reflecting the presence of other diseases, a weaker immune system, or simply worse overall health… [+10542 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Egypt says cruise ship quarantined over new virus cluster", "description": "Health authorities in Egypt released a statement saying they#39;d found a dozen Egyptian crew members on the ship had contracted the fast-spreading virus, but did not show symptoms.", "url": "https://www.moneycontrol.com/news/trends/health-trends/egypt-says-cruise-ship-quarantined-over-new-virus-cluster-5013471.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/10/Cruise-770x433.jpg", "publishedAt": "2020-03-07T12:38:06Z", "content": "A cruise ship on Egypt's Nile River with over 150 tourists, including Indians, and local crew was in quarantine March 7 in the southern city of Luxor, after 12 people tested positive for the new coronavirus. A Taiwanese-American tourist who had previously bee… [+2465 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Fiona Sun, Fiona Sun", "title": "Coronavirus: Hongkongers caring for special needs individuals at ‘breaking point’ as necessary services are scaled back", "description": "More than nine in 10 Hongkongers caring for family members with special needs, including the disabled, the elderly and children with special educational needs, have felt increasingly helpless amid the coronavirus epidemic, a new survey calling for government …", "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3074084/coronavirus-hongkongers-caring-special-needs", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/07/c59951c0-604c-11ea-be3e-43af5536d789_image_hires_205745.JPG?itok=ui63ZRy6&v=1583585874", "publishedAt": "2020-03-07T13:00:14Z", "content": "Published: 9:00pm, 7 Mar, 2020\r\nUpdated: 9:00pm, 7 Mar, 2020"}, {"source": {"id": null, "name": "Residentadvisor.net"}, "author": "Matt McDermott", "title": "Ciel, Helix & Mr. Ho feature on 19-track compilation to benefit medical workers on the frontline of the coronavirus outbreak", "description": "All proceeds from Home Fitness​/​家庭保健 will go towards the purchase of protective clothing and other essential goods for frontline medical staff in Wuhan.", "url": "https://www.residentadvisor.net/news/72192", "urlToImage": "https://www.residentadvisor.net/images/news/2020/wuhan-covid.jpg", "publishedAt": "2020-03-07T12:47:00Z", "content": "All proceeds from Home Fitness/ will go towards the purchase of protective clothing and other essential goods for frontline medical staff in Wuhan.\r\nA new compilation, Home Fitness/, will benefit medical workers in the hardest-hit areas of Wuhan, China. After… [+1243 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Swiss government to virus-hit companies: don't expect helicopter money", "description": "The Swiss government is working on directing support to companies hit by falling demand caused by the coronavirus outbreak and will not adopt a broad stimulus programme, a top official said on Saturday. \"For us it is important that we don't have some kind of …", "url": "https://finance.yahoo.com/news/swiss-government-virus-hit-companies-122932620.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QT1gNXCN94zyldwWgSNKBw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODA-/https://s.yimg.com/uu/api/res/1.2/3qICqaSVOfgWgoSNkwgUqQ--~B/aD01NTA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/84a9f1e04c4af725217857c49bafe244", "publishedAt": "2020-03-07T12:29:32Z", "content": "ZURICH (Reuters) - The Swiss government is working on directing support to companies hit by falling demand caused by the coronavirus outbreak and will not adopt a broad stimulus programme, a top official said on Saturday.\r\n\"For us it is important that we don'… [+1264 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Karl Maier", "title": "Head of Italy’s Democratic Party Tests Positive for Coronavirus", "description": "(Bloomberg) -- The head of Italy’s Democratic Party said he’s tested positive for the coronavirus, as his government prepares new measures including extendin...", "url": "https://news.yahoo.com/head-italy-democratic-party-tests-123316870.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-07T12:33:16Z", "content": "(Bloomberg) -- The head of Italys Democratic Party said hes tested positive for the coronavirus, as his government prepares new measures including extending quarantine areas to deal with the outbreak, the biggest in Europe.\r\nI am fine and will remain at home … [+2733 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Leader of Italy's Co-Ruling Democratic Party Zingaretti Tests Positive for Coronavirus", "description": "The death toll from the coronavirus (COVID-19) in Italy jumped from 49 to 157 on 5 March, with the total number of those infected exceeding 4,600, Angelo Borrelli, the head of the national Civil Protection Agency, said earlier this week.", "url": "https://sputniknews.com/europe/202003071078503187-leader-of-italys-co-ruling-democratic-party-tests-positive-for-coronavirus/", "urlToImage": "https://cdn5.img.sputniknews.com/images/107850/31/1078503161.jpg", "publishedAt": "2020-03-07T12:43:03Z", "content": null}, {"source": {"id": null, "name": "Guelphtoday.com"}, "author": "Troy Bridgeman", "title": "Local eatery blames overreaction to Covid-19 for sudden drop in business - GuelphToday", "description": "In this Following Up feature we return to Chao Bistro and hear from owner Billy Nguyen about how a previously busy and popular restaurant has lost 90 per cent of its business in the past few weeks", "url": "https://www.guelphtoday.com/following-up/local-eatery-blames-overreaction-to-covid19-for-sudden-drop-in-business-2143490", "urlToImage": "https://www.vmcdn.ca/f/files/guelphtoday/2020-03-06-gt-–-following-up-chao-bistro-vs-corona-virus-–-tb-01.jpeg;w=1200;h=800;mode=crop", "publishedAt": "2020-03-07T13:00:00Z", "content": "The open sign outside the front doors of Chao Bistro on Elmira Road was still flashing Friday but inside the tables were empty and if public panic over the coronavirus doesn't subside the light in that open sign may soon go out, says its owner. \r\n“We have los… [+1772 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Robert Farley", "title": "Think Coronavirus Is Bad? The Spanish Flu Pandemic of 1918 Killed 50 Million People", "description": "Robert Farley Health, Americas Including 675,000 Americans. Coronavirus isn’t the first pandemic to strike the United States. In 1918, just as the United States geared up for the Western Front, a new and virulent disease began to strike US Army training camps…", "url": "https://nationalinterest.org/blog/buzz/think-coronavirus-bad-spanish-flu-pandemic-1918-killed-50-million-people-130667", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/dsdf.jpg", "publishedAt": "2020-03-07T12:47:00Z", "content": "Coronavirus isnt the first pandemic to strike the United States. In 1918, just as the United States geared up for the Western Front, a new and virulent disease began to strike US Army training camps. The virus, which eventually took the name Spanish Flu in th… [+6210 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Bird Flu Outbreak Reported in 2 Poultry Farms in Kerala; Culling of Ducks, Hens Ordered - News18", "description": "Bird Flu Outbreak Reported in 2 Poultry Farms in Kerala; Culling of Ducks, Hens Ordered News18 Bird flu confirmed in Kozhikode, officials demand high alert in state The New Indian Express Month after first coronavirus case, Kerala detects bird flu in 2 villag…", "url": "https://www.news18.com/news/india/bird-flu-outbreak-reported-in-2-poultry-farms-in-kerala-culling-of-ducks-hens-ordered-2529777.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2017/03/bird-flue.jpg", "publishedAt": "2020-03-07T12:26:20Z", "content": "Kozhikode: An outbreak of bird flu has been reported from two poultry farms in Kerala's Kozhikode district, prompting authorities to order culling of ducks and hens within one km radius of the affected areas.\r\nDistrict Collector Sreeram Sambasiva Rao, chaired… [+1912 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Suzanne O'Halloran", "title": "Record-low mortgage rates could turn a 30-year loan into a 20-year", "description": "Record-low mortgage rates means easy money, faster loan payoffs.", "url": "https://finance.yahoo.com/news/record-low-mortgage-rates-could-130042041.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-07T13:00:42Z", "content": "History was made this week in the mortgage market, giving homeowners and prospective homebuyers the chance of a lifetime.\r\nU.S. mortgage rates slid to record lows, as the yield on the 10-year note fell below 1 percent for the first time ever after the Federal… [+1800 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Jessica Bartlett", "title": "Mass. insurers commit to zero-cost coronavirus tests, treatment", "description": "Insurance regulators have issued guidance calling for coronavirus tests and treatment be made available to the public at no cost to consumers. Insurers support the mandate, though volatile financials will follow.", "url": "https://www.bizjournals.com/boston/news/2020/03/07/mass-insurers-commit-to-zero-cost-coronavirus.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_boston+%28Boston+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-03-07T12:46:30Z", "content": null}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Robinson Meyer, The Atlantic", "title": "The Strongest Evidence Yet That America Is Botching Coronavirus Testing", "description": "“I don’t know what went wrong,” a former CDC chief told The Atlantic.", "url": "https://www.theatlantic.com/health/archive/2020/03/how-many-americans-have-been-tested-coronavirus/607597/?utm_source=digg", "urlToImage": "https://cdn.defenseone.com/media/img/upload/2020/03/06/D1-image-to-post_2sPEtPl/open-graph.jpg", "publishedAt": "2020-03-07T13:00:00Z", "content": "I dont know what went wrong, a former CDC chief told The Atlantic.\r\n Its one of the most urgent questions in the United States right now: How many people have actually been tested for the coronavirus?\r\nThis number would give a sense of how widespread the dise… [+14259 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "8 more COVID-19 cases discharged, 8 new cases confirmed: MOH", "description": "SINGAPORE: Eight more patients have recovered from the coronavirus, said the Ministry of Health (MOH) on Saturday (Mar 7), bringing the total number of discharged cases to 90. Eight new cases were also confirmed, four of whom are linked to the cluster involvi…", "url": "https://www.channelnewsasia.com/news/singapore/covid19-coronavirus-mar-7-cases-12512420", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12441736/16x9/991/557/679634c4cd4144eec816f2f2c8ea0141/Uf/tourists-walking-along-the-cavenagh-bridge.jpg", "publishedAt": "2020-03-07T12:37:06Z", "content": "SINGAPORE: Eight new cases of COVID-19 were confirmed in Singapore on Saturday (Mar 7), bringing the total number of cases to 138. \r\nEight more patients have also recovered from the coronavirus, said the Ministry of Health in a daily update, bringing the numb… [+6557 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "Stocks are fresh off their most chaotic week since 2011. Here's why the market is so confused about what's next.", "description": "The stock market just posted its most volatile seven-day streak in nearly a decade, and many experts expect the wild market swings to persist. Markets closed Friday having almost wiped all month-to-date gains. Both the S&P 500 and Dow Jones industrial average…", "url": "https://www.businessinsider.com/stock-market-week-in-review-outlook-mixed-coronavirus-outbreak-volatility-2020-3", "urlToImage": "https://i.insider.com/5aba3d785c0d63572d8b4579?width=1200&format=jpeg", "publishedAt": "2020-03-07T13:08:00Z", "content": "<ul><li>The stock market just posted its most volatile seven-day streak in nearly a decade, and many experts expect the wild market swings to persist.</li><li>Markets closed Friday having almost wiped all month-to-date gains. Both the S&amp;P 500 and Dow Jone… [+6816 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By REUTERS", "title": "Leader of Italy's Democratic Party tests positive for coronavirus", "description": "\"I have coronavirus too,\" Democratic Party leader Nicola Zingaretti said in a video posted on Facebook. ;", "url": "https://www.jpost.com/International/Leader-of-Italys-co-ruling-democratic-party-tests-positive-to-coronavirus-620096", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/454878", "publishedAt": "2020-03-07T12:26:29Z", "content": null}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Live and Let's Fly", "title": "Lufthansa May Ground A380 Fleet, Slash Capacity By 50%", "description": "Citing unprecedented cancellations and anemic new bookings, Lufthansa is considering grounding its entire A380 fleet as it explores a massive cutback in flights. Coronavirus concerns have prompted thousands of passengers to cancel or postpone travel. The prob…", "url": "https://liveandletsfly.boardingarea.com/2020/03/07/lufthansa-grounds-a380/", "urlToImage": "https://liveandletsfly.boardingarea.com/wp-content/uploads/2020/03/Lufthansa-Grounds-A380.jpg", "publishedAt": "2020-03-07T12:39:02Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Speights)", "title": "Better Marijuana Stock: KushCo Holdings vs. Green Thumb Industries", "description": "These two U.S.-based pot stocks have taken a shellacking in recent months. That presents an opportunity for long-term investors.", "url": "https://www.fool.com/investing/2020/03/07/better-marijuana-stock-kushco-holdings-vs-green-th.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561547/marijuana-growing-in-a-greenhouse.jpg", "publishedAt": "2020-03-07T12:32:00Z", "content": "Murphy's Law might need a cannabis corollary. What can go wrong for marijuana stocks will go wrong for marijuana stocks. \r\nThis corollary seems to be applicable to both KushCo Holdings(OTC:KSHB) and Green Thumb Industries(OTC:GTBIF). KushCo's shares have plun… [+4231 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Nick Jonas wipes hands on Priyanka Chopra’s kurta while playing Holi, actor says ‘who needs towels?’ - Hindustan Times", "description": "Nick Jonas wipes hands on Priyanka Chopra’s kurta while playing Holi, actor says ‘who needs towels?’ Hindustan Times These pictures of Nick Jonas and Priyanka Chopra from Ambani's Holi bash are taking over the internet by Times of India Inside Pics From Isha …", "url": "https://www.hindustantimes.com/bollywood/nick-jonas-wipes-hands-on-priyanka-chopra-s-kurta-while-playing-holi-actor-says-who-needs-towels/story-mKFg98EYr0cpNcjXHsj5lJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/07/Pictures/_0252ac24-6066-11ea-ab89-cb4d4e6220f6.jpg", "publishedAt": "2020-03-07T12:19:00Z", "content": "Actor Priyanka Chopra and her singer husband had a loads of fun at the Holi celebration at businesswoman Isha Ambani’s residence on Friday. In one video, Nick is even seen wiping his hands on Priyanka’s outfit!\r\nPriyanka took to her Instagram stories to share… [+1626 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Maxx Chatsko)", "title": "Essential Utilities Takes Environmental Lead in Water, Nears Natural Gas Integration", "description": "Shares of the electric and gas utility were pounded in the broader market correction, but the long-term potential remains intact.", "url": "https://www.fool.com/investing/2020/03/07/essential-utilities-takes-environmental-lead-in-wa.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561035/078-birds-eye-wastewater-treatment.jpg", "publishedAt": "2020-03-07T12:34:00Z", "content": "The S&amp;P 500 declined by double digits in the last week of February as investors grappled with the reality of the coronavirus outbreak. Even if the illness doesn't become the worst-case scenario originally feared (and encouragingly, it appears to be much l… [+5923 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Coronavirus: PM Modi holds review meeting, asks officials to ensure sufficient quarantine, critical care facilities", "description": "Prime Minister Narendra Modi reviewed the coronavirus situation in the country at a meeting with officials on Saturday and directed them to identify locations for sufficient quarantine facilities and make provisions for critical care in case the disease sprea…", "url": "https://timesofindia.indiatimes.com/india/coronavirus-pm-modi-holds-review-meeting-asks-officials-to-ensure-sufficient-quarantine-critical-care-facilities/articleshow/74528105.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74528219,width-1070,height-580,imgsize-166738,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-07T12:36:30Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Around 4,000 New Yorkers are being told to self-quarantine. An 84-year old woman who had contact with a coronavirus patient describes what it's like.", "description": "An 84-year-old woman who attends synagogue with a man diagnosed with the coronavirus has been isolated, but says she's not worried about getting sick.", "url": "https://news.yahoo.com/around-4-000-yorkers-being-124100051.html", "urlToImage": null, "publishedAt": "2020-03-07T12:41:00Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Soo Kim", "title": "Coronavirus Update: Map Shows More Than 100,000 Cases Confirmed Globally, Infections Spread to Nearly 100 Countries", "description": "The outbreak continues with the U.S. military in Italy, the Federal Bureau of Investigation, and more countries outside China reporting new cases.", "url": "https://www.newsweek.com/coronavirus-update-map-death-toll-new-cases-washington-florida-iran-italy-egypt-cruise-1491049", "urlToImage": "https://d.newsweek.com/en/full/1572104/2015-south-southwest-festival-austin-texas.jpg", "publishedAt": "2020-03-07T13:02:50Z", "content": "The COVID-19 virus outbreak continues across the globe, with South Korea, Italy, Iran, Germany, and France still among the worst-hit countries outside China, where the virus was first detected.\r\nThe U.S. saw three more deaths, including in Washington state an… [+12449 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Robert Farley", "title": "Coronavirus Is A Killer (But the Spanish Flu Killed Five Times More People Than World War I)", "description": "Robert Farley Health, Europe Did it impact the end of the so-called Great War? As the spring of 1918 opened, the end of the largest war that humanity had yet undertaken appeared to be in sight. The collapse of the Russian Empire resulted in a brutal sort of “…", "url": "https://nationalinterest.org/blog/buzz/coronavirus-killer-spanish-flu-killed-five-times-more-people-world-war-i-130757", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/wwflu.jpg", "publishedAt": "2020-03-07T12:45:00Z", "content": "As the spring of 1918 opened, the end of the largest war that humanity had yet undertaken appeared to be in sight. The collapse of the Russian Empire resulted in a brutal sort of peace in the East, allowing the transfer of German soldiers to the Western Front… [+6288 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Arizona Republic, Kaila White, Arizona Republic", "title": "Arizona man posts YouTube video that he has coronavirus: 'I'm healthy, I'm gonna be good'", "description": "\"Luckily, I'm alive. On my way home from Paris, I thought I was gonna die,\" the man said in a video. \"I'm healthy, I'm gonna be good.\"", "url": "https://www.azcentral.com/story/news/local/scottsdale-breaking/2020/03/07/man-posts-youtube-video-he-has-coronavirus-likely-arizona-case/4970372002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/07/PPHX/7b187b4e-e7f8-4b3a-bc1a-c0dad8259894-_PL_0253.JPG?crop=4895,2754,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-07T13:00:18Z", "content": "A Phoenix-area man posted a public video on YouTube on Friday afternoon saying that he has the new coronavirus.\r\nThe man, who appears to be in his 20s, posted that he contracted new coronavirus while in Paris and was diagnosed Tuesday. \r\n\"Ive been staying ver… [+6267 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Arizona Republic, Amanda Morris, Arizona Republic", "title": "How private hospitals and labs in Arizona will help test more people for the coronavirus", "description": "Mayo clinic, Sonora Quest and TGen are developing their own COVID-19 tests to expand testing availability beyond the state lab.", "url": "https://www.azcentral.com/story/news/local/arizona-health/2020/03/07/labs-and-hospitals-develop-additional-arizona-coronavirus-testing/4963985002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/06/PPHX/18caf3b1-f792-4012-a570-f503bd38c77d-20200305_124459.jpg?crop=4031,2268,x0,y373&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-07T13:00:05Z", "content": "A Mayo Clinic medical laboratory scientist prepares a sample for COVID-19 testing.\r\n (Photo: Courtesy of Mayo Clinic)\r\nHospitals and laboratories are racing to create more testing options for the new coronavirus as the number of confirmed cases continues to c… [+12630 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | City Lodge Hotel Group to educate guests on coronavirus safety", "description": "The City Lodge Hotel Group has launched its own coronavirus protocol to educate staff and guests on how to stay safe.", "url": "https://www.news24.com/SouthAfrica/News/city-lodge-hotel-group-to-educate-guests-on-coronavirus-safety-20200307", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10047/fd60f87d4c084be9ac8558a05d6bc48c.jpg", "publishedAt": "2020-03-07T12:25:33Z", "content": "The City Lodge Hotel Group has launched its own coronavirus protocol to educate staff and guests on how to stay safe.\r\nIt is all hands on deck at City Lodge after South Africa's first Covid-19 case was confirmed in KwaZulu-Natal on Thursday afternoon. A secon… [+1706 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "This week in Auto: Will scrappage scheme ever see the light of the day?", "description": "Here is a complete list of all the major developments in the auto space this week", "url": "https://www.moneycontrol.com/news/technology/auto/this-week-in-auto-will-scrappage-scheme-ever-see-the-light-of-the-day-5013331.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/03/Ashok_leyland_720-770x433.jpg", "publishedAt": "2020-03-07T12:24:37Z", "content": "In trying times, the corporate world around the globe looks up to their respective governments to step in and create some magic. Several auto companies felt helpless watching their factories sit idle as some critical parts from China were not made available i… [+5671 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Claire Lehmann", "title": "Getting ahead of the virus: Historic lessons for democratic leaders", "description": "Democratic societies may be hesitant to introduce self-distancing measures to combat the coronavirus but now is the time for decisive action.", "url": "https://www.smh.com.au/national/getting-ahead-of-the-virus-historic-lessons-for-democratic-leaders-20200305-p547an.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2688%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_41/t_crop_custom/q_86%2Cf_auto/280f6117b242c733fab0687624db8f20c94f34ef", "publishedAt": "2020-03-07T13:05:00Z", "content": "In 2018, Gates made another warning. Noting that people could travel across the globe in a matter of hours, he said a pathogen similar to SARS could kill 30 million people in six months.\r\nA new pathogen has now emerged. COVID-19 was first detected in Wuhan, C… [+8014 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "UN asks 9 countries to delay peacekeeper rotations due to coronavirus", "description": "UNITED NATIONS, United States: The United Nations on Friday (Mar 6) asked nine countries, including China, South Korea and France, to delay by three months the rotations of their UN peacekeeping forces due to the coronavirus outbreak. The request was made to …", "url": "https://www.channelnewsasia.com/news/world/covid19-united-nations-peacekeeping-rotations-delay-12512910", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12512936/16x9/991/557/94165d4420a817ec98c62a5555659d7c/ZI/united-nations-blue-helmets-france.jpg", "publishedAt": "2020-03-07T12:20:37Z", "content": "UNITED NATIONS, United States: The United Nations on Friday (Mar 6) asked nine countries, including China, South Korea and France, to delay by three months the rotations of their UN peacekeeping forces due to the coronavirus outbreak.\r\nThe request was made to… [+867 chars]"}, {"source": {"id": null, "name": "Legalinsurrection.com"}, "author": "Mike LaChance", "title": "Look for the Union Label Week in Higher Education", "description": "Your weekly report on campus news.", "url": "https://legalinsurrection.com/2020/03/look-for-the-union-label-week-in-higher-education/", "urlToImage": "https://legalinsurrection.com/wp-content/uploads/2020/02/UC-Santa-Cruz-Strike.jpg", "publishedAt": "2020-03-07T13:00:45Z", "content": "Your weekly report on campus news.Has higher education been improved by the introduction of unionization for grad student teachers? Now is a good time to ask this question.\r\nMeanwhile, the antics at Syracuse continue.\r\nThis foolishness puts people at risk.\r\nV… [+140 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "PCB chief Ehsan Mani admits Asia Cup T20 will be held at neutral venue", "description": "BCCI president Sourav Ganguly had earlier said that India can’t play in Pakistan - the designated host country - due to security concerns", "url": "https://www.thehindu.com/sport/cricket/pcb-chief-ehsan-mani-admits-asia-cup-t20-will-be-held-at-neutral-venue/article31009135.ece", "urlToImage": "https://www.thehindu.com/sport/cricket/9z3maj/article25812471.ece/ALTERNATES/LANDSCAPE_615/EHSANMANI", "publishedAt": "2020-03-07T12:11:58Z", "content": "Pakistan Cricket Board Chairman Ehsan Mani on Saturday said the Asia Cup T20 later this year will be held at a neutral venue, virtually endorsing BCCI President Sourav Gangulys statement that the tournament will be held in Dubai.\r\nA few days back, Mani had di… [+1938 chars]"}]