[{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "School officials speak out after student gets virus", "description": "CNN's Wolf Blitzer speaks to two Washington state school officials about how the district is dealing with one of their students testing positive to coronavirus.", "url": "https://www.cnn.com/videos/health/2020/03/02/coronavirus-case-washington-school-closed-cleaning-bts-tsr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302175002-everett-washington-school-coronavirus-case-officials-tsr-intv-03022020-super-tease.jpg", "publishedAt": "2020-03-02T22:56:51Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Bryan Menegus", "title": "Hey, Steve Wozniak: What the Fuck?", "description": "There’s a lot of information about coronavirus online right now, some of it useful, much of it alarming, and even more of it just confusing noise. Today, Apple co-founder Steve Wozniak contributed to that last category, tweeting that he recently returned from…", "url": "https://gizmodo.com/hey-steve-wozniak-what-the-fuck-1842035667", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ksb2hxoicg1h2ca8vzdr.jpg", "publishedAt": "2020-03-02T22:20:00Z", "content": "Theres a lot of information about coronavirus online right now, some of it useful, much of it alarming, and even more of it just confusing noise. Today, Apple co-founder Steve Wozniak contributed to that last category, tweeting that he recently returned from … [+3486 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Epic delays Fortnite tournaments until it fixes performance issues", "description": "Epic Games has announced that it won’t be hosting any tournaments with cash prizes until it fixes performance issues affecting both players and the game’s servers. That could mean we may have to wait a while to hear about the next World Cup event.", "url": "https://www.theverge.com/2020/3/2/21162003/epic-delays-fortnite-tournaments-fixes-performance-issues-world-cup", "urlToImage": "https://cdn.vox-cdn.com/thumbor/h1KiCAl23jbZXsBIsZ2HHhXEpQQ=/0x752:7360x4605/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18340835/Fortnite_WorldCup2019_PressDay_Candids_00011__1_.jpg", "publishedAt": "2020-03-02T22:34:34Z", "content": "Photo: Epic Games Epic Games announced today that it won’t be hosting any Fortnite tournaments with cash prizes until it addresses performance issues affecting both players and the game’s servers. “Our goal is to improve performance before kicking off any cas… [+2415 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pfizer identified some antiviral compounds with potential as coronavirus treatments", "description": "Drugmaker Pfizer Inc said on Monday that it identified certain antiviral compounds it had in development that have the potential to inhibit coronaviruses and is engaging with a third party to screen the compounds.", "url": "https://www.reuters.com/article/us-health-coronavirus-pfizer-idUSKBN20P3BJ", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497886909&w=1200&r=LYNXMPEG212MU", "publishedAt": "2020-03-02T23:06:44Z", "content": "NEW YORK (Reuters) - Drugmaker Pfizer Inc (PFE.N) said on Monday that it identified certain antiviral compounds it had in development that have the potential to inhibit coronaviruses and is engaging with a third party to screen the compounds. \r\nThe company sa… [+387 chars]"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Allison Jones", "title": "Ontario reports three new coronavirus cases, bringing province's total to 18 - CP24 Toronto's Breaking News", "description": "Ontario reports three new coronavirus cases, bringing province's total to 18 CP24 Toronto's Breaking News Sudbury health unit planning for possible pandemic of COVID-19 CBC.ca Global concerns rising over COVID-19, seven new cases in Canada, sixth deaths in U.…", "url": "https://www.cp24.com/news/ontario-reports-three-new-coronavirus-cases-bringing-province-s-total-to-18-1.4835004", "urlToImage": "https://www.cp24.com/polopoly_fs/1.4823588.1582498857!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-02T22:13:00Z", "content": "TORONTO -- Ontario reported three new cases of the novel coronavirus Monday, bringing the total in the province to 18, though officials say the virus is not spreading locally.\r\nA spate of new cases has been reported over the past few days, all of them people … [+3573 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Laura Osman", "title": "Travellers from Iran face increased border screening in Canada as COVID-19 cases rise - Global News", "description": "Travellers from Iran face increased border screening in Canada as COVID-19 cases rise Global News Ontario confirms 4 new COVID-19 cases CBC News Ontario reports three new coronavirus cases, bringing province's total to 18 The Globe and Mail Coronavirus outbre…", "url": "http://globalnews.ca/news/6620874/canada-border-screenings-iran/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/mxmu101-228_2020_165625.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-02T22:32:18Z", "content": "The federal government has increased border-screening measures for travellers arriving in Canada from Iran in light of the growing number of novel coronavirus cases linked to that country.\r\nSeveral of Canada’s most recent 27 confirmed cases of the new coronav… [+2724 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ann Scott Tyson", "title": "Containing coronavirus: Where democracy struggles – and thrives", "description": "Coronavirus poses different challenges for democracies than for China, where COVID-19 began, as they balance public health with individual rights.", "url": "https://news.yahoo.com/containing-coronavirus-where-democracy-struggles-224800251.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-02T22:48:00Z", "content": "As Washington state grapples with coronavirus, Americans are getting their first up-close look at life amid an outbreak  and how the country might balance public health safety with personal liberties.\r\nSix people in the state have died, the first coronavirus-… [+9579 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Madeline Merinuk", "title": "Amid coronavirus outbreak, these airlines will waive flight-change fees", "description": "Following the COVID-19 outbreak, airlines including American, Delta, JetBlue and United are taking measures to help slow the spread of the novel coronavirus.", "url": "https://news.yahoo.com/amid-coronavirus-outbreak-airlines-waive-222810408.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/t999lKxTIyOehsKJCnkjFw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02NDA-/https://s.yimg.com/uu/api/res/1.2/W2jvA5J._vJqiReaqkioZQ--~B/aD0xMjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/nbc_today_217/dfaac97ffb0d8da1e6aa8279aa6df831", "publishedAt": "2020-03-02T22:28:10Z", "content": ""}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Google Cloud cancels its biggest conference of the year over coronavirus fears (GOOG, GOOGL)", "description": "Google Cloud has canceled its biggest event of the year over coronavirus concerns. Google Cloud Next was set to be held in San Francisco in April. Google Cloud said it plans to replace the in-person conference with \"streamed keynotes, breakout sessions, inter…", "url": "https://www.businessinsider.com/google-cloud-cancels-next-conference-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5cb4b216aefeef1a8504057b?width=1200&format=jpeg", "publishedAt": "2020-03-02T22:38:27Z", "content": "Google Cloud has canceled its biggest annual conference due to coronavirus concerns.\r\nThe conference, called Google Cloud Next, was supposed to take place in San Francisco from April 6-8. Instead, Google Cloud will make its conference digital through \"streame… [+710 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rhea Mahbubani", "title": "The leader of a fringe religious sect at the center of South Korea's coronavirus outbreak has apologized as Seoul's mayor files a lawsuit accusing the group of 'murder' and 'injury'", "description": "Lee Man-hee, the founder and spiritual leader of Shincheonji Church of Jesus, held a news conference on Monday and apologized for South Korea's coronavirus outbreak, which has, in large part, been traced to the secretive sect's Daegu city branch. \"We made our…", "url": "https://www.businessinsider.com/south-korea-seoul-mayor-sues-shincheonji-coronavirus-outbreak-leader-apologizes-2020-3", "urlToImage": "https://i.insider.com/5e5d7abafee23d04da1d24c3?width=1200&format=jpeg", "publishedAt": "2020-03-02T22:17:08Z", "content": "The man at the helm of the Shincheonji Church of Jesus, widely regarded as a doomsday cult, apologized on Monday for the role played by his followers in South Korea's coronavirus crisis.\r\n\"Although it was not intentional, many people have been infected,\" Lee … [+6262 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joey Hadden", "title": "Over 20,000 people have signed a petition to cancel SXSW over coronavirus worries. Here's a list of all the major event cancellations due to the outbreak so far.", "description": "Events are being canceled and postponed around the globe to prevent the spread of the novel coronavirus, which originated in Wuhan, China, and has killed at least 3,048 people and infected more than 89,000. Nearly 20,000 people have signed a petition to cance…", "url": "https://www.businessinsider.com/major-events-cancelled-or-postponed-due-to-the-coronavirus-2020", "urlToImage": "https://i.insider.com/5e5d4d81fee23d3f6670c098?width=1200&format=jpeg", "publishedAt": "2020-03-02T22:37:00Z", "content": null}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Apple cofounder falsely speculates family sinus infection made him ‘patient zero’ for coronavirus", "description": "Apple cofounder Steve Wozniak took to Twitter this afternoon to suggest that he and his wife “may have both been patient zero” for coronavirus in the United States. As it turns out, this wasn’t the case. more… The post Apple cofounder falsely speculates famil…", "url": "https://9to5mac.com/2020/03/02/steve-wozniak-coronavirus-false/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2017/05/woz.jpg?quality=82&strip=all", "publishedAt": "2020-03-02T22:26:10Z", "content": "Apple cofounder Steve Wozniak took to Twitter this afternoon to suggest that he and his wife may have both been patient zero for coronavirus in the United States. As it turns out, this wasn’t the case.\r\nWozs tweet came in the form of a Swarm check-in at the W… [+1653 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Coronavirus troubles underscore Apple's reliance on China", "description": "The COVID-19 outbreak has made it clear just how dependent Apple is on its supply chain in China, despite efforts to diversify where its products are made.", "url": "https://appleinsider.com/articles/20/03/02/coronavirus-troubles-underscore-apples-reliance-on-china", "urlToImage": "https://photos5.appleinsider.com/gallery/34735-62942-200302-iPhone11Pro-xl.jpg", "publishedAt": "2020-03-02T22:16:46Z", "content": "The COVID-19 outbreak has made it clear just how dependent Apple is on its supply chain in China, despite efforts to diversify where its products are made.Last Friday, Apple CEO Tim Cook said that the company remains \"fundamentally strong\" in the face of the … [+2893 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bethany Biron", "title": "Purell hand sanitizer is selling out on Amazon as coronavirus fears grow — and some third-party vendors are now selling bottles for more than $100", "description": "Purell hand sanitizer is currently sold out from its brand storefront page on Amazon as coronavirus fears mount. All Purell products are currently listed as \"unavailable,\" while a disclaimer next to each of the products states \"we don't know when or if this i…", "url": "https://www.businessinsider.com/purell-hand-sanitizer-sells-out-amazon-coronavirus-fears-2020-2", "urlToImage": "https://i.insider.com/5e5d73c1fee23d06ae593413?width=1200&format=jpeg", "publishedAt": "2020-03-02T22:18:25Z", "content": "Purell hand sanitizer is currently sold out on Amazon as fear over the spread of coronavirus grows in the US. \r\nAs of Monday afternoon, every Purell product on the brand's Amazon storefront was sold out, with items ranging from bulk travel minis to individual… [+1473 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Gareth Branwyn", "title": "Minimum Wage Machine dispenses free money at the simple turn of a crank", "description": "Take as much money as you want, at $7.25 an hour (current Fed minimum wage). All you have to do is turn the crank, which dispenses one penny every 4.97 seconds. Easy money, right? This brilliant art piece by Blake Fall-Conroy provides a visceral demonstration…", "url": "https://boingboing.net/2020/03/02/minimum-wage-machine-dispenses.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/mwm-1-3.jpg?fit=500%2C357&ssl=1", "publishedAt": "2020-03-02T22:29:57Z", "content": "Take as much money as you want, at $7.25 an hour (current Fed minimum wage). All you have to do is turn the crank, which dispenses one penny every 4.97 seconds. Easy money, right?\r\nThis brilliant art piece by Blake Fall-Conroy provides a visceral demonstratio… [+2169 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Pfizer identified some antiviral compounds with potential as coronavirus treatments", "description": "Drugmaker Pfizer Inc said on Monday that it identified certain antiviral compounds it had in development that have the potential to inhibit coronaviruses and is engaging with a third party to screen the compounds. Pfizer Chief Scientific Officer Mikael Dolste…", "url": "https://news.yahoo.com/pfizer-identified-antiviral-compounds-potential-230524412.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/f9efb.0Z9D3a4pT03AHQxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzMuNg--/https://s.yimg.com/uu/api/res/1.2/S_pj4DfooyEX5mh4PO.7Uw--~B/aD01NDY7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/9975ba8e1ff54a4ff864990395e92042", "publishedAt": "2020-03-02T23:05:24Z", "content": "NEW YORK (Reuters) - Drugmaker Pfizer Inc &lt;PFE.N&gt; said on Monday that it identified certain antiviral compounds it had in development that have the potential to inhibit coronaviruses and is engaging with a third party to screen the compounds.\r\nThe compa… [+392 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ahmed Charai", "title": "The Coronavirus Threatens Africans and China’s Hold on Africa", "description": "Africa’s comparatively poor health-care system is failing to recognize many cases in its midst—setting the stage for a larger tragedy.", "url": "https://news.yahoo.com/coronavirus-threatens-africans-china-hold-225100889.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/eLf3eKEIP4dvB1Jws9Rd5w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/fvPJMKlmlOr.k2zqYP696A--~B/aD05NzY7dz0xMzAxO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/f88fe935463439bca0199006d9ee3cf0", "publishedAt": "2020-03-02T22:51:00Z", "content": "The most terrifying and mysterious question about the Coronavirus is: Why has Africa, home to 1.3 billion people, only reported three cases and no deaths? \r\nWorldwide, coronavirus, also known as Covid-19, has been found in eighty-six thousand people and kille… [+1006 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "Personal Finance Daily: How America’s extreme ‘survivalists’ are preparing for a worst-case coronavirus epidemic and 5 last-minute tips to save money before Tax Day", "description": "Monday’s top personal finance stories", "url": "https://www.marketwatch.com/story/how-americas-extreme-survivalists-are-preparing-for-a-worst-case-coronavirus-epidemic-and-5-last-minute-tips-to-save-money-before-tax-day-2020-03-02", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-03-02T22:18:22Z", "content": "Barrons wants to recognize people and organizations whose products, services, or education programs are making an impact to improve the financial health of individuals across the U.S. Be sure to head to barrons.com/celebrates for more information and to submi… [+3182 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Thom Dunn", "title": "Female komodo dragons don't need no man to make more dragons", "description": "Back in August 2019, a female komodo dragon named Charlie gave birth to three little dragons at the Chattanooga Zoo. The zookeepers had previously tried to hook her up with a sweet dragon fella named Kadal, but the two never really seemed to hit it off — not …", "url": "https://boingboing.net/2020/03/02/female-komodo-dragons-dont-n.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/komodo-dragon.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-02T22:29:42Z", "content": "Back in August 2019, a female komodo dragon named Charlie gave birth to three little dragons at the Chattanooga Zoo. The zookeepers had previously tried to hook her up with a sweet dragon fella named Kadal, but the two never really seemed to hit it off not th… [+3296 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jeffrey Heller", "title": "Netanyahu declares victory in Israeli election", "description": "Prime Minister Benjamin Netanyahu declared victory on Tuesday in Israel's third election in less than a year, after television exit polls showed him just a seat short of a governing majority in parliament.", "url": "https://www.reuters.com/article/us-israel-election-idUSKBN20P3BS", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497887402&w=1200&r=LYNXMPEG212MY", "publishedAt": "2020-03-02T23:08:44Z", "content": "JERUSALEM (Reuters) - Prime Minister Benjamin Netanyahu declared victory on Tuesday in Israel’s third election in less than a year, after television exit polls showed him just a seat short of a governing majority in parliament. \r\nA win for Netanyahu, 70, afte… [+4231 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Katyanna Quach", "title": "First MWC, then GDC, now Nvidia's GPU conference is online-only as coronavirus spreads in Silicon Valley", "description": "Google's TensorFlow Dev Summit may be next, too Nvidia’s GPU Technology Conference, due to take place on March 22 to 26 in Silicon Valley's San Jose McEnery Convention Center, has been cancelled following the Wuhan coronavirus outbreak in Northern California.…", "url": "https://www.theregister.co.uk/2020/03/02/coronavirus_conference_concerns/", "urlToImage": "https://regmedia.co.uk/2018/03/27/jensen_huang.jpg", "publishedAt": "2020-03-02T22:31:42Z", "content": "Nvidias GPU Technology Conference, due to take place on March 22 to 26 in Silicon Valley's San Jose McEnery Convention Center, has been cancelled following the Wuhan coronavirus outbreak in Northern California.\r\nThe chip giant's loyalists will not get to see … [+2942 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "US coronavirus death toll rises to 6", "description": "Four more deaths reported in Washington state, where officials had previously said two people had died from the virus.", "url": "https://www.aljazeera.com/news/2020/03/coronavirus-death-toll-rises-6-200302203641200.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/2/4486f3f9bfbb45f6bc1b3c87a7b9a0fa_18.jpg", "publishedAt": "2020-03-02T22:16:26Z", "content": "Four more people have died in the US state of Washington after being infected with the coronavirus, bringing the death toll in the state and country to six, authorities said on Monday.\r\nDr Jeff Duchin, chief health officer for the Seattle and King County Publ… [+2433 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Live: VP Pence, coronavirus task-force brief the public - Fox News", "description": "Live: VP Pence, coronavirus task-force brief the public Fox News Watch live: Pence to hold briefing on coronavirus response CBS News Tapper presses Pence: Do you think Democrats want people to get coronavirus? CNN Coronavirus cases spread as nation’s second d…", "url": "https://www.youtube.com/watch?v=OeO3dd28N8M", "urlToImage": null, "publishedAt": "2020-03-02T22:31:42Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why JD.com Stock Popped Today", "description": "Shares of the online retailer rose on a strong report and resilience in the face of the novel coronavirus.", "url": "https://www.fool.com/investing/2020/03/02/why-jdcom-stock-popped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561042/delivery-by-jdcom-at-wuhan-hubei-province.jpg", "publishedAt": "2020-03-02T22:27:00Z", "content": "What happened\r\nShares of JD.com (NASDAQ:JD) were surging after the Chinese e-commerce specialist turned in a better-than-expected fourth-quarter earnings report and gave guidance that showed the company weathering the COVID-19 coronavirus outbreak well.\r\nAs a… [+2126 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mike Pence Gives Update On Coronavirus Threat | NBC News (Live Stream) - NBC News", "description": "Mike Pence Gives Update On Coronavirus Threat | NBC News (Live Stream) NBC News Watch: Mike Pence leads coronavirus briefing as officials confirm more cases in the United States CNBC Pence leans in on coronavirus as response gets political: Updates POLITICO P…", "url": "https://www.youtube.com/watch?v=vVcxO0dOXwA", "urlToImage": "https://i.ytimg.com/vi/vVcxO0dOXwA/maxresdefault.jpg", "publishedAt": "2020-03-02T22:29:15Z", "content": "Watch live coverage as Vice President Pence provides an update on the coronavirus threat to the U.S., along with Ambassador Deborah Birx, the White House coronavirus response coordinator.» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC» Watch more NB… [+639 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Hyatt Pulls Guidance on Concerns Over Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-02/hyatt-pulls-2020-guidance-on-concerns-over-coronavirus-outbreak", "urlToImage": null, "publishedAt": "2020-03-02T22:38:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump Meets With Pharma Executives About Coronavirus | NBC News (Live Stream) - NBC News", "description": "Trump Meets With Pharma Executives About Coronavirus | NBC News (Live Stream) NBC News Trump's coronavirus strategy faces new scrutiny after second US death CNN VP Pence: US is the most prepared to handle coronavirus Fox News Harry Reid: Joe Biden is the Demo…", "url": "https://www.youtube.com/watch?v=zII4lRAEJrA", "urlToImage": "https://i.ytimg.com/vi/zII4lRAEJrA/maxresdefault.jpg", "publishedAt": "2020-03-02T22:29:46Z", "content": "President Trump, Vice President Pence and members of the Coronavirus Task Force meet with pharmaceutical executives.\r\n» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC» Watch more NBC video: http://bit.ly/MoreNBCNews\r\nNBC News is a leading source of g… [+577 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Abantika Ghosh", "title": "Screening stepped up as coronavirus reaches Delhi and Hyderabad", "description": "The new cases mark the first instance in the country of the virus being reported from outside Kerala, where three students returning from Wuhan, the Chinese city at the heart of the outbreak, were found to have been infected.", "url": "https://indianexpress.com/article/cities/delhi/coronavirus-outbreak-cases-in-delhi-hyderabad-screening-stepped-up-6296354/", "urlToImage": "https://images.indianexpress.com/2020/02/china-airport.jpg?w=759", "publishedAt": "2020-03-02T23:10:05Z", "content": "Written by Abantika Ghosh\r\n | New Delhi | \r\nPublished: March 3, 2020 4:40:05 am\r\nSo far 5,57,431 passengers have been screened at airports, and 12,431 at seaports. Moreover, 25,738 passengers are under community surveillance. Fifteen labs are functional and 1… [+5161 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Abantika Ghosh", "title": "Screening stepped up as coronavirus reaches Delhi and Hyderabad", "description": "The new cases mark the first instance in the country of the virus being reported from outside Kerala, where three students returning from Wuhan, the Chinese city at the heart of the outbreak, were found to have been infected.", "url": "https://indianexpress.com/article/india/coronavirus-outbreak-cases-in-delhi-hyderabad-screening-stepped-up-6296354/", "urlToImage": "https://images.indianexpress.com/2020/02/china-airport.jpg?w=759", "publishedAt": "2020-03-02T23:10:05Z", "content": "Written by Abantika Ghosh\r\n | New Delhi | \r\nUpdated: March 3, 2020 5:16:21 am\r\nSo far 5,57,431 passengers have been screened at airports, and 12,431 at seaports. Moreover, 25,738 passengers are under community surveillance. Fifteen labs are functional and 19 … [+5159 chars]"}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Evan Selleck", "title": "Turns out Steve Wozniak’s wife has a sinus infection, not the coronavirus", "description": "Apple co-founder Steve Wozniak tweeted out that he and his wife may have been \"patient zero\" for the coronavirus in the United States. Turns out his wife has a sinus infection.", "url": "https://www.idownloadblog.com/2020/03/02/steve-wozniak-coronavirus-patient-zero-tweet/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2014/12/steve-wozniak.jpg", "publishedAt": "2020-03-02T23:07:00Z", "content": "The global outbreak of the novel coronavirus has many people concerned, but some folks probably shouldnt take to Twitter and suggest irrational conclusions.\r\nTake, for example, Apple co-founder Steve Wozniak. The Woz tweeted out earlier today (via AppleInside… [+1633 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Abner Li", "title": "Google cancels in-person Cloud Next ’20 for ‘Digital Connect’ conference due to coronavirus", "description": "Before I/O in May, Google for the past several years has hosted Cloud Next for G Suite, Google Cloud, and other enterprise offerings a month before. The company announced today it’s canceling the in-person conference for a “free, global, digital-first, multi-…", "url": "https://9to5google.com/2020/03/02/google-cloud-next-coronavirus/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2019/04/google-cloud-next-19.jpg?quality=82&strip=all", "publishedAt": "2020-03-02T22:33:39Z", "content": "Before I/O in May, Google has hosted Cloud Next for G Suite, Google Cloud, and other enterprise offerings a month before. The company announced today it’s canceling the in-person conference for a “free, global, digital-first, multi-day event” over coronavirus… [+1719 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch live: Washington state governor gives update on coronavirus deaths - NBC News", "description": "Watch live coverage as Washington state Gov. Jay Inslee provides an update on the coronavirus spread, which has killed six people in the state. » Subscribe t...", "url": "https://www.youtube.com/watch?v=Vy_z5Ii5KT0", "urlToImage": "https://i.ytimg.com/vi/Vy_z5Ii5KT0/maxresdefault_live.jpg", "publishedAt": "2020-03-02T23:05:56Z", "content": "Watch live coverage as Washington state Gov. Jay Inslee provides an update on the coronavirus spread, which has killed six people in the state.» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC» Watch more NBC video: http://bit.ly/MoreNBCNews\r\nNBC News… [+610 chars]"}, {"source": {"id": null, "name": "Ilounge.com"}, "author": "Haider Ali Khan", "title": "iPhone production is not likely to improve this year due to Coronavirus", "description": "The Coronavirus outbreak has taken the world with a surprise. It is not only the people who are affected by the virus. The virus is also affecting some of the major tech giants across the globe. Over the past few weeks since the outbreak, Apple’s iPhone produ…", "url": "https://www.ilounge.com/news/iphone/iphone-production-is-not-likely-to-improve-this-year-due-to-corona", "urlToImage": "https://www.ilounge.com/wp-content/uploads/2020/03/iPhone-Production-is-not-likely-to-Improve-This-Year-Due-to-Corona-1024x512.png", "publishedAt": "2020-03-02T22:21:13Z", "content": "The Coronavirus outbreak has taken the world with a surprise. It is not only the people who are affected by the virus. The virus is also affecting some of the major tech giants across the globe. Over the past few weeks since the outbreak, Apple’s iPhone produ… [+1278 chars]"}, {"source": {"id": null, "name": "Wvlt.tv"}, "author": "Lauren Meyers", "title": "Better Business Bureau warns people to not fall for coronavirus cons - WVLT.TV", "description": "The Better Business Bureau warns the public to not fall for a coronavirus con.", "url": "https://www.wvlt.tv/content/news/Better-Business-Bureau-warns--568414041.html", "urlToImage": "https://media.graytvinc.com/images/560*315/Untitled+design+(19)6.jpg", "publishedAt": "2020-03-02T22:54:37Z", "content": "JONESBORO, Ark. (WVLT/ KAIT) -- Despite calls from President Trump not to panic, concern is growing among Americans about the coronavirus.\r\nAccording to KAIT, several stores reported shortages of everything from hand sanitizers and disinfectants to face masks… [+1271 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Mark Prvulovic)", "title": "Dow Jones Recovers 1,300 Points Despite Increase in U.S. Coronavirus Deaths", "description": "The markets witnessed a major recovery on Monday. Will it last?", "url": "https://www.fool.com/investing/2020/03/02/dow-jones-recovers-1300-points-despite-increase-in.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561079/gettyimages-159757472.jpg", "publishedAt": "2020-03-02T22:24:34Z", "content": "Financial markets jumped substantially on Monday, recovering partially from the significant losses seen last week. The Dow Jones Industrial Average is up 1,294 points, or 5%, while the S&amp;P 500 and the Nasdaq are up 4.6% and 4.5% respectively.\r\nToday's per… [+1311 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "American Airlines’ India nonstops from Seattle are now on sale", "description": "American Airlines has set the date for its return to India with new nonstop service to the technology hub of Bangalore. The Oneworld alliance carrier will begin daily service between Seattle/Tacoma (SEA) and Bangalore (BLR) on Oct. 25, according to Cirium sch…", "url": "http://thepointsguy.com/news/american-airlines-india-nonstops-from-seattle-are-now-on-sale/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/10/20191028_DFW-Airport_American-Airlines-787-taking-off-from-DFW_JTGenter.jpg?fit=1600%2C1067px&ssl=1", "publishedAt": "2020-03-02T22:45:16Z", "content": "American Airlines has set the date for its return to India with new nonstop service to the technology hub of Bangalore.\r\nThe Oneworld alliance carrier will begin daily service between Seattle/Tacoma (SEA) and Bangalore (BLR) on Oct. 25, according to Cirium sc… [+3528 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Igor Derysh", "title": "Coronavirus appears to have spread undetected in the US for six weeks, study says", "description": "Researchers found that the virus spread undetected in Washington state for weeks before five people died.", "url": "https://www.salon.com/2020/03/02/coronavirus-appears-to-have-spread-undetected-in-the-us-for-six-weeks-study-says/", "urlToImage": "https://media.salon.com/2020/02/ebola-coronavirus-0227201.jpg", "publishedAt": "2020-03-02T22:23:33Z", "content": "The coronavirus appears to have spread undetected in the U.S. for about six weeks, according to an analysis by researchers in Washington state.\r\nThe Centers for Disease Control and Prevention announced the first confirmed case of coronavirus in Washington on … [+6587 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Partha Sarathi Biswas", "title": "Chicken festivals dished out across state to quell corona scare, increase consumption", "description": "Since the first week of February, the poultry industry has been reeling from low sales after social media messages linked poultry meat with the spread of coronavirus disease. Poultry meat sale reportedly has plummeted to almost 30 per cent of its normal value…", "url": "https://indianexpress.com/article/cities/pune/chicken-festivals-dished-out-across-state-to-quell-corona-scare-increase-consumption-6296410/", "urlToImage": "https://images.indianexpress.com/2020/02/Poultry.jpg?w=759", "publishedAt": "2020-03-02T22:32:13Z", "content": "Written by Partha Sarathi Biswas | Pune | \r\nPublished: March 3, 2020 4:02:13 am\r\nOn average, Pune reports sale of 90 lakh to 1.10 crore birds per month, while around three crore birds are sold across the state. (File Photo)Alarmed over a continuous dip in sal… [+2413 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Mary Honkus", "title": "Disney Parks in China and Japan Look Like Ghost Towns After Closing Due to Coronavirus Outbreak", "description": "Even the most magical place on earth is not immune to the threat of coronavirus. Disney parks Hong Kong, Shanghai, and Tokyo are the first Disney parks to have shut down over growing concerns about the spread of the novel coronavirus COVID-19. Tokyo Disneylan…", "url": "https://people.com/travel/disney-parks-in-china-and-japan-look-like-ghost-towns-after-closing-due-to-coronavirus-outbreak/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fdisneyland-closures-98.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-02T22:24:04Z", "content": "Even the most magical place on earth is not immune to the threat of coronavirus.\r\nDisney parks Hong Kong, Shanghai, and Tokyo are the first Disney parks to have shut down over growing concerns about the spread of the novel coronavirus COVID-19.\r\nTokyo Disneyl… [+2962 chars]"}, {"source": {"id": null, "name": "Mindbodygreen.com"}, "author": "Abby Moore", "title": "New Study Finds This '5th Vital Sign' May Prevent The Spread Of Coronavirus", "description": "This extra question can make a difference.", "url": "https://www.mindbodygreen.com/articles/5th-vital-sign-that-might-prevent-spread-of-coronavirus", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_157,w_1500,h_843/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/cqa0xcr1kk7b0h0m4.jpg", "publishedAt": "2020-03-02T22:41:00Z", "content": "While implementing travel bans might not protect people from infectious diseases, commentary published in Annals of Internal Medicine, said talking about where youve traveled could have protective effects. \r\nIn the new report, researchers discussed a potentia… [+883 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Heidi Chung", "title": "Coronavirus, Super Tuesday, Target earnings: What to know in markets Tuesday", "description": "Investors will be eyeing any developments of the coronavirus, Super Tuesday, and Target earnings on March 3.", "url": "https://finance.yahoo.com/news/coronavirus-super-tuesday-target-earnings-what-to-know-in-markets-tuesday-223533583.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/7NHl5YY9jVWQHTLTmj6fHw--~B/aD0zNDMwO3c9NTI4NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/ca6622d0-5ca2-11ea-afbf-62b595a02fa1", "publishedAt": "2020-03-02T22:35:33Z", "content": "Markets staged a major rebound Monday after logging its worst week since early October 2008. The Dow (^DJI) surged a whopping 1,293.96 points, or 5.1%, while the S&amp;P 500 (^GSPC) soared 4.6% and the Nasdaq (^IXIC)jumped 4.5%. Despite the massive rally to k… [+2701 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "China’s U.N. envoy says Beijing confident it will meet economic goals despite COVID-19 outbreak", "description": "Zhang Jun made the statement at a news conference at the United Nations to mark China’s presidency of the Security Council for March", "url": "https://www.thehindu.com/news/international/chinas-un-envoy-says-beijing-confident-it-will-meet-economic-goals-despite-coronavirus-outbreak/article30968058.ece", "urlToImage": "https://www.thehindu.com/news/international/vyjrt9/article30968057.ece/ALTERNATES/LANDSCAPE_615/CHINA-OUTBREAK", "publishedAt": "2020-03-02T22:20:07Z", "content": "Chinas U.N. ambassador, Zhang Jun, said on Monday that while the coronavirus outbreak has had a negative impact on the countrys economy, Beijing was working to revitalize and was confident it would reach its economic goals for 2020.\r\nDefinitely the epidemic, … [+1144 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Teen threatens 'massacre' at former high school through Instagram via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_fb78c3f7231c78ddaae5ec44cb4a8258", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-02T23:10:14Z", "content": "Washington, Coronavirus\r\nThe coronavirus continued its march across the US with six people dying after contracting the illness, all of them so far in Washington state."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Awaiting US stock futures open at 6 pm after Wall Street's worst week since 2008 via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_b80aa02da18658e60f1078ecd82c55ce", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-02T23:10:14Z", "content": "Washington, Coronavirus\r\nThe coronavirus continued its march across the US with six people dying after contracting the illness, all of them so far in Washington state."}, {"source": {"id": null, "name": "1011now.com"}, "author": "Press Release", "title": "Better Business Bureau warns of Coronavirus Con - 1011now", "description": "The Better Business Bureau put out a warning about a Coronavirus scam on Monday. The BBB said that the spread of COVID-19 in the U.S. has resulted in scammers taking advantage of fears about the illness.", "url": "https://www.1011now.com/content/news/Better-Business-Bureau-warns-of-Coronavirus-Con-568411991.html", "urlToImage": "https://media.graytvinc.com/images/MGN_1280x720_80718C00-RHFKG.jpg", "publishedAt": "2020-03-02T22:14:15Z", "content": "The Better Business Bureau put out a warning about a Coronavirus scam on Monday. The BBB said that the spread of COVID-19 in the U.S. has resulted in scammers taking advantage of fears about the illness. \r\nLook out for fake cures, phony prevention measures, a… [+2338 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "NBCNews.com", "title": "Watch live: Washington state governor gives update on coronavirus deaths - NBC News", "description": "Watch live: Washington state governor gives update on coronavirus deaths NBC News Washington State Governor Gives Update On Coronavirus Deaths | NBC News (Live Stream) NBC News Washington, Florida Governors Declare State of Emergency for Coronavirus U.S. News…", "url": "https://www.nbcnews.com/video/watch-live-washington-state-governor-gives-update-on-coronavirus-deaths-79835717652", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/inslee-live.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-02T23:05:52Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "H.V. MacArthur, Contributor, H.V. MacArthur, Contributor https://www.forbes.com/sites/hvmacarthur/", "title": "When People Won’t Call Out: How To Manage Those That Show Up Sick To Work", "description": "With the ominous news going around about the coronavirus, people showing up sick to work has an extra tinge of concern than it normally would. Company’s sick policies do not tend to force an employee to take sick time. So what should managers do when someone …", "url": "https://www.forbes.com/sites/hvmacarthur/2020/03/02/when-people-wont-call-out-how-to-manage-those-that-show-up-sick-to-work/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5d82cb765d4500072da9e5%2F0x0.jpg", "publishedAt": "2020-03-02T22:22:55Z", "content": "Getty\r\nWe all know that feeling. Were taking our vitamins, getting sleep and even went diligently to the doctor for our flu shot. Then one day, were sitting at our desk and our co-worker drags themselves in. Their eyes are watery and red, their nose runny and… [+5115 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Sven Gustafson", "title": "Cupra unveils Formentor crossover as brand’s first bespoke model", "description": "Filed under: SEAT, Crossover, Hybrid Continue reading Cupra unveils Formentor crossover as brand’s first bespoke model Cupra unveils Formentor crossover as brand’s first bespoke model originally appeared on Autoblog on Mon, 2 Mar 2020 17:35:00 EST. Please see…", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/03/02/cupra-formentor-performance-crossover-revealed/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/573x323+107+106/resize/800x450!/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2020/03/02161308/singlePhoto-0.resizeViewPort.1200.fileReferenceOriginal-3.jpg", "publishedAt": "2020-03-02T22:35:00Z", "content": "Cupra, the performance sub-brand of Seat, Volkswagens Spanish subsidiary, has taken the wraps off the first vehicle designed specifically for the brand. The design-forward crossover is called the Formentor, and it will be made available in a plug-in hybrid ve… [+3000 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK preparing measures to help business, economy if coronavirus spreads - Reuters", "description": "The British government is preparing possible measures to support the health service, businesses and the economy as the outbreak of coronavirus continues to spread, the finance ministry said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-idUSKBN20P3AF", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497880392&w=1200&r=LYNXMPEG212M2", "publishedAt": "2020-03-02T22:47:00Z", "content": "LONDON (Reuters) - The British government is preparing possible measures to support the health service, businesses and the economy as the outbreak of coronavirus continues to spread, the finance ministry said on Monday. \r\nThe United Kingdom has so far had 40 … [+2332 chars]"}, {"source": {"id": null, "name": "Edweek.org"}, "author": "Mark Lieberman", "title": "How to Respond to Coronavirus: 6 Steps for Schools", "description": "Here are key steps for district and school leaders to follow if coronavirus hits your community.", "url": "https://www.edweek.org/ew/articles/2020/03/02/how-to-respond-to-coronavirus-6-steps.html", "urlToImage": "https://www.edweek.org/media/2020/03/02/stock-jarun011-soc.jpg", "publishedAt": "2020-03-02T22:45:00Z", "content": "Cases of the novel coronavirus have begun to hit K-12 schools, and its likely more will appear in the coming days as evidence mounts of the diseases spread beyond people who have recently traveled abroad. Schools in states with confirmed cases have begun clos… [+5364 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rachel Sandler, Forbes Staff, Rachel Sandler, Forbes Staff https://www.forbes.com/sites/rachelsandler/", "title": "How The CDC Botched Its Initial Coronavirus Response With Faulty Tests", "description": "Public health experts say the CDC made early missteps that limited its capacity to test for Covid-19.", "url": "https://www.forbes.com/sites/rachelsandler/2020/03/02/how-the-cdc-botched-its-initial-coronavirus-response-with-faulty-tests/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204648065%2F960x0.jpg", "publishedAt": "2020-03-02T23:09:34Z", "content": "The U.S. has only tested 3,600 people for Covid-19, HHS Secretary Alex Azar said Sunday.\r\nPhoto by THOMAS KIENZLE/AFP via Getty Images\r\nTopline: U.S. health officials made crucial mistakes in its initial response to the coronavirus that public health experts … [+7285 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Taylor Mims", "title": "Avril Lavigne, Wolf Parade & More Cancel Tours as Coronavirus Spreads", "description": "With nearly 90,000 cases of coronavirus reported worldwide, the live music industry is continuing to see high profile artists cancel shows out of safety concerns.", "url": "https://www.billboard.com/articles/business/touring/9326722/avril-lavigne-wolf-parade-cancel-tours-coronavirus", "urlToImage": "https://static.billboard.com/files/media/Avril-Lavigne-bb24-2018-feat-billboard-cinmruru-1548.jpg", "publishedAt": "2020-03-02T22:17:56Z", "content": "With nearly 90,000 cases of coronavirus reported worldwide, the live music industry is continuing to see high-profile artists cancel shows out of safety concerns. Following announcements last week that rock legends Green Day canceled shows in Asia and global … [+2529 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Nick Bilton", "title": "Coronavirus Is Creating a Fake-News Nightmarescape", "description": "The first true epidemic of a polarized, plugged-in era comes with all the attendant conspiracy theories—and they’re spreading on social media almost as fast as the virus itself.", "url": "https://www.vanityfair.com/news/2020/03/coronavirus-is-creating-fake-news-nightmarescape-social-media", "urlToImage": "https://media.vanityfair.com/photos/5e5d76781c938a0008ddb35d/16:9/w_1280,c_limit/coronavirus-conspiracies.jpg", "publishedAt": "2020-03-02T22:37:31Z", "content": "Donald Trump Jr.s comments to Fox &amp; Friends on Friday might be the purest example of the sort of misinformation thats spreading almost as quickly as the coronavirus. For [Democrats] to try to take a pandemic and seemingly hope that it comes here and kills… [+3484 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Natalie Rahhal Acting Us Health Editor", "title": "Children with few symptoms could 'fuel the spread of coronavirus'", "description": "Children's innate immune systems may be better at fighting the coronavirus infection, so they show fewer symptoms, but can carry the virus and give it to adults - especially older ones who are vulnerable.", "url": "https://www.dailymail.co.uk/health/article-8067443/Children-symptoms-fuel-spread-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/02/22/25452024-0-image-a-5_1583189798075.jpg", "publishedAt": "2020-03-02T23:03:17Z", "content": "As the coronavirus outbreak has spread to tens of thousands of people worldwide, it's become clear that one group isn't getting as sick as others: children. \r\nNo children under age nine have been reported dead in China and, so far, young kids make up less tha… [+3824 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sophie Borland Jason Groves for the Daily Mail", "title": "Travellers with suspected coronavirus could be DETAINED at UK borders", "description": "A 'war room' in the Cabinet Office and in every Whitehall ministry will have a lead official to coordinate their responses.", "url": "https://www.dailymail.co.uk/news/article-8067231/Travellers-suspected-coronavirus-DETAINED-UK-borders.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/02/22/25451384-0-image-a-51_1583188270951.jpg", "publishedAt": "2020-03-02T22:31:12Z", "content": "An army of NHS volunteers is being called up to help tackle the coronavirus menace.\r\nWith Boris Johnson warning of a 'mass epidemic', officials are urgently trying to speed up the six-month process of becoming a hospital volunteer.\r\nHelpers could be asked to … [+6506 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "“PUT A CHECK MARK ON THE PBS NEWSHOUR FOR POLITICIZING THE CORONAVIRUS.” On PBS, David Brooks Se…", "description": "“PUT A CHECK MARK ON THE PBS NEWSHOUR FOR POLITICIZING THE CORONAVIRUS.” On PBS, David Brooks Sees ‘A Lot of Upside for the Democrats’ on Coronavirus.", "url": "https://pjmedia.com/instapundit/360116/", "urlToImage": null, "publishedAt": "2020-03-02T22:45:33Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Team of low wage temps successfully identified Italian strain of the coronavirus, but they were still criticized by Cathy and Kathy [Hero]", "description": "Team of low wage temps successfully identified Italian strain of the coronavirus, but they were still criticized by Cathy and Kathy", "url": "https://www.fark.com/comments/10729742/Team-of-low-wage-temps-successfully-identified-Italian-strain-of-coronavirus-but-they-were-still-criticized-by-Cathy-Kathy", "urlToImage": "https://fark-usrimg-850.nyc3.digitaloceanspaces.com/G/GZ/fark_GZdSybUzObv4XaMwSk0QXAKUCAk.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583730000&Signature=1dqpgOLpVFMDUSe00kyTQ%2Beo1iM%3D", "publishedAt": "2020-03-02T23:05:09Z", "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links. This is the number of comments. Click here to read them.\r\n… [+117 chars]"}, {"source": {"id": null, "name": "Freep.com"}, "author": "Susan Selasky, Tresa Baldas", "title": "Coronavirus fears have shoppers stocking up on water, wipes and toilet paper - Detroit Free Press", "description": "Coronavirus fears have shoppers stocking up on water, wipes and toilet paper Detroit Free Press Coronavirus fears prompt Costco shopping rush, shares rise Fox Business Costco Stock is Jumping as Shoppers Buy to Prep for Coronavirus Barron's Local News Shopper…", "url": "https://www.freep.com/story/news/2020/03/02/fears-novel-coronavirus-shoppers-emptying-store-shelves/4930024002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/02/PDTF/2e1ff0ee-3894-4913-8264-f9ed090dc668-TNS_US-NEWS-CORONAVIRUS.jpg?crop=3850,2166,x0,y292&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-02T22:50:00Z", "content": "Shoppers buy toilet paper, food and water at a store in Los Angeles, California, on Saturday, as people begin to panic buy and stockpile essentials from fear that supplies will be affected by the spread of the COVID-19, coronavirus outbreak across the country… [+7872 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Danielle Zoellner", "title": "‘He will lose the election’: Trump won't win 2020 because of coronavirus, ‘Dr Doom’ economist predicts", "description": "Economist Nouriel Roubini, who's nicknamed \"Dr Doom\" for his pessimistic predictions, has said the coronavirus will stop President Donald Trump from getting re-elected.The academic is known for correctly predicting the 2008 housing crisis and recession, and h…", "url": "https://news.yahoo.com/lose-election-trump-wont-win-230511144.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kWz67P15bQDve3c1Rbw8Qw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/kAhCZ0TLmBGLbtx94u5QNw--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/4895a18305e319c12f911f186b14a655", "publishedAt": "2020-03-02T23:05:11Z", "content": "Getty Images\r\nEconomist Nouriel Roubini, who's nicknamed \"Dr Doom\" for his pessimistic predictions, has said the coronavirus will stop President Donald Trump from getting re-elected.\r\nThe academic is known for correctly predicting the 2008 housing crisis and … [+2567 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus misinformation spreads rapidly on social media", "description": "As the coronavirus spreads worldwide, so too does misinformation about the disease. CNET senior producer Dan Patterson joins CBSN with a closer look at where the bad info is coming from and what companies are doing to curtail it.", "url": "https://www.cbsnews.com/video/coronavirus-misinformation-spreads-rapidly-on-social-media/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/02/ace8c103-d490-4b47-943e-ce11bd080785/thumbnail/1200x630/eca07f844ec3ce3a709a60cb3dd32c4d/0302-cbsn-coronavirusmisinfo-2039818-640x360.jpg", "publishedAt": "2020-03-02T22:55:34Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Google asks Dublin staff to work from home as coronavirus precaution", "description": "Alphabet Inc's Google has asked around 8,000 staff at its European headquarters in Dublin to work from home on Tuesday as a precaution after a staff-member reported flu-like symptoms.", "url": "https://www.reuters.com/article/us-health-coronavirus-google-idUSKBN20P39D", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T22:27:05Z", "content": "DUBLIN (Reuters) - Alphabet Inc’s Google has asked around 8,000 staff at its European headquarters in Dublin to work from home on Tuesday as a precaution after a staff-member reported flu-like symptoms. \r\nThe decision comes days after Ireland on Saturday conf… [+879 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Nate Madden", "title": "NASA satellite images of China air pollution offer glimpse into coronavirus’ impact on the country", "description": "Recent satellite images of China released by the National Aeronautic and Space Administration illustrate just how heavy an impact the coronavirus outbreak is having on the country. NASA and European Space Agency pollution tracking satellites captured the rece…", "url": "https://www.theblaze.com/news/nasa-satellite-images-of-china-air-pollution-offer-glimpse-into-coronavirus-impact-on-the-country", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgzODg3My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNzA5NTEyMX0.XKhVt7y76mKG122MiwYkj6W2XDP_Yuh1ZmQrJKAp5pM/img.jpg?width=1200&coordinates=0%2C277%2C0%2C277&height=600", "publishedAt": "2020-03-02T22:38:23Z", "content": "Recent satellite images of China released by the National Aeronautic and Space Administration illustrate just how heavy an impact the coronavirus outbreak is having on the country.\r\nNASA and European Space Agency pollution tracking satellites captured the rec… [+1990 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Dems, Trump, and officials clash over coronavirus", "description": "President Trump continues to blame news coverage for the fear and anxiety surrounding the outbreak", "url": "https://www.msnbc.com/deadline-white-house/watch/dems-trump-and-officials-clash-over-coronavirus-79840837824", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_wh_deadline_coronavirus_200302_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-02T22:31:38Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "'Hundreds' may have coronavirus in Washington state", "description": "NBC correspondent, Gadi Schwartz brings the latest from Washington state where six people have died from the coronavirus.", "url": "https://www.msnbc.com/mtp-daily/watch/-hundreds-may-have-coronavirus-in-washington-state-79840837632", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_gadiwashington_200302_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-02T22:15:31Z", "content": null}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Mikael Thalen", "title": "Steve Wozniak thinks he’s coronavirus ‘patient zero’", "description": "The Apple co-founder says his wife came down with a 'bad cough' after a trip to China. The post Steve Wozniak thinks he’s coronavirus ‘patient zero’ appeared first on The Daily Dot.", "url": "https://www.dailydot.com/irl/steve-wozniak-coronavirus-patient-zero/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/wozniak-coronavirus-patient-zero.jpg", "publishedAt": "2020-03-02T22:39:13Z", "content": "Apple co-founder Steve Wozniak believes that he and his wife may be responsible for bringing the coronavirus (COVID-19) to the United States.\r\nWozniak made the bold statement on Twitter Monday, announcing that his wife Janet had come down with a bad cough fol… [+1116 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Italy Reports Coronavirus Deaths and Hospitalizations", "description": "Italy reports 1835 are the people who test positive for the coronavirus. 149 people have recovered. There are 742 patients hospitalized with symptoms, 166 are in intensive care, while 927 are in home... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2020/03/italy-reports-coronavirus-deaths-and-hospitalizations.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2020/03/italycoronavirus.jpg", "publishedAt": "2020-03-02T23:09:31Z", "content": "Italy reports 1835 are the people who test positive for the coronavirus. 149 people have recovered. \r\nThere are 742 patients hospitalized with symptoms, 166 are in intensive care, while 927 are in home isolation. \r\nThis seems to indicate that three times as m… [+2035 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Pence says risk to Americans from coronavirus remains low", "description": "Vice President Mike Pence said on Monday the risk to Americans from coronavirus remains low, after authorities in Washington state announced the deaths of four more people, raising the U.S. death toll to six.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/JrELR7p6Vdc/pence-says-risk-to-americans-from-coronavirus-remains-low-idUSKBN20P3AR", "urlToImage": null, "publishedAt": "2020-03-02T22:51:14Z", "content": null}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "Spirit Airlines plans first international routes from New Orleans", "description": "Spirit Airlines will add its first international routes from New Orleans this June, connecting the city with Cancun and San Pedro Sula, Honduras. The South Florida-based ultra-low-cost-carrier will begin service between New Orleans (MSY) and Cancun (CUN) on J…", "url": "http://thepointsguy.com/news/spirit-airlines-plans-first-international-routes-from-new-orleans/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2020/01/20200131_Spirit-Airlines-Livery-and-Interior-Updates-16.jpg?fit=1600%2C1067px&ssl=1", "publishedAt": "2020-03-02T23:00:52Z", "content": "Spirit Airlines will add its first international routes from New Orleans this June, connecting the city with Cancun and San Pedro Sula, Honduras.\r\nThe South Florida-based ultra-low-cost-carrier will begin service between New Orleans (MSY) and Cancun (CUN) on … [+2209 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "Monica Nickelsburg", "title": "Microsoft cancels MVP Summit due to coronavirus outbreak in Seattle area", "description": "Microsoft is canceling its Most Valuable Professional (MVP) Summit and moving the event online due to the COVID-19 coronavirus. The company has been notifying attendees that the event, which was scheduled for March 15-20 in Bellevue and Redmond, Wash., is can…", "url": "https://www.geekwire.com/2020/microsoft-cancels-mvp-summit-due-coronavirus-outbreak-seattle-area/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2019/11/microsoft-1260x945.jpg", "publishedAt": "2020-03-02T22:21:16Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Trump meets with coronavirus task force and pharma execs as death toll increases in U.S.", "description": "President Trump met with his coronavirus task force and executives from pharmaceutical companies at the White House to discuss the administration's response to the outbreak and the process of developing a vaccine. Watch his remarks here.", "url": "https://www.cbsnews.com/video/donald-trump-coronavirus-task-force-death-toll-increase-today-2020-03-02/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/02/12d7c19f-51d7-4118-8aff-b8542279f12a/thumbnail/1200x630/3ea973d3b785da6c151a721fade8475a/cbsn-fusion-donald-trump-coronavirus-task-force-death-toll-increase-today-2020-03-02-thumbnail-453294-640x360.jpg", "publishedAt": "2020-03-02T22:37:17Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Onemileatatime.com"}, "author": "Ben (Lucky)", "title": "Delta Waiving Change Fees On International Flights", "description": "Over the past few days we’ve seen JetBlue, Alaska Airlines, and American Airlines, start to waive change fees on new bookings as a way of drumming up business. Clearly future bookings are way down as a result of the uncertainty created by coronavirus, so airl…", "url": "https://onemileatatime.com/delta-waiving-change-fees-on-international-flights/", "urlToImage": "https://onemileatatime.com/wp-content/uploads/2018/02/Delta-A350-Business-Class-3.jpg", "publishedAt": "2020-03-02T22:14:30Z", "content": "Over the past few days weve seen JetBlue, Alaska Airlines, and American Airlines, start to waive change fees on new bookings as a way of drumming up business.\r\nClearly future bookings are way down as a result of the uncertainty created by coronavirus, so airl… [+2117 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "Coronavirus coverage from STAT News", "description": "Read all of our coverage of the new virus that has emerged in China and spread to countries around the world.", "url": "https://www.statnews.com/tag/coronavirus/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/02/Coronavrius-AP-1024x576.jpg", "publishedAt": "2020-03-02T23:07:56Z", "content": "Read all of our coverage of the new virus that has emerged in China and spread to countries around the world. And sign up for our Morning Rounds newsletter to get an update first thing each weekday morning."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Megan Cerullo", "title": "Co-Diagnostics now selling coronavirus test in U.S.", "description": "Test uses AI to deliver results in about 90 minutes from FDA-certified laboratories, CEO says.", "url": "https://www.cbsnews.com/news/coronavirus-test-co-diagnostics-covid-19/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/02/1953610f-059f-4ab6-aa07-42a9820c5f48/thumbnail/1200x630/5eb04a5489affb5ebd8e96b3602facb3/gettyimages-1204066779.jpg", "publishedAt": "2020-03-02T22:50:20Z", "content": "Medical testing company Co-Diagnostics said Monday that its coronavirus test kits are now available for sale to laboratories in the U.S., an announcement that sent its stock soaring nearly 35%\r\nThe tests from Co-Diagnostics, which has also developed screening… [+3710 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "Watch live: Pence gives update on coronavirus outbreak", "description": "Vice President Mike Pence is speaking about the coronavirus outbreak.", "url": "https://www.bostonglobe.com/2020/03/02/metro/watch-live-pence-gives-update-coronavirus-outbreak/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=140", "publishedAt": "2020-03-02T22:32:54Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "NHL looking at plans if coronavirus spreads", "description": "The NHL is working on contingency plans in case the coronavirus becomes a more serious health threat in the United States and Canada.", "url": "https://www.espn.com/nhl/story/_/id/28823987/nhl-looking-plans-coronavirus-spreads", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0502%2Fr364785_1296x729_16%2D9.jpg", "publishedAt": "2020-03-02T23:09:49Z", "content": "BOCA RATON -- The NHL is \"starting to explore contingency plans\" should the coronavirus become a more significant health threat in North America ahead of the 2019-20 NHL playoffs, deputy commissioner Bill Daly told ESPN on Monday.\r\nDaly did not rule out sever… [+3676 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "USA Also Likely Has Thousands of Coronavirus Cases Already", "description": "Dr. Scott Gottlieb, member of the boards of Pfizer and biotech company Illumina and former FDA commissioner, and Dr. Matt McCarthy, an infectious disease physician, were on CNBC to discuss the latest... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2020/03/usa-also-likely-has-thousands-of-coronavirus-cases-already.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2020/01/HERO_coronavirus.jpg", "publishedAt": "2020-03-02T22:43:29Z", "content": "Dr. Scott Gottlieb, member of the boards of Pfizer and biotech company Illumina and former FDA commissioner, and Dr. Matt McCarthy, an infectious disease physician, were on CNBC to discuss the latest on the coronavirus outbreak. McCarthy and Gottlieb believe … [+2682 chars]"}, {"source": {"id": null, "name": "Nofilmschool.com"}, "author": "Daron James", "title": "Sigma Officially Confirms 120fps RAW Recording for fp", "description": "Sigma updates fp firmware roadmap with version 2.0. In unconfirmed reports it was suggested Sigma would be announcing a firmware update for the Sigma fp during CP+ which was cancelled due to the coronavirus threat. Several trade shows have been cancelled or p…", "url": "https://nofilmschool.com/sigma-fp-120fps-support", "urlToImage": "https://nofilmschool.com/sites/default/files/styles/facebook/public/sigma_fp.jpg?itok=uos-F-6p", "publishedAt": "2020-03-02T22:20:00Z", "content": "Sigma updates fp firmware roadmap with version 2.0. \r\nIn unconfirmed reports it was suggested Sigma would be announcing a firmware update for the Sigma fp during CP+ which was cancelled due to the coronavirus threat. Several trade shows have been cancelled or… [+911 chars]"}, {"source": {"id": null, "name": "Osnews.com"}, "author": "Thom Holwerda", "title": "Uyghurs for sale", "description": "The Chinese government has facilitated the mass transfer of Uyghur and other ethnic minority citizens from the far west region of Xinjiang to factories across the country. Under conditions that strongly suggest forced labour, Uyghurs are working in factories …", "url": "https://www.osnews.com/story/131455/uyghurs-for-sale/", "urlToImage": null, "publishedAt": "2020-03-02T22:42:27Z", "content": "The Chinese government has facilitated the mass transfer of Uyghur and other ethnic minority citizens from the far west region of Xinjiang to factories across the country. Under conditions that strongly suggest forced labour, Uyghurs are working in factories … [+694 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Dan Wasserman", "title": "Pence rolls out plan for coronavirus", "description": "Cartoonist Dan Wasserman's take on the news.", "url": "https://www.bostonglobe.com/2020/03/02/opinion/pence-rolls-out-plan-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/HHgHnFer-JcfS10N2-X67JHNGCY=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/LSGL2RPFMBD6TCKBLO73YL5JTM.jpg", "publishedAt": "2020-03-02T22:20:20Z", "content": "Follow Dan Wasserman on Twitter @WassermanToons."}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Coming in contact with people from all over the world, US airport workers are one of the most likely vectors fro the Coronavirus to spread to the wider population. So, you'll be thrilled to know almost none of them have PTO or health Insurance [Scary]", "description": "Coming in contact with people from all over the world, US airport workers are one of the most likely vectors fro the Coronavirus to spread to the wider population. So, you'll be thrilled to know almost none of them have PTO or health Insurance", "url": "https://www.fark.com/comments/10729846/Coming-in-contact-with-people-from-all-over-world-US-airport-workers-are-one-of-most-likely-vectors-fro-Coronavirus-to-spread-to-wider-population-So-youll-be-thrilled-to-know-almost-none-of-them-have-PTO-health-Insurance", "urlToImage": "https://fark-usrimg-850.nyc3.digitaloceanspaces.com/v/vc/fark_vcwN2TyO4qQnj816MDmRRmj3jHg.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583730000&Signature=EH4Xmly6jmt6HbVLGBgjcvDWXUA%3D", "publishedAt": "2020-03-02T22:50:07Z", "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links. This is the number of comments. Click here to read them.\r\n… [+117 chars]"}, {"source": {"id": null, "name": "Gaycities.com"}, "author": "Dan Renzi", "title": "These gays can save the world from coronavirus, with Naomi Campbell’s help", "description": "When supermodel Naomi Campbell, patron saint of drama queens everywhere, made a fun video of her pre-flight cleaning ritual, she demonstrated how she wipes down her seat, her overhead luggage bin, anything that she will touch on the flight. The video was met …", "url": "https://www.gaycities.com/outthere/50247/the-gays-are-going-to-save-the-world-from-the-coronavirus/", "urlToImage": "https://gaycities-blog-prodweb.imgix.net/outthere/content/uploads/2020/03/naomi_campbell-scaled.jpg?fit=crop&auto=format&auto=compress&crop=faces", "publishedAt": "2020-03-02T22:17:56Z", "content": "When supermodel Naomi Campbell, patron saint of drama queens everywhere, made a fun video of her pre-flight cleaning ritual, she demonstrated how she wipes down her seat, her overhead luggage bin, anything that she will touch on the flight. The video was met … [+3200 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "De Blasio: 'For a lot of people' coronavirus is 'manageable'", "description": "Mayor Bill de Blasio discusses the first coronavirus case in New York City.", "url": "http://www.msnbc.com/mtp-daily/watch/de-blasio-for-a-lot-of-people-coronavirus-is-manageable-79841861592", "urlToImage": null, "publishedAt": "2020-03-02T22:16:33Z", "content": null}, {"source": {"id": null, "name": "Cheezburger.com"}, "author": "Meeeeesh", "title": "Fifteen Parody Tweets About Coronavirus Using Classic Hit Songs", "description": "While the entire world freaks out about the Wuhan coronavirus, memers are using humor to mitigate the panicky feelings. And with the first confirmed case in New York City, those fears certainly aren't going to go away any time soon. Twitter user @actioncookbo…", "url": "https://cheezburger.com/10742277/fifteen-parody-tweets-about-coronavirus-using-classic-hit-songs", "urlToImage": "https://i.chzbgr.com/thumb800/10742277/h7777518A/funny-parody-tweets-about-coronavirus-featuring-the-center-for-disease-control-and-hit-songs", "publishedAt": "2020-03-02T23:00:00Z", "content": "While the entire world freaks out about the Wuhan coronavirus, memers are using humor to mitigate the panicky feelings. And with the first confirmed case in New York City, those fears certainly aren't going to go away any time soon. \r\nTwitter user @actioncook… [+180 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Priyanka Dayal McCluskey", "title": "Baker says state is preparing for ‘all possible scenarios’ of the coronavirus", "description": "Governor Baker says the risk for contracting the novel coronavirus in Massachusetts remains low but that vowed state officials are preparing for \"any and all possible scenarios.”", "url": "https://www.bostonglobe.com/2020/03/02/metro/baker-says-state-is-preparing-all-possible-scenarios-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/d4y-RX7pNNJCKNiDAEPBb33TmFQ=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/HAXPNDKMBNGWNG7UGOR6XQGPJE.JPG", "publishedAt": "2020-03-02T22:20:59Z", "content": "Governor Charlie Baker on Monday said the risk for contracting the novel coronavirus in Massachusetts remains low but vowed state officials are preparing for \"any and all possible scenarios.\r\nWeve been actively planning to ensure Massachusetts is prepared to … [+1349 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Chris Arnold", "title": "Mortgage Rates Are Near All-Time Lows As Coronavirus Worries Hit Markets", "description": "Coronavirus fears have sent stock markets reeling, but they're also pushing mortgage rates down near historic lows. That's an opportunity for homebuyers and homeowners.", "url": "https://www.npr.org/2020/03/02/811223836/mortgage-rates-are-near-all-time-lows-as-coronavirus-worries-hit-markets", "urlToImage": "https://media.npr.org/assets/img/2020/03/02/rtr3hybz_wide-4f81c9cc9e5dcb3edcf7a4c3aef7f97a94257d1d.jpg?s=1400", "publishedAt": "2020-03-02T22:49:15Z", "content": "Coronavirus fears have sent stock markets plummeting last week, but they're also pushing mortgage rates down near historic lows. That's an opportunity for homebuyers and homeowners.\r\nSteve Dipaola/Reuters\r\nA dramatic drop in mortgage rates may give prospectiv… [+3971 chars]"}, {"source": {"id": null, "name": "Macdailynews.com"}, "author": "MacDailyNews", "title": "Woz and his wife may be the first U.S. COVID-19 coronavirus cases", "description": "Apple co-founder Steve Wozniak today tweeted that he and his wife may have the first in the U.S. - patients zero - to have the COVID-19 coronavirus … The post Woz and his wife may be the first U.S. COVID-19 coronavirus cases appeared first on MacDailyNews.", "url": "https://macdailynews.com/2020/03/02/woz-and-his-wife-may-be-the-first-u-s-covid-19-coronavirus-cases/", "urlToImage": "https://149359564.v2.pressablecdn.com/wp-content/uploads/2017/07/170719_woz.jpg", "publishedAt": "2020-03-02T22:19:43Z", "content": "Apple co-founder Steve “Woz” Wozniak today tweeted that he and his wife may have the first in the U.S. – patients zero – to have the COVID-19 coronavirus after returning from a trip to China.\r\nChecking out Janets bad cough. Started Jan. 4. We had just returne… [+2585 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Bess Levin", "title": "Report: Rich Americans Trying to Get the Coronavirus Vaccine Early Like It’s a Pair of Limited Edition Air Jordans", "description": "Billionaires would like to jump the line, please.", "url": "https://www.vanityfair.com/news/2020/03/rich-people-coronavirus", "urlToImage": "https://media.vanityfair.com/photos/5b6090f13368540bfc7d2720/16:9/w_1280,c_limit/stevemnuchincapitalgains.jpg", "publishedAt": "2020-03-02T22:11:45Z", "content": "Charles Stevenson, an investor who was the longtime board president at a Park Avenue co-op thats home to several billionaires, has been staying in Southampton. I dont feel concerned at the momentits not near me right now, Stevenson said. If people in the vill… [+2045 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribers)", "title": "Oxford Immunotec Global PLC (OXFD) Q4 2019 Earnings Call Transcript", "description": "OXFD earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/03/02/oxford-immunotec-global-plc-oxfd-q4-2019-earnings.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-03-02T23:00:14Z", "content": "Image source: The Motley Fool.\r\nOxford Immunotec Global PLC (NASDAQ:OXFD)Q4 2019 Earnings CallMar 2, 2020, 8:00 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nGood mor… [+42626 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Austrolib", "title": "Gold Is At All Time Highs In Real Terms Despite Friday's Selloff", "description": "The gold price in terms of real assets, meaning other commodities, was at all time record highs until Friday's pullback.Gold priced in real assets since 2008 shows that tops have not led to lasting corrections in the dollar price of gold. We'll see what happe…", "url": "https://seekingalpha.com/article/4328968-gold-is-all-time-highs-in-real-terms-despite-fridays-selloff", "urlToImage": "https://static3.seekingalpha.com/images/marketing_images/mining_minerals/precious_metals.jpeg", "publishedAt": "2020-03-02T22:13:53Z", "content": "When we think of the great gold bull market of the past nearly 20 years, we almost always think of it in terms of the US dollar. Myself included, and I am no fan of the US dollar at all. True gold bugs know the key pivot dates very well. Most of us even know … [+7013 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Zoe Tidman, Zoe Tidman", "title": "Less than 1% of doctors feel NHS is well prepared for coronavirus, poll shows", "description": "Common concerns include bed shortages and not enough staff", "url": "https://www.independent.co.uk/news/health/coronavirus-doctors-uk-nhs-hospitals-outbreak-preparations-a9370986.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/21/coronavirus-london.jpg", "publishedAt": "2020-03-02T23:03:27Z", "content": "Less than 1 per cent of doctors feel that the NHS is well prepared for the new coronavirus, according to a new poll. \r\nEight out of the 1,618 respondents said they believed the health service was ready to deal with an outbreak when asked by The Doctors' Assoc… [+2183 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Danielle Zoellner, Danielle Zoellner", "title": "'He will lose the election': Trump won't win 2020 because of coronavirus, 'Dr Doom' economist predicts", "description": "Nouriel Roubini says the virus will hurt the president's re-election efforts", "url": "https://www.independent.co.uk/news/world/americas/us-election/trump-2020-election-coronavirus-lose-dr-doom-a9371041.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/22/gettyimages-83492460.jpg", "publishedAt": "2020-03-02T23:05:11Z", "content": "Economist Nouriel Roubini, who's nicknamed \"Dr Doom\" for his pessimistic predictions, has said the coronavirus will stop President Donald Trump from getting re-elected. \r\nThe academic is known for correctly predicting the 2008 housing crisis and recession, an… [+27113 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Tim O'Donnell", "title": "Americans are growing less confident in Trump’s coronavirus response, poll shows", "description": "Approval rating for the coronavirus response from President Trump and the Centers for Disease Control are dipping, a new poll released by Morning Consult on Monday shows.\nOf those surveyed, 49 percent approved of the job Trump is doing to prepare the U.S. for…", "url": "https://theweek.com/speedreads/899542/americans-are-growing-less-confident-trumps-coronavirus-response-poll-shows", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1204818081.jpg?itok=t3OBBR0N", "publishedAt": "2020-03-02T22:12:56Z", "content": "The Recording Academy is officially playing its ousted CEO off. \r\nJust before the 2020 Grammys in January, Deborah Dugan was placed on administrative leave as the head of the organization that puts on the show, with the Recording Academy citing \"a formal alle… [+1499 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US Vice President Mike Pence Holds Briefing on Coronavirus - Video", "description": "The virus was first registered in the Chinese city of Wuhan, Hubei province, in late December, later reaching more than 40 countries around the globe.", "url": "https://sputniknews.com/us/202003021078455681-us-vice-president-mike-pence-holds-briefing-on-coronavirus---video/", "urlToImage": "https://cdn5.img.sputniknews.com/images/107843/64/1078436471.jpg", "publishedAt": "2020-03-02T22:30:54Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Nicole Yang", "title": "Celtics bring in doctor to prepare and protect against coronavirus", "description": "Kemba Walker joked that he may be taking a break from signing autographs — or at least bringing his own pen.", "url": "https://www.bostonglobe.com/2020/03/02/sports/celtics-bring-doctor-prepare-protect-against-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/2FObfiahaObot9PJaFvZt9_1df4=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/HU2MO3Q2MAHUKW6CITCEEDRPZQ.jpg", "publishedAt": "2020-03-02T22:19:01Z", "content": "A doctor visited the Auerbach Center Monday afternoon to educate the Celtics about the outbreak of the new coronavirus.\r\n\"We just had a doc in here today to talk about it, to give the facts about it,\" coach Brad Stevens said. \"We're treating it, from our stan… [+1332 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "GuruFocus.com", "title": "The Supply Chain Problem: How a Coronavirus-Driven Recession Would Present Unique Challenges", "description": "Collapsing factory production levels may change the playing field for investors Continue reading...", "url": "https://finance.yahoo.com/news/supply-chain-problem-coronavirus-driven-222059868.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/DwWm6Ks83Huzpr6QS19hYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NjA-/https://s.yimg.com/uu/api/res/1.2/2Qs2kcOEvfSw3UUVrIbk4w--~B/aD0zODA7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/us.finance.gurufocus/fde9d26ee1fa3d9eae0d4428dbecdc84", "publishedAt": "2020-03-02T22:20:59Z", "content": "The last few recessions in U.S. history happened for various reasons, but in the end, they were all due to sudden reductions in demand. However, despite reduction in demand, there was no upfront squeeze from supply reduction - that didn't happen until after d… [+8533 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bryan Hood", "title": "The Louvre Closes After Staff Threaten to Walk Out Because of Coronavirus Fears", "description": "Workers at the museum voted “almost unanimously” not to open on Sunday and Monday.", "url": "https://www.yahoo.com/lifestyle/louvre-closes-staff-threaten-walk-223002383.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HpQeOMrKmfR3I6NUB59yZg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuMzY-/https://s.yimg.com/uu/api/res/1.2/vNFvQ2rLeX6_grNPgKYjzw--~B/aD01NjI7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/robb_report_967/4d9f2829e2423e86dcbef346c1164109", "publishedAt": "2020-03-02T22:30:02Z", "content": "Click here to read the full article. \r\nAs the coronavirus outbreak widens across the world, national and local governments are starting to take drastic measures to stop it in its tracks. Now, in Europe, where cases have started to surge over the last week, fe… [+2226 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tim O'Donnell", "title": "Americans are growing less confident in Trump's coronavirus response, poll shows", "description": "Approval ratings for the coronavirus response from President Trump and the Centers for Disease Control are dipping, a new poll released by Morning Consult on Monday shows.Of those surveyed, 49 percent approved of the job Trump is doing to prepare the U.S. for…", "url": "https://news.yahoo.com/americans-growing-less-confident-trump-221200654.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CSUqccreEtlczE.DXuU7GA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/Bg6mwEroNDReaEZNXnrstg--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/c7ea37a723c639ad9c3ee21f1ceb985f", "publishedAt": "2020-03-02T22:12:00Z", "content": "Approval ratings for the coronavirus response from President Trump and the Centers for Disease Control are dipping, a new poll released by Morning Consult on Monday shows.\r\nOf those surveyed, 49 percent approved of the job Trump is doing to prepare the U.S. f… [+871 chars]"}, {"source": {"id": null, "name": "Csmonitor.com"}, "author": "Ann Scott Tyson, Sara Miller Llana", "title": "Containing coronavirus: Where democracy struggles – and thrives - The Christian Science Monitor", "description": "Coronavirus poses different challenges for democracies than for China, where COVID-19 began, as they balance public health with individual rights.", "url": "https://www.csmonitor.com/World/2020/0302/Containing-coronavirus-Where-democracy-struggles-and-thrives", "urlToImage": "https://images.csmonitor.com/csm/2020/03/0203%20Belgium_Europe_Virus_Outbreak.jpg?alias=standard_900x600", "publishedAt": "2020-03-02T22:48:00Z", "content": "As Washington state grapples with coronavirus, Americans are getting their first up-close look at life amid an outbreak  and how the country might balance public health safety with personal liberties.\r\nSix people in the state have died, the first coronavirus-… [+9570 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Hanna Krueger", "title": "Local health boards to decide whether students should self-quarantine after travel to high-risk coronavirus countries", "description": "Gov. Charlie Baker and state health officials have been in constant contact with the CDC and the White House as the coronavirus spreads and protocols solidify around the country.", "url": "https://www.bostonglobe.com/2020/03/02/metro/local-health-boards-decide-whether-students-should-self-quarantine-after-travel-high-risk-coronavirus-countries/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=140", "publishedAt": "2020-03-02T22:50:29Z", "content": "For now, local health boards are calling the shots on whether students who have traveled to high-risk coronavirus countries should self-quarantine or not. A handful of Massachusetts schools instituted the protocol after two people from a Catholic school in Rh… [+1308 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BIG STORY: Quarantine 24 hours in Wuhan - CGTN America", "description": "BIG STORY: Quarantine 24 hours in Wuhan CGTN America COVID-19 | Wuhan closes makeshift hospital as new cases in China drop sharply The Hindu More than 87000 COVID-19 cases worldwide; China reports 202 new cases and 42 deaths ARIRANG NEWS Travelers Begin Impor…", "url": "https://www.youtube.com/watch?v=y79eur0X8Zw", "urlToImage": "https://i.ytimg.com/vi/y79eur0X8Zw/maxresdefault.jpg", "publishedAt": "2020-03-02T22:55:55Z", "content": null}]