[{"source": {"id": "reuters", "name": "Reuters"}, "author": "Syed Raza Hassan", "title": "Pakistan's largest city shuts schools for two weeks over virus fears", "description": "Pakistan's southern province of Sindh extended the closure of all educational institutions following the confirmation of a second coronavirus case in Karachi, the country's largest city.", "url": "https://www.reuters.com/article/us-health-coronavirus-pakistan-idUSKBN20P1HK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T11:08:19Z", "content": "KARACHI, Pakistan (Reuters) - Pakistan’s southern province of Sindh extended the closure of all educational institutions following the confirmation of a second coronavirus case in Karachi, the country’s largest city. \r\nPakistan has confirmed four cases of cor… [+1231 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "1501 infected, 66 dead from coronavirus in Iran: state TV", "description": "Sixty six people have died and 1501 people have been infected by coronavirus in Iran, Deputy Health Minister Alireza Raisi said in an announcement on state TV.", "url": "https://www.reuters.com/article/us-health-coronavirus-iran-idUSKBN20P1E6", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497699266&w=1200&r=LYNXMPEG21101", "publishedAt": "2020-03-02T10:38:23Z", "content": "DUBAI (Reuters) - Sixty six people have died and 1501 people have been infected by coronavirus in Iran, Deputy Health Minister Alireza Raisi said in an announcement on state TV. \r\n“The definite latest numbers we have are 523 new infections and 12 new deaths s… [+130 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraq announces two new coronavirus cases - Health Ministry", "description": "Iraq has detected two new coronavirus patients, both of whom had recently visited Iran, the Health Ministry said on Monday, bringing the total cases recorded so far to 21.", "url": "https://www.reuters.com/article/us-health-coronavirus-iraq-idUSKBN20P168", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T11:03:07Z", "content": "BAGHDAD (Reuters) - Iraq has detected two new coronavirus patients, both of whom had recently visited Iran, the Health Ministry said on Monday, bringing the total cases recorded so far to 21. \r\nThe two new cases were detected in Baghdad and had recently retur… [+267 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iceland confirms first three cases of coronavirus, in patients returning from Italy", "description": "The first three cases of people infected with coronavirus have been confirmed in Iceland, the country's Department of Civil Protection and Emergency Management said in a statement late on Sunday.", "url": "https://www.reuters.com/article/uk-health-coronavirus-iceland-idUSKBN20P195", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T11:03:07Z", "content": "COPENHAGEN (Reuters) - The first three cases of people infected with coronavirus have been confirmed in Iceland, the country’s Department of Civil Protection and Emergency Management said in a statement late on Sunday. \r\nThe first patient was diagnosed on Fri… [+205 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Confirmed coronavirus cases in Germany rise to 150: Robert Koch Institute", "description": "The number of confirmed coronavirus cases in Germany has risen to 150 on Monday from 129 on Sunday, the Robert Koch Institute for disease control said, adding that the risk from the virus in Germany is now \"moderate\".", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-cases-idUSKBN20P158", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T11:03:07Z", "content": "BERLIN (Reuters) - The number of confirmed coronavirus cases in Germany has risen to 150 on Monday from 129 on Sunday, the Robert Koch Institute for disease control said, adding that the risk from the virus in Germany is now “moderate”. \r\nMore than half of th… [+878 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sachin Ravikumar", "title": "India reports two more cases of coronavirus, taking tally to five", "description": "India reported two more cases of coronavirus on Monday, taking the number of people who have tested positive in the country to five, and hammering already rocky stock markets.", "url": "https://www.reuters.com/article/us-health-coronavirus-india-idUSKBN20P15O", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497700496&w=1200&r=LYNXMPEG210TC", "publishedAt": "2020-03-02T11:03:07Z", "content": "BENGALURU (Reuters) - India reported two more cases of coronavirus on Monday, taking the number of people who have tested positive in the country to five, and hammering already rocky stock markets. \r\nOne of the new cases was detected in the capital, New Delhi… [+1530 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sunghee Hwang", "title": "South Korean sect leader apologises over coronavirus spread", "description": "Shincheonji head Lee Man-hee's plea for forgiveness came after Seoul city authorities filed a murder complaint against him for failing to cooperate in containing the epidemic. South Korea's case numbers -- the largest total anywhere outside China -- are expec…", "url": "https://news.yahoo.com/south-korean-sect-leader-apologises-over-coronavirus-spread-080822873.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pavycNucn53lXXlmKP.s7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjA-/https://s.yimg.com/uu/api/res/1.2/yHY2Sfjc7XXNWUmVO8ydOg--~B/aD01MTY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/e5fb9502dc588b2105fc3212644f3e51750304be.jpg", "publishedAt": "2020-03-02T10:37:22Z", "content": "Seoul (AFP) - The elderly leader of a secretive South Korean sect linked to more than half the country's 4,000-plus coronavirus cases knelt before the cameras Monday to apologise for the spread of the disease.\r\nShincheonji head Lee Man-hee's plea for forgiven… [+3193 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bill Bostock", "title": "A member of the inner circle of Iran's Supreme Leader died of the coronavirus, as the country records more deaths than anywhere outside China", "description": "A top adviser to Iranian Supreme Leader Ayatollah Ali Khamenei died of coronavirus on Monday. Mohammad Mirmohammadi, 71, is among a growing number of government officials to contract the virus. He is the first to die. Iran has logged more deaths than anywhere…", "url": "https://www.businessinsider.com/iran-supreme-leader-khamenei-inner-circle-first-death-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e5cd44bfee23d50fa7e9235?width=1200&format=jpeg", "publishedAt": "2020-03-02T10:41:17Z", "content": "A close adviser to Iran's Supreme Leader Ayatollah Ali Khamenei has died of the coronavirus, as the country continues to record a higher death toll than anywhere outside of China.\r\nMohammad Mirmohammadi, 71, died in hospital in Tehran on Monday, The Associate… [+3074 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Samuel Lovett", "title": "‘Seriously people’: Health chief urges people to stop buying face masks as coronavirus sweeps globe", "description": "America’s top doctor has urged people to stop buying face masks, insisting they “are not effective in preventing” the spread of coronavirus among the general population.Dr Jerome Adams, the surgeon general of the US, has echoed the Centers for Disease Control…", "url": "https://news.yahoo.com/seriously-people-health-chief-urges-104555663.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/d4wxRz9vndadJ1VSsxYhQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/5knwKQGU5J_tytz9GkzbXw--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/b717914658601690b79e5d6c903b62d3", "publishedAt": "2020-03-02T10:45:55Z", "content": "Getty\r\nAmericas top doctor has urged people to stop buying face masks, insisting they are not effective in preventing the spread of coronavirus among the general population.\r\nDr Jerome Adams, the surgeon general of the US, has echoed the Centers for Disease C… [+3088 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "'There's nothing really to be relieved about': Stocks climb on hopes of coronavirus stimulus, but analysts fear the rally is premature", "description": "Stocks recovered on Monday after central bankers promised to protect their economies against the coronavirus outbreak. US, Japanese, and British authorities said they would intervene as needed to provide liquidity and stabilize markets. Italian officials plan…", "url": "https://markets.businessinsider.com/news/stocks/stocks-rise-coronavirus-stimulus-hopes-rally-may-be-premature-2020-3-1028954296", "urlToImage": "https://images.markets.businessinsider.com/image/5e5ce05dfee23d631734d812-2000/gettyimages-885636516.jpg", "publishedAt": "2020-03-02T10:55:43Z", "content": "Spencer Platt / Getty Images\r\n<ul><li>Stocks recovered on Monday after central bankers promised to protect their economies against the coronavirus outbreak.</li><li>US, Japanese, and British authorities said they would intervene as needed to provide liquidity… [+4143 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ed Mazza", "title": "‘He Just F**ked Right Off!’ John Oliver Torches Trump’s Coronavirus Disaster", "description": "The \"Last Week Tonight\" host rips the administration's response to a growing COVID-19 threat.", "url": "https://www.huffpost.com/entry/john-oliver-coronavirus_n_5e5caa32c5b6450a30c11f23", "urlToImage": "https://img.huffingtonpost.com/asset/5e5cd4c023000038110bf706.jpeg?cache=YiBWhTqjOD&ops=1200_630", "publishedAt": "2020-03-02T10:36:47Z", "content": "John Oliver tore into President Donald Trump’s confusing response to the ongoing COVID-19 crisis on Sunday night. \r\n“This is a bad time to have a president who cannot speak clearly,” Oliver said. “Because there’s already enough bad information flying around.”… [+1163 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "EU ministers to discuss coronavirus as concerns mount in Europe", "description": "European Union ministers will discuss possible responses to the coronavirus outbreak in extraordinary meetings this week, a sign of growing concern over the epidemic's spread to most EU countries. Such a degree of activity in the EU has not been seen Europe's…", "url": "https://news.yahoo.com/eu-ministers-discuss-coronavirus-concerns-104221056.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aw1xBGb4c_yZLI3ADeFL0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzI-/https://s.yimg.com/uu/api/res/1.2/w2KYlTOqpeqJofbnxowlHQ--~B/aD01NDU7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/c3afa84a2f95cf934a77da23f2903be3", "publishedAt": "2020-03-02T10:42:21Z", "content": "BRUSSELS (Reuters) - European Union ministers will discuss possible responses to the coronavirus outbreak in extraordinary meetings this week, a sign of growing concern over the epidemic's spread to most EU countries.\r\nThe spread of the virus raises questions… [+2040 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Anne Applebaum", "title": "Epidemics Reveal the Truth of the Societies They Hit", "description": "A nation’s response to disaster speaks to its strengths—and to its dysfunctions.", "url": "https://www.theatlantic.com/ideas/archive/2020/03/italys-response-to-coronavirus/607306/", "urlToImage": "https://cdn.theatlantic.com/thumbor/WlehHdvyb2IW9IXhxKFV425EBiE=/5x0:3542x1842/960x500/media/img/mt/2020/03/RTS33ESZ/original.jpg", "publishedAt": "2020-03-02T11:00:00Z", "content": "BOLOGNA, Italy—I am sitting in the middle of this northern Italian city, two hours’ drive from the Lombardian towns that have been quarantined. At this precise moment in time, Bologna has not produced a single incidence of coronavirus. One or two people with … [+10261 chars]"}, {"source": {"id": null, "name": "Imore.com"}, "author": "Oliver Haslam", "title": "LG, supplier of iPhone cameras, closes shop following coronavirus case", "description": "What you need to know LG Innotek makes camera modules for Apple's iPhones. Its factory in Gumi, South Korea has been closed. A worker was confirmed to have contracted coronavirus. It'll be closed until at least Tuesday. LG Innotek, a supplier of the camera mo…", "url": "https://www.imore.com/lg-innotek-supplier-iphone-cameras-closes-its-factory-after-coronavirus-case", "urlToImage": "https://www.imore.com/sites/imore.com/files/styles/large/public/field/image/2019/09/iphone-11-pro-midnight-green-camera.png?itok=5AM0n1vH", "publishedAt": "2020-03-02T10:33:35Z", "content": "LG Innotek, a supplier of the camera modules used in iPhones, has closed a factory in Gumi, South Korea. The move comes after a member of the factory's workforce was confirmed to have contracted coronavirus.\r\nThe factory closed over the weekend, according to … [+1082 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "How Coronavirus Is Weighing on South Korea's Auto Industry", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-02/how-coronavirus-is-weighing-on-south-korea-s-auto-industry-video", "urlToImage": null, "publishedAt": "2020-03-02T10:15:10Z", "content": null}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "Hong Kong Retail Sales Down 21.4% Due to Coronavirus", "description": "The health scare worsened an already weak environment for retail after months of often violent anti-government protests.", "url": "https://www.businessoffashion.com/articles/news-analysis/hong-kong-retail-sales-down-due-to-coronavirus", "urlToImage": null, "publishedAt": "2020-03-02T10:24:23Z", "content": null}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "Nike Temporarily Closes European Headquarters Due to Coronavirus", "description": "The sportswear giant’s office in the Netherlands will be shut down following the news that an employee is infected with the virus.", "url": "https://www.businessoffashion.com/articles/news-analysis/nike-temporarily-closes-european-headquarters-due-to-coronavirus", "urlToImage": null, "publishedAt": "2020-03-02T10:33:03Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Is Spreading: Should You Wear a Face Mask?", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-02/masks-only-work-up-to-a-point-cell-biologist-says-video", "urlToImage": null, "publishedAt": "2020-03-02T11:00:18Z", "content": null}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Peter Morici", "title": "Peter Morici: Trump’s campaign may be banking too much on a strong economy", "description": "President Donald Trump is counting on a strong economy to propel his re-election, but this economic optimism ignores increasingly tough structural challenges and creeping decadence.", "url": "https://www.marketwatch.com/story/trumps-campaign-may-be-banking-too-much-on-a-strong-economy-2020-03-02", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB175_trump__ZG_20200228171244.jpg", "publishedAt": "2020-03-02T11:00:02Z", "content": "President Donald Trump says the coronavirus in under control and the economy will be fine.\r\nThe Trump administration entered 2020 confident a strong economy could carry the president to re-election.\r\nGovernment officials, business leaders and academics partic… [+4520 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Azlan Shah Cup hockey tournament postponed due to coronavirus", "description": "The Azlan Shah Cup hockey tournament became the latest sporting event to be affected by the novel coronavirus outbreak.", "url": "https://indianexpress.com/article/sports/hockey/azlan-shah-cup-hockey-tournament-postponed-due-to-coronavirus-6295579/", "urlToImage": "https://images.indianexpress.com/2019/03/india-poland-hockey-759.jpg?w=759", "publishedAt": "2020-03-02T10:29:40Z", "content": "By: PTI | \r\nPublished: March 2, 2020 3:59:40 pm\r\nIndia thrashed Poland 10-0 in their final round robin game at Sultan Azlan Shah Cup.The Azlan Shah Cup hockey tournament on Monday became the latest sporting event to be affected by the novel coronavirus outbre… [+2334 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Portugal registers first two cases of coronavirus: SIC television", "description": "Portugal registered its first two cases of the new coronavirus on Monday, SIC television channel reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-portugal-idUSKBN20P1BB", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T10:12:53Z", "content": "LISBON (Reuters) - Portugal registered its first two cases of the new coronavirus on Monday, SIC television channel reported. \r\nIt said one case was discovered in a man who had recently traveled to Italy and another one in a man who had returned from Spain. B… [+181 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Masked and gloved: Israelis in quarantine from coronavirus vote in election", "description": "Paramedics dressed in head-to-toe protective gear stood guard at dedicated polling stations where Israelis under quarantine from the coronavirus voted in Monday's election.", "url": "https://www.reuters.com/article/us-israel-election-health-coronavirus-idUSKBN20P1BZ", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T10:21:46Z", "content": "JERUSALEM (Reuters) - Paramedics dressed in head-to-toe protective gear stood guard at dedicated polling stations where Israelis under quarantine from the coronavirus voted in Monday’s election. \r\nOne by one, voters in face masks and gloves who have been isol… [+1461 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "EU ministers to discuss coronavirus as concerns mount in Europe", "description": "European Union ministers will discuss possible responses to the coronavirus outbreak in extraordinary meetings this week, a sign of growing concern over the epidemic's spread to most EU countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-eu-idUSKBN20P1F7", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497700088&w=1200&r=LYNXMPEG2110D", "publishedAt": "2020-03-02T10:42:21Z", "content": "BRUSSELS (Reuters) - European Union ministers will discuss possible responses to the coronavirus outbreak in extraordinary meetings this week, a sign of growing concern over the epidemic’s spread to most EU countries. \r\nThe spread of the virus raises question… [+2051 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Joe Wallace, Chong Koh Ping", "title": "Global Stocks Rebound on Stimulus Hopes - The Wall Street Journal", "description": "Global Stocks Rebound on Stimulus Hopes The Wall Street Journal Global stocks rebound as investors bet central banks will act over the coronavirus CNN Goldman economists expect Fed to cut rates soon to head off impact of outbreak MarketWatch Another Bad Week …", "url": "https://www.wsj.com/articles/treasury-yields-near-1-as-asian-markets-open-lower-11583114956", "urlToImage": "https://images.wsj.net/im-159359/social", "publishedAt": "2020-03-02T10:30:00Z", "content": "Global stocks stabilized Monday on hopes that central banks and governments will take steps to steady financial markets after last weeks rout and shield economic growth from the coronavirus epidemic.\r\nFutures tied to the S&amp;P 500 index rose 1.7%, signaling… [+270 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Apple CEO Tim Cook said the Trump administration directly intervened to help the iPhone maker break into India", "description": "Tim Cook said during an interview with Fox Business that the Trump administration enabled Apple to enter the Indian retail market. Previously Apple was only permitted to sell its devices in India via third parties, as local laws meant the firm would have to p…", "url": "https://www.businessinsider.com/tim-cook-trump-administration-helped-apple-break-the-indian-market-2020-3", "urlToImage": "https://i.insider.com/5dd65c61fd9db2198876c352?width=1200&format=jpeg", "publishedAt": "2020-03-02T10:57:32Z", "content": "The Trump administration helped Apple get a foothold in India, CEO Tim Cook told Fox Business in an interview recorded Thursday.\r\nThe tech giant announced last week that it would begin online sales in India this year, and aim to open its first store in the co… [+1488 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Apple Reportedly Releasing iPad Pro With Keyboard & Built-In Trackpad", "description": "Sources are reporting that Apple could be expected to update its iPad Pro with a keyboard and built-in trackpad. According to reports in The Information, the new technology could be paired with the next-generation iPad Pro, which is reported to release in lat…", "url": "https://hypebeast.com/2020/3/apple-ipad-pro-trackpad-keyboard-rumors-updates", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fapple-ipad-pro-trackpad-keyboard-rumors-updates-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-02T10:44:20Z", "content": "Sources are reporting that Apple could be expected to update its iPad Pro with a keyboard and built-in trackpad. According to reports in The Information, the new technology could be paired with the next-generation iPad Pro, which is reported to release in lat… [+694 chars]"}, {"source": {"id": null, "name": "Abc7ny.com"}, "author": null, "title": "Coronavirus News: Mayor de Blasio, Gov. Cuomo to give update on 1st NYC coronavirus case - WABC-TV", "description": "Coronavirus News: Mayor de Blasio, Gov. Cuomo to give update on 1st NYC coronavirus case WABC-TV New York governor confirms first coronavirus case in state Reuters First Coronavirus Case In New York Is Confirmed CBS New York First case of coronavirus confirme…", "url": "https://abc7ny.com/5978615", "urlToImage": "https://cdn.abcotvs.com/dip/images/5901059_013020-wabc-coronavirus-outbreak-generic-img.jpg?w=1600", "publishedAt": "2020-03-02T10:35:10Z", "content": "NEW YORK (WABC) -- The first case of coronavirus has been reported in New York City. Both Mayor Bill de Blasio and Governor Andrew Cuomo say that the risk to New Yorkers remains low.They will hold a press conference together Monday at 9:45 a.m. to provide an … [+10998 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Laura Begley Bloom, Contributor, Laura Begley Bloom, Contributor https://www.forbes.com/sites/laurabegleybloom/", "title": "Coronavirus And Travel: The Scary Facts (And The Reassuring Ones)", "description": "Experts share coronavirus news and information—good and bad—about what it means for cruise ships, airplanes and travel in general.", "url": "https://www.forbes.com/sites/laurabegleybloom/2020/03/02/coronavirus-travel-scary-facts-advice/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1204387350%2F960x0.jpg", "publishedAt": "2020-03-02T11:00:00Z", "content": "A traveler wears a traveler in an airport during the coronavirus crisis.\r\nGetty\r\nWith reports emerging of two deaths in the US due to novel coronavirus (also known as COVID-19) and cases of coronavirus exploding around the country and around the globe, travel… [+20168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Tourist in Milan: Who cares about coronavirus?", "description": "Tourists in Milan, Italy, seem to be shrugging off fears of the novel coronavirus, which has killed over 3,000 people worldwide, the vast majority in mainland China. CNN's Ben Wedeman reports from Milan.", "url": "https://www.cnn.com/videos/world/2020/03/02/coronavirus-outbreak-milan-italy-tourism-wedeman-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302103653-coronavirus-outbreak-milan-italy-tourism-wedeman-intl-ldn-vpx-00003422-super-tease.jpg", "publishedAt": "2020-03-02T10:55:10Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Skift.com"}, "author": "Rosie Spinks, Skift", "title": "European Tourism Losing More Than $1 Billion a Month From Virus: EU Commissioner", "description": "As the coronavirus enters its third full month, the tourism industry is able to more precisely quantify the scale of the financial impact.", "url": "https://skift.com/2020/03/02/european-tourism-losing-more-than-1-billion-a-month-from-virus-eu-commissioner/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/49600463532_109554c1d4_4k.jpg", "publishedAt": "2020-03-02T11:00:35Z", "content": "As the coronavirus enters its third full month affecting the globe, the tourism industry is able to more precisely quantify the scale of its financial impact.\r\nOn Monday, European commissioner for Internal Markets Thierry Breton told a French television stati… [+1130 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Airline body IATA calls on Mideast governments to help airlines handle coronavirus outbreak", "description": "Middle East governments should consider providing support to airlines to help them manage the impact of the coronavirus outbreak, which has led to a raft of flight cancellations, the industry's largest global body said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-airlines-middle-ea-idUSKBN20P1A9", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497699858&w=1200&r=LYNXMPEG2110U", "publishedAt": "2020-03-02T10:47:18Z", "content": "ABU DHABI (Reuters) - Middle East governments should consider providing support to airlines to help them manage the impact of the coronavirus outbreak, which has led to a raft of flight cancellations, the industry’s largest global body said on Monday. \r\nGloba… [+2097 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "India’s February unemployment rate rises to 7.78%, highest in 4 months", "description": "In rural areas, the unemployment rate increased to 7.37% in February from 5.97% in the previous month, while in urban areas, it fell to 8.65% from 9.70%, the data released by CMIE, a Mumbai-based private think-tank showed.", "url": "https://indianexpress.com/article/business/economy/india-unemployment-rate-jobs-crisis-youth-slowdown-6295653/", "urlToImage": "https://images.indianexpress.com/2020/03/jobs-1.jpg?w=759", "publishedAt": "2020-03-02T11:03:04Z", "content": "By: Reuters | New Delhi | \r\nUpdated: March 2, 2020 4:39:31 pm\r\nIndia’s economy expanded at its slowest pace in more than six years in the last three months of 2019, with analysts predicting further deceleration as the global coronavirus outbreak stifles growt… [+939 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "How Coronavirus Is Weighing on South Korea’s Auto Industry", "description": "Mar.02 -- KJ Hwang, head of research at CGS-CIMB Securities, discusses the spread of coronavirus and its impact on South Korea’s auto industry. He speaks on “Bloomberg Markets: Asia.”", "url": "https://finance.yahoo.com/video/coronavirus-weighing-south-korea-auto-102004996.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QISkiWwhEg.tfbg1olMIFA--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/02/5e5ce21669e6c51d61e0fe20/5e5ce21669e6c51d61e0fe21_o_U_v2.jpg", "publishedAt": "2020-03-02T10:20:04Z", "content": "Mar.02 -- KJ Hwang, head of research at CGS-CIMB Securities, discusses the spread of coronavirus and its impact on South Koreas auto industry. He speaks on Bloomberg Markets: Asia."}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Shock Exchange", "title": "Siemens Healthineers Is Too Pricey", "description": "SMMNY is generating solid top line growth.EBIT margins are falling due to negative mix at its largest operating segment.Potential headwinds from the coronavirus may not be priced in.At over 14x EBITDA, SMMNY is a sell.", "url": "https://seekingalpha.com/article/4328673-siemens-healthineers-is-too-pricey", "urlToImage": "https://static.seekingalpha.com/uploads/2020/2/27/3022051-15827965526599839_origin.jpg", "publishedAt": "2020-03-02T10:53:10Z", "content": "Siemens Mobile Head CT. Source: Siemens Healthineers\r\nSiemens Healthineers (OTCPK:SMMNY) (OTC:SEMHF) reported quarterly revenue of EUR 3.59 billion, non-GAAP EPS of EUR 0.35, and GAAP EPS of EUR 0.30. The stock is down about 5% since its earnings announcement… [+4627 chars]"}, {"source": {"id": null, "name": "Thismorningwithgordondeal.com"}, "author": "info@compassmedianetworks.com (Compass Media Networks), Gordon Deal", "title": "This Morning with Gordon Deal March 02, 2020", "description": "Pete Buttigieg ends Democratic presidential bid, coronavirus cases mount as second person dies in U.S., and how scammers could use coronavirus scare to steal your money.", "url": "http://www.thismorningwithgordondeal.com/programhighlights?pid=56549", "urlToImage": null, "publishedAt": "2020-03-02T11:07:00Z", "content": null}, {"source": {"id": null, "name": "Designtaxi.com"}, "author": null, "title": "Internet Users Are Designing And Selling Coronavirus-Themed Merchandise", "description": "Image via Young Merch Store The COVID-19 outbreak has taken the lives of over 3,000 people globally, and has left nearly 90,000 infected by the disease. The World Health Organization (WHO) has declared the epidemic to be a public health emergency worldwide. T…", "url": "https://designtaxi.com/news/408860/Internet-Users-Are-Designing-And-Selling-Coronavirus-Themed-Merchandise/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+designtaxi_news+%28TAXI+Daily+News%29", "urlToImage": "https://editorial.designtaxi.com/editorial-images/news-coronaviruss020320/babyyoda.jpg", "publishedAt": "2020-03-02T10:21:50Z", "content": "Image via Young Merch StoreThe COVID-19 outbreak has taken the lives of over 3,000 people globally, and has left nearly 90,000 infected by the disease. The World Health Organization (WHO) has declared the epidemic to be a public health emergency worldwide. \r\n… [+1892 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "Jamie Dettmer", "title": "Italy's Coronavirus Cases Jump 50% in One Day", "description": "The Italian government is ramping up public health measures in a bid to halt the abrupt spike in Coronavirus infections, which rose by 50% Sunday from 24 hours earlier, the biggest one day jump in cases since the virus emerged in Italy.\n\nItaly's Civil Protect…", "url": "https://www.voanews.com/science-health/coronavirus-outbreak/italys-coronavirus-cases-jump-50-one-day", "urlToImage": "https://media.voltron.voanews.com/Drupal/01live-166/reuters-pictures/2020/03/RTS34DLH.jpg", "publishedAt": "2020-03-02T10:22:17Z", "content": "ROME - The Italian government is ramping up public health measures in a bid to halt the abrupt spike in Coronavirus infections, which rose by 50% Sunday from 24 hours earlier, the biggest one day jump in cases since the virus emerged in Italy.\r\nItaly's Civil … [+4562 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Crude price check: Potential production cut by OPEC could push Brent to $55/bbl", "description": "The decision to not move the meeting up highlights the lack of urgency in the cartel for the coronavirus fears and waits to get a clear picture on how long coronavirus will have an impact.", "url": "https://www.moneycontrol.com/news/business/commodities/crude-price-check-potential-production-cut-by-opec-could-push-brent-to-55bbl-4992831.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/10/Oil-Crude-Oil-770x433.jpg", "publishedAt": "2020-03-02T10:27:29Z", "content": "Navneet Damani\r\nChina's shutdown puts OPEC and allies nations in an awkward position. Markets keep on assuming the virus clears up pretty quickly, but as the spread of the virus to Italy and Korea accelerate, the crisis could continue to grow worse. OPEC is w… [+7423 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Muyu Xu", "title": "More traffic, night lights show China's factories restart as new virus cases drop", "description": "Nearly 300 million people have gone back to work in China since the Lunar New Year break as more companies restart business and coronavirus travel restrictions ease, although many small firms are still struggling to find enough workers to run plants.", "url": "https://www.reuters.com/article/us-health-coronavirus-china-bigdata-idUSKBN20P1GE", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497701972&w=1200&r=LYNXMPEG2112N", "publishedAt": "2020-03-02T11:03:57Z", "content": "BEIJING/SINGAPORE (Reuters) - Nearly 300 million people have gone back to work in China since the Lunar New Year break as more companies restart business and coronavirus travel restrictions ease, although many small firms are still struggling to find enough w… [+4709 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louis Chilton, Louis Chilton", "title": "John Oliver skewers Trump's coronavirus comments: 'He's a president whose entire life has been a series of low-stakes lies'", "description": "The comedian made fun of the US President's misleading reaction to the coronavirus outbreak", "url": "https://www.independent.co.uk/arts-entertainment/films/news/john-oliver-trump-coronavirus-news-last-week-tonight-a9368816.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/10/john-oliver-trump.jpg", "publishedAt": "2020-03-02T11:03:52Z", "content": "John Oliver has skewered Donald Trumps recent coronavirus comments, saying: This is a bad time to have a president who cannot speak clearly.\r\nSpeaking on his late night comedy series Last Week Tonight With John Oliver, the British-American comic highlighted s… [+1230 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " John Mulaney on SNL: 3 Sketches You Have to See via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_d25c7cf8b73c50f60c1b857229ae4366", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-02T11:10:13Z", "content": "Rhode Island, Coronavirus\r\nPROVIDENCE, R.I. (AP) Rhode Island has its first confirmed case of the new COVID-19 virus, state public health officials announced Sunday,..."}, {"source": {"id": null, "name": "Whtc.com"}, "author": "Thomson Reuters", "title": "Goldman Sachs halts all non-essential business travel: memo - WHTC News", "description": "LONDON (Reuters) - Goldman Sachs Group Inc  has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.\nThe \"precautionary measures\" come as global businesses take more sweeping steps to help prevent the…", "url": "https://whtc.com/news/articles/2020/mar/02/goldman-sachs-halts-all-non-essential-business-travel-memo/990127/?refer-section=business", "urlToImage": "https://radiocms-images.us1.eldarioncloud.com/resize/1200/https://storage.googleapis.com/media.mwcradio.com/mimesis/2020-03/02/2020-03-02T105130Z_1_LYNXMPEG21116_RTROPTP_3_GOLDMAN-SACHS-DEALS.JPG?upscale=False", "publishedAt": "2020-03-02T10:52:08Z", "content": "LONDON (Reuters) - Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.\r\nThe \"precautionary measures\" come as global businesses take more sweeping steps to help prevent the… [+869 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Second death from coronavirus reported in U.S.", "description": "Dr. Amesh Adalja from Johns Hopkins Center for Health Security discusses the latest coronavirus developments.", "url": "http://www.msnbc.com/morning-joe-first-look/watch/second-death-from-coronavirus-reported-in-u-s-79798341658", "urlToImage": null, "publishedAt": "2020-03-02T10:59:39Z", "content": null}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Donald Kirk", "title": "South Korea’s Creepy Coronavirus Cellphone Alerts are Useful, But They May Be TMI", "description": "SeongJoon Cho SEOUL–In high-tech South Korean society millions of mobile phones are beeping at once with the disturbing words “Emergency Alert.” In the midst of a medical crisis that refuses to go away, the messages are more than urgent warnings to wash hands…", "url": "https://www.thedailybeast.com/south-koreas-creepy-coronavirus-cellphone-alerts-may-be-too-much-information", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583142344/200301-kirk-korea-coronovirus-tease_e8tyze", "publishedAt": "2020-03-02T10:49:32Z", "content": "SEOULIn high-tech South Korean society millions of mobile phones are beeping at once with the disturbing words Emergency  Alert.\r\nIn the midst of a medical crisis that refuses to go away, the messages are more than urgent warnings to wash hands and avoid crow… [+4927 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Goldman Sachs halts all non essential business travel - memo", "description": "Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.  The \"precautionary measures\" come as global businesses take more sweeping steps to help prevent the spread of coronavi…", "url": "https://finance.yahoo.com/news/goldman-sachs-halts-non-essential-101542541.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-02T10:15:42Z", "content": "LONDON, March 2 (Reuters) - Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.\r\nThe \"precautionary measures\" come as global businesses take more sweeping steps to help pr… [+877 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Sarah Hoyt", "title": "WELL, DUH. AND AMAZON TOO: Coronavirus Outbreak Benefits Netflix, Other ‘Stay-at-Home’ Compani…", "description": "WELL, DUH. AND AMAZON TOO: Coronavirus Outbreak Benefits Netflix, Other ‘Stay-at-Home’ Companies.", "url": "https://pjmedia.com/instapundit/360062/", "urlToImage": null, "publishedAt": "2020-03-02T11:00:57Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "China closes 1st ‘pop-up’ coronavirus hospital, built in 10 days, after last group of recovered patients discharged", "description": "Authorities in Wuhan have closed the city’s first makeshift hospital after discharging the last batch of 34 recovered coronavirus patients, as the rate of infection in the city has dropped dramatically. Read Full Article at RT.com", "url": "https://www.rt.com/news/482093-china-closes-first-wuhan-hospital/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5cdf6020302707804e1498.JPG", "publishedAt": "2020-03-02T11:02:09Z", "content": "Wuhan was the site of the original outbreak of the coronavirus epidemic, and the city’s response, building a new hospital in less than two weeks to handle Covid-19 patients, was seen as a modern marvel with the total number of hospital beds in the city eventu… [+1192 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Syed Raza Hassan", "title": "Pakistan's largest city shuts schools for two weeks over virus fears", "description": "Pakistan's southern province of Sindh extended the closure of all educational institutions following the confirmation of a second coronavirus case in Karachi, the country's largest city. Pakistan has confirmed four cases of coronavirus, three of them involvin…", "url": "https://news.yahoo.com/pakistans-largest-city-shuts-schools-110647145.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MIIQRybhJGjXIugy1tPh1A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuMg--/https://s.yimg.com/uu/api/res/1.2/e5IU1zT6t.a7EkjhLLzUfg--~B/aD01MzI7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/7a950619c3c89dd465d3b71bc2d1590f", "publishedAt": "2020-03-02T11:06:47Z", "content": "By Syed Raza Hassan\r\nKARACHI, Pakistan (Reuters) - Pakistan's southern province of Sindh extended the closure of all educational institutions following the confirmation of a second coronavirus case in Karachi, the country's largest city.\r\nPakistan has confirm… [+1245 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "India reports two more cases of coronavirus, taking tally to five", "description": "India reported two more cases of coronavirus on Monday, taking the number of people who have tested positive in the country to five, and hammering already rocky stock markets.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/0WqnkoBvfes/india-reports-two-more-cases-of-coronavirus-taking-tally-to-five-idUSKBN20P15O", "urlToImage": null, "publishedAt": "2020-03-02T11:03:07Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Luke Andrews For Mailonline", "title": "Train passenger flosses her teeth on a London-bound rush hour service packed with commuters", "description": "The woman was filmed flossing her teeth on the 8am Reading to London Paddington train on Thursday last week. Her actions were branded 'beyond appalling' by fellow passengers.", "url": "https://www.dailymail.co.uk/news/article-8064789/Train-passenger-flosses-teeth-London-bound-rush-hour-service-packed-commuters.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/02/10/25423324-0-image-a-29_1583146599426.jpg", "publishedAt": "2020-03-02T11:01:29Z", "content": "A woman has been filmed flossing her teeth on a packed commuter train to London Paddington.\r\nShocking footage, filmed on a mobile phone, also shows the woman picking at her teeth and placing her fingers inside her mouth. \r\nIt comes after the UK reported 13 ne… [+2240 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Michael Alexander", "title": "Did California's \"outbreak\" patient infect dozens of hospital workers in Sacramento?", "description": "(Natural News) Those in the frontlines in the fight against the COVID-19 outbreak may have been infected after a woman from California tested positive for the novel coronavirus infection. The woman, who is now critically ill with the coronavirus, was hospital…", "url": "https://www.naturalnews.com/2020-03-02-did-californias-outbreak-patient-infect-dozens-of-hospital-workers-sacramento.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Coronavirus-Nurse-Doctor-Stethoscope-Sick-Cough-Sneeze.jpg", "publishedAt": "2020-03-02T10:54:03Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Bank of England says working with international partners on coronavirus", "description": "The Bank of England said it was working with Britain's finance ministry and international partners to make sure \"all necessary steps are taken\" to protect its banking system and the broader economy from the impact of coronavirus. European shares steadied on M…", "url": "https://finance.yahoo.com/news/bank-england-says-working-international-101536264.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/u.b6vCCCMuin2bxWMBv1Cw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/bIjR1p17W9yArc2DI5.FBQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/4b34977927961680d9748738ff51c2a5", "publishedAt": "2020-03-02T10:15:36Z", "content": "LONDON (Reuters) - The Bank of England said it was working with Britain's finance ministry and international partners to make sure \"all necessary steps are taken\" to protect its banking system and the broader economy from the impact of coronavirus.\r\nEuropean … [+1950 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Leigh Thomas", "title": "Global growth plunging into downturn over coronavirus, OECD says", "description": "The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development (OECD) warned on Monday, urging governments and central banks to fight back to avoid an…", "url": "https://finance.yahoo.com/news/global-growth-plunging-downturn-over-102132670.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xdY9FC9dDru2J_kfQ7FHAQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzMuNg--/https://s.yimg.com/uu/api/res/1.2/xEE39VqXkG08ocj0P5cNtg--~B/aD01NDY7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/86b2ab0d8c72793e01d2bf0108352705", "publishedAt": "2020-03-02T10:21:32Z", "content": "By Leigh Thomas\r\nPARIS (Reuters) - The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development warned on Monday, urging governments and central ban… [+3416 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "The incredibly bullish force investors can't afford to ignore: Morning Brief", "description": "Top news and what to watch in the markets on Monday, March 2, 2020.", "url": "https://finance.yahoo.com/news/stock-market-bullish-human-resilience-long-term-morning-brief-110325830.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/65htNr2YmxjyLk2cUFS.2w--~B/aD0xMDA3O3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-03/b3c4c1d0-5bc6-11ea-bfff-a78fa65d2c38", "publishedAt": "2020-03-02T11:03:25Z", "content": "Monday, March 2, 2020\r\nGet the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe\r\nDont underestimate the power of human resilience\r\nThe spread of COVID-19 has contributed to world markets plummeting at a historic pace… [+4840 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Leigh Thomas", "title": "Global growth plunging into downturn over coronavirus, OECD says", "description": "The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development warned on Monday, urging governments and central banks to fight back to avoid an even s…", "url": "https://finance.yahoo.com/news/global-growth-plunging-downturn-over-102657256.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BXAtfqocB6TcGK4RwQywAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODkuNg--/https://s.yimg.com/uu/api/res/1.2/xbEb9xQe8eirGUc7aY2IWw--~B/aD01NTY7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/22dc6164b35e87a73e1b2b877d82fb09", "publishedAt": "2020-03-02T10:26:57Z", "content": "By Leigh Thomas\r\nPARIS (Reuters) - The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development warned on Monday, urging governments and central ban… [+3427 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus Is Dashing Putin’s Big Plan to Revive Russian Growth", "description": "(Bloomberg) -- Russian President Vladimir Putin was counting on his new government to lead an economic revival this year to boost his flagging popularity ratings. The global spread of coronavirus may be about to upend his carefully constructed plan.Oil prices…", "url": "https://finance.yahoo.com/news/coronavirus-dashing-putin-big-plan-110323080.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Ol0ewo.opQ4zQnno307eng--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/6daa02dab72eeb487ae3d7095f9ba3d2", "publishedAt": "2020-03-02T11:03:23Z", "content": "(Bloomberg) --\r\nRussian President Vladimir Putin was counting on his new government to lead an economic revival this year to boost his flagging popularity ratings. The global spread of coronavirus may be about to upend his carefully constructed plan.\r\nOil pri… [+3809 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Asian 20km Race Walk Championships in Japan cancelled due to coronavirus threat", "description": "This is the third major athletics event to be cancelled or postponed after the dreaded coronavirus outbreak in China. The post Asian 20km Race Walk Championships in Japan cancelled due to coronavirus threat appeared first on Firstpost.", "url": "https://www.firstpost.com/sports/asian-20km-race-walk-championships-in-japan-cancelled-due-to-coronavirus-threat-8108731.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/Japan-coronavirus-1024.jpg", "publishedAt": "2020-03-02T10:56:22Z", "content": "New Delhi: The Asian 20km Race Walk Championships in Japan scheduled for 15 March, where 13 Indians were to take part, has been cancelled due to the novel coronavirus outbreak.\r\nTokyo Olympics-bound Bhawana Jat was to lead the Indian challenge in the event ea… [+1538 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Leigh Thomas", "title": "Global growth plunging into downturn over coronavirus, OECD says", "description": "The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development warned on Monday, urging governments and central banks to fight back to avoid an even s…", "url": "https://finance.yahoo.com/news/global-growth-plunging-downturn-over-102657906.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3zYqkTm4Wj1p3QLMSX_eGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODkuNg--/https://s.yimg.com/uu/api/res/1.2/p_UhBw4KrAiPhIZrHGaizQ--~B/aD01NTY7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/22dc6164b35e87a73e1b2b877d82fb09", "publishedAt": "2020-03-02T10:26:57Z", "content": "By Leigh Thomas\r\nPARIS (Reuters) - The coronavirus outbreak is plunging the world economy into its worst downturn since the global financial crisis, the Organisation for Economic Cooperation and Development warned on Monday, urging governments and central ban… [+3427 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Jonathan Cable and Leika Kihara", "title": "Coronavirus hits global factories, policy easing prospects rise", "description": "LONDON/TOKYO (Reuters) - Global factories took a beating in February from the coronavirus outbreak with activity in China shrinking at a record pace, surveys showed on Monday, raising the prospect of a coordinated policy response by central banks to prevent a…", "url": "https://finance.yahoo.com/news/coronavirus-hits-global-factories-policy-105842889.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sNa6LRnc84Z1Cy3xjE_zgw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/BIbp2UuXy_TxmobKGL4Xiw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/c68bc323ded05e2b32a1d08589d10a3c", "publishedAt": "2020-03-02T10:58:42Z", "content": "By Jonathan Cable and Leika Kihara\r\nLONDON/TOKYO (Reuters) - Global factories took a beating in February from the coronavirus outbreak with activity in China shrinking at a record pace, surveys showed on Monday, raising the prospect of a coordinated policy re… [+4990 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "Indonesia becomes the latest country to be struck down by the coronavirus", "description": "The country's president confirmed both Indonesian citizens caught the virus from an infected Japanese national in the capital of Jakarta. Almost 90,000 patients worldwide have caught the virus.", "url": "https://www.dailymail.co.uk/health/article-8064885/Indonesia-latest-country-struck-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/02/10/25422074-0-image-a-8_1583144400261.jpg", "publishedAt": "2020-03-02T10:40:40Z", "content": "Someone who is infected with the coronavirus can spread it with just a simple cough or a sneeze, scientists say.\r\nNearly 3,000 people with the virus are now confirmed to have died and more than 83,000 have been infected. Here's what we know so far:\r\nWhat is t… [+12336 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Paul Hannon", "title": "Global Growth to Slow Sharply as Coronavirus Takes Heavy Toll, Says OECD - The Wall Street Journal", "description": "Global Growth to Slow Sharply as Coronavirus Takes Heavy Toll, Says OECD The Wall Street Journal How COVID-19 is affecting the economy CBC News Coronavirus may shrink world economy, watchdog says Fox Business Coronavirus 'biggest threat to global economy sinc…", "url": "https://www.wsj.com/articles/global-growth-to-slow-sharply-as-coronavirus-takes-heavy-toll-says-oecd-11583143200", "urlToImage": "https://images.wsj.net/im-159379/social", "publishedAt": "2020-03-02T10:43:00Z", "content": "The global economy will slow sharply this year as governments attempt to contain the coronavirus epidemic, although the scale of the setback is highly uncertain, the Organization for Economic Cooperation and Development said Monday.\r\nIn its best case scenario… [+86 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": "George Galloway. Sputnik International", "title": "US Election; Delhi Clashes; Syria; Assange; Coronavirus", "description": "Join George Galloway on the new home for the Mother of All Talk Shows - this week we talk about US election, Delhi clashes, Syria, Assange’s Extradition Hearing, coronavirus.", "url": "https://sputniknews.com/radio-moats/202003021078449805-us-election-delhi-clashes-syria-assange-coronavirus/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107619/06/1076190627.jpg", "publishedAt": "2020-03-02T10:31:33Z", "content": null}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "ENTIRE regional govt of Italy’s Lombardy region to be screened for coronavirus after official tests positive for illness", "description": "Members of the local government in Lombardy, Italy will undergo medical screening, after tests revealed that a regional councilor tested positive for coronavirus. Italy has reported hundreds of new cases of the deadly illness. Read Full Article at RT.com", "url": "https://www.rt.com/news/482094-coronavirus-lombardy-italy-govt-test/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5cdcf720302707804e1490.JPG", "publishedAt": "2020-03-02T10:42:33Z", "content": "Lombardy’s regional governor, Attilio Fontana, has reportedly quarantined himself after his government councilor for economic development was found to be carrying the virus. All members of the local government will now be required to be tested for the illness… [+1254 chars]"}, {"source": {"id": null, "name": "Wraltechwire.com"}, "author": null, "title": "TechWire rewind: Coronavirus impact; NC tech jobs surge; Sift Media growth + 67 more headlines - WRAL Tech Wire", "description": "Here's a recap of the past week's headlines as reported by WRAL TechWire - 70 stories across the breadth of tech and life science.", "url": "https://www.wraltechwire.com/2020/03/02/techwire-rewind-coronavirus-impact-nc-tech-jobs-surge-sift-media-growth-67-more-headlines/", "urlToImage": "https://www.wraltechwire.com/wp-content/uploads/2019/08/business-newspaper.jpg", "publishedAt": "2020-03-02T11:11:05Z", "content": "As Monday morning rolls in, we’re providing TechWire readers with a quick recap of the past week’s news headlines.\r\nMost notably, the global coronavirus outbreak dominated news coverage last week. As the CDC warned that the novel coronavirus will inevitably s… [+1451 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "CAC to shortlist candidates for selectors’ job on Tuesday", "description": "The three-member CAC, which is supposed to pick the selectors as per the BCCI constitution, has not had much to do since its appointment on January 31.", "url": "https://indianexpress.com/article/sports/cricket/cac-to-shortlist-candidates-for-selectors-job-on-tuesday-6295569/", "urlToImage": "https://images.indianexpress.com/2020/03/RP-Singh-1.jpg?w=759", "publishedAt": "2020-03-02T10:33:55Z", "content": "By: PTI | Mumbai | \r\nPublished: March 2, 2020 4:03:55 pm\r\nRP Singh is one of the three members of the CAC Committee (File photo)The BCCI’s Cricket Advisory Committee (CAC) will finally get down to the work of picking two national selectors at its first meetin… [+1568 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Orathai Sriring, Reuters", "title": "Virus Cuts Thailand’s Tourist Arrivals Projection This Year by 6 Million", "description": "For Thailand's tourism, which is much more used to a growth narrative, plunging visitor numbers is a sobering reality the industry is now facing. Unfortunately, the tourism free fall hasn't stopped. -Xinyi Liang-Pholsena", "url": "https://skift.com/2020/03/02/virus-cuts-thailands-tourist-arrivals-projection-this-year-by-6-million/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/thumbnail-3f4bda439a854bbb7c2d2e3d55fec9eb-scaled-e1583142476997.jpeg", "publishedAt": "2020-03-02T10:20:49Z", "content": "The number of foreign tourists in Thailand may fall by six million this year to 33.8 million, the lowest in four years, due to growing fears over the coronavirus outbreak, the Tourism Authority of Thailand said on Monday.\r\nThat was downgraded from last month’… [+593 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Sensex ends 153 points lower amid fresh coronavirus cases in India, Nifty falls 69 points; SBI, Tata Steel among top losers", "description": "Tanking 939 points from the day's high level, equity benchmark index Sensex closed 153.27 points lower at 38,144.02 on Monday as detection of fresh coronavirus cases in India spooked domestic investors The post Sensex ends 153 points lower amid fresh coronavi…", "url": "https://www.firstpost.com/business/sensex-ends-153-points-lower-amid-fresh-coronavirus-cases-in-india-nifty-falls-69-points-sbi-tata-steel-among-top-losers-8108601.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/08/sensex-bse_01.jpg", "publishedAt": "2020-03-02T10:40:08Z", "content": "Mumbai: Tanking 939 points from the day's high level, equity benchmark index Sensex closed 153.27 points lower at 38,144.02 on Monday as detection of fresh coronavirus cases in India spooked domestic investors.\r\nMarking its seventh consecutive session of fall… [+1715 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Samuel Lovett, Samuel Lovett", "title": "'Seriously people': Health chief urges people to stop buying face masks as coronavirus sweeps globe", "description": "Warning from Dr Jerome Adams, the US surgeon general, comes amid surge in demand among Americans", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-news-face-masks-amazon-map-symptoms-latest-jerome-adams-a9368046.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/09/coronavirus.jpg", "publishedAt": "2020-03-02T10:45:55Z", "content": "Americas top doctor has urged people to stop buying face masks, insisting they are not effective in preventing the spread of coronavirus among the general population.\r\nDr Jerome Adams, the surgeon general of the US, has echoed the Centers for Disease Control … [+5275 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Elite Consulting Explains How DJI Drones is Joining the Fight Against Coronavirus", "description": "Drones have been used in many healthcare interventions in these past years: for example, they have been used in the fight against malaria or to distribute medicines in remote areas. Now, DJI drones are giving their contribution to the fight against the latest…", "url": "https://news.yahoo.com/elite-consulting-explains-dji-drones-110000603.html", "urlToImage": null, "publishedAt": "2020-03-02T11:00:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Hollie Silverman, CNN", "title": "Travelers will face new restrictions and cancellations as coronavirus cases grow in the US", "description": "Travelers entering the United States will face new protocols as cases of novel coronavirus grow around the world.", "url": "https://www.cnn.com/travel/article/coronavirus-travel-restrictions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200229142154-04-trump-coronavirus-presser-0229-super-tease.jpg", "publishedAt": "2020-03-02T10:27:01Z", "content": "Hollie Silverman, CNNUpdated 2nd March 2020\r\nThe US is expanding travel restrictions from Iran and heightening a travel advisory for certain regions of South Korea and Italy, Vice President Mike Pence said Saturday. Meantime, President Trump in a tweet on Sun… [+3672 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Gautam Sunder", "title": "Jackie Chan clarifies that he’s not infected by coronavirus, thanks fans for sending him face masks", "description": "The Hong Kong actor is shooting for ‘The Iron Mask’ with Hollywood star Arnold Schwarzenegger, and states that he’s not under quarantine", "url": "https://www.thehindu.com/entertainment/movies/jackie-chan-clarifies-that-hes-not-infected-by-coronavirus-thanks-fans-for-sending-him-face-masks/article30962916.ece", "urlToImage": "https://www.thehindu.com/entertainment/movies/5xcy08/article30962915.ece/ALTERNATES/LANDSCAPE_615/1200383387", "publishedAt": "2020-03-02T10:45:28Z", "content": "With the world reeling from the impact of the COVID-19, there continues to be growing concern among residents in several countries that are badly hit, including Hong Kong where over 100 people have been infected.\r\nA rumour recently did the rounds that actor J… [+1306 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Financial markets rebound after panic sell-off as global central banks pledge to pump in more cash", "description": "Stock markets in Europe and Asia rose on Monday amid growing hopes that stimulus measures will help financial markets to stabilize after last week’s massive losses. Read Full Article at RT.com", "url": "https://www.rt.com/business/482081-global-markets-rebound-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5ce1c620302708a52c09c8.JPG", "publishedAt": "2020-03-02T10:47:33Z", "content": "China’s benchmark Shanghai Composite gained 3.15 percent to close at 2,970.93 points, while key indices of the Shenzhen Stock Exchange, the Shenzhen Component and the Shenzhen Composite, jumped 3.65 percent and 3.15 percent respectively. Hong Kong’s Hang Seng… [+1625 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Peter Weber", "title": "Turkey shoots down Syrian warplanes, kills hundreds of government forces", "description": "Turkey shot down two Syrian Su-24 fighter jets and struck several bases deep in Syrian government territory, killing hundreds of Syrian forces and destroying armaments, Turkey's Defense Ministry said, calling the attacks retaliation for airstrikes that killed…", "url": "https://theweek.com/speedreads/899310/turkey-shoots-down-syrian-warplanes-kills-hundreds-government-forces", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/screen_shot_2020-03-02_at_5.00.21_am.jpg?itok=o7qHO0mc", "publishedAt": "2020-03-02T11:05:05Z", "content": "The U.S. Centers for Disease Control and Convention (CDC) wasn't wrong last week that the new COVID-19 coronavirus would hit the U.S., John Oliver said on Sunday's extremely topical Last Week Tonight. There are now several dozen confirmed cases and two deaths… [+2138 chars]"}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "Joydeep Bose", "title": "As Delhi confirms first Coronavirus infection, here's what you should do to stay safe - DNA India", "description": "As Delhi confirms first Coronavirus infection, here's what you should do to stay safe DNA India View Full coverage on Google News", "url": "https://www.dnaindia.com/india/column-as-delhi-confirms-first-coronavirus-infection-here-s-what-you-should-do-to-stay-safe-2815729", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/03/02/896348-coronavirus-1.jpg", "publishedAt": "2020-03-02T10:38:00Z", "content": null}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Associated Press", "title": "Coronavirus may shrink world economy, watchdog says - Fox Business", "description": "Coronavirus may shrink world economy, watchdog says Fox Business OECD warns coronavirus outbreak could halve its global growth outlook Financial Times Coronavirus 'biggest threat to global economy since financial crisis' Yahoo Finance Economic Group Warns Tha…", "url": "https://www.foxbusiness.com/markets/coronavirus-may-shrink-world-economy-watchdog-says", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/MonVirus2.jpg?ve=1&tl=1", "publishedAt": "2020-03-02T10:44:20Z", "content": "A global agency says the spreading coronavirus could make the world economy shrink this quarter, for the first time since the international financial crisis more than a decade ago.\r\nThe Organization for Economic Cooperation and Development says Monday in a sp… [+1159 chars]"}, {"source": {"id": null, "name": "Eschatonblog.com"}, "author": "noreply@blogger.com (ql)", "title": "Morning Thread", "description": "Reading that there are now confirmed cases of the coronavirus in Florida and New York City. Genie is definitely out of the bottle.", "url": "https://www.eschatonblog.com/2020/03/morning-thread_2.html", "urlToImage": null, "publishedAt": "2020-03-02T11:05:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Goldman Sachs halts all non-essential business travel: memo", "description": "Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.", "url": "https://www.reuters.com/article/us-health-coronavirus-goldman-sachs-idUSKBN20P1G5", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497699888&w=1200&r=LYNXMPEG21116", "publishedAt": "2020-03-02T10:52:08Z", "content": "LONDON (Reuters) - Goldman Sachs Group Inc (GS.N) has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters. \r\nThe “precautionary measures” come as global businesses take more sweeping steps to help pre… [+888 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Gantz rejects mudslinging, Netanyahu dismisses virus fears as party leaders vote", "description": "Odeh: Change impossible 'without partnership between Arabs, Jews'; Liberman: Choose 'between strong Yisrael Beytenu, religious state'; Litzman: 'Vote without fear of coronavirus'", "url": "https://www.timesofisrael.com/gantz-rejects-mudslinging-netanyahu-dismisses-virus-fears-as-party-heads-vote/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/000_1PI4UH-1024x640.jpg", "publishedAt": "2020-03-02T10:13:50Z", "content": "Blue and White leader Benny Gantz urged Israelis to boot his rival Prime Minister Benjamin Netanyahu from office, as he and other party leaders cast ballots in Israel’s third election in less than a year on Monday morning, vowing that they would break the imp… [+6384 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Goldman Sachs halts all non essential business travel - memo - Reuters", "description": "Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters.", "url": "https://www.reuters.com/article/health-coronavirus-goldman-sachs-idUSL8N2AV2U8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-02T11:07:00Z", "content": "LONDON, March 2 (Reuters) - Goldman Sachs Group Inc has told its staff that all non-essential business travel should be postponed, according to a memo seen by Reuters. \r\nThe “precautionary measures” come as global businesses take more sweeping steps to help p… [+882 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Coronavirus Confirmed for Russian Citizen Who Returned From Italy", "description": "According to the country's health authorities, the patient is in a satisfactory condition, and his symptoms are mild.", "url": "https://sputniknews.com/russia/202003021078450134-Coronavirus-Confirmed-for-Russian-Citizen-Who-Returned-From-Italy/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107230/85/1072308589.png", "publishedAt": "2020-03-02T11:10:18Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Kaiser Health News", "title": "In an exchange about Coronavirus, Trump’s DHS chief gets flu mortality rate wrong", "description": "During a Senate appropriations Feb. 25 subcommittee hearing, Chad Wolf, the acting secretary of Homeland Security, said the U.S. flu mortality rate was about the same as the current estimated global mortality rate of the coronavirus outbreak.He made this stat…", "url": "https://www.rawstory.com/2020/03/in-an-exchange-about-coronavirus-trumps-dhs-chief-gets-flu-mortality-rate-wrong/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-28-at-1.35.53-PM.png", "publishedAt": "2020-03-02T10:43:17Z", "content": null}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Lance D Johnson", "title": "New York Times spreads dangerous misinformation, falsely claims flu shot will protect against coronavirus, pneumonia", "description": "(Natural News) The New York Times has published dangerous misinformation about how to prepare for the coronavirus. The recent article said, “wash your hands, keep a supply of medicine, and GET A FLU SHOT.” This might be one of the most illogical pieces of med…", "url": "https://www.naturalnews.com/2020-03-02-nyt-spreads-dangerous-misinformation-claims-flu-shot-protects-against-coronavirus.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Flu-Shot-Needle.jpg", "publishedAt": "2020-03-02T10:58:57Z", "content": null}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Ethan Huff", "title": "More proof CDC delay allowed virus to spread: Nursing home in Washington state confirms two new coronavirus cases after weeks of being prohibited from testing", "description": "(Natural News) A nursing home facility in Kirkland, Washington, located near Seattle, is facing what could be a new Wuhan coronavirus (CoVid-19) outbreak cluster. Officials say that 52 people at the Life Care Center are displaying symptoms that align with inf…", "url": "https://www.naturalnews.com/2020-03-02-cdc-delay-allowed-spread-coronavirus-nursing-home-washington.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Coronavirus-Red-Virus.jpg", "publishedAt": "2020-03-02T10:54:51Z", "content": null}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Evangelyn Rodriguez", "title": "Here's what you need to know about the latest coronavirus outbreak", "description": "(Natural News) Coronaviruses are not new — in fact, they’re some of the most common types of viruses. But what’s new is the coronavirus strain called 2019-nCoV that has been spreading in China, forcing the government to put 18 major cities and nearly 60 milli…", "url": "https://www.naturalnews.com/2020-03-02-what-you-need-to-know-about-the-coronavirus-outbreak.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Woman-Asia-China-Flu-Sick-Coronavirus.jpg", "publishedAt": "2020-03-02T10:25:07Z", "content": null}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "STEVE PEOPLES", "title": "2020 Watch: How long will Joe Biden’s moment last?", "description": "WASHINGTON (AP) — Presidential politics move fast. What we’re watching heading into a new week on the 2020 campaign: ___ Days to Super Tuesday: 1 Days to general election: 256 Most Read Stories Surgeon general urges the public to stop buying face masks amid c…", "url": "https://www.seattletimes.com/nation-world/nation-politics/2020-watch-how-long-will-joe-bidens-moment-last/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/03/urn-publicid-ap-org-63cfaef470bc9fec4c0d13ae26bfcb5dElection_2020_Joe_Biden_00285-1200x630.jpg", "publishedAt": "2020-03-02T10:23:15Z", "content": "WASHINGTON (AP) Presidential politics move fast. What we’re watching heading into a new week on the 2020 campaign:\r\n___\r\nDays to Super Tuesday: 1 \r\nDays to general election: 256\r\n___\r\nTHE NARRATIVE\r\nThe Democrats’ 2020 nomination fight is at a crossroads. Ver… [+4715 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Adviser to Iran’s supreme leader felled by coronavirus", "description": "Tehran dismisses US offer of aid, accusing Washington of trying to weaken Iranians' spirits over outbreak", "url": "https://www.timesofisrael.com/adviser-to-irans-supreme-leader-felled-by-coronavirus/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/AP_20060619441220-e1583140431232-1024x640.jpg", "publishedAt": "2020-03-02T10:35:47Z", "content": "TEHRAN, Iran  A member of a council that advises Iran’s supreme leader died Monday after falling sick from the new coronavirus, state radio reported, becoming the first top official to succumb to the illness that has affected several members of the Islamic Re… [+2449 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He, CNN Business", "title": "Chinese officials are taking control of troubled airline operator HNA", "description": "Chinese authorities are stepping in to run one of the country's largest conglomerates as it struggles to overcome a massive debt crisis made worse by the novel coronavirus outbreak.", "url": "https://www.cnn.com/2020/03/02/business/hna-group-china-government/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302005452-hainan-airlines-file-super-tease.jpg", "publishedAt": "2020-03-02T10:13:11Z", "content": null}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Anne Sraders", "title": "Coronavirus spreads to a previously healthy sector: corporate earnings", "description": "From Apple to Coca-Cola, here are the big companies revising earnings outlooks due to coronavirus.", "url": "https://fortune.com/2020/03/02/coronavirus-spreads-to-corporate-earnings/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/02/GettyImages-1202430229.jpg?resize=1200,600", "publishedAt": "2020-03-02T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Mactrast.com"}, "author": "Chris Hauk", "title": "iPhone Camera Supplier LG Innotek Forced to Shut Down Factory For Cleaning Due to Coronavirus Case", "description": "iPhone camera supplier LG Innotek has been forced to close one of their factories after a worker tested positive for coronavirus. Read More...", "url": "https://www.mactrast.com/2020/03/iphone-camera-supplier-lg-innotek-forced-to-shut-down-factory-for-cleaning-due-to-coronavirus-case/", "urlToImage": "https://s4827.pcdn.co/wp-content/uploads/2019/09/Apple_iPhone-11-Pro_Matte-Glass-Back_091019_big.jpg.large_2x.jpg", "publishedAt": "2020-03-02T10:51:59Z", "content": "iPhone camera supplier LG Innotek has been forced to close one of their factories after a worker tested positive for coronavirus. The Gumi, South Korea factory – which is close to Daegu, where most of the South Korean coronavirus cases have been confirmed – w… [+922 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Eren Sengezer", "title": "Coronavirus update: First confirmed case in London, total infections in Iran at 1,501", "description": "Public Health England has recently announced that they have a confirmed case of coronavirus infection in south London after a member of staff at Wimbl", "url": "https://www.fxstreet.com/news/coronavirus-update-first-confirmed-case-in-london-total-infections-in-iran-at-1-501-202003021038", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/NZDUSD/pile-of-new-zealand-money-2647160_Large.jpg", "publishedAt": "2020-03-02T10:38:17Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "FXStreet Team", "title": "GBP/USD: Brexit and BoE's response to coronavirus hit the pound", "description": "GBP/USD has been on the back foot after the BOE pledged to act. Brexit and coronavirus headlines are dominating trading, Yohay Elam from FXStreet repo", "url": "https://www.fxstreet.com/news/gbp-usd-brexit-and-boes-response-to-coronavirus-hit-the-pound-202003021021", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/GBPUSD/new-twenty-pound-notes-3079030_Large.jpg", "publishedAt": "2020-03-02T10:21:48Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Alex Avard", "title": "E3 2020 is \"moving ahead full speed\" despite Coronavirus concerns", "description": "The ESA reiterates that it's \"watching the situation very closely\" following GDC's cancellation", "url": "https://www.gamesradar.com/e3-2020-is-moving-ahead-full-speed-despite-coronavirus-concerns/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hJMw4TpMQRiWtY7b7nwhhn-1200-80.jpg", "publishedAt": "2020-03-02T11:02:37Z", "content": "E3 2020 is still going ahead despite ongoing concerns about the spread of Coronavirus, with organizers the Entertainment Software Association confirming that the recent cancellation of the Game Developers Conference hasn't affected its current schedule for th… [+1572 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Myupchar", "title": "We spoke to the National Helpline about the biggest coronavirus myths. Here is what they said.", "description": "Talk to anyone on the street about the virus and you will be met with confusion and a complete misunderstanding of the disease. The post We spoke to the National Helpline about the biggest coronavirus myths. Here is what they said. appeared first on Firstpost.", "url": "https://www.firstpost.com/health/we-spoke-to-the-national-helpline-about-the-biggest-coronavirus-myths-here-is-what-they-said-8108581.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/02/GettyImages-1198473293-1.jpg", "publishedAt": "2020-03-02T10:57:09Z", "content": null}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Eren Sengezer", "title": "China's Premier Li: Coronavirus outbreak control remains at crucial stage", "description": "There is a positive trend in areas outside of Hubesi but strict prevention and control measures must maintain, China's Premier Li Keqiang told the Chi", "url": "https://www.fxstreet.com/news/chinas-premier-li-coronavirus-outbreak-control-remains-at-crucial-stage-202003021058", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/China/coronavirus3_Large.jpg", "publishedAt": "2020-03-02T10:58:18Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "247wallst.com"}, "author": "247chrislange", "title": "Will Lyft Stock Catch a Ride After This Coronavirus Scare?", "description": "Although markets may be panicking now at the prospect of COVID-19 spreading, Lyft stock may be an investment vehicle offering great value once the fear wears off.", "url": "https://247wallst.com/services/2020/03/02/will-lyft-stock-catch-a-ride-after-this-coronavirus-scare/", "urlToImage": "https://s2.wp.com/wp-content/themes/vip/247wallst/images/247-50x50.png", "publishedAt": "2020-03-02T11:05:26Z", "content": "Lyft (NASDAQ: LYFT) and Uber (NYSE: UBER) have been the focus for those looking to play the gig economy since they came public last spring. Although markets may be panicking now at the prospect of the COVID-19 coronavirus spreading, Lyft stock may be an inves… [+4493 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "China Has Made Spreading Rumours on Social Media A Crime as it Battles The Coronavirus Outbreak - News18", "description": "The new regulations come into effect as Chinese authorities face criticism, particularly on social media, over handling of the crisis and how the early warnings were ignored. There is no exact definition as to what constitutes “spreading rumors and disturbing…", "url": "https://www.news18.com/news/tech/china-has-made-spreading-rumors-on-social-media-a-crime-as-it-battles-the-coronavirus-outbreak-2522321.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Untitled-design-131.png", "publishedAt": "2020-03-02T10:27:30Z", "content": "It is now officially a crime to spread rumours on social media, at least if you live in China or are a Chinese citizen. The new cyberspace regulations have gone into effect in the country as China continues to battle the Coronavirus, or COVID-19 outbreak. Amo… [+3674 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Bill Bostock)", "title": "A member of the inner circle of Iran's Supreme Leader died of the coronavirus, as the country records more deaths than anywhere outside China", "description": "Iran is accused of hiding the true number of coronavirus cases. Some researchers estimate there could be 23 times more infections than stated.", "url": "https://news.yahoo.com/member-inner-circle-irans-supreme-104117884.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6.c_9wWBQH30096aTAhNIQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTY2MDtoPTQ5Ng--/https://s.yimg.com/uu/api/res/1.2/BEyudmkb_3brwoHIkIrXjw--~B/aD0yNDg7dz0zMzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/EN/business_insider_articles_888/92a3a4822f2ad92413782e23bd74fd85", "publishedAt": "2020-03-02T10:41:17Z", "content": "Mohammad Mirmohammadi, who died on Monday.\r\nIslamic Parliament of Iran\r\n<ul><li>A top adviser to Iranian Supreme Leader Ayatollah Ali Khamenei died of coronavirus on Monday.\r\n</li><li>Mohammad Mirmohammadi, 71, is among a growing number of government official… [+3697 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tran Thi Minh Ha, with Suy Se in Phnom Penh, Cambodia", "title": "Virus hammers garment industries in Cambodia, Vietnam", "description": "Cambodia's multi-billion-dollar garment industry is at risk of chain disruption from the deadly coronavirus, its strongman premier said Monday, as the outbreak cripples Southeast Asia's key industries, bringing border trade to a trickle. The death toll from t…", "url": "https://news.yahoo.com/virus-hammers-garment-industries-cambodia-vietnam-105957795.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/JXm4VSq9oMF1woihT1biLg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/Wv0FXkGJQJRfWW0UgzH6cw--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/1e61324448fbcf4bf8f0228a05b9b527c7f64411.jpg", "publishedAt": "2020-03-02T10:59:57Z", "content": "Cambodia's multi-billion-dollar garment industry is at risk of chain disruption from the deadly coronavirus, its strongman premier said Monday, as the outbreak cripples Southeast Asia's key industries, bringing border trade to a trickle.\r\nThe death toll from … [+2615 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "DY_Kim", "title": "Agencies Of Park Min Young And Han Ye Seul Reassure Fans About Coronavirus Concerns After Milan Trip", "description": "Agencies of stars who attended Milan Fashion Week have responded to concerns about potential for infection of the novel coronavirus (COVID-19). It was recently confirmed that two of Chungha’s staff members tested positive for COVID-19 following their return f…", "url": "https://www.soompi.com/article/1386044wpp/agencies-of-park-min-young-and-han-ye-seul-reassure-fans-about-coronavirus-concerns-after-milan-trip", "urlToImage": "https://6.viki.io/image/93a62999c9b648b3929bc66cb3d6092b.jpeg?s=900x600&e=t", "publishedAt": "2020-03-02T10:21:23Z", "content": "Agencies of stars who attended Milan Fashion Week have responded to concerns about potential for infection of the novel coronavirus (COVID-19).\r\nIt was recently confirmed that two of Chunghas staff members tested positive for COVID-19 following their return f… [+1120 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "The Associated Press", "title": "Driver sentenced to death in China for stabbing two people at coronavirus checkpoint in Yunnan province", "description": "A driver who fatally stabbed two people guarding a virus-control roadblock in southwestern China was sentenced to death Sunday The post Driver sentenced to death in China for stabbing two people at coronavirus checkpoint in Yunnan province appeared first on F…", "url": "https://www.firstpost.com/world/driver-sentenced-to-death-in-china-for-stabbing-two-people-at-coronavirus-checkpoint-in-yunnan-province-8108451.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/AP20049413176385.jpg", "publishedAt": "2020-03-02T11:10:00Z", "content": "Beijing: A driver who fatally stabbed two people guarding a virus-control roadblock in southwestern China was sentenced to death Sunday, a state news agency reported.\r\nA volunteer wearing a face mask stands at a neighborhood checkpoint in Beijing. AP\r\nThe rep… [+973 chars]"}]