[{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": null, "title": "Why Coronavirus Spread Across the Globe: Mobile Population and Mild Symptoms - msnNOW", "description": "Why Coronavirus Spread Across the Globe: Mobile Population and Mild Symptoms msnNOW Coronavirus has 'pandemic potential,' WHO warns as US ramps up testing ABC News Coronavirus: More new cases outside China than in — WHO Axios Top 10 Coronavirus Infected Natio…", "url": "https://www.wsj.com/articles/why-coronavirus-spread-across-the-globe-mobile-population-and-mild-symptoms-11582822312", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB10tX6d.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=2790&y=1206", "publishedAt": "2020-02-27T17:34:00Z", "content": "© Akos Stiller/Bloomberg NewsThe novel coronavirus has quickly hopscotched from a food market in China around the world, to small towns in northern Italy and a major pilgrimage site in Iran. It spread through a megachurch in South Korea and sickened hundreds … [+13830 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Kuwait suspends studies at military institutions over coronavirus fears: KUNA", "description": "The Kuwaiti army will suspend studies at military colleges and schools for two weeks from March 1 due to concerns about the coronavirus outbreak, state news agency KUNA said on Thursday.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/nkZYSdkB_Rs/kuwait-suspends-studies-at-military-institutions-over-coronavirus-fears-kuna-idUSKCN20L2NU", "urlToImage": null, "publishedAt": "2020-02-27T18:00:01Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Coronavirus: Rush Limbaugh and Fox News' Laura Ingraham are denying the risk in an attempt to protect Trump", "description": "Two prominent right-wing media personalities are denying the threat posed by the Wuhan coronavirus and spreading conspiracy theories to boost the president. Talk-radio host Rush Limbaugh falsely claimed \"the coronavirus is the common cold\" and argued that the…", "url": "https://www.businessinsider.com/right-wing-media-spreads-conspiracy-and-deny-risk-of-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5e57e948fee23d65137fa406?width=1200&format=jpeg", "publishedAt": "2020-02-27T17:31:57Z", "content": "Some of President Donald Trump's most vocal backers in right-wing media are downplaying the threat posed by the Wuhan coronavirus and spreading conspiracy theories to boost the president's response. \r\nJust weeks after Trump awarded conservative talk-radio hos… [+3886 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "UBS is forecasting that Asia revenues at UPS and FedEx will slump by 70% as coronavirus poleaxes global trade", "description": "Trade volumes — particularly trade between Asia and the US — are already sinking because of coronavirus. That threatens transportation giants like FedEx and UPS, warned the transportation equity research team at UBS in a February 27 note. For the month of Feb…", "url": "https://www.businessinsider.com/coronavirus-slashing-trade-lowering-outlook-ups-fdx-ubs-2020-2", "urlToImage": "https://i.insider.com/5d1b754ca17d6c2ada078f2e?width=1200&format=jpeg", "publishedAt": "2020-02-27T17:57:54Z", "content": "The transportation equity research team at UBS is lowering its near-term estimates for transportation giants FedEx and UPS as coronavirus slams global trade.\r\nFor Memphis-based FedEx, UBS is lowering its outlook for the package giant's earnings this quarter f… [+4698 chars]"}, {"source": {"id": null, "name": "Thewhig.com"}, "author": null, "title": "Coronavirus here to stay, Kingston's medical officer of health says - The Kingston Whig-Standard", "description": "Coronavirus here to stay, Kingston's medical officer of health says The Kingston Whig-Standard Iran reports 7 new virus deaths as another senior government official infected The Times of Israel View Full coverage on Google News", "url": "https://www.thewhig.com/news/local-news/coronavirus-here-to-stay-kingstons-medical-officer-of-health-says", "urlToImage": "https://nexus.prod.postmedia.digital/wp-content/uploads/2020/02/IMG_2666-scaled-2560-e1582822586749.jpg", "publishedAt": "2020-02-27T18:07:54Z", "content": "KINGSTON — The COVID-19 virus appears to have gone truly global now that it is spreading faster outside of mainland China than it is within that country.\r\nBut as far as brand new epidemics go, it could be worse.\r\nAs of Thursday morning, slightly more than 2,8… [+3215 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook cancels its annual F8 conference due to coronavirus concerns (FB)", "description": "Facebook has canceled its annual F8 conference over coronavrius concerns. In a statement, the company said: \"In light of the growing concerns around COVID-19, we've made the difficult decision to cancel the in-person component of F8 this year, in order to pri…", "url": "https://www.businessinsider.com/facebook-cancels-f8-coronavirus-covid-2020-2", "urlToImage": "https://i.insider.com/5e5804acfee23d7af953f5b5?width=1200&format=jpeg", "publishedAt": "2020-02-27T18:07:53Z", "content": "Facebook has canceled its annual F8 conference due to concerns over the novel coronavirus outbreak.\r\nNormally the biggest event of the year for the California social networknig giant, F8 was due to be held in San Jose in May, but on Thursday the company annou… [+887 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Daily Crunch: DoorDash files to go public", "description": "DoorDash prepares to go public, Roblox raises $150 million and Reddit’s CEO takes aim at TikTok. Here’s your Daily Crunch for February 27, 2020. 1. DoorDash, the $13B on-demand food delivery startup, says it has confidentially filed for an IPO The company sai…", "url": "http://techcrunch.com/2020/02/27/daily-crunch-doordash-files-to-go-public/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-1147932671.jpg?w=601", "publishedAt": "2020-02-27T17:53:03Z", "content": "DoorDash prepares to go public, Roblox raises $150 million and Reddit’s CEO takes aim at TikTok. Here’s your Daily Crunch for February 27, 2020.\r\n1. DoorDash, the $13B on-demand food delivery startup, says it has confidentially filed for an IPO\r\nThe company s… [+2761 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Libby Cathey", "title": "Pence criticized for response to HIV outbreak as Indiana governor", "description": "The announcement that Vice President Mike Pence will lead the response to coronavirus has raised questions around his handling of an HIV epidemic while Indiana Governor.", "url": "https://abcnews.go.com/Politics/leads-coronavirus-response-pence-criticized-handling-hiv-outbreak/story?id=69255588", "urlToImage": "https://s.abcnews.com/images/Politics/pence-1-rt-er-200227_hpMain_16x9_992.jpg", "publishedAt": "2020-02-27T17:20:06Z", "content": "President Donald Trump's announcement that Vice President Mike Pence has the experience to lead the administration's coronavirus response has raised questions around Pence's handling of a major health crisis when he was governor of Indiana.\r\n\"Hes got a certai… [+5008 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashley Rodriguez", "title": "Netflix shares are on the rise, in spite of the coronavirus fears that are rocking the broader stock market (NFLX)", "description": "Netflix stock is on the rise, even as the broader stock market slides amid growing fears of the coronavirus. Shares of the company are up about 5% this week, as of Thursday afternoon, while the S&P 500 slid around 5%. Netflix may be not be affected by the sto…", "url": "https://www.businessinsider.com/netflix-stock-rises-as-stock-market-slides-amid-coronavirus-fears-2020-2", "urlToImage": "https://i.insider.com/5e5801cafee23d04407a7fc3?width=1200&format=jpeg", "publishedAt": "2020-02-27T18:10:52Z", "content": "Netflix isn't going down with the coronavirus slump.\r\nShares of the streaming company are on the rise, even as the stock market slides amid growing fears of the coronavirus.\r\nNetflix stock was up about 5% this week, as of Thursday afternoon, while the S&amp;P… [+2292 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Tonya Garcia", "title": "Best Buy says coronavirus-related supply chain issues factored into guidance", "description": "Best Buy says supply chain disruptions caused by the coronavirus outbreak will only impact the first half of the year.", "url": "https://www.marketwatch.com/story/best-buy-says-coronavirus-related-supply-chain-issues-factored-into-guidance-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB048_bby_st_ZG_20200227122647.jpg", "publishedAt": "2020-02-27T17:43:18Z", "content": "Best Buy Co Inc. gave fiscal first-quarter and full-year guidance on Thursday that takes into account the coronavirus epidemics impact on the consumer electronics retailers supply chain.\r\nBest Buy \r\nBBY, -0.18%\r\n  forecasts that most of the impact from the co… [+3669 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Victor Reklaitis", "title": "Key Words: Pelosi: Stock market’s plunge is ‘disturbing’; Trump ‘silly’ to pin fall on Democratic debate", "description": "House Speaker Nancy Pelosi on Thursday expressed concern about the stock market’s coronavirus-driven selloff and the California Democrat also criticized President Donald Trump’s analysis of the market’s action.", "url": "https://www.marketwatch.com/story/pelosi-stock-markets-plunge-is-disturbing-trump-silly-to-pin-fall-on-democratic-debate-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HV501_NancyP_ZG_20191118113300.jpg", "publishedAt": "2020-02-27T17:39:55Z", "content": "U.S. House Speaker Nancy Pelosi on Thursday expressed concern about the stock markets coronavirus-driven selloff, as the California Democrat also criticized President Donald Trumps analysis of the markets action.\r\nShe offered the following take when asked at … [+1341 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Carli Velocci", "title": "Microsoft is the latest company to pull out of GDC 2020", "description": "What you need to know Microsoft announced it's pulling out of GDC due to coronavirus concerns. The company is moving a lot of its sessions online to a digital-only event. Microsoft follows Sony, Facebook, Unity, and others that have pulled out of the annual c…", "url": "https://www.windowscentral.com/microsoft-latest-company-pull-out-gdc-2020-due-coronavirus-concerns", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2015/03/phil-spencer-gdc-stage.jpg?itok=kZLNtTkW", "publishedAt": "2020-02-27T17:39:54Z", "content": "That's another one down. Microsoft's Game Stack team announced Thursday that it won't be attending the Game Developers Conference (GDC) in San Francisco on account of coronavirus concerns.\r\nThe company made the announcement on its Game Stack blog:\r\nAfter a cl… [+1982 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ethan Gach", "title": "China Pulls Plague Inc. From App Store", "description": "The creators of the popular plague simulator say it was taken down by China’s Cyberspace Administration over “illegal” content. Read more...", "url": "https://kotaku.com/china-pulls-plague-inc-from-app-store-1841955831", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/k8fvxdwjbqipiny4d8ki.png", "publishedAt": "2020-02-27T17:30:00Z", "content": "The creators of the popular plague simulator say it was taken down by Chinas Cyberspace Administration over illegal content.\r\nWeve just been informed that Plague Inc. includes content that is illegal in China as determined by the Cyberspace Administration of … [+1847 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Ash", "title": "Unity pulls out of GDC 2020 due to ‘current conditions’ with coronavirus", "description": "Unity has issued a statement saying that the company has made the “difficult decision” to withdraw from GDC 2020 over coronavirus concerns. In a statement published on the official Unity blog, the company confirmed that it opted to cancel its appearance after…", "url": "https://mspoweruser.com/unity-withdraws-from-gdc-2020-over-coronavirus/", "urlToImage": null, "publishedAt": "2020-02-27T17:12:32Z", "content": "Unity has issued a statement saying that the company has made the “difficult decision” to withdraw from GDC 2020 over coronavirus concerns.\r\nIn a statement published on the official Unity blog, the company confirmed that it opted to cancel its appearance afte… [+2340 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "POLITICO Staff", "title": "Experts warn that Trump's coronavirus claims are misleading: Latest Updates", "description": "Trump’s alternately combative and light-hearted press conference on the government’s coronavirus response did little to calm escalating global concerns about the epidemic.", "url": "https://www.politico.com/news/2020/02/27/coronavirus-updates-latest-news-usa-response-117870", "urlToImage": "https://static.politico.com/2c/b8/5529a87a4d3595af367f9d713002/200227-coronavirus-gty-773.jpg", "publishedAt": "2020-02-27T17:31:21Z", "content": "Trump insisted Wednesday night that health workers are testing everybody that we need to test, a statement one expert called blatantly false.\r\nThe latest U.S. coronavirus case highlights the country's still-limited ability to test patients for the virus.\r\nJus… [+3486 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "The Cable Fed Policy, Markets, Coronavirus (Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-02-27/the-cable-fed-policy-markets-coronavirus-podcast", "urlToImage": null, "publishedAt": "2020-02-27T18:02:29Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Did FuelCell Energy, Ballard Power, and Plug Power Shares Just Drop?", "description": "Even doomsday-prepper stocks now suffer from coronavirus.", "url": "https://www.fool.com/investing/2020/02/27/why-did-fuelcell-energy-ballard-power-and-plug-pow.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560322/hydrogen-fuel-cell-single.jpg", "publishedAt": "2020-02-27T17:41:00Z", "content": "What happened\r\nWhen you think about it, fuel cell stocks like FuelCell Energy(NASDAQ:FCEL), Ballard Power(NASDAQ:BLDP), and Plug Power (NASDAQ:PLUG) are kind of the ultimate \"prepper\" stocks.\r\nDivorced from the grid, fuel cells should permit their operators t… [+1219 chars]"}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Tyler Cowen", "title": "How the coronavirus is changing the culture of science and publication", "description": "A torrent of data is being released daily by preprint servers that didn’t even exist a decade ago, then dissected on platforms such as Slack and Twitter, and in the media, before formal peer review begins. Journal staffers are working overtime to get manuscri…", "url": "https://marginalrevolution.com/marginalrevolution/2020/02/how-the-coronavirus-is-changing-the-culture-of-science-and-publication.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-02-27T18:10:43Z", "content": "A torrent of data is being released daily by preprint servers that didnt even exist a decade ago, then dissected on platforms such as Slack and Twitter, and in the media, before formal peer review begins. Journal staffers are working overtime to get manuscrip… [+1385 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of TripAdvisor Are Down Today", "description": "The coronavirus is making an already challenging situation even more difficult.", "url": "https://www.fool.com/investing/2020/02/27/why-shares-of-tripadvisor-are-down-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560331/traveler-with-a-health-mask-on-outbreak-pandemic-getty.jpg", "publishedAt": "2020-02-27T17:54:00Z", "content": "What happened\r\nShares of TripAdvisor(NASDAQ:TRIP) fell more than 7% on Thursday morning on fresh concerns about the reach of the coronavirus and its impact on travel. The shares made up much of that decline as the morning went on, but investors should expect … [+1328 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Uber Stock Fell Today", "description": "The ridesharing company continues to face legal challenges, and the coronavirus outbreak is rattling investors.", "url": "https://www.fool.com/investing/2020/02/27/why-uber-stock-fell-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560315/ubereats_photo_app_on_phone_cropped-1.jpg", "publishedAt": "2020-02-27T17:26:22Z", "content": "What happened\r\nShares of ridesharing giant Uber Technologies (NYSE:UBER) have fallen today, down by 5% as of 11:40 a.m. EST, following some ongoing setbacks in Europe. The broader market is also selling off due to fears surrounding the escalating coronavirus … [+1483 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Alex Ward", "title": "Closed schools and empty stadiums: How countries are trying to stop coronavirus’s spread", "description": "Italy, South Korea, Japan, Saudi Arabia, and the United States are taking steps like canceling military drills and closing schools to stop coronavirus’s spread.", "url": "https://www.vox.com/2020/2/27/21155864/coronavirus-italy-saudi-arabia-south-korea-japan-military", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YNhSd9zNgy6WFXvFswG00o8lSCw=/0x689:6939x4322/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19751379/1203638403.jpg.jpg", "publishedAt": "2020-02-27T18:10:00Z", "content": "A man wearing a face mask walks past Tokyo Dome where a number of events including pop concerts have been canceled because of concerns over the coronavirus, on February 27, 2020, in Tokyo, Japan. | Carl Court/Getty Images A quick look at how Italy, South Kore… [+10233 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "As coronavirus spreads, U.S.-Korean military exercises are suspended and Japanese schools close - CBS News", "description": "As coronavirus spreads, U.S.-Korean military exercises are suspended and Japanese schools close CBS News US, South Korea to postpone military drills over coronavirus Fox News The Dark Side of FOMO: Living Through a Coronavirus Outbreak in South Korea VICE Sou…", "url": "https://www.youtube.com/watch?v=Yzre57AK89k", "urlToImage": "https://i.ytimg.com/vi/Yzre57AK89k/maxresdefault.jpg", "publishedAt": "2020-02-27T17:19:11Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is the spread of coronavirus out of control? I Inside Story - Al Jazeera English", "description": "Is the spread of coronavirus out of control? I Inside Story Al Jazeera English Iranian deputy health minister, diagnosed with coronavirus, goes into quarantine as locals accuse Tehran of cover-up CNBC Iran’s coronavirus outbreak could be contributing to a pot…", "url": "https://www.youtube.com/watch?v=xZMxrjoeHao", "urlToImage": "https://i.ytimg.com/vi/xZMxrjoeHao/maxresdefault.jpg", "publishedAt": "2020-02-27T17:30:04Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Maxx Chatsko)", "title": "Here's Why Vir Biotechnology Rose as Much as 100.1% Today", "description": "The company announced a partnership in its efforts to develop monoclonal antibodies capable of neutralizing the novel coronavirus strain.", "url": "https://www.fool.com/investing/2020/02/27/heres-why-vir-biotechnology-rose-as-much-as-1001-t.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560335/paper-airplanes-rising.jpg", "publishedAt": "2020-02-27T18:01:00Z", "content": "What happened\r\nShares of Vir Biotechnology(NASDAQ:VIR) more than doubled today after the company announced a collaboration with WuXi Biologics. The pair will work together to develop antibodies to treat the novel coronavirus strain, SARS-CoV-2, that is spread… [+1778 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Mark DeCambre", "title": "Market Extra: This stock has scored the biggest boost from the coronavirus outbreak — but the company has been out of business for years", "description": "To call it a case of mistaken identity might be underselling it, but shares of Zoom Technologies have been practically, er, zooming higher amid the recent rally in the popular videoconferencing company Zoom Video Communications which went public back last yea…", "url": "https://www.marketwatch.com/story/this-stock-has-scored-the-biggest-boost-from-the-coronavirus-outbreak-but-the-company-has-been-out-of-business-for-years-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB045_zoom_0_ZG_20200227121508.jpg", "publishedAt": "2020-02-27T17:50:28Z", "content": "To call it a case of mistaken identity might be underselling it, but shares of Zoom Technologies have been practically, er, zooming higher amid the recent buoyancy in the popular videoconferencing company Zoom Video Communications which went public back last … [+4009 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Rachael Rettner", "title": "California's latest coronavirus case wasn't tested for several days - Livescience.com", "description": "California's latest coronavirus case wasn't tested for several days Livescience.com California is monitoring at least 8,400 people for the coronavirus CNBC Coronavirus Diagnosis in California Highlights Testing Flaws The New York Times Message to Campus Commu…", "url": "https://www.livescience.com/california-coronavirus-patient-not-tested-for-days.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DhVcuSAXDMiRdnbv53uWzh-1200-80.png", "publishedAt": "2020-02-27T18:07:00Z", "content": "A coronavirus patient in Northern California\r\n wasn't tested for the virus for several days after arriving at the hospital, according to news reports. This patient may be the first known case in the U.S. to catch the virus through community spread.\r\nThe patie… [+2327 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Facebook cancels its F8 developer conference, which was scheduled to take place May 5-6 at the San Jose McEnery Convention Center, over coronavirus concerns (Queenie Wong/CNET)", "description": "Queenie Wong / CNET : Facebook cancels its F8 developer conference, which was scheduled to take place May 5-6 at the San Jose McEnery Convention Center, over coronavirus concerns — The May event is typically Facebook's biggest event of the year, and follows t…", "url": "https://www.techmeme.com/200227/p20", "urlToImage": "https://cnet2.cbsistatic.com/img/IPGIL3sDSMDwxAcMio8HMeHepAk=/756x567/2019/04/30/d7aec367-5925-4740-817b-26dfa6e41f22/facebook-f8-2019-9293.jpg", "publishedAt": "2020-02-27T18:07:32Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Microsoft Pulls Out of Video Game Conference on Coronavirus Fears", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/microsoft-pulls-out-of-game-conference-on-coronavirus-fears", "urlToImage": null, "publishedAt": "2020-02-27T17:53:24Z", "content": null}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS New York", "title": "700 ASKED TO ISOLATE IN NY", "description": "700 ASKED TO ISOLATE IN NY (Main headline, 4th story, link ) Related stories: FEAR IN ITALY WARNINGS BERLIN CAUTION ISRAEL STOCKS SPIRAL", "url": "https://newyork.cbslocal.com/2020/02/26/coronavirus-update-de-blasio-cuomo-outline-preparations-in-new-york/", "urlToImage": "https://newyork.cbslocal.com/wp-content/uploads/sites/14578484/2020/02/De-Blasio-1.jpg?w=1024", "publishedAt": "2020-02-27T17:37:37Z", "content": "NEW YORK (CBSNewYork) – New York is bracing for a coronavirus outbreak.CBS2 has learned hundreds of people are being monitored for possible coronavirus exposure in New York state.\r\nThe Health Department says 700 people in the state have been asked to voluntar… [+3849 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Ash", "title": "Microsoft Game Stack cancels GDC 2020 appearance", "description": "Microsoft Game Stack is the latest company to join the list of those withdrawing from GDC 2020 over concerns related to the recent coronavirus outbreak. Posting on the official Microsoft Developer blog, Microsoft Game Stack said that it’s made the “difficult …", "url": "https://mspoweruser.com/microsoft-game-stack-pulls-out-of-gdc-2020/", "urlToImage": null, "publishedAt": "2020-02-27T18:03:49Z", "content": "Microsoft Game Stack is the latest company to join the list of those withdrawing from GDC 2020 over concerns related to the recent coronavirus outbreak.\r\nPosting on the official Microsoft Developer blog, Microsoft Game Stack said that it’s made the “difficult… [+2609 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "U.S. Coronavirus Patient Who Had Not Traveled Overseas Was Not Tested for Days", "description": "The first U.S. coronavirus patient who did not recently travel overseas was unable to be tested for several days because of federal regulations, The New York Times reported. On Wednesday night, the Centers for Disease Control confirmed that a person in Califo…", "url": "https://people.com/health/us-coronavirus-patient-who-did-not-travel-overseas-was-not-tested-for-days/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Fcorona-virus37.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-02-27T17:16:14Z", "content": "The first U.S. coronavirus patient who did not recently travel overseas was unable to be tested for several days because of federal regulations, The New York Times reported.\r\nOn Wednesday night, the Centers for Disease Control confirmed that a person in Calif… [+2867 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Chris Hill)", "title": "MasterCard Revises Guidance on the Back of Coronavirus", "description": "As a result of a slowing global economy, MasterCard revised its guidance. Should stockholders be worried?", "url": "https://www.fool.com/investing/2020/02/27/mastercard-revises-guidance-on-the-back-of-coronav.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559948/cover_mf.jpg", "publishedAt": "2020-02-27T17:49:00Z", "content": "In this episode of Market Foolery, Chris Hill and Jason Moser go through the results of three recent earnings announcements.\r\n<ul><li>MasterCard (NYSE:MA) is getting a new CEO next year; the guys share their views on the present CEO, Ajay Banga, and the futur… [+22672 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Anders Bylund)", "title": "Why Many High-Flying Tech Stocks Are Falling Today", "description": "Risk-averse investors are running away from volatile tech stocks due to the coronavirus outbreak. Should you follow them out or take advantage of sudden discounts on high-quality companies?", "url": "https://www.fool.com/investing/2020/02/27/why-many-high-flying-tech-stocks-are-falling-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560311/chinese-woman-wearing-face-mask.jpg", "publishedAt": "2020-02-27T17:16:00Z", "content": "What happened\r\nMany market-darling tech stocks are taking a deep dive today because of the developing coronavirus outbreak. Social media specialist Snap(NYSE:SNAP) fell as much as 6.6% Thursday morning, while cloud computing expert Fastly(NYSE:FSLY) dropped 1… [+2352 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Pence Picks Top AIDS Official for Response...", "description": "Pence Picks Top AIDS Official for Response... (Top headline, 10th story, link ) Related stories: First case of UNKNOWN ORIGIN confirmed in Northern California... WAS NOT TESTED FOR DAYS... Medical staff exposed? Experts: Should be prepared to see overnight bo…", "url": "https://finance.yahoo.com/news/pence-picks-top-u-aids-163417283.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T17:25:36Z", "content": "(Bloomberg) -- Vice President Mike Pence has selected the State Departments top AIDS official, Deborah Birx, to join his coronavirus response team, his office announced on Thursday.\r\nBirx is a career government official who was nominated by former President B… [+2270 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Molly Osberg", "title": "Gwenyth Paltrow Suddenly Has Very Standard Beliefs About Why People Get Sick", "description": "There’s a story I think about a lot, told by Douglas Rushkoff, one of the only good futurists. I encourage you to read it in its entirety, but essentially: Rushkoff was once invited to give a fantastically well-compensated talk about the “future of technology…", "url": "https://jezebel.com/all-of-a-sudden-gwenyth-paltrow-has-very-standard-beli-1841954003", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zuaqidlg3ptylzhmpzvw.jpg", "publishedAt": "2020-02-27T17:40:00Z", "content": "Theres a story I think about a lot, told by Douglas Rushkoff, one of the only good futurists. I encourage you to read it in its entirety, but essentially: Rushkoff was once invited to give a fantastically well-compensated talk about the future of technology t… [+2454 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Daniel Sparks)", "title": "Why Tesla Stock Fell Sharply Thursday", "description": "The electric-car maker's shares have lost nearly a fifth of their value over the last week.", "url": "https://www.fool.com/investing/2020/02/27/why-tesla-stock-fell-sharply-thursday.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560333/why-tesla-stock-is-down-thursday.png", "publishedAt": "2020-02-27T18:07:00Z", "content": "What happened\r\nShares of electric-car company Tesla(NASDAQ:TSLA) took a big hit on Thursday. As of 12:20 p.m. EST, the stock was down 8.2%.\r\nWhile the stock's pullback on Thursday is undoubtedly influenced by a continued market sell-off amid coronavirus fears… [+1100 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "UAE suspends passenger ferry services with Iran over coronavirus", "description": "The United Arab Emirates has suspended passenger ferry services with Iran until further notice over coronavirus fears, the state news agency WAM said on Thursday.", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/DUVliB-NU9M/uae-suspends-passenger-ferry-services-with-iran-over-coronavirus-idUSKCN20L2KO", "urlToImage": null, "publishedAt": "2020-02-27T17:24:03Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "The wildly popular simulation game 'Plague Inc' has been pulled from the iPhone's Chinese app store amid the ongoing coronavirus crisis in China (AAPL)", "description": "A long-running, wildly popular game that simulates a worldwide pandemic was just pulled from Apple's iPhone app store in China. The game's use spiked in China after the coronavirus outbreak, and it reached the top spot on Apple's App Store charts as a result.…", "url": "https://www.businessinsider.com/plague-inc-coronavirus-iphone-chinese-app-store-covid-2020-2", "urlToImage": "https://i.insider.com/5e57e4eefee23d58795496d7?width=1200&format=jpeg", "publishedAt": "2020-02-27T17:13:39Z", "content": "A wildly popular game that intends to simulate a worldwide epidemic recently had a cosmic surge in popularity — \"Plague Inc.,\" as it's known, even became the most popular game on Apple's iPhone app store around the world.\r\nRecently, the game topped Apple's ap… [+1894 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "Wall Street slips into correction territory on alarm over coronavirus", "description": "The S&P 500 and Nasdaq are now more than 10% below their intraday record highs hit on Feb. 19, while the Dow Jones Industrials is 10% off its Feb.12 peak.", "url": "https://indianexpress.com/article/business/world-market/wall-street-slips-into-correction-territory-on-alarm-over-coronavirus-6290087/", "urlToImage": "https://images.indianexpress.com/2020/02/wall-street.jpg?w=759", "publishedAt": "2020-02-27T18:02:27Z", "content": "By: Reuters | \r\nPublished: February 27, 2020 11:32:27 pm\r\nThe indexes were set for their steepest weekly pullback since the global financial crisis as rising number of new infections outside China raised fears of a pandemic. (Reuters)Wall Street’s main indexe… [+2360 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "U.S. 'As Prepared as Any Country Can Be' on Coronavirus: Senator Braun", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-02-27/u-s-as-prepared-as-any-country-can-be-on-coronavirus-senator-braun-video", "urlToImage": null, "publishedAt": "2020-02-27T17:54:24Z", "content": null}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "H&M Sees No Big Delays in Supply Despite Coronavirus Outbreak", "description": "The fast fashion retailer has started reopening stores in China after closing a third of them due to the outbreak.", "url": "https://www.businessoffashion.com/articles/news-analysis/hm-sees-no-big-delays-in-supply-despite-coronavirus-outbreak", "urlToImage": null, "publishedAt": "2020-02-27T18:02:34Z", "content": null}, {"source": {"id": null, "name": "Abovethelaw.com"}, "author": "MothersEsquire", "title": "Lawyering From A Pandemic", "description": "I am not scared of contracting coronavirus; I am scared of sneezing in public.", "url": "https://abovethelaw.com/2020/02/lawyering-from-a-pandemic/", "urlToImage": "https://abovethelaw.com/uploads/2020/02/virus-sick-mask-GettyImages-1143629873.jpg", "publishedAt": "2020-02-27T17:12:01Z", "content": "(Image via Getty)\r\nEd. note\r\n: This is the latest installment in a series of posts on motherhood in the legal profession, in partnership with our friends at MothersEsquire. Welcome Lindsay Kennedy back to our pages.\r\nI live in South Korea with my young daught… [+5210 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Stephen Moyes", "title": "Could hit 80% of Brits in 'worst case scenario'...", "description": "Could hit 80% of Brits in 'worst case scenario'... (Second column, 3rd story, link ) Related stories: Vexed by how to contain virus, countries take tough steps... Schools shut, travel curbed... Infects Iranian Vice President, Kills Ambassador To Vatican... Sa…", "url": "http://www.thesun.co.uk/news/11041657/coronavirus-could-kill-500000-brits/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/02/NINTCHDBPICT000557460853.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-02-27T17:49:37Z", "content": "FOUR in five Brits could become infected by deadly coronavirus with up to 500,000 killed, according to a doomsday scenario set out in official papers seen by The Sun.\r\nMinisters are now considering the assumption that more than 50million people in the UK coul… [+2922 chars]"}, {"source": {"id": null, "name": "Morningstar.com"}, "author": null, "title": "U.S. Business Investment Rose Ahead of Coronavirus - Morningstar.com", "description": "U.S. Business Investment Rose Ahead of Coronavirus Morningstar.com", "url": "https://www.morningstar.com/news/dow-jones/2020022711461/us-business-investment-rose-ahead-of-coronavirus", "urlToImage": "https://www.morningstar.com/assets/img/30241a1.png", "publishedAt": "2020-02-27T17:48:00Z", "content": "By Amara Omeokwe and Sarah Chaney \r\nA key measure of U.S. business investment rose in January, a sign businesses were more willing to spend in early 2020, despite coronavirus risks that erupted late that month. \r\nNew orders for nondefense capital goods exclud… [+2774 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus spreads to every continent except Antarctica - CNN", "description": "There have been more than 82,000 global cases of the novel coronavirus. At least 11 European countries have confirmed cases of the strain, while South Korea ...", "url": "https://www.youtube.com/watch?v=4w2MCjIDJ3Q", "urlToImage": "https://i.ytimg.com/vi/4w2MCjIDJ3Q/maxresdefault.jpg", "publishedAt": "2020-02-27T18:07:15Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Amara Omeokwe, Sarah Chaney", "title": "U.S. Business Investment Rose Ahead of Coronavirus - The Wall Street Journal", "description": "U.S. Business Investment Rose Ahead of Coronavirus The Wall Street Journal", "url": "https://www.wsj.com/articles/u-s-durable-orders-fell-slightly-in-january-11582810338", "urlToImage": "https://images.wsj.net/im-157987/social", "publishedAt": "2020-02-27T17:33:00Z", "content": "A key measure of U.S. business investment rose in January, a sign businesses were more willing to spend in early 2020, despite coronavirus risks that erupted late that month. \r\nNew orders for nondefense capital goods excluding aircraftor what are called core … [+166 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Demitrios Kalogeropoulos", "title": "Starbucks Is Back in Business in China - Motley Fool", "description": "Management is encouraged by a recent slowdown in the spread of coronavirus.", "url": "https://www.fool.com/investing/2020/02/27/starbucks-is-back-in-business-in-china.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560313/coffee-cup.jpg", "publishedAt": "2020-02-27T17:15:00Z", "content": "Starbucks(NASDAQ:SBUX) is resuming its business in China. The coffee giant said on Thursday that it has reopened nearly all of its stores in the country after shuttering them temporarily in response to the coronavirus outbreak and the subsequent drop in custo… [+888 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The Hollywood Con Queen via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_3737752f950e9c1efcfc79d598aba2e1", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Jimmy Kimmel Asks Republicans To Name A Country On A Map And It Doesn't Go Well via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_146f9f2ae9956a9fc12a38049c566ca7", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " In your face Flat Earth society via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_43d0bb35f1e1a1ba58fe8a4663373f67", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Watch Elizabeth Warren tell a Sanders supporter that Bernie helped write the delegate rules he now opposes via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_d591cb09a549995070c7687bb578a06c", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Target raised wages. Then it cut workers' hours and doubled their workload via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_178d2394eb13297b7254c8fc4ead9c1d", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Hundreds of balloons released at Church of Scientology event. Local officials don't want it to ever happen again via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_b87a5416ce69a6afd28e9ba784c2db47", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " 5 Secret Reasons Movies Look Like Garbage via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_954b66727930bd16858f1f09df582b0c", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T17:20:09Z", "content": "Iran, Masoumeh Ebtekar, Vice President of Iran, Coronavirus\r\nMasoumeh Ebtekar, Iran's Vice President for Women and Family Affairs, has contracted the coronavirus, CBS reported Thursday, citing Iranian state..."}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Andy Greene", "title": "Flashback: The Rolling Stones and Justin Timberlake Battle SARS in 2003", "description": "Seventeen years ago, Timberlake had to dodge bottles of urine when he joined the Rolling Stones at massive concert following the SARS outbreak", "url": "https://www.rollingstone.com/music/music-news/rolling-stones-justin-timberlake-sars-concert-2003-959091/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/02/MickJaggerJustinTimberlake.jpg", "publishedAt": "2020-02-27T17:44:03Z", "content": "Fears about a coronavirus outbreak have been bubbling around the States for the past month or so, but during the past few days, the concern seems to have grown into an outright panic. The stock market is in free fall, people are stockpiling medical masks, and… [+2465 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Matt Perez, Forbes Staff, Matt Perez, Forbes Staff https://www.forbes.com/sites/mattperez/", "title": "Unity Technologies Drops Out Of The Game Developers Conference Due To The Coronavirus", "description": "It follows a string of major companies that have cancelled their participation, including Sony, Facebook and Electronic Arts.", "url": "https://www.forbes.com/sites/mattperez/2020/02/27/unity-technologies-drops-out-of-the-game-developers-conference-due-to-the-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5802d07a009800073463ed%2F960x0.jpg", "publishedAt": "2020-02-27T17:57:39Z", "content": "Unity\r\nCredit: Unity\r\nTopline: Joining a growing list of major companies to dropout from the upcoming Game Developers Conference in San Francisco, Unity Technologies announced today in a statement that it will be cancelling its participation in March due to r… [+4927 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Is the stock market overreacting to coronavirus?", "description": "The 2019 coronavirus or COVID-19 has infected over 82,000 people globally and roiled financial markets. Some are concerned and others view this as an overreaction. Here's what they're saying.", "url": "https://finance.yahoo.com/news/is-the-stock-market-overreacting-to-coronavirus-172222574.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/84hvo5H2JU_Zd5g2pJe68w--~B/aD0zNjAwO3c9NTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/e5da1cb0-58ab-11ea-a4fb-0bbc822ec50b", "publishedAt": "2020-02-27T17:22:22Z", "content": "Whats happening\r\nGlobal financial markets have reacted sharply to the coronavirus outbreaks. Trillions of dollars of value have been wiped out as the major stock market indices dropped amidst concern. The S&amp;P 500 (^GSPC) has dropped around 7% since concer… [+7303 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Rachael Kennedy", "title": "Coronavirus: Can you catch COVID-19 twice? | Euronews answers", "description": "It comes after a woman in Japan allegedly tested positive after recovering from an earlier bout.", "url": "https://www.euronews.com/2020/02/27/coronavirus-can-you-catch-covid-19-twice-euronews-answers", "urlToImage": "https://static.euronews.com/articles/stories/04/53/05/68/1000x563_cmsv2_6fef79b5-7532-51b7-8bd8-f7ccf86a0288-4530568.jpg", "publishedAt": "2020-02-27T17:14:43Z", "content": "Scientists are working to discover all they can about the behaviours of the COVID-19 coronavirus, from how it manifests itself in the body to how it spreads between people.\r\nIn treating those infected, patients are kept under strict quarantine for a period of… [+3259 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus and the 2020 elections: What candidates are saying", "description": "The 2020 Democrats have been putting forth a range of ideas to combat the coronavirus in recent days. On Thursday, Elizabeth Warren announced perhaps the most novel one.", "url": "https://finance.yahoo.com/news/coronavirus-and-the-2020-elections-what-candidates-are-saying-172344052.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/tn1zy6CmmDq1DQWxpLWxCw--~B/aD0zMTE3O3c9NDY3NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/5cb9ed80-5986-11ea-9c49-2954d464cd0d", "publishedAt": "2020-02-27T17:23:44Z", "content": "As the number of deaths caused by the coronavirus rise and the stock market continues its brutal selloff this week, the Democratic presidential candidates have come down hard on the White Houses response to the growing epidemic.\r\nThe 2020 candidates have been… [+4256 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Variety", "title": "Howard Stern calls staffer 'racist' for linking BTS to coronavirus", "description": "\"The Howard Stern Show\" host said staffer Salvatore Governale's comment linking K-pop group BTS to the coronavirus was \"racist.\"", "url": "https://www.nbcnews.com/news/asian-america/howard-stern-calls-staffer-racist-linking-bts-coronavirus-n1144251", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_09/3246981/200227-howard-stern-cs-1156a_5a8f5747ba38471e9036a4d2db7e2228.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-27T17:30:53Z", "content": "Remarks about BTS made on The Howard Stern Show are being called racist by both listeners and the shows host.\r\nDuring the February 24 episode of the SiriusXM staple, Howard Stern a notorious germaphobe brought up growing concern over the deadly coronavirus wi… [+2861 chars]"}, {"source": {"id": null, "name": "Iphonehacks.com"}, "author": "Mahit Huilgol", "title": "Apple Removes Popular iOS Game Plague.Inc from the App Store in China", "description": "Apple has informed the makers of Plague.Inc, Ndemic Creations that the game has been taken down from the App Store in China. Apple says the game was removed because “includes content that is illegal in China as determined by the Cyberspace Administration of C…", "url": "http://www.iphonehacks.com/2020/02/plague-inc-removed-app-store.html", "urlToImage": "http://cdn.iphonehacks.com/wp-content/uploads/2020/02/plague.inc_.jpg", "publishedAt": "2020-02-27T17:35:52Z", "content": "Apple has informed the makers of Plague.Inc, Ndemic Creations that the game has been taken down from the App Store in China. Apple says the game was removed because includes content that is illegal in China as determined by the Cyberspace Administration of Ch… [+1789 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Tesla shares slump as coronavirus hits China car registrations", "description": "Shares of Tesla Inc fell as much as 14% on Thursday on concerns about the impact of the coronavirus on the electric-car maker's vehicle registrations in China.  Data from LMC Automotive showed that 3,563 Tesla vehicles were registered in China in January, up …", "url": "https://finance.yahoo.com/news/tesla-shares-slump-coronavirus-hits-172247323.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T17:22:47Z", "content": "Feb 27 (Reuters) - Shares of Tesla Inc fell as much as 14% on Thursday on concerns about the impact of the coronavirus on the electric-car maker's vehicle registrations in China.\r\nData from LMC Automotive showed that 3,563 Tesla vehicles were registered in Ch… [+1731 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Eliza Relman)", "title": "Rush Limbaugh and Fox News' Laura Ingraham are denying the coronavirus risk in an attempt to protect Trump", "description": "Talk-radio host Rush Limbaugh falsely claimed \"the coronavirus is the common cold\" and argued Democrats are more of a threat than the coronavirus.", "url": "https://news.yahoo.com/coronavirus-rush-limbaugh-fox-news-173157607.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/fIV.iJYrc8KZ499xgu3u4g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NTkuNDM3NjA5ODQxODI3OA--/https://s.yimg.com/uu/api/res/1.2/0Mj6Q4F5r77R5Kt7Pnqksw--~B/aD04NTM7dz0xMTM4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/EN/business_insider_articles_888/af3f1a356b41093b019dec4520df5244", "publishedAt": "2020-02-27T17:31:57Z", "content": "Radio personality Rush Limbaugh pumps thumb after being awarded the Medal of Freedom by First Lady Melania Trump after being acknowledged by US President Donald Trump as he delivers the State of the Union address at the US Capitol in Washington, DC, on Februa… [+4819 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Looks like Pope Francis may have contracted coronavirus. Yep, we're totally screwed [News]", "description": "Looks like Pope Francis may have contracted coronavirus. Yep, we're totally screwed", "url": "https://www.fark.com/comments/10726065/Looks-like-Pope-Francis-may-have-contracted-coronavirus-Yep-were-totally-screwed", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/R/R6/fark_R6BIxZzwLIWWDJcCDxez_o6NNiQ.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583125200&Signature=M9FELcxObRNQtG%2F3zscHeUqha34%3D", "publishedAt": "2020-02-27T17:42:07Z", "content": "Red Shirt Blues:ColonelCathcart: ///then realized I wasn't catholic\r\n[Fark user image image 228x221]\r\nThere's still time Colonel.\r\nMy pope has cooler hats:/also not religious and very much agnostic in the sense that something higher must exist, but is unknowa… [+2 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Conchita Margaret Widjojo and Simon Perry", "title": "Queen's Granddaughter Zara Tindall and Husband Mike Tindall Will Not Self-Isolate After Italy Ski Trip", "description": "Zara and Mike Tindall are not self-isolating after a recent ski trip to northern Italy, where the coronavirus has been spreading. The Queen’s eldest granddaughter, 38, and her husband are following U.K. government guidelines and medical advice that self-isola…", "url": "https://people.com/royals/queens-granddaughter-zara-tindall-and-husband-mike-tindall-will-not-self-isolate-after-italy-ski-trip/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Fzara-tindall.jpg%3Fcrop%3D0px%2C179px%2C1024px%2C538px%26resize%3D1200%2C630", "publishedAt": "2020-02-27T17:53:05Z", "content": "Zara and Mike Tindall are not self-isolating after a recent ski trip to northern Italy, where the coronavirus has been spreading.\r\nThe Queen’s eldest granddaughter, 38, and her husband are following U.K. government guidelines and medical advice that self-isol… [+2176 chars]"}, {"source": {"id": null, "name": "Bklyner.com"}, "author": null, "title": "Fears of Coronavirus Bring Business Down in Sunset Park Chinatown - BKLYNER", "description": "SUNSET PARK — Sunset Park’s Chinatown’s main stretch along 8th Avenue in Brooklyn is typically bustling with shoppers and diners....", "url": "https://bklyner.com/coronavirus-sunset-park/", "urlToImage": "https://s3.amazonaws.com/bklyner/bklyner/wp-content/uploads/2020/02/IMG_4060-768x576.jpg", "publishedAt": "2020-02-27T18:02:00Z", "content": "Businesses on Sunset Park’s 8th Avenue are open and welcoming customers. Ana Lucia Murillo/Bklyner.\r\nSUNSET PARK — Sunset Parks Chinatowns main stretch along 8th Avenue in Brooklyn is typically bustling with shoppers and diners. But in the past month, local b… [+5249 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "When the Market Drops, Play the Long Game With Retirement Savings", "description": "Fear is infecting the stock market on concerns that the spread of the coronavirus will interfere with global trade. Over only six days, U.S. stocks have slid nail-bitingly close to…", "url": "https://finance.yahoo.com/news/market-drops-play-long-game-181128225.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T18:11:28Z", "content": "Fear is infecting the stock market on concerns that the spread of the coronavirus will interfere with global trade. Over only six days, U.S. stocks have slid nail-bitingly close to a correction, defined as a 10% drop from the market top.\r\nIts safe to say that… [+4362 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Mairead McArdle, Mairead McArdle", "title": "Pence Announces White House Coordinator for Coronavirus Response", "description": "Vice President Mike Pence has appointed the administration's top AIDS official as head coordinator in tackling the coronavirus in the U.S.", "url": "https://www.nationalreview.com/news/pence-announces-white-house-coordinator-for-coronavirus-response/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/RTS33S99.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-02-27T17:54:12Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Sophia Ankel), Sophia Ankel", "title": "Inside the comeback story of Tyson Fury, the undefeated 'Gypsy King' who overcame a depression and shed 112 pounds to be heavyweight champion of the world, twice", "description": "Getty Images British boxer Tyson Fury, aka the \"Gypsy King,\" won his second heavyweight title in Las Vegas on Sunday, 23 February. The fighter, who comes from a long line of gypsy fighters and has struggled with mental health issues, remains undefeated. Here …", "url": "https://www.businessinsider.com/tyson-fury-biography-of-second-time-heavy-weight-champion-2020-2", "urlToImage": "https://i.insider.com/5e551808fee23d549a7c7a93?width=1200&format=jpeg", "publishedAt": "2020-02-27T17:27:25Z", "content": null}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Kit Daniels", "title": "CDC Faces Scrutiny Over Limited Coronavirus Testing", "description": "Confirmed case of 'unknown origin' violates CDC's own testing guidelines", "url": "https://www.infowars.com/cdc-faces-scrutiny-over-limited-coronavirus-testing/", "urlToImage": "https://assets.infowars.com/2020/02/022720flowchart.jpg", "publishedAt": "2020-02-27T17:35:37Z", "content": "The Center for Disease Control is facing scrutiny over its Coronavirus testing flowchart which only considers a narrow set of circumstances before a patient is tested for the virus.\r\nThe circumstances are so limited that the testing for ‘unknown origin’ case … [+2958 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Colleen Shalby, Jaclyn Cosgrove, Taryn Luna, Dakota Smith, Soumya Karlamangla", "title": "California grapples with growing coronavirus threat: 'Everyone's concerned'", "description": "Two communities have issued emergency orders amid the COVID-19 outbreak, and health agencies say they are preparing for more cases.", "url": "https://www.latimes.com/california/story/2020-02-27/california-grapples-with-growing-coronavirus-threat-everyones-concerned", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/6580726/2147483647/strip/true/crop/6272x3293+0+359/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1e%2Fc1%2F3a7d92c941f0aff7cf660483c1f1%2F495941-sd-me-coronavirus-evacuees-airport-depart-hl-001.jpg", "publishedAt": "2020-02-27T17:30:13Z", "content": "California is coming to terms with the growing threat posed by coronavirus, as two communities issued emergency orders and a patient in Northern California was described by authorities as potentially the first in the U.S. to contract the disease through commu… [+7772 chars]"}, {"source": {"id": null, "name": "Econbrowser.com"}, "author": "Menzie Chinn", "title": "Guest Contribution: “Will the Coronavirus Lead to Global Recession?”", "description": "Today, we present a guest post written by Jeffrey Frankel, Harpel Professor at Harvard’s Kennedy School of Government, and formerly a member of the White House Council of Economic Advisers. A shorter version appeared in Project Syndicate February 24th. Februa…", "url": "http://econbrowser.com/archives/2020/02/guest-contribution-will-the-coronavirus-lead-to-global-recession", "urlToImage": null, "publishedAt": "2020-02-27T17:37:17Z", "content": "Today, we present a guest post written by Jeffrey Frankel, Harpel Professor at Harvards Kennedy School of Government, and formerly a member of the White House Council of Economic Advisers. A shorter version appeared in Project Syndicate  February 24th.\r\nFebru… [+7985 chars]"}, {"source": {"id": null, "name": "Dcist.com"}, "author": "ewilliams", "title": "As More Potential Coronavirus Cases Emerge, People Are Grabbing Masks ‘Like Hotcakes’", "description": "What people in the D.C. area need to know about the virus. The post As More Potential Coronavirus Cases Emerge, People Are Grabbing Masks ‘Like Hotcakes’ appeared first on DCist.", "url": "https://dcist.com/story/20/02/27/as-more-potential-coronavirus-cases-emerge-people-are-grabbing-masks-like-hotcakes/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/02/AP_20058508203232-1024x667.jpg", "publishedAt": "2020-02-27T17:47:10Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "UAE suspends passenger ferry services with Iran over coronavirus", "description": "The United Arab Emirates has suspended passenger ferry services with Iran until further notice over coronavirus fears, the state news agency WAM said on Thursday.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/iWfdJTesVwI/uae-suspends-passenger-ferry-services-with-iran-over-coronavirus-idUSKCN20L2KO", "urlToImage": null, "publishedAt": "2020-02-27T17:24:03Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Timothy Green)", "title": "Why Shares of Nutanix Crashed Today", "description": "A guidance cut overshadowed better-than-expected results.", "url": "https://www.fool.com/investing/2020/02/27/why-shares-of-nutanix-crashed-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560320/stock-chart-going-down.jpg", "publishedAt": "2020-02-27T17:25:00Z", "content": "What happened\r\nShares of Nutanix (NASDAQ:NTNX) tumbled on Thursday after the cloud software company reported its fiscal second-quarter results. Nutanix beat analyst estimates across the board, but the company cut its guidance for the full year. The stock was … [+1676 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Sony’s PS5 design is still a mystery, but we really hope it’s something like this", "description": "Microsoft this week revealed even more details about its upcoming Xbox Series X console, just a few months after unveiling the Xbox Series X name and design. Sony, on the other hand, doesn’t seem as ready to make any PS5 announcements of its own. The PlayStat…", "url": "https://bgr.com/2020/02/27/ps5-release-date-playstation-5-design-imagined-in-new-concept/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/01/playstation-4-ps4-controllers-sign.jpg?quality=98&strip=all", "publishedAt": "2020-02-27T17:42:19Z", "content": "Microsoft this week revealed even more details about its upcoming Xbox Series X console, just a few months after unveiling the Xbox Series X name and design. Sony, on the other hand, doesn’t seem as ready to make any PS5 announcements of its own. The PlayStat… [+2465 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Justin Baragona", "title": "Even Meghan McCain Thinks Mike Pence Will Screw Up Coronavirus Response", "description": "The View co-host Meghan McCain on Thursday blasted President Donald Trump’s decision to name Vice President Mike Pence as the administration’s coronavirus response czar, specifically highlighting Pence’s terrible record of handling an HIV outbreak as Indiana …", "url": "https://www.thedailybeast.com/even-meghan-mccain-thinks-mike-pence-will-screw-up-coronavirus-response", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_360,w_640,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1582824579/view_10_zue6ev", "publishedAt": "2020-02-27T17:46:56Z", "content": "The View co-host Meghan McCain on Thursday blasted President Donald Trumps decision to name Vice President Mike Pence as the administrations coronavirus response czar, specifically highlighting Pences terrible record of handling an HIV outbreak as Indiana gov… [+2750 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Amanda Woods", "title": "Coronavirus death toll surges in Iran, Italy as spread continues", "description": "More people have died from the coronavirus in Italy and Iran, while the bug has now spread to several new counties across Europe, according to reports Thursday. Two more people have died from the virus in Italy, bringing country’s death toll to 14, while 528 …", "url": "https://nypost.com/2020/02/27/coronavirus-death-toll-surges-in-iran-italy-as-spread-continues/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/italy-coronavirus-65.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-27T18:03:26Z", "content": "More people have died from the coronavirus in Italy and Iran, while the bug has now spread to several new counties across Europe, according to reports Thursday.\r\nTwo more people have died from the virus in Italy, bringing the country’s death toll to 14, while… [+1516 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "FREE FLOW OF INFORMATION: The Coronavirus Outbreak: How Democratic Taiwan Outperformed Authoritaria…", "description": "FREE FLOW OF INFORMATION: The Coronavirus Outbreak: How Democratic Taiwan Outperformed Authoritarian China.", "url": "https://pjmedia.com/instapundit/359698/", "urlToImage": null, "publishedAt": "2020-02-27T17:20:18Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Kuwait suspends studies at military institutions over coronavirus fears: KUNA", "description": "The Kuwaiti army will suspend studies at military colleges and schools for two weeks from March 1 due to concerns about the coronavirus outbreak, state news agency KUNA said on Thursday.", "url": "https://www.reuters.com/article/us-china-health-kuwait-idUSKCN20L2NU", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T18:00:01Z", "content": "DUBAI (Reuters) - The Kuwaiti army will suspend studies at military colleges and schools for two weeks from March 1 due to concerns about the coronavirus outbreak, state news agency KUNA said on Thursday. \r\nEarlier on Thursday, a Kuwaiti health ministry offic… [+192 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "ROGER SIMON: For Democrats, Coronavirus Is the New Russia… Or, Is It Ukraine?…", "description": "ROGER SIMON: For Democrats, Coronavirus Is the New Russia… Or, Is It Ukraine?", "url": "https://pjmedia.com/instapundit/359721/", "urlToImage": null, "publishedAt": "2020-02-27T17:45:55Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "MEANWHILE, OVER AT VODKAPUNDIT: What Will the Left Do When A Billion-Jillion Americans Don’t Die of …", "description": "MEANWHILE, OVER AT VODKAPUNDIT: What Will the Left Do When A Billion-Jillion Americans Don’t Die of Coronavirus?", "url": "https://pjmedia.com/instapundit/359726/", "urlToImage": null, "publishedAt": "2020-02-27T17:57:31Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Italy plays down coronavirus risk as death toll rises, cases jump", "description": "Italy's government, desperate to stave off a likely recession, played down on Thursday the gravity of an outbreak of coronavirus, the worst yet seen in Europe, saying it only impacted a tiny fraction of the country.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/xgQXH-EyYNs/italy-plays-down-coronavirus-risk-as-death-toll-rises-cases-jump-idUSKCN20L13W", "urlToImage": null, "publishedAt": "2020-02-27T17:54:02Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Three more people die from coronavirus in Italy: civil protection agency", "description": "Three more people have died in Italy from coronavirus, bringing the death toll from the worst outbreak of the illness in Europe to 17, the Civil Protection Agency said on Thursday.", "url": "https://www.reuters.com/article/us-china-health-italy-casualties-idUSKCN20L2NO", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T17:55:33Z", "content": "ROME (Reuters) - Three more people have died in Italy from coronavirus, bringing the death toll from the worst outbreak of the illness in Europe to 17, the Civil Protection Agency said on Thursday. \r\nThe number of confirmed cases has risen to 650, officials s… [+219 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "David Morgan", "title": "U.S. officials say they are ramping up efforts to guard against coronavirus", "description": "U.S. officials on Thursday said they were ramping up efforts to guard Americans against a local spread of the new coronavirus, dispatching test kits nationwide, and promising funding legislation within the next two weeks.", "url": "https://www.reuters.com/article/us-china-health-usa-idUSKCN20L2O3", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496094244&w=1200&r=LYNXNPEG1Q1MT", "publishedAt": "2020-02-27T18:08:35Z", "content": "WASHINGTON/NEW YORK (Reuters) - U.S. officials on Thursday said they were ramping up efforts to guard Americans against a local spread of the new coronavirus, dispatching test kits nationwide, and promising funding legislation within the next two weeks. \r\nAt … [+4476 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mairead McArdle", "title": "Pence Announces White House Coordinator for Coronavirus Response", "description": "Vice President Mike Pence has appointed the administration's top AIDS official as head coordinator in tackling the coronavirus in the U.S., the White House said Thursday.Ambassador Debbie Birx will serve as \"White House Coronavirus Response Coordinator\" and r…", "url": "https://news.yahoo.com/pence-announces-white-house-coordinator-175412689.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5xBcFnDYKjpC8EJDNTze0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/.GWoqfmkFWMvwKGvd1LBQA--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/42253cd976718bb0541221dda734a622", "publishedAt": "2020-02-27T17:54:12Z", "content": "Vice President Mike Pence has appointed the administrations top AIDS official as head coordinator in tackling the coronavirus in the U.S., the White House said Thursday.\r\nAmbassador Debbie Birx will serve as White House Coronavirus Response Coordinator and re… [+2011 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Tesla shares slump as coronavirus hits China car registrations", "description": "Data from LMC Automotive showed that 3,563 Tesla vehicles were registered in China in January, up from 853 vehicles a year earlier, but down from the 6,613 vehicles registered in December. Tesla registrations fluctuate significantly from month to month, LMC d…", "url": "https://finance.yahoo.com/news/tesla-shares-slump-coronavirus-hits-173302671.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/l79IE5HV4UL464qY5CAxPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/UHaIVs1DckvLFQChAniANg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0ab7c08c22e672069a05ee7b31e8a22a", "publishedAt": "2020-02-27T17:33:02Z", "content": "(Reuters) - Shares of Tesla Inc &lt;TSLA.O&gt; fell as much as 14% on Thursday on concerns about the impact of the coronavirus on the electric-car maker's vehicle registrations in China.\r\nData from LMC Automotive showed that 3,563 Tesla vehicles were register… [+1740 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Tesla shares slump as coronavirus hits China car registrations", "description": "Data from LMC Automotive showed that 3,563 Tesla vehicles were registered in China in January, up from 853 vehicles a year earlier, but down from the 6,613 vehicles registered in December. Tesla registrations fluctuate significantly from month to month, LMC d…", "url": "https://finance.yahoo.com/news/tesla-shares-slump-coronavirus-hits-172644209.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Lt8aIB9mb03y4wc2JFolLA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02NzAuNA--/https://s.yimg.com/uu/api/res/1.2/vWVro8m18p8HT7JwFSsdvQ--~B/aD00MTk7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/36e0a47320944d596ebff9db05bb1300", "publishedAt": "2020-02-27T17:26:44Z", "content": "(Reuters) - Shares of Tesla Inc fell as much as 14% on Thursday on concerns about the impact of the coronavirus on the electric-car maker's vehicle registrations in China.\r\nData from LMC Automotive showed that 3,563 Tesla vehicles were registered in China in … [+1724 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Tesla shares slump as coronavirus hits China car registrations", "description": "Data from LMC Automotive showed that 3,563 Tesla vehicles were registered in China in January, up from 853 vehicles a year earlier, but down from the 6,613 vehicles registered in December. Tesla registrations fluctuate significantly from month to month, LMC d…", "url": "https://finance.yahoo.com/news/tesla-shares-slump-coronavirus-hits-173302548.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/anJpq9ET6UhixaBrWf0D5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/_nApSxICdZfrn4Xbv8OomQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/0ab7c08c22e672069a05ee7b31e8a22a", "publishedAt": "2020-02-27T17:33:02Z", "content": "(Reuters) - Shares of Tesla Inc &lt;TSLA.O&gt; fell as much as 14% on Thursday on concerns about the impact of the coronavirus on the electric-car maker's vehicle registrations in China.\r\nData from LMC Automotive showed that 3,563 Tesla vehicles were register… [+1740 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Bonnie Kristian", "title": "What it's like to be in Venice during coronavirus lockdown", "description": "Coronavirus has come to Italy, where 528 cases of infection and 12 deaths have been reported as of Thursday. In the northern part of the country, a dozen towns are on lockdown, with fines to be levied against anyone caught coming or going. But perhaps the mos…", "url": "https://theweek.com/articles/897972/what-like-venice-during-coronavirus-lockdown", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/venice_virus.jpg?itok=ZRwqUWKM", "publishedAt": "2020-02-27T18:04:03Z", "content": "Coronavirus has come to Italy, where 528 cases of infection and 12 deaths have been reported as of Thursday. In the northern part of the country, a dozen towns are on lockdown, with fines to be levied against anyone caught coming or going. But perhaps the mos… [+8119 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribers)", "title": "Steven Madden Ltd (SHOO) Q4 2019 Earnings Call Transcript", "description": "SHOO earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/27/steven-madden-ltd-shoo-q4-2019-earnings-call-trans.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-27T18:00:35Z", "content": "Image source: The Motley Fool.\r\nSteven Madden Ltd (NASDAQ:SHOO)Q4 2019 Earnings CallFeb 27, 2020, 8:30 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nGood morning. My … [+45028 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "Are the elderly at a greater risk for coronavirus complications?", "description": "Experts agree the available data on new coronavirus cases around the world suggests elderly people who contract the virus are at a greater risk for complications and death than other individuals.", "url": "https://www.sfgate.com/bayarea/article/elderly-seniors-coronavirus-great-risk-death-sick-15089210.php", "urlToImage": "https://s.hdnux.com/photos/01/10/40/53/19008254/137/rawImage.jpg", "publishedAt": "2020-02-27T17:24:45Z", "content": "<ul><li>In this Sunday, Feb. 9, 2020, photo released by Xinhua News Agency, doctors scan a patient's lungs at Huoshenshan temporary hospital built for patients diagnosed with coronavirus in Wuhan in central China's Hubei province. Mainland China has reported … [+5195 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Leigh Mcmanus For Mailonline", "title": "NHS would sacrifice most vulnerable patients' critical care during coronavirus surge, medics admit", "description": "Under 'Three Wise Men' protocol, senior medics would need to decipher which patients to give care such as ventilators and beds to, with a focus on saving those most likely to recover.", "url": "https://www.dailymail.co.uk/health/article-8052295/NHS-sacrifice-vulnerable-patients-critical-care-coronavirus-surge-medics-admit.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/27/17/25264078-0-image-a-55_1582823957898.jpg", "publishedAt": "2020-02-27T17:36:00Z", "content": "Someone who is infected with the coronavirus can spread it with just a simple cough or a sneeze, scientists say.\r\nNearly 3,000 people with the virus are now confirmed to have died and more than 80,000 have been infected. Here's what we know so far:\r\nWhat is t… [+12336 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Christian Datoc", "title": "Vice President Mike Pence Names Deborah Birx As The White House’s Coronavirus Response Coordinator", "description": "Vice President Mike Pence announced Thursday that Ambassador Deborah Birx will join the coronavirus task force as White House coronavirus response director. “Ambassador Birx is a world renowned global health official and physician,” the vice president’s offic…", "url": "https://dailycaller.com/2020/02/27/mike-pence-debbie-birx-white-house-coronavirus-response-coordinator-global-aids/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/GettyImages-1208914619-e1582824973346.jpg", "publishedAt": "2020-02-27T17:51:12Z", "content": "Vice President Mike Pence announced Thursday that Ambassador Deborah Birx will join the coronavirus task force as White House coronavirus response director.\r\n“Ambassador Birx is a world renowned global health official and physician,” the vice president’s offi… [+1937 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Coronavirus Threatens EU’s Rapprochement with China", "description": "The China-EU summit in Beijing, scheduled for 31 March, may not take place due to the coronavirus epidemic. It was reported by SCMP; citing diplomatic sources in the EU, and noting that Chinese Vice-Premier Liu He's visit to Brussels had previously been cance…", "url": "https://sputniknews.com/world/202002271078421345-coronavirus-threatens-eus-rapprochement-with-china/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107838/93/1078389312.jpg", "publishedAt": "2020-02-27T18:05:18Z", "content": "The China-EU summit in Beijing, scheduled for 31 March, may not take place due to the coronavirus epidemic. It was reported by SCMP; citing diplomatic sources in the EU, and noting that Chinese Vice-Premier Liu He's visit to Brussels had previously been cance… [+4111 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Martin Finucane", "title": "Warren introduces bill to transfer funding from border wall to efforts to combat coronavirus", "description": "The Democratic presidential candidate said funds should be diverted from Trump's 'racist border wall' to combating coronavirus.", "url": "https://www.bostonglobe.com/2020/02/27/metro/warren-introduces-bill-transfer-funding-border-wall-efforts-combat-coronavirus/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=140", "publishedAt": "2020-02-27T17:53:51Z", "content": "The text of Warrens bill proposing the Prioritizing Pandemic Prevention Act\" was attached to the tweet.\r\nIt calls for any unobligated Federal funds appropriated or otherwise made available to plan, develop, or construct a phsyical barrier along the internatio… [+3150 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "SA Transcripts", "title": "Garrett Motion (GTX) CEO, Olivier Rabiller on Q4 2019 Results - Earnings Call Transcript", "description": "", "url": "https://seekingalpha.com/article/4327761-garrett-motion-gtx-ceo-olivier-rabiller-on-q4-2019-results-earnings-call-transcript", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-27T17:25:44Z", "content": "Garrett Motion Inc. (NYSE:GTX) Q4 2019 Earnings Conference Call February 27, 2020 9:00 AM ET\r\nCompany Participants\r\nOlivier Rabiller - President, Chief Executive Officer\r\nPeter Bracke - Vice President, interim Chief Financial Officer\r\nPaul Blalock - Investor … [+41679 chars]"}, {"source": {"id": null, "name": "Popville.com"}, "author": "Prince Of Petworth", "title": "“DC Health Department Confirms No Coronavirus Cases in DC”", "description": "Photo by Chris Chern\r\n\r\nFrom the Mayor's Office:\r\n\r\n\"Mayor Muriel Bowser has directed her Administration's agencies to monitor developments related to the coronavirus occurring across the globe and in the United States. DC Health has confirmed that there are …", "url": "https://www.popville.com/2020/02/dc-health-department-confirms-no-coronavirus-cases-in-dc/", "urlToImage": "https://s26552.pcdn.co/wp-content/uploads/2020/02/mask-e1582825096824.jpg", "publishedAt": "2020-02-27T17:40:18Z", "content": "Photo by Chris Chern\r\nFrom the Mayor’s Office:\r\n“Mayor Muriel Bowser has directed her Administration’s agencies to monitor developments related to the coronavirus occurring across the globe and in the United States. DC Health has confirmed that there are no c… [+3991 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Lisa M. Krieger, Annie Sciacca", "title": "Coronavirus: Solano County woman waited 11 days for test results - The Mercury News", "description": "Coronavirus: Solano County woman waited 11 days for test results The Mercury News After mystery coronavirus case in California, health officials go into detective mode NBC News State health officials, California Governor respond to coronavirus COVID-19 concer…", "url": "https://www.mercurynews.com/coronavirus-want-a-test-to-see-if-you-have-it-youll-have-to-wait", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/02/coronavirus-generic-graphic.png?w=720&h=405", "publishedAt": "2020-02-27T17:29:00Z", "content": "A Solano County woman now critically ill with coronavirus was hospitalized for 11 days before her infection was detected, raising the prospect of broader, uncontrolled community exposure to the dangerous respiratory disease.\r\nThe failure to test the woman, wh… [+7159 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "As coronavirus spreads, U.S.-Korean military exercises are suspended and Japanese schools close", "description": "As coronavirus continues to spread across Asia and elsewhere, public schools in Japan will be closed for more than a month and this summer's Tokyo Olympics are called into question. The U.S. and South Korea are also suspending military exercises indefinitely.…", "url": "https://www.cbsnews.com/video/coronavirus-outbreak-continues-to-roil-asia-as-us-korean-military-exercises-are-suspended-and-japanese-schools-close/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2017/08/10/3102a9a6-d90c-4086-a984-1abe061746ba/thumbnail/1200x630/cb16e63b818055ab94b94871817dbcd6/news2.jpg", "publishedAt": "2020-02-27T17:13:34Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}]