[{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "Supplements Won't Protect You From COVID-19", "description": "Elderberry syrup? Vitamin C? If you’re looking for extra protection from the coronavirus, please put those back on the pharmacy shelf and go home and wash your hands. Yes, even if Doctor Oz just told you to buy them. Read more...", "url": "https://vitals.lifehacker.com/supplements-wont-protect-you-from-covid-19-1842245758", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/kjkeyif7ajum1kzkfksq.jpg", "publishedAt": "2020-03-10T20:15:00Z", "content": "Elderberry syrup? Vitamin C? If youre looking for extra protection from the coronavirus, please put those back on the pharmacy shelf and go home and wash your hands. Yes, even if Doctor Oz just told you to buy them. \r\nSupplements have never been shown to beat… [+1247 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Dharna Noor on Earther, shared by Brian Kahn to Gizmodo", "title": "A Fracking Bailout Is A Terrible Idea", "description": "The U.S. government definitely has its priorities in order. Apparently, it’s considering using the coronavirus outbreak as an excuse to pour money into fossil fuel companies. Read more...", "url": "https://earther.gizmodo.com/a-fracking-bailout-is-a-terrible-idea-1842246263", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bqx2t8ef3qxseto1t4zh.jpg", "publishedAt": "2020-03-10T20:47:00Z", "content": "The U.S. government definitely has its priorities in order. Apparently, its considering using the coronavirus outbreak as an excuse to pour money into fossil fuel companies.\r\nThe Washington Post reports that the Trump administration is considering kicking mon… [+2933 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "New York Auto Show delayed until August", "description": "Organizers of the 2020 New York International Auto Show have postponed the event until August due to concerns about the COVID-19 outbreak. The New York Auto Show, which is organized by the Greater New York Automobile Dealers Association, was scheduled to begi…", "url": "http://techcrunch.com/2020/03/10/new-york-auto-show-delayed-until-august/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/mercedes-ny-auto.jpg?w=600", "publishedAt": "2020-03-10T20:56:51Z", "content": "Organizers of the 2020 New York International Auto Show have postponed the event until August due to concerns about the COVID-19 outbreak.\r\nThe New York Auto Show, which is organized by the Greater New York Automobile Dealers Association, was scheduled to beg… [+1550 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New York Auto Show set to be postponed to August because of coronavirus", "description": "The New York auto show is set to be postponed until August because of the coronavirus outbreak, automakers and a spokesman for the show said Tuesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-auto-show-idUSKBN20X2ZG", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T20:32:47Z", "content": "(Reuters) - The New York auto show is set to be postponed until August because of the coronavirus outbreak, automakers and a spokesman for the show said Tuesday. \r\nThe annual event, which draws thousands of reporters and hundreds of thousands of visitors, is … [+251 chars]"}, {"source": {"id": null, "name": "Msn.com"}, "author": null, "title": "Walmart, Apple and Olive Garden are among major employers updating sick leave policies as coronavirus cases spread - msnNOW", "description": "Walmart, Apple and Olive Garden are among major employers updating sick leave policies as coronavirus cases spread msnNOW Olive Garden's parent begins offering paid sick leave to all employees amid coronavirus outbreak CNBC Orlando-based Darden Restaurants wi…", "url": "https://www.msn.com/en-us/money/companies/walmart-apple-and-olive-garden-are-among-major-employers-updating-sick-leave-policies-as-coronavirus-cases-spread/ar-BB110k3q", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB110k3c.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=1493&y=696", "publishedAt": "2020-03-10T20:45:00Z", "content": "Video by TodayThe coronavirus outbreak that is quickly spreading throughout the country is forcing major American companies to rethink how they approach paid sick leave. More than 30 million U.S. workers many of them low-wage service employees at restaurants,… [+6091 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Are viruses more likely to spread on cruise ships? - CBC News", "description": "Are viruses more likely to spread on cruise ships? CBC News Canadian Grand Princess cruise ship passengers arrive for quarantine at CFB Trenton CTV News Hundreds on coronavirus-hit Grand Princess anxiously wait to disembark The Guardian COVID-19: Why are crui…", "url": "https://www.youtube.com/watch?v=VMLQkn5MDlg", "urlToImage": "https://i.ytimg.com/vi/VMLQkn5MDlg/maxresdefault.jpg", "publishedAt": "2020-03-10T20:18:09Z", "content": "Dr. Kate Bunyan, a former cruise ship doctor, says the notion that cruise ships are a breeding ground for bugs and viruses such as COVID-19 is incorrect. People are no more likely to get sick on a cruise ship than at a hospital or a school.\r\n»»» Subscribe to … [+983 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Colorado's governor just declared a state of emergency over coronavirus", "description": "Colorado declared a state of emergency on Tuesday after the 15th coronavirus case was confirmed in a matter of days. The patients have been located all over the state, not clustered in a single area. The state of emergency involves granting sick leave for peo…", "url": "https://www.businessinsider.com/colorado-governor-declares-state-of-emergency-over-coronavirus-covid-19-2020-3", "urlToImage": "https://i.insider.com/536be56beab8ea1e4833ed1e?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:18:50Z", "content": "Colorado Gov. Jared Polis declared a state of emergency over the coronavirus on Tuesday after the state confirmed its 15th case, all of them in a matter of days.\r\nWhile that may not be as many confirmed cases as other states, the concerning part is that the c… [+1462 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "The coronavirus' average incubation period is 5 days, a study shows — but in 1% of cases, it may last longer than the standard 2-week quarantine", "description": "The new coronavirus has killed at least 4,000 people and infected more than 116,000. In a new study, scientists found that the virus' average incubation period — the length of time between infection and testing positive for the illness — is five days. The new…", "url": "https://www.businessinsider.com/coronavirus-incubation-period-5-days-average-can-exceed-2-weeks-2020-3", "urlToImage": "https://i.insider.com/5e67d9df54f25c63c3653735?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:53:00Z", "content": "Since the start of the coronavirus outbreak, researchers have been racing to answer a critical question: How much time passes between when a patient gets infected and when their coronavirus test comes back positive?\r\nThe estimates have been wide-ranging. Acco… [+5488 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bryan Pietsch", "title": "Massachusetts just declared a state of emergency after 92 residents tested positive for the coronavirus", "description": "Massachusetts Governor Charlie Baker declared a state of emergency for the state on Tuesday. He said in a press conference that the declaration would give his government more flexibility to \"respond to this evolving outbreak.\" Massachusetts Health and Human S…", "url": "https://www.businessinsider.com/massachusetts-declares-state-of-emergency-over-coronavirus-covid-19-2020-3", "urlToImage": "https://i.insider.com/5e67f57284159f12760611f2?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:22:46Z", "content": "Massachusetts declared a state of emergency on Tuesday as the state tries to manage a \"significant uptick\" of coronavirus cases. \r\n\"Today, I'm declaring a state of emergency in Massachusetts,\" said Governor Charlie Baker. \"This declaration will give our admin… [+397 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Will Weissert / AP", "title": "Bernie Sanders and Joe Biden Cancel Ohio Campaign Events Amid Coronavirus Concerns", "description": "The two Democratic presidential front runners abruptly canceled scheduled rallies in Cleveland amid concerns over the spread of coronavirus.", "url": "https://time.com/5800514/sanders-biden-events-ohio-canceled/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/sanders-biden-campaign-events-ohio-canceled.jpg?quality=85&crop=0px%2C204px%2C4534px%2C2373px&resize=1200%2C628&strip", "publishedAt": "2020-03-10T21:11:16Z", "content": "(WASHINGTON) — Democratic presidential candidates Bernie Sanders and Joe Biden abruptly canceled scheduled rallies Tuesday night in Cleveland amid concerns over the spread of the new coronavirus — as public health fears began transforming the 2020 race.\r\nSand… [+2312 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump says it's not a 'big deal' he hasn't been tested for coronavirus, despite interacting with GOP lawmakers who've self-quarantined", "description": "President Donald Trump on Tuesday said he doesn't \"feel any reason\" to be tested for coronavirus, but also signaled he'd be open to it. \"I don't think it is a big deal. I don't feel any reason — I feel extremely good. I feel very good, but I guess it's not a …", "url": "https://www.businessinsider.com/trump-says-not-big-deal-he-hasnt-been-tested-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e666116fee23d6e612b7092?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:54:45Z", "content": "President Donald Trump on Tuesday said it's not a \"big deal\" he's not been tested for coronavirus, even though he's been in the vicinity of GOP lawmakers who have self-quarantined after discovering they interacted with an infected person. \r\nBut the president … [+1481 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: New York sets up containment zone, EU to establish €25B fund for economy - CNET", "description": "Latest COVID-19 updates: An area of New York state has been designated a containment zone, Massachusetts declares a state of emergency, and the EU wants to set up a fund to address the outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-new-york-sets-up-containment-zone-eu-to-establish-eur25b-fund-for-economy/", "urlToImage": "https://cnet3.cbsistatic.com/img/HVJXYNBvtQh-3T-4WTDE0fqE1H8=/756x567/2020/03/09/8ef1deeb-c72b-4895-97be-7ad2c1cf3487/gettyimages-1204352391.jpg", "publishedAt": "2020-03-10T21:06:00Z", "content": "Coronavirus has spread across every continent, except Antarctica, leaving some cities empty.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a newly identified coronavirus first detected in China in December, has rapidly spread across the globe … [+39994 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Bernie Sanders cancels election night rally in Ohio over coronavirus concerns", "description": "Concerns over coronavirus led Sen. Bernie Sanders to cancel an election night rally on Tuesday. The rally was set to be held in Cleveland, Ohio. \"Out of concern for public health and safety, we are canceling tonight's rally in Cleveland,\" Sanders' campaign sa…", "url": "https://www.businessinsider.com/bernie-sanders-cancels-ohio-election-night-rally-over-coronavirus-concerns-2020-3", "urlToImage": "https://i.insider.com/5e67f7fc54f25c109d5c9058?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:34:42Z", "content": "Sen. Bernie Sanders and former Vice President Joe Biden on Tuesday announced they're canceling election night rallies in Cleveland, Ohio, over concerns linked to the novel coronavirus. \r\n\"Out of concern for public health and safety, we are canceling tonight's… [+1480 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Haven Orecchio-Egresitz", "title": "A UK arcade is luring in customers by offering up toilet paper and cleaning products as prizes", "description": "A UK arcade has replaced the toys in its grabber machines with toilet paper and hand sanitizer. People around the world are panic shopping amid coronavirus concerns. Rob Braddick, who owns the arcade, told CNN that he wanted to cheer people up. Visit Business…", "url": "https://www.businessinsider.com/you-can-win-toilet-paper-cleaning-products-at-uk-arcade-2020-3", "urlToImage": "https://i.insider.com/5e67f439e4f9fe1143241af5?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:21:13Z", "content": "With coronavirus concerns prompting panic shopping around the world, an arcade in the UK has packed its grabber machines with toilet paper and cleaning supplies. \r\nRob Braddick, who owns Braddick's Holiday Park in Westward Ho!, Devon, (and yes, the town has a… [+1382 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "James Longman", "title": "Coronavirus outbreak in Europe has many asking, 'Why Italy?': Reporter's Notebook", "description": "The coronavirus outbreak in Europe has many asking, \"Why Italy?\" James Longman reports.", "url": "https://abcnews.go.com/Health/coronavirus-outbreak-europe-italy-reporters-notebook/story?id=69509633", "urlToImage": "https://s.abcnews.com/images/Health/coronavirus-7-gty-er-200310_hpMain_16x9_992.jpg", "publishedAt": "2020-03-10T20:21:58Z", "content": "It's among the most clichéd journalistic tropes: to speak to the taxi driver en route to the airport and use those comments as some kind of gauge for the national sentiment.\r\nBut at just after 5 a.m. on Tuesday, my cab driver cried as we drove to Rome's Fiumi… [+2772 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "TSN.ca Staff", "title": "MLSE: Ticket refunds will be considered case by case - TSN", "description": "MLSE: Ticket refunds will be considered case by case TSN History of Maple Leafs players to score 50 goals in a season Sportsnet.ca Ferraro shares something odd he noticed between the benches about the Leafs TSN Toronto Maple Leafs: A Look At the Toronto Marli…", "url": "https://www.tsn.ca/mlse-leafs-raptors-and-tfc-ticket-refunds-will-be-considered-case-by-case-1.1455637", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1319932!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/scotiabank-arena.jpg", "publishedAt": "2020-03-10T20:53:36Z", "content": "Customers of the Toronto Maple Leafs, Raptors and Toronto FC who have coronavirus symptoms and have been quarantined will be considered for ticket refunds on a case-by-case basis, a Maple Leaf Sports &amp; Entertainment spokesman told TSN Senior Correspondent… [+1495 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin McDowell", "title": "9 ways to protect yourself from getting sick in an open office", "description": "With the number of coronavirus cases increasing, you may be wondering how to protect yourself from getting sick while at work. According to a new survey, 52.9% of Americans believe open offices will lead to an increase in coronavirus infections, and 41% belie…", "url": "https://www.businessinsider.com/ways-to-protect-yourself-from-illness-office", "urlToImage": "https://i.insider.com/5e665d38fee23d69105a72d3?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:13:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "The CDC recommends wearing disposable latex gloves when disinfecting your home — here's where to buy them affordably as prices on cleaning supplies surge", "description": "Latex, nitrile, and vinyl gloves can be used for a number of purposes, like protecting your hands while you clean your home or office. The CDC recommends wearing disposable gloves while cleaning and throwing them out after you're done using them. As fears of …", "url": "https://www.businessinsider.com/where-to-buy-affordable-latex-gloves", "urlToImage": "https://i.insider.com/5e67f41454f25c0b631244d5?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:56:00Z", "content": "When you buy through our links, we may earn money from our affiliate partners. Learn more.\r\nWear latex gloves while disinfecting your space to protect your hands from germs.\r\nEliyahu Ungar-Sargon/Shutterstock\r\nDoor handles, kitchen counters, tables, phones, a… [+1694 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Richard Cowan, Susan Cornwell and David Morgan", "title": "'We are the last to leave': Pelosi resists closing Congress amid coronavirus crisis", "description": "U.S. lawmakers rejected on Tuesday the idea of shutting down Congress as the highly contagious coronavirus spreads in the United States, conscious of the need to show calm in the face of the unfolding public health crisis. \"We are the captains of the ship,\" H…", "url": "https://news.yahoo.com/last-leave-pelosi-resists-closing-205656699.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.dC0B8T34RiEVHCz8iSUFQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDQ-/https://s.yimg.com/uu/api/res/1.2/fY9hMgJJP5yTgVZZwKBCzw--~B/aD01NjU7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/641a6e01f22d27f013ac6568f165d65b", "publishedAt": "2020-03-10T20:56:56Z", "content": "By Richard Cowan, Susan Cornwell and David Morgan\r\nWASHINGTON (Reuters) - U.S. lawmakers rejected on Tuesday the idea of shutting down Congress as the highly contagious coronavirus spreads in the United States, conscious of the need to show calm in the face o… [+3776 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Yahoo News", "title": "Only 6,563 Americans Have Been Tested For It So Far", "description": "But confusion about the exact number of people tested persists even at the highest reaches of government.", "url": "https://www.huffpost.com/entry/americans-tested-for-coronavirus-so-far_n_5e67f271c5b60557280cede6", "urlToImage": "https://img.huffingtonpost.com/asset/5e67f34d2600001123b6098d.jpeg?cache=pcy7plo4zv&ops=1778_1000", "publishedAt": "2020-03-10T20:12:38Z", "content": "Despite vows to drastically expand the coronavirus testing regime, federal and state public health authorities have tested only 6,563 people for the coronavirus as of Tuesday morning, according to the Centers for Disease Control and Prevention and numbers pro… [+4320 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Cameron Joseph, Anne Torpey", "title": "Bernie Sanders Cancels Cleveland Rally Over Coronavirus Concerns", "description": "It's the first time a presidential campaign has canceled a publicly scheduled event.", "url": "https://www.vice.com/en_us/article/jgeaw3/bernie-sanders-cancels-cleveland-rally-over-coronavirus-concerns", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e67f83a19a7d8009dd3d308/lede/1583872242657-AP_20070664498583.jpeg?crop=1xw:0.8418252780153977xh;center,center&resize=1200:*", "publishedAt": "2020-03-10T20:37:04Z", "content": "WASHINGTON The pandemic has officially hit the campaign trail.\r\n Bernie Sanders presidential campaign has canceled a planned Tuesday rally in Cleveland over local health officials concerns about the coronavirus.\r\n The decision marks the first time a president… [+1272 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Ross Marowits", "title": "North American stock markets partially rebound on stimulus hope and higher crude - CTV News", "description": "North American stock markets partially rebound on stimulus hope and higher crude CTV News As the TSX tanked, this was the only stock that stayed in the green Yahoo Canada Finance Buffett Indicator: How Much Further Will the TSX Stock Market Crash? The Motley …", "url": "https://www.ctvnews.ca/business/north-american-stock-markets-partially-rebound-on-stimulus-hope-and-higher-crude-1.4846103", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4846500.1583851782!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-10T21:09:00Z", "content": "TORONTO -- \r\nCanada's main stock index partially rebounded from its worst one-day decline in more than 30 years on the promise of fiscal stimulus by the U.S. and other governments and a lift in oil prices.\r\nThe S&amp;P/TSX composite index gained as much as 54… [+4914 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Ruby Cramer", "title": "Bernie Sanders And Joe Biden Canceled Election Night Rallies Over Coronavirus Concerns", "description": "“All future Bernie 2020 events will be evaluated on a case by case basis,\" Sanders' campaign said. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/rubycramer/bernie-sanders-coronavirus-biden-ohio-election", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/10/20/asset/99d1b62e3a35/sub-buzz-240-1583871549-1.jpg?crop=3000:1571;0,78", "publishedAt": "2020-03-10T20:53:53Z", "content": "ROMULUS, Mich. Bernie Sanders and Joe Biden canceled their election night rallies in Cleveland, Ohio, at the last minute Tuesday over concerns about the coronavirus outbreak.\r\nThe Sanders campaign said that all future campaign events would be evaluated on a c… [+2929 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Summer Meza", "title": "Trump defies expert opinions on coronavirus: 'It will go away, just stay calm'", "description": "President Trump's comments on the COVID-19 coronavirus diverge slightly from other officials.During a Tuesday press conference, Trump sought to reassure the public, saying everything from \"it will go away, just stay calm,\" to stating the U.S. has done a \"very…", "url": "https://news.yahoo.com/trump-defies-expert-opinions-coronavirus-202600585.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QVuAOuEZHi_3vKkNDvCgOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/fc0a6G9.Tno__uRV.fMJ9A--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/37befd2723e50a49d75806753231cf03", "publishedAt": "2020-03-10T20:26:00Z", "content": "President Trump's comments on the COVID-19 coronavirus diverge slightly from other officials.\r\nDuring a Tuesday press conference, Trump sought to reassure the public, saying everything from \"it will go away, just stay calm,\" to stating the U.S. has done a \"ve… [+2164 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "'Star Trek' shields up: US lawmakers advised to use Vulcan greeting to avoid coronavirus exposure", "description": "As coronavirus continues to spread around the world, lawmakers suggest another measure to prevent the spread of disease: a Vulcan greeting.", "url": "https://www.space.com/coronavirus-star-trek-spock-vulcan-greeting.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kMFJjsRDbNLmQ3MGCwbhsL-1200-80.jpg", "publishedAt": "2020-03-10T21:10:54Z", "content": "As the coronavirus responsible for COVID-19 continues to spread around the world, lawmakers suggest another measure to prevent the spread of disease: a Vulcan greeting. \r\nWhile hand washing and limiting exposure remain ideal ways to protect yourself and other… [+1311 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": null, "title": "Bernie Sanders Cancels Cleveland Rally Amid Ohio Coronavirus Concerns", "description": "Vermont Sen. Bernie Sanders has canceled a rally in downtown Cleveland scheduled for Tuesday night amid concerns about coronavirus.", "url": "https://www.cleveland.com/open/2020/03/bernie-sanders-cancels-cleveland-rally-amid-ohio-coronavirus-concerns.html", "urlToImage": "https://www.cleveland.com/resizer/tn1dPlF_VyRRH1lq2dsKMTS5jGQ=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/5XOYAR554ZB4JLOCVPECL4ORV4.JPG", "publishedAt": "2020-03-10T20:52:40Z", "content": "CLEVELAND, Ohio - Democratic presidential candidate Bernie Sanders has canceled a planned rally in downtown Cleveland Tuesday night amid concerns about the coronavirus, the campaign said.\r\nThe cancellation by the Vermont senators campaign follows an afternoon… [+2293 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Peter Sciretta", "title": "Daily Podcast: Mulan, Paramount Presents, Coronavirus, Halloween Horror Nights, Quibi and Thor: Love and Thunder", "description": "On the March 10, 2020 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film senior writer Ben Pearson, writer Hoai-Tran Bui and Chris Evangelista to talk about the latest film and TV news, including Mulan, Paramount Presents, Coronav…", "url": "https://www.slashfilm.com/daily-podcast-mulan-paramount-presents-coronavirus-halloween-horror-nights-quibi-and-thor-love-and-thunder/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/mulan-pg-13.jpg", "publishedAt": "2020-03-10T20:15:57Z", "content": "On the March 10, 2020 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film senior writer Ben Pearson, writer Hoai-Tran Bui and Chris Evangelista to talk about the latest film and TV news, including Mulan, Paramount Presents, Coronav… [+957 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Tyler Conway", "title": "BYU Announces Fan Who Attended Feb. 22 Game vs. Gonzaga Has the Coronavirus", "description": "A man who has tested positive for the coronavirus attended BYU's home game against Gonzaga last month, the school said in a statement Tuesday...", "url": "https://bleacherreport.com/articles/2880246-byu-announces-fan-who-attended-feb-22-game-vs-gonzaga-has-the-coronavirus", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/856/828/hi-res-aceed9fabb7ecd2e17b498b157dca86a_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-10T21:10:46Z", "content": "Rick Bowmer/Associated Press\r\nA man who has tested positive for the coronavirus attended BYU's home game against Gonzaga last month, the school said in a statement Tuesday.\r\n\"BYU was contacted by the Utah County Health Department to notify the university that… [+1042 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Rob Goldberg", "title": "Ivy League Teams Petition to Reinstate Conference Tournaments Amid Coronavirus", "description": "After the Ivy League  announced  Tuesday it was canceling its men's and women's basketball tournaments amid concerns about the  coronavirus, member teams have started a petition to ...", "url": "https://bleacherreport.com/articles/2880241-ivy-league-teams-petition-to-reinstate-conference-tournaments-amid-coronavirus", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/856/822/hi-res-38ba5e37b7d78bdd1b2be3233e7c7822_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-10T20:22:42Z", "content": "Jessica Hill/Associated Press\r\nAfter the Ivy League announced Tuesday it was canceling its men's and women's basketball tournaments amid concerns about the coronavirus, member teams have started a petition to reinstate the tourney:\r\nGary Parrish@GaryParrishCB… [+1697 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Sudeep Reddy", "title": "Sanders cancels evening event due to coronavirus fears", "description": "Bernie Sanders has canceled his evening rally in Cleveland “out of concern for public health and safety,” his campaign said.", "url": "https://www.politico.com/news/2020/03/10/sanders-cancels-evening-event-due-to-coronavirus-fears-125138", "urlToImage": "https://static.politico.com/b6/41/4b609c7b47e8ab5ecd461877dbf3/20200310-bernie-sanders-gty-773.jpg", "publishedAt": "2020-03-10T20:17:11Z", "content": "Sen. Bernie Sanders. | Scott Olson/Getty Images\r\nBernie Sanders has canceled his evening rally in Cleveland out of concern for public health and safety, his campaign said.\r\nThe move represents the first example of a presidential campaign explicitly canceling … [+59 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Timothy Rapp", "title": "SEC, Big 12, ACC Tournament Locker Rooms Closed to Media Amid Coronavirus Fears", "description": "The SEC, Big 12 and ACC will all close their locker rooms to media access during their basketball conference tournaments to limit the potential for athlete exposure to the coronavirus, ...", "url": "https://bleacherreport.com/articles/2880248-sec-big-12-acc-tournament-locker-rooms-closed-to-media-amid-coronavirus-fears", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/856/829/hi-res-0b04c2dd3923f2de22ad0998fb123c6d_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-10T21:10:46Z", "content": "Steve Cannon/Associated Press\r\nThe SEC, Big 12 and ACC will all close their locker rooms to media access during their basketball conference tournaments to limit the potential for athlete exposure to the coronavirus, according to multiple reports:\r\nEmily Proud… [+916 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "United Airlines to extend coronavirus-related capacity cuts into summer", "description": "U.S. airlines are taking actions unseen since the days following the 9/11 attacks as they attempt to minimize the impact from the dramatic drop in bookings amid traveler fears of the novel coronavirus outbreak. United Airlines was the first to unveil sweeping…", "url": "http://thepointsguy.com/news/united-airlines-to-extend-coronavirus-impact-capacity-cuts-through-summer/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2019/05/Maxian_GettyImages-458938283.jpg?fit=1600%2C1063px&ssl=1", "publishedAt": "2020-03-10T20:30:13Z", "content": "U.S. airlines are taking actions unseen since the days following the 9/11 attacks as they attempt to minimize the impact from the dramatic drop in bookings amid traveler fears of the novel coronavirus outbreak.\r\nUnited Airlines was the first to unveil sweepin… [+3466 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Matt Posky", "title": "OPEC Infighting and Coronavirus Ads Up to Affordable Gas", "description": "With the coronavirus keeping people indoors and shale drilling keeping U.S. oil prices relatively stable, you’ve probably noticed gasoline bills being quite reasonable of late. Well, don’t get used to the sums you’re paying now, as analysts project fuel price…", "url": "https://www.thetruthaboutcars.com/2020/03/opec-infighting-and-coronavirus-ads-up-to-affordable-gas/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2020/03/shutterstock_449689783.jpg", "publishedAt": "2020-03-10T20:14:42Z", "content": "With the coronavirus keeping people indoors and shale drilling keeping U.S. oil prices relatively stable, you’ve probably noticed gasoline bills being quite reasonable of late. Well, don’t get used to the sums you’re paying now, as analysts project fuel price… [+3559 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of JetBlue Were Up Today", "description": "The airline industry is getting aggressive in response to the coronavirus risk.", "url": "https://www.fool.com/investing/2020/03/10/why-shares-of-jetblue-were-up-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562624/jetblue-tailfins-source-jblu.jpg", "publishedAt": "2020-03-10T20:23:00Z", "content": "What happened\r\nShares of JetBlue Airways (NASDAQ:JBLU) climbed nearly 10% on renewed investor confidence that airline stocks can weather a COVID-19 coronavirus-induced travel slump. Many of JetBlue's larger rivals are following that company's lead and bringin… [+1563 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Noonan)", "title": "Stocking Up for Coronavirus? Target Is Putting Purchase Limits on Some Items", "description": "The retailer is implementing new policies and increasing staff hours to better meet challenges from the coronavirus.", "url": "https://www.fool.com/investing/2020/03/10/stocking-up-for-coronavirus-target-is-putting-purc.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562598/gettyimages-838816102.jpg", "publishedAt": "2020-03-10T20:42:00Z", "content": "Target(NYSE:TGT) CEO Brian Cornell posted a letter to customers on the company's website on Tuesday, outlining actions the retailer is taking in response to COVID-19. These initiatives include limiting the purchase quantities of some key items, increasing in-… [+1524 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Cory Turner", "title": "Proactive School Closings Can Stem Disease Spread — But Causes Its Own Worries", "description": "Closing schools could slow the spread of coronavirus — but school leaders worry closure comes with its own risks, especially for kids who depend on school meals and whose parents can't take off work.", "url": "https://www.npr.org/2020/03/10/814164972/proactive-school-closings-can-stem-disease-spread-but-causes-its-own-worries", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-03-10T20:12:37Z", "content": null}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Ben Yakas", "title": "Broadway Believes \"The Show Must Go On\" Despite Coronavirus Spread", "description": "Does the risk of coronavirus spread outweigh the benefits of keeping The Great White Way open right now? [ more › ]", "url": "https://gothamist.com/arts-entertainment/broadway-believes-show-must-go-despite-coronavirus-spread", "urlToImage": "https://cms.prod.nypr.digital/images/301909/fill-1200x650/", "publishedAt": "2020-03-10T20:51:00Z", "content": "As the outbreak of COVID-19 continues to spread, more and more people are choosing to preemptively cancel or postpone events involving large gatherings of people. Pearl Jam postponed their tour, Coachella is likely being moved to October, movie studios have d… [+6952 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "UN chief says drop in emissions from virus will not solve climate crisis", "description": "UN Secretary General Antonio Guterres warned Tuesday that while the global outbreak of coronavirus may have caused a temporary drop in emissions that cause global warming, it would not end the problem and might even divert attention from the fight.", "url": "https://phys.org/news/2020-03-chief-emissions-virus-climate-crisis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/2-peoplewalkpa.jpg", "publishedAt": "2020-03-10T20:24:52Z", "content": "UN Secretary General Antonio Guterres warned Tuesday that while the global outbreak of coronavirus may have caused a temporary drop in emissions that cause global warming, it would not end the problem and might even divert attention from the fight.\r\n\"We shoul… [+2677 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Anders Bylund)", "title": "Why VMware Shares Fell 18.6% in February", "description": "The virtual computing expert's fourth-quarter report was a mixed bag, and management appeared to underestimate the upcoming impact of the coronavirus.", "url": "https://www.fool.com/investing/2020/03/10/why-vmware-shares-fell-186-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562622/chart-arrow-downward.jpg", "publishedAt": "2020-03-10T20:55:00Z", "content": "What happened\r\nShares of virtual computing veteran VMware(NYSE:VMW) fell 18.6% in February, according to data from S&amp;P Global Market Intelligence. The stock tracked alongside the broader market all month long, coronavirus warts and all, until the bottom d… [+1075 chars]"}, {"source": {"id": null, "name": "Q13fox.com"}, "author": "https://www.facebook.com/Q13FOX", "title": "Two more coronavirus deaths in King County as 10 nursing homes report positive tests - Q13 News Seattle", "description": "Two more coronavirus deaths in King County as 10 nursing homes report positive tests Q13 News Seattle Coronavirus death toll reaches 22 statewide after three more Life Care residents die Q13 News Seattle Coronavirus cases could reach 64,000 in Washington stat…", "url": "https://q13fox.com/2020/03/10/two-more-coronavirus-deaths-in-king-county-as-10-nursing-homes-report-positive-tests/", "urlToImage": "https://tribkcpq.files.wordpress.com/2020/03/gettyimages-476433472.jpg?quality=85&strip=all&w=1200", "publishedAt": "2020-03-10T20:54:16Z", "content": "SEATTLE -- Two more King County nursing home residents have died after contracting COVID-19, bringing the total number of deaths in the county to 22 and the statewide number to 24 as of Tuesday afternoon (March 10).\r\nAccording to King County Public Health, th… [+2907 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Hoai-Tran Bui", "title": "Why People Are Calling to #BoycottMulan, and What it Has to Do With the Hong Kong Protests", "description": "The release of Disney’s live-action remake of Mulan comes at a difficult time for the studio, with the coronavirus epidemic potentially taking its biggest international market, Chinese moveigoers, off the table. But Mulan is facing more than one viral obstacl…", "url": "https://www.slashfilm.com/boycott-mulan-explained-liu-yifei-hong-kong/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/077_mulan_mrk_239_4K_r709f.000022.jpg", "publishedAt": "2020-03-10T21:00:46Z", "content": "The release of Disney’s live-action remake of Mulan comes at a difficult time for the studio, with the coronavirus epidemic potentially taking its biggest international market, Chinese moveigoers, off the table.\r\nBut Mulan is facing more than one viral obstac… [+4884 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Lisa M. Krieger, Julia Prodis Sulek", "title": "Coronavirus: Cruise ship passengers now at Travis quarantine, no plans to get tested - The Mercury News", "description": "Coronavirus: Cruise ship passengers now at Travis quarantine, no plans to get tested The Mercury News At least 21 people on board the Grand Princess test positive for COVID-19 ABC News CRUISE SHIP docks in Oakland port — MELANIA TRUMP cancels Beverly Hill fun…", "url": "https://www.mercurynews.com/coronavirus-cruise-ship-passengers-now-at-travis-quarantine-no-plans-to-get-tested", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/03/SJM-L-CRUISEDOCK-0310-98.jpg?w=1024&h=681", "publishedAt": "2020-03-10T21:08:02Z", "content": "Nearly 1,000 Californians will wait out a 14-day quarantine at two state military bases, a mandatory detention that has turned a relaxing social cruise to Hawaii into a month-long travail.\r\nThere are yet no plans to test the former guests of the Grand Princes… [+9346 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Quarantined Cruise Ship Passenger Describes Life On Board Grand Princess | NBC News - NBC News", "description": "Quarantined Cruise Ship Passenger Describes Life On Board Grand Princess | NBC News NBC News Meet the Insane People Still Planning Cruise Ship Vacations The Daily Beast Cruise ship passengers express frustration with coronavirus response CBS Evening News Cali…", "url": "https://www.youtube.com/watch?v=FN1huu7BfsU", "urlToImage": "https://i.ytimg.com/vi/FN1huu7BfsU/maxresdefault.jpg", "publishedAt": "2020-03-10T20:30:58Z", "content": "Quarantined Passenger Henry Choy tells us how he is coping on the Grand Princess cruise ship on day five of the quarantine.» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC» Watch more NBC video: http://bit.ly/MoreNBCNews\r\nNBC News Digital is a collec… [+837 chars]"}, {"source": {"id": null, "name": "Extremetech.com"}, "author": "Joel Hruska", "title": "The Fastest Supercomputer on Earth Is Being Deployed Against Coronavirus", "description": "Credit: Carlos Jones/ORNL, CC BY 2.0 The world's most powerful supercomputer is being dedicated to hunting down a treatment for coronavirus as Covid-19 cases continue to rise. The post The Fastest Supercomputer on Earth Is Being Deployed Against Coronavirus a…", "url": "https://www.extremetech.com/computing/307381-the-fastest-supercomputer-on-earth-is-being-deployed-against-coronavirus", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/06/Summit_ORNL.jpg", "publishedAt": "2020-03-10T20:26:49Z", "content": "The US Department of Energy has announced that the Summit supercomputer will be used to attempt to find a treatment or cure for Covid-19, also known as coronavirus. Summit is a 10KW machine built with 4,608 processing nodes. Each node contains 2x Power9 CPUs … [+5625 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Robert L. Leahy Ph.D.", "title": "Are You Worried About the Coronavirus?", "description": "How do we balance appropriate medical knowledge and dealing with our constant worries?", "url": "https://www.psychologytoday.com/ca/blog/anxiety-files/202003/are-you-worried-about-the-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T20:21:35Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Morgan Raum", "title": "Costco Suspends Free Samples in Stores Amid Coronavirus Concerns", "description": "Over the last few weeks, multiple large food companies and restaurant chains like Starbucks and Coca-Cola have implemented precautionary measures amid increasing coronavirus concerns — and now Costco is joining in and temporarily suspending the distribution o…", "url": "https://people.com/food/costco-suspends-free-samples-in-stores-amid-coronavirus-concerns/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2018%2F06%2F42.jpg%3Fcrop%3D0px%2C0px%2C3000px%2C1575px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T20:51:27Z", "content": "Over the last few weeks, multiple large food companies and restaurant chains like Starbucks and Coca-Cola have implemented precautionary measures amid increasing coronavirus concerns — and now Costco is joining in and temporarily suspending the distribution o… [+2129 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "TheBlaze Staff", "title": "Leftist Coronavirus lies debunked", "description": "It should come as no surprise that the mainstream media has pinned the Coronavirus outbreak on President Trump. Equally not shocking is the fact that Trump took action after the discovery of the first case of Coronavirus. Obama, on the other hand, waited unti…", "url": "https://www.theblaze.com/louder-with-crowder/leftist-coronavirus-lies-debunked", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg3MDEwOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyMDAwNTQxNn0.AZsc7AdZlW2HQ3DLxMXbmZ7YXnxtPYOq6TLUrCGRmPM/img.jpg?width=1200&coordinates=0%2C7%2C0%2C7&height=600", "publishedAt": "2020-03-10T20:43:47Z", "content": "It should come as no surprise that the mainstream media has pinned the Coronavirus outbreak on President Trump. Equally not shocking is the fact that Trump took action after the discovery of the first case of Coronavirus, while Obama waited until 1-thousand c… [+694 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "How to beat back the coronavirus", "description": "Data: The Center for Systems Science and Engineering at Johns Hopkins; Chart: Axios Visuals The coronavirus is here and will complicate life for millions of Americans — but there are signs from Asia that it can get better if we're willing to take that pain no…", "url": "https://www.axios.com/how-to-beat-coronavirus-7f38b798-5a11-43c9-a6ab-e407b2713e44.html", "urlToImage": "https://images.axios.com/d9LxVtChq9ajAA44t2UklWWu1x0=/2020/03/10/1583873946179.png", "publishedAt": "2020-03-10T20:59:47Z", "content": "The coronavirus is here and will complicate life for millions of Americans but there are signs from Asia that it can get better if we're willing to take that pain now.\r\nThe big picture: Coronavirus is stifled by early and aggressive action  and no matter how … [+1550 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Carlie Porterfield, Forbes Staff, Carlie Porterfield, Forbes Staff https://www.forbes.com/sites/carlieporterfield/", "title": "New Rochelle, NY, Joins Italy And Wuhan Province In Coronavirus Crackdowns", "description": "With more and more areas being placed under restrictions to prevent coronavirus spread, here’s what to expect from a lockdown.", "url": "https://www.forbes.com/sites/carlieporterfield/2020/03/10/new-rochelle-ny-joins-italy-and-wuhan-province-in-coronavirus-crackdowns/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1211630692%2F0x0.jpg", "publishedAt": "2020-03-10T20:31:48Z", "content": "New Rochelle, a city just north of New York City, has become the state's largest source of ... [+] coronavirus infections, prompting Governor Andrew Cuomo to announce Tuesday that officials will be implementing a one mile radius containment area there.\r\nGetty… [+4633 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "tedstew1", "title": "Bernie Sanders, Joe Biden Cancel Tuesday Night Rallies Over Concerns Of Spread Of Coronavirus", "description": "The presidential campaigns of Bernie Sanders and Joe Biden are cancelling rallies planned for Tuesday night in Cleveland amid concerns over the spread of the coronavirus. “Out of concern for public health and safety, we are canceling tonight’s rally in Clevel…", "url": "https://deadline.com/2020/03/coronavirus-bernie-sanders-joe-biden-1202878763/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/shutterstock_editorial_10571858an.jpg?w=1024", "publishedAt": "2020-03-10T20:53:35Z", "content": "The presidential campaigns of Bernie Sanders and Joe Biden are cancelling rallies planned for Tuesday night in Cleveland amid concerns over the spread of the coronavirus.\r\n“Out of concern for public health and safety, we are canceling tonight’s rally in Cleve… [+2235 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Lowe's Stock Was Rising Today", "description": "The home-improvement retailer gained on insider buying and hopes for a stimulus.", "url": "https://www.fool.com/investing/2020/03/10/why-lowes-stock-was-rising-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562613/slide-14-lowes-store-source-lowes.jpg", "publishedAt": "2020-03-10T20:19:00Z", "content": "What happened\r\nShares of Lowe's (NYSE:LOW) were moving higher today as the home-improvement retailer caught a tailwind from the rebound in the broader market on hopes for a federal stimulus. Lowe's also revealed that CEO Marvin Ellison bought about $1 million… [+1667 chars]"}, {"source": {"id": null, "name": "Kfvs12.com"}, "author": "Marsha Heller", "title": "Heartland business, facilities, events implementing restrictions due to coronavirus concerns - KFVS", "description": "Heartland business, facilities, events implementing restrictions due to coronavirus concerns KFVS", "url": "https://www.kfvs12.com/2020/03/10/heartland-business-facilities-implementing-restrictions-due-coronavirus-concerns/", "urlToImage": "https://www.kfvs12.com/resizer/h1cspIusLfDhz-goUyPyGrZoFzY=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/JSBBQVUTVJAN7HPWTLER6JXN5Y.jpg", "publishedAt": "2020-03-10T20:36:00Z", "content": "(KFVS) - Concerns about the spread of the coronavirus has some businesses and facilities in the Heartland restricting access to visitors, vendors and volunteers until further notice.\r\nThe restrictions are in accordance with the recommendations from state heal… [+3019 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rachel Sandler, Forbes Staff, Rachel Sandler, Forbes Staff https://www.forbes.com/sites/rachelsandler/", "title": "Bernie Sanders And Joe Biden Cancel Campaign Rallies Over Coronavirus", "description": "Both are the first primary campaign events to be affected by Covid-19.", "url": "https://www.forbes.com/sites/rachelsandler/2020/03/10/bernie-sanders-and-joe-biden-cancel-campaign-rallies-over-coronavirus/", "urlToImage": null, "publishedAt": "2020-03-10T21:09:55Z", "content": null}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Dan Evon", "title": "Does Daniel Radcliffe Have Coronavirus?", "description": "An imposter Twitter account spread misinformation amid a 2020 outbreak of the new coronavirus.", "url": "https://www.snopes.com/fact-check/daniel-radcliffe-coronavirus/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/GettyImages-1192758818-1-e1583870912868.jpg?fit=1200,823", "publishedAt": "2020-03-10T20:28:33Z", "content": "On March 10, 2020, the @BBCNewsTonight Twitter account published a tweet claiming that actor Daniel Radcliffe had become the first famous person to test positive for the new coronavirus:\r\nThis Twitter account is not affiliated with BBC News. This is an impost… [+1221 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "Sanders campaign cancels Cleveland rally over coronavirus concerns", "description": "Sen. Bernie Sanders' campaign announced in a statement Tuesday that tonight's rally in Cleveland will be canceled due to concerns about the spread of the coronavirus. Why it matters: It's the first rally in the 2020 presidential primary to be canceled over co…", "url": "https://www.axios.com/sanders-campaign-cancels-rally-coronavirus-db625850-2da3-412a-9f45-4d194c93bc93.html", "urlToImage": "https://images.axios.com/TfzmkvCVY-nGl2NPWDEe18KDtA4=/2020/03/10/1583871387984.jpg", "publishedAt": "2020-03-10T20:16:46Z", "content": "Bernie Sanders is now the clear front-runner for the Democratic presidential nomination,and his opponents are ready to try to knock him down at tonight's debate in Charleston, South Carolina especially Michael Bloomberg, who was the punching bag at the Las Ve… [+333 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Planet Fitness Stock Popped Today", "description": "Shares of the discount gym chain gained with the broader market recovery today.", "url": "https://www.fool.com/investing/2020/03/10/why-planet-fitness-stock-popped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562627/planet-fitness-slide-15-source-planet-fitness.jpg", "publishedAt": "2020-03-10T21:04:00Z", "content": "What happened\r\nShares of Planet Fitness (NYSE:PLNT) were getting pumped up today, one of several stocks to make big gains on hopes for a stimulus package from the federal government. A recent round of insider buying might also have encouraged investors.\r\nThe … [+1943 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kirsten Korosec", "title": "New York Auto Show delayed until August", "description": "Organizers of the 2020 New York International Auto Show have postponed the event until August due to concerns about the COVID-19 outbreak. The New York Auto Show, which is organized by the Greater New York Automobile Dealers Association, was scheduled to begi…", "url": "https://finance.yahoo.com/news/york-auto-show-delayed-until-205651307.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ffu5dWhByWKvY6JWxV7eKw--~B/aD04MDA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/6dc13fc5021e44f11666848323e15a16", "publishedAt": "2020-03-10T20:56:51Z", "content": "Organizers of the 2020 New York International Auto Show have postponed the event until August due to concerns about the COVID-19 outbreak.\r\nThe New York Auto Show, which is organized by the Greater New York Automobile Dealers Association, was scheduled to beg… [+1550 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Alexia Fernandez", "title": "Sylvester Stallone Wears Gloves While Buying Groceries at Whole Foods Amid Coronavirus Fears", "description": "Sylvester Stallone is taking extra safety measures while buying groceries. In photos exclusive to TMZ, the actor, 73, is seen buying groceries at Whole Foods in Los Angeles on Monday and wearing latex gloves amid growing concerns over the spread of coronaviru…", "url": "https://people.com/movies/sylvester-stallone-wears-gloves-buying-groceries-coronavirus-fears/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fstallone-groceries.jpg%3Fcrop%3D0px%2C0px%2C1125px%2C590.625px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T20:51:58Z", "content": "Sylvester Stallone is taking extra safety measures while buying groceries.\r\nIn photos exclusive to TMZ, the actor, 73, is seen buying groceries at Whole Foods in Los Angeles on Monday and wearing latex gloves amid growing concerns over the spread of coronavir… [+2455 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "CDC tells high-risk groups to prepare for lockdown", "description": "The Centers for Disease Control and Prevention have updated their stance on the risk that the coronavirus infection COVID-19 poses to individuals in high-risk groups. With the virus spreading in bursts around the United States, the CDC now says that individua…", "url": "https://bgr.com/2020/03/10/coronavirus-news-cdc-lockdown-united-states/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/02/10568941g-e1582821519680.jpg?quality=98&strip=all", "publishedAt": "2020-03-10T20:37:27Z", "content": "The Centers for Disease Control and Prevention have updated their stance on the risk that the coronavirus infection COVID-19 poses to individuals in high-risk groups. With the virus spreading in bursts around the United States, the CDC now says that individua… [+2595 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: 'Vulnerable' Bedford man self-isolates due to risks", "description": "A man with health conditions says he is self-isolating in his home for the foreseeable future.", "url": "https://www.bbc.co.uk/news/av/uk-england-beds-bucks-herts-51816097/coronavirus-vulnerable-bedford-man-self-isolates-due-to-risks", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/157F3/production/_111215088_p0867ndf.jpg", "publishedAt": "2020-03-10T21:00:05Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Joe Tenebruso)", "title": "Why Teladoc Health Stock Surged Today", "description": "The telemedicine leader is likely to be part of the solution for COVID-19 preparedness.", "url": "https://www.fool.com/investing/2020/03/10/why-teladoc-health-stock-surged-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562634/telehealth-gettyimages-1183728722.jpg", "publishedAt": "2020-03-10T20:52:00Z", "content": "What happened\r\nShares of Teladoc Health(NYSE:TDOC) jumped more than 9% on Tuesday as health facilities around the world gear up to face the COVID-19 coronavirus outbreak.\r\nSo what\r\nWith the number of confirmed cases of COVID-19, the disease caused by the nove… [+1177 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of Alaska Air Group Are Soaring Today", "description": "Investors take a fresh look at airline stocks after weeks of selling.", "url": "https://www.fool.com/investing/2020/03/10/why-shares-of-alaska-air-group-are-soaring-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562621/alk-plane-source-alk.jpg", "publishedAt": "2020-03-10T20:13:00Z", "content": "What happened\r\nShares of Alaska Air Group (NYSE:ALK) climbed nearly 10% on Tuesday afternoon as investors took a second look at airline stocks, which have been beaten down by fears of a travel slump related to COVID-19 outbreaks. The impact on airlines is rea… [+1992 chars]"}, {"source": {"id": null, "name": "Bklyner.com"}, "author": null, "title": "Help Available For Small Businesses Affected By Coronavirus - BKLYNER", "description": "Yesterday, March 9, Mayor Bill de Blasio announced measures to help businesses affected or about to be affected by the...", "url": "https://bklyner.com/help-available-for-small-businesses-affected-by-coronavirus/", "urlToImage": "https://s3.amazonaws.com/bklyner/bklyner/wp-content/uploads/2020/03/IMG_6551-e1583872171706.jpg", "publishedAt": "2020-03-10T20:32:00Z", "content": "Coney Island Avenue. Liena Zagare/Bklyner\r\nYesterday, March 9, Mayor Bill de Blasio announced measures to help businesses affected or about to be affected by the coronavirus. The city is asking businesses to carry on, but if possible to allow employees to wor… [+2406 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Oil jumps 10%, U.S. stocks rebound after market rout", "description": "Oil and global equity markets charged back on Tuesday after the prior day's steep losses as the world's biggest economies moved to cushion the impact of the coronavirus, but stock gains in Europe failed to hold as investors remained skittish.", "url": "http://feeds.reuters.com/~r/reuters/businessNews/~3/qbGfswCCRx8/oil-jumps-10-u-s-stocks-rebound-after-market-rout-idUSKBN20W363", "urlToImage": null, "publishedAt": "2020-03-10T20:41:04Z", "content": null}, {"source": {"id": null, "name": "Skift.com"}, "author": "Brian Sumers, Skift", "title": "Deep Cutbacks on Corp Travel Force U.S. Airlines to Slash Flights", "description": "Coronavirus is a disaster for U.S. airlines. Some executives compare to the the fallout after 9/11. The big question is how long will it last? Airlines hope the revenue dip will be short-term. -Brian Sumers", "url": "https://skift.com/2020/03/10/u-s-airlines-cut-flights-as-many-corporations-limit-travel/", "urlToImage": "https://skift.com/wp-content/uploads/2020/01/thumbnail-966066dc3de300d3b0de9bcd28c18c56-e1578432813735.jpeg", "publishedAt": "2020-03-10T21:00:52Z", "content": "With lucrative business travel drying up because of concerns about coronavirus, U.S. airlines are taking aggressive action to cut flights, park airplanes and slash costs, with many executives saying Tuesday at an investor conference that they must reduce capa… [+7675 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Eric Abent", "title": "GDC will live stream talks and events in place of postponed show", "description": "Back in February, GDC 2020 was postponed due to the ongoing coronavirus outbreak. Though the organizers of the Game Developers Conference hope to host the event at some point in the summer, there’s the tricky fact that many developers and publishers had prese…", "url": "https://www.slashgear.com/gdc-will-live-stream-talks-and-events-in-place-of-postponed-show-10612767/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/Game-Developers-Conference-logo.jpg", "publishedAt": "2020-03-10T20:26:11Z", "content": "Back in February, GDC 2020 was postponed due to the ongoing coronavirus outbreak. Though the organizers of the Game Developers Conference hope to host the event at some point in the summer, there’s the tricky fact that many developers and publishers had prese… [+1513 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Blake Burman", "title": "Amazon, Apple, Google lead tech coronavirus White House meeting - Fox Business", "description": "The Trump administration is tapping American industry to help fight coronavirus.", "url": "https://www.foxbusiness.com/technology/amazon-apple-google-lead-big-tech-coronavirus-white-house-meeting", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/Coronavirus-White-House-Logos.jpg?ve=1&tl=1", "publishedAt": "2020-03-10T21:03:05Z", "content": "Big tech is joining the fight against the coronavirus.\r\nRepresentatives from Google, Apple, Facebook, Microsoft, Amazon and Twitter are expected to visit the White House on Wednesday, FOX Business has learned. These executives will be joined by officials from… [+2777 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Jareen Imam, Shamar Walters, Dareh Gregorian", "title": "Man intentionally crashes car into St. Louis polling station, police say - NBCNews.com", "description": "Man intentionally crashes car into St. Louis polling station, police say NBCNews.com Live Primary Election Results: Michigan, Washington and More The New York Times Georgia voting locations try to prevent spread of coronavirus Atlanta Journal Constitution Mar…", "url": "https://www.nbcnews.com/politics/2020-election/man-intentionally-crashes-car-st-louis-polling-station-police-say-n1154751", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_11/3263901/200310-missouri-polling-station-crash-ew-338p_d6853f6922c86d203c86e0469e5fcb35.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T20:58:00Z", "content": "A man intentionally backed his car into a St. Louis polling station on Tuesday and then started throwing liquid on voting machines, police said.\r\nArlice Thompson, a 60-year-old St. Louis resident and poll worker, told NBC News she was helping a voter check in… [+2456 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kenneth Rapoza, Contributor, Kenneth Rapoza, Contributor https://www.forbes.com/sites/kenrapoza/", "title": "See How Shanghai, Hong Kong Hotel Traffic Has Collapsed Due To Coronavirus", "description": "A digital heat map of Shanghai and Hong Kong hotels after large event cancellations. This will play out in Italy now and soon, the U.S.", "url": "https://www.forbes.com/sites/kenrapoza/2020/03/10/see-how-shanghai-hong-kong-hotel-traffic-has-collapsed-due-to-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67f99daa54280007598298%2F0x0.jpg", "publishedAt": "2020-03-10T21:04:27Z", "content": "Travel industry data mappers, OTA Insight, are seeing ghosts in Hong Kong hotels as large scale ... [+] gatherings get canceled due to the new coronavirus COVID-19.\r\nOTA Insight\r\nShanghai and Hong Kong hotel traffic has collapsed because of the coronavirus. T… [+3494 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Dan Adler", "title": "The Art Production Fund Gala Brought Emily Ratajkowski and David Byrne to the Tom Sachs Space Program", "description": "The event went on as scheduled, with some possible evidence of growing coronavirus worries.", "url": "https://www.vanityfair.com/style/2020/03/art-production-fund-gala-2020", "urlToImage": "https://media.vanityfair.com/photos/5e67cc075a28f70008cd560c/16:9/w_1280,c_limit/art-production-fund-gala.png", "publishedAt": "2020-03-10T20:12:07Z", "content": "In the hours before the 10th annual Art Production Fund gala began on Monday night in Manhattans Seagram Building, the city surrounding it began to change due to the spread of coronavirus. Universities canceled classes or moved them online, and Governor Andre… [+2794 chars]"}, {"source": {"id": null, "name": "Coindesk.com"}, "author": "Leigh Cuen", "title": "Bitcoiners in Europe Reflect on Economic Shocks as Coronavirus Spreads", "description": "With assets from oil barrels to bitcoin being pulverized by the coronavirus slowdown, people worldwide are reevaluating their plans for crypto gatherings, especially in geographies where anti-COVID-19 measures are increasingly serious. In Milan, Italy, which …", "url": "https://www.coindesk.com/bitcoiners-in-europe-reflect-on-economic-shocks-as-coronavirus-spreads", "urlToImage": "https://www.coindesk.com/wp-content/uploads/2020/03/shutterstock_1584696625-1200x628.jpg", "publishedAt": "2020-03-10T20:25:21Z", "content": "With assets from oil barrels to bitcoin being pulverized by the coronavirus slowdown, people worldwide are reevaluating their plans for crypto gatherings, especially in geographies where anti-COVID-19 measures are increasingly serious. \r\nIn Milan, Italy, whic… [+3777 chars]"}, {"source": {"id": null, "name": "Gaycities.com"}, "author": "Dan Renzi", "title": "The boys at Winter Party had an abs-olutely great time in Miami", "description": "Coronavirus? What coronavirus?  Quarantines and travel restrictions didn’t stop the circuit crowd from attending Winter Party Festival in Miami, the annual NGLTF fundraiser held during the first weekend of March. The 2020 Winter Party was as popular as ever, …", "url": "https://www.gaycities.com/outthere/50441/the-boys-at-winter-party-had-an-abs-olutely-great-time-in-miami/", "urlToImage": "https://gaycities-blog-prodweb.imgix.net/outthere/content/uploads/2020/03/winter_party_miami.jpg?fit=crop&auto=format&auto=compress&crop=faces", "publishedAt": "2020-03-10T21:00:45Z", "content": "Coronavirus? What coronavirus?  Quarantines and travel restrictions didnt stop the circuit crowd from attending Winter Party Festival in Miami, the annual NGLTF fundraiser held during the first weekend of March.\r\nThe 2020 Winter Party was as popular as ever, … [+762 chars]"}, {"source": {"id": null, "name": "Gofugyourself.com"}, "author": "Jessica", "title": "Your Afternoon Chat: What Are You Reading?", "description": "In case we're all CONFINED TO THE HOUSE.", "url": "https://www.gofugyourself.com/your-afternoon-chat-what-are-you-reading-6-03-2020", "urlToImage": "https://static.gofugyourself.com/uploads/2020/03/books-1583722171.gif", "publishedAt": "2020-03-10T21:00:28Z", "content": "So here’s the thing: I think all of us have taken to thinking, “I might just…stay inside for a while.” None of us want to get coronavirus — and none of us want to give coronavirus to someone who might be worse off than we are, should we be asymptomatic (my ow… [+442 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Dan Caplinger)", "title": "Stock Market Wrap-Up: Cypress Semiconductor Deal Approved; Inovio Fights Back", "description": "The stock market regained considerable ground Tuesday.", "url": "https://www.fool.com/investing/2020/03/10/stock-market-wrap-up-cypress-semi-deal-approved-in.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562631/semiconductor-gettyimages-179653150.jpg", "publishedAt": "2020-03-10T21:03:51Z", "content": "Major benchmarks bounced back on Tuesday, although even the huge gains that the Dow Jones Industrial Average (DJINDICES:^DJI), S&amp;P 500 (SNPINDEX:^GSPC), and Nasdaq Composite (NASDAQINDEX:^IXIC) managed to post only clawed back a fraction of what they lost… [+3691 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Bernstein slashes price target on Disney, predicts park closures due to coronavirus outbreak", "description": "An analyst at Bernstein cut their price target on Disney, noting the increasing possibility of domestic park closures as the coronavirus outbreak continues to spread. The Final Round panel discusses the latest.", "url": "https://finance.yahoo.com/video/bernstein-slashes-price-target-disney-201448362.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/MU5RCNNb_kh75VIgRTFM7g--~B/aD0zNDAyO3c9NjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/10/5e67f53cda8e83431aa329b8/5e67f53cda8e83431aa329b9_o_U_v2.jpg", "publishedAt": "2020-03-10T20:14:48Z", "content": "An analyst at Bernstein cut their price target on Disney, noting the increasing possibility of domestic park closures as the coronavirus outbreak continues to spread. The Final Round panel discusses the latest."}, {"source": {"id": null, "name": "Newatlas.com"}, "author": "C.C. Weiss", "title": "Hispano Suiza unleashes performance track car with glorious 1930s rump", "description": "At last year's Geneva Motor Show, Hispano Suiza rose from the dead to present the Carmen, a heavily retro-influenced electric hyper-GT with more than 1,000 horses and looks torn from Hollywood's Golden Age. Thanks to coronavirus, this year's Geneva Motor Show…", "url": "https://newatlas.com/automotive/hispano-suiza-carmen-boulogne/", "urlToImage": "https://assets.newatlas.com/dims4/default/8a48f0e/2147483647/strip/true/crop/6561x3445+0+470/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2Fe5%2Fcf%2Fa1a1cfbb4978b57bbec5d741663f%2F2-rear.jpg", "publishedAt": "2020-03-10T20:35:10Z", "content": "At last year's Geneva Motor Show, Hispano Suiza rose from the dead to present the Carmen, a heavily retro-influenced electric hyper-GT with more than 1,000 horses and looks torn from Hollywood's Golden Age. Thanks to coronavirus, this year's Geneva Motor Show… [+2797 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Erica Schwiegershausen", "title": "Colleges Across the U.S. Are Bracing for Coronavirus", "description": "Many are holding classes remotely, and Harvard just announced students have five days to leave campus altogether.", "url": "http://www.thecut.com/2020/03/school-closings-colleges-cancel-classes-across-u-s.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/10/10-harvard.w1200.h630.jpg", "publishedAt": "2020-03-10T20:49:39Z", "content": "An increasing number of colleges across the U.S. have announced that they are canceling in-person classes due to the threat of the coronavirus.\r\nAs of March 10, there were at least 730 confirmed cases of COVID-19, the respiratory infection caused by the new c… [+4883 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryder Kimball", "title": "Inside Eyam, a 17th century English village that became one of the most remarkable cases of self-quarantine in history", "description": "When plague-ridden fleas brought the bubonic plague to the small town of Eyam in England, its residents decided to quarantine themselves instead of fleeing to nearby cities, where they could have worsened the epidemic. The fleas had spread from London which w…", "url": "https://www.businessinsider.com/eyam-self-quarantine-bubonic-plague-prevented-community-spread", "urlToImage": "https://i.insider.com/5e67bef054f25c43b50586e4?width=1200&format=jpeg", "publishedAt": "2020-03-10T20:49:00Z", "content": null}, {"source": {"id": null, "name": "Justjared.com"}, "author": "Just Jared", "title": "Daniel Radcliffe & Coronavirus Rumors: Here's His Rep's Response", "description": "Rumors have been spreading that Daniel Radcliffe tested positive for Coronavirus after a tweet from a fake BBC account went viral. A hoax account tweeted out, “BREAKING: Daniel Radcliffe tests positive for coronavirus. The actor is said to be the first famous…", "url": "http://www.justjared.com/2020/03/10/daniel-radcliffe-coronavirus-rumors-heres-his-reps-response/", "urlToImage": "http://cdn01.cdn.justjared.com/wp-content/uploads/headlines/2020/03/radcliffe-corona.jpg", "publishedAt": "2020-03-10T20:57:08Z", "content": "Rumors have been spreading that Daniel Radcliffe tested positive for Coronavirus after a tweet from a fake BBC account went viral.\r\nA hoax account tweeted out, “BREAKING: Daniel Radcliffe tests positive for coronavirus. The actor is said to be the first famou… [+544 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Nine new cases of coronavirus confirmed in Wales", "description": "Health officials say nine more individuals have tested positive for the virus in Wales.", "url": "https://www.bbc.co.uk/news/uk-wales-51827012", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-10T20:45:43Z", "content": "Nine more individuals in Wales have tested positive for coronavirus, health officials confirmed on Tuesday evening.\r\nIt brings the number of cases to 15.\r\nWales' chief medical officer said seven of the new infections were identified following a resident in th… [+150 chars]"}, {"source": {"id": null, "name": "Dcist.com"}, "author": "lmccue", "title": "D.C.’s Arts Institutions Bracing To Take Financial Hit From Coronavirus", "description": "“They’re taking all the precautions they can, but at the same time they don’t want to scare everybody away.” The post D.C.’s Arts Institutions Bracing To Take Financial Hit From Coronavirus appeared first on DCist.", "url": "https://dcist.com/story/20/03/10/d-c-s-arts-institutions-bracing-to-take-financial-hit-from-coronavirus/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/03/rob-laughter-WW1jsInXgwM-unsplash-1024x684.jpg", "publishedAt": "2020-03-10T20:31:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH: Biden gets heated when an autoworker confronts him on gun rights - Fox News", "description": "WATCH: Biden gets heated when an autoworker confronts him on gun rights Fox News What would Bernie Sanders do about coronavirus? Reuters Bernie Sanders to take stage at Fox News Town Hall in Michigan on eve of pivotal primary Fox News Why Bernie bros must und…", "url": "https://www.youtube.com/watch?v=HzwpABQUXCE", "urlToImage": null, "publishedAt": "2020-03-10T20:39:36Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Missouri AG Sues Televangelist Jim Bakker for Selling Fake Coronavirus Cure", "description": "If he doesn't stop lying, Jim Bakker could go to jail for fraud. (Again.)", "url": "https://friendlyatheist.patheos.com/2020/03/10/missouri-ag-sues-televangelist-jim-bakker-for-selling-fake-coronavirus-cure/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/03/BakkerSilverFraud-768x430.png", "publishedAt": "2020-03-10T20:30:06Z", "content": "Last week, New York Attorney General Letitia James sent a letter to televangelist Jim Bakker, demanding that he stop selling his “Silver Solution” because his show was falsely referring to it as a cure for coronavirus.\r\nThe Jim Bakker Show is suggesting that … [+1754 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Kieren McCarthy", "title": "California tech industry gets its first big coronavirus hit: RSA Conference attendee infected, in serious condition", "description": "NASA also struck, more conferences cancelled, WISPA is moving ahead The deadly Wuhan coronavirus has reached California’s tech sector with the news that an engineer who attended the RSA Conference in San Francisco last month has now tested positive for COVID-…", "url": "https://www.theregister.co.uk/2020/03/10/rsa_conference_coronavirus/", "urlToImage": "https://regmedia.co.uk/2020/03/10/shutterstock_sick.jpg", "publishedAt": "2020-03-10T20:36:35Z", "content": "The deadly Wuhan coronavirus has reached Californias tech sector with the news that an engineer who attended the RSA Conference in San Francisco last month has now tested positive for COVID-19 and is in a serious condition.\r\nThe 45-year-old employee of Exabea… [+3786 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Paul Nuki", "title": "Coronavirus: is it time to stop using public transport? No, but walking or cycling is best", "description": "Transport for London joined dozens of cities across the world on Tuesday in announcing an &quot;enhanced cleaning regime&quot; for trains and buses.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-time-stop-using-public-transport-no-walking-cycling/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/10/TELEMMGLPICT000226910489-xlarge_trans_NvBQzQNjv4BqABqq2hkeCmkkLCJ1aFwBSzG0lHXf5rk6Abw9UoqqW9U.jpeg?imwidth=1200", "publishedAt": "2020-03-10T21:00:00Z", "content": "Transport for London joined dozens of cities across the world on Tuesday in announcing an \"enhanced cleaning regime\" for trains and buses.\r\n\"Cleaning across the Tube and bus network now includes additional substances that kill viruses and bacteria on contact … [+4848 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Air Canada suspends flights to and from Italy due to coronavirus", "description": "Air Canada said on Tuesday it will suspend its service to and from Italy, as the country imposed a nationwide lockdown to stem the spread of the coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-idUSKBN20X2YK", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501391814&w=1200&r=LYNXMPEG291TX", "publishedAt": "2020-03-10T20:28:50Z", "content": "(Reuters) - Air Canada said on Tuesday it will suspend its service to and from Italy, as the country imposed a nationwide lockdown to stem the spread of the coronavirus. \r\n“Due to Italian government regulations and ongoing health and safety concerns, Air Cana… [+606 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "BILL MAHONEY", "title": "Capitol quieter than normal, but business as usual continues amid coronavirus - Politico", "description": "The most significant departure in day-to-day norms in the Capitol so far has come in the governor’s office.", "url": "https://www.politico.com/states/new-york/city-hall/story/2020/03/10/capitol-quieter-than-normal-but-business-as-usual-continues-amid-coronavirus-1266333", "urlToImage": "https://static.politico.com/fa/6c/7cde66f848b99c03257f24d2f350/180103-albany-statehouse-ap.jpg", "publishedAt": "2020-03-10T20:30:00Z", "content": "New York's statehouse | AP Photo\r\nALBANY Thousands of people from every corner of New York descended on the Capitol complex Tuesday, where they spent the day crowding with each other into enclosed spaces. \r\nUpon arriving, most were greeted by a man dressed as… [+7154 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "NTD Eurofins Offers Coronavirus SARS-CoV-2 Testing Through Viracor Eurofins", "description": "NTD Eurofins, in accordance with the FDA Emergency Use Authorization Guidance, announces it will offer testing for Coronavirus SARS-CoV-2 RT-PCR as of March 13, 2020 through its sister company Viracor Eurofins. The new test utilizes real-time reverse-transcri…", "url": "https://news.yahoo.com/ntd-eurofins-offers-coronavirus-sars-205300265.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/snOADRu.lWh0BFQ5x2abHw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTEzNA--/https://s.yimg.com/uu/api/res/1.2/NIQclMt1A02HRysKIMT24g--~B/aD02Nzt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/225a564ad74e77ad8a54edb65665fc1f", "publishedAt": "2020-03-10T20:53:00Z", "content": "MELVILLE, N.Y., March 10, 2020 /PRNewswire/ -- NTD Eurofins, in accordance with the FDA Emergency Use Authorization Guidance, announces it will offer testing for Coronavirus SARS-CoV-2 RT-PCR as of March 13, 2020 through its sister company Viracor Eurofins.  … [+4415 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Marta Rodriguez Martinez", "title": "Spanish far right deputy tests positive for coronavirus days after mass rally", "description": "'It was a mistake, for which we apologise,' VOX said.", "url": "https://www.euronews.com/2020/03/10/spanish-far-right-deputy-tests-positive-for-coronavirus-days-after-mass-rally", "urlToImage": "https://static.euronews.com/articles/stories/04/55/83/72/1000x563_cmsv2_2b033d08-2c83-56c5-bbec-d21022d692cc-4558372.jpg", "publishedAt": "2020-03-10T20:56:21Z", "content": "Vox General Secretary Javier Ortega Smith has tested positive for the coronavirus just days after speaking at a mass rally in Spain. \r\nIn a statement, Vox leader Santiago Abascal confirmed that Ortega Smith had contracted COVID-19 and admitted that holding a … [+799 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "O’Neill: No Bosnia fans could boost NI", "description": "Michael O'Neill believes Northern Ireland could benefit if their scheduled Euro 2020 play-off semi-final away to Bosnia and Herzegovina is played behind closed doors later this month.", "url": "https://www.skysports.com/football/news/12019/11954778/michael-o8217neill-northern-ireland-could-be-boosted-by-no-bosnia-fans-at-euro-2020-play-off", "urlToImage": "https://e0.365dm.com/20/03/1600x900/skysports-northern-ireland_4944211.jpg", "publishedAt": "2020-03-10T20:13:00Z", "content": "Michael O'Neill believes Northern Ireland could benefit if their scheduled Euro 2020 play-off semi-final away to Bosnia and Herzegovina is played behind closed doors later this month.\r\nThe Bosnian Football Federation on Tuesday postponed ticket sales for the … [+3244 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Cristian Farias", "title": "What Was the Trump DOJ’s Problem With Coronavirus Prevention Posters?", "description": "Immigration courts were hanging CDC posters on their walls. Someone in Washington had a problem with that — before backing down.", "url": "http://nymag.com/intelligencer/2020/03/what-was-trump-dojs-problem-with-covid-prevention-posters.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/03/10/10-doj.w1200.h630.jpg", "publishedAt": "2020-03-10T20:55:26Z", "content": "Since Donald Trump took office, immigration judges have been on a short leash. By law or regulation, these public servants wear robes, must abide by ethical standards, and are expected to exercise independent judgment and discretion. But the Justice Departmen… [+3878 chars]"}, {"source": {"id": null, "name": "Ieee.org"}, "author": "Tekla S. Perry", "title": "Satellites and AI Monitor Chinese Economy’s Reaction to Coronavirus", "description": "Researchers at WeBank mine satellite, GPS, and social media data to conclude that the Chinese economy is well on the way to recovering from COVID-19", "url": "https://spectrum.ieee.org/view-from-the-valley/artificial-intelligence/machine-learning/satellites-and-ai-monitor-chinese-economys-reaction-to-coronavirus?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IeeeSpectrum+%28IEEE+Spectrum%29", "urlToImage": null, "publishedAt": "2020-03-10T21:00:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Grace Schneider, Louisville Courier Journal", "title": "From 'touchless' pizza delivery to cancellations: How Kentucky companies are addressing the coronavirus", "description": "Big and small companies in Louisville are feeling the brunt of the spreading coronavirus and the resulting downturn in business.", "url": "https://finance.yahoo.com/news/touchless-pizza-delivery-cancellations-kentucky-203100239.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8U8RYsBjKMwtnj06Z7tAww--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/uHHb_4Ek9q2Q4PK3GiEV.A--~B/aD0zODQwO3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/b8f74b288b61eb63bb693def0cdc3051", "publishedAt": "2020-03-10T20:31:00Z", "content": "Responding to the rising COVID-19 threat in Kentucky, businesses imposed new restrictions on employees and raced to take more measures to head off the risks.\r\nAs the new coronavirus spreads across the U.S., into Kentucky and neighboring states, companies have… [+5101 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Aaron Colen", "title": "New York calls in the National Guard, creates a 'containment zone' to combat coronavirus spread", "description": "The state of New York has created a one-mile \"containment zone\" in New Rochelle and is using the National Guard to deliver food and clean buildings, according to the New York Times. The extra containment measures come as a result of a coronavirus outbreak tha…", "url": "https://www.theblaze.com/news/new-york-calls-in-the-national-guard-creates-a-containment-zone-to-combat-coronavirus-spread", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg3MDA4NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0NTEzMTQ0Mn0.3_Fjj1DXCdH841U-pqKY__-rgPqUt5uNeceINfm9w8I/img.jpg?width=1200&coordinates=0%2C236%2C0%2C236&height=600", "publishedAt": "2020-03-10T20:55:04Z", "content": "The state of New York has created a one-mile \"containment zone\" in New Rochelle and is using the National Guard to deliver food and clean buildings, according to the New York Times.\r\nThe extra containment measures come as a result of a coronavirus outbreak th… [+1748 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Beth Skwarecki", "title": "Supplements Won't Protect You From COVID-19", "description": "Elderberry syrup? Vitamin C? If you’re looking for extra protection from the coronavirus, please put those back on the pharmacy shelf and go home and wash your hands. Yes, even if Doctor Oz just told you to buy them. More »", "url": "https://www.lifehacker.com.au/2020/03/supplements-wont-protect-you-from-covid-19/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/kjkeyif7ajum1kzkfksq.jpg", "publishedAt": "2020-03-10T20:15:00Z", "content": "Elderberry syrup? Vitamin C? If youre looking for extra protection from the coronavirus, please put those back on the pharmacy shelf and go home and wash your hands. Yes, even if Doctor Oz just told you to buy them.\r\nSupplements have never been shown to beat … [+1246 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Mikael Thalen", "title": "No, Daniel Radcliffe does not have coronavirus", "description": "A viral tweet from a fake account claimed the 'Harry Potter' star had been infected. The post No, Daniel Radcliffe does not have coronavirus appeared first on The Daily Dot.", "url": "https://www.dailydot.com/unclick/daniel-radcliffe-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/daniel-radcliffe-fake-coronavirus-tweet.jpg", "publishedAt": "2020-03-10T20:44:24Z", "content": "A tweet alleging to come from the BBC on Tuesday claimed that actor Daniel Radcliffe had tested positive for the coronavirus (COVID-19).\r\nThe claim quickly circulated online and was retweeted by numerous high-profile individuals, including New York Times corr… [+1762 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Adam Guillen Jr.", "title": "Could Coronavirus Impact UFC Columbus?", "description": "The coronavirus outbreak could impact UFC’s upcoming trip to Columbus, Ohio on March 28, as the Governor of Ohio is considering banning fans from attending live events.", "url": "https://www.mmamania.com/2020/3/10/21173698/ufc-columbus-ohio-governor-no-fans-allowed-live-sporting-events-coronavirus-mma", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0uFvQKXv_L6NUHP2zXGF0dIVXR0=/0x0:4902x2566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19756335/1199265434.jpg.jpg", "publishedAt": "2020-03-10T21:00:00Z", "content": "Photo by Josh Hedges/Zuffa LLC via Getty Images The coronavirus outbreak is still going strong and has no signs of slowing down. As a result, several sporting events in many countries have been forced to stage games with no fans in attendance. Even the NBA is… [+1929 chars]"}, {"source": {"id": null, "name": "Motorauthority.com"}, "author": "feedback@highgearmedia.com (Aaron Cole), Aaron Cole", "title": "2020 New York auto show postponed until August due to coronavirus concerns", "description": "Organizers of the 2020 New York auto show confirmed Tuesday that next month's show will be postponed until late August due to increasing health concerns related to the spreading coronavirus in the area. “We are taking this extraordinary step to help protect o…", "url": "https://www.motorauthority.com/news/1127406_2020-new-york-auto-show-postponed-until-august-due-to-coronavirus-concerns", "urlToImage": "https://images.hgmsites.net/hug/2019-gmc-sierra-1500_100648525_h.jpg", "publishedAt": "2020-03-10T20:41:00Z", "content": "Organizers of the 2020 New York auto show confirmed Tuesday that next month's show will be postponed until late August due to increasing health concerns related to the spreading coronavirus in the area.\r\nWe are taking this extraordinary step to help protect o… [+899 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Coronavirus: Deserted places in America, Italy, China and more", "description": "From hallowed U.S. colleges to Parisian museums to Italian landmarks, the coronavirus is clearing out the world's most beloved public spaces.", "url": "https://www.cbsnews.com/pictures/coronavirus-deserted-places-in-america-china-italy-and-beyond/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/10/de317e19-bd0d-4751-b64b-9f0d80afbee4/thumbnail/1200x630/f95c1686938b21bf4cafbfd666d8e963/gettyimages-1206287422.jpg", "publishedAt": "2020-03-10T20:59:15Z", "content": null}, {"source": {"id": null, "name": "Bmwblog.com"}, "author": "Horatiu Boeriu", "title": "The 2020 New York Auto Show rescheduled for August due to coronavirus", "description": "Following the Geneva Motor Show cancelation, the New York International Auto Show is taking precautions as well. As a result of the ongoing health concerns … The article The 2020 New York Auto Show rescheduled for August due to coronavirus appeared first on B…", "url": "https://www.bmwblog.com/2020/03/10/the-2020-new-york-auto-show-rescheduled-for-august/", "urlToImage": "https://cdn.bmwblog.com/wp-content/uploads/2018/03/Fire-Orange-BMW-M4-Convertible.jpg", "publishedAt": "2020-03-10T20:45:45Z", "content": "Following the Geneva Motor Show cancelation, the New York International Auto Show is taking precautions as well. As a result of the ongoing health concerns from the spread of the coronavirus in the region, the New York International Auto Show has been resched… [+1666 chars]"}]