[{"source": {"id": null, "name": "Boston.com"}, "author": "associated-press", "title": "Read the full statement from health officials on the 2nd positive coronavirus test in Mass. - Boston.com", "description": "Read the full statement from health officials on the 2nd positive coronavirus test in Mass. Boston.com Best practices to take action against COVID-19 | ABC NEWS LIVE PRIME ABC News Coronavirus in China: The most important lessons from China’s Covid-19 respons…", "url": "https://www.boston.com/news/health/2020/03/03/2nd-positive-coronavirus-test-massachusetts", "urlToImage": "https://www.boston.com/wp-content/uploads/2020/03/Q4YUONPFSNHSVPW375FPEGPZJQ-850x478.jpg", "publishedAt": "2020-03-03T13:52:09Z", "content": "BOSTON (AP) A second person in Massachusetts tested positive for the new coronavirus, the state Department of Public Health said in a news release Monday.The woman in her 20s had recently traveled to Italy with a school group. She lives in Norfolk County, whe… [+4950 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New York City school closed Tuesday after suspected case of coronavirus: statement", "description": "A New York City school says it will be closed on Tuesday after a suspected case of coronavirus was detected in its community, the SAR Academy and SAR High School said in a statement.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-school-idUSKBN20Q1U6", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T13:51:43Z", "content": "(Reuters) - A New York City school says it will be closed on Tuesday after a suspected case of coronavirus was detected in its community, the SAR Academy and SAR High School said in a statement. \r\nThe school said the closure was a precautionary measure and th… [+276 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Coronavirus a perfect excuse for shady crowdfunded gadgets", "description": "A tiny, bargain-priced drone that delivers cinematic HD footage? Full speed ahead, backers ! But alas, there's a problem: coronavirus. The BBC reports on backers who pledged nearly $2m and are about to experience disappointment. Ash Hall, who reviews drones, …", "url": "https://boingboing.net/2020/03/03/coronavirus-a-perfect-excuse-f.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/111117912_2521e6d8-0fb9-45fa-b79f-152a62df86cb.jpg?fit=660%2C371&ssl=1", "publishedAt": "2020-03-03T13:44:45Z", "content": "A tiny, bargain-priced drone that delivers cinematic HD footage? Full speed ahead, backers! But alas, there's a problem: coronavirus. The BBC reports on backers who pledged nearly $2m and are about to experience disappointment.\r\nAsh Hall, who reviews drones, … [+2720 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Harry Suhartono / Bloomberg", "title": "With ‘Cabbage Prices’ on Offer Amid Coronavirus Outbreak, Flights Across China Currently Cost as Little as $13", "description": "Airlines are offering tickets at \"cabbage prices\" as they start restoring seat capacity following drastic cuts during coronavirus outbreak", "url": "https://time.com/5794372/china-coronavirus-cheap-flights/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/china-coronavirus-cheap-flights.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-03T13:26:21Z", "content": "(Bloomberg) — Chinese airlines are offering tickets at what are known colloquially as cabbage prices as they start restoring seat capacity following drastic capacity cuts enforced by the COVID-19 coronavirus.\r\nA one-way direct trip from Shanghai to Chengdu on… [+2020 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Spriha Srivastava", "title": "Here are 6 signs that show a coronavirus-driven recession may just be around the corner", "description": "The virus outbreak has hit manufacturing activity in both China and the U.S. Manufacturing activity in China touched its lowest since the reading began in 2004. Government bond yields have sunk as investors move into safer assets. Meanwhile, the biggest reces…", "url": "https://markets.businessinsider.com/news/stocks/coronavirus-driven-recession-near-here-signals-chances-stock-market-economy-2020-3-1028959395", "urlToImage": "https://markets.businessinsider.com/image/5e5e2feefee23d64d766ff45-2400/db64d0f087604af888fc0f4c2fb3dd65.jpg", "publishedAt": "2020-03-03T13:33:18Z", "content": "AP Images / Richard Drew\r\n<ul><li>The virus outbreak has hit manufacturing activity in both China and the U.S. Manufacturing activity in China touched its lowest since the reading began in 2004.Â </li><li>Government bond yields have sunk as investors move int… [+7754 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Elliot Hannon", "title": "U.S. Limited Coronavirus Testing Because It Didn’t Have Enough Tests", "description": "The CDC had only tested 500 specimens, while other countries screened tens of thousands, and China likely millions of patients.", "url": "https://slate.com/news-and-politics/2020/03/u-s-limited-coronavirus-testing-not-enough-tests.html", "urlToImage": "https://compote.slate.com/images/3b55f235-b8a9-499d-9cf4-64a98686ba2c.jpeg?width=780&height=520&rect=4677x3118&offset=0x0", "publishedAt": "2020-03-03T13:50:49Z", "content": "Coronavirus testing in the U.S. has been restricted because of a lack of tests.\r\n<ol><li>\r\nYou Can Still Vote for Elizabeth Warren if You Think Shed Be the Best President\r\n </li><li>\r\nMayor Pete Was Good for the Left\r\n </li><li>\r\nWhat Happens to Early Votes A… [+2562 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "bwinck@businessinsider.com (Ben Winck), Ben Winck", "title": "Robinhood says it's restored service after an outage blocked users from the stock market's monstrous rally", "description": "Steve Jennings/Getty Images for TechCrunch Robinhood has resumed regular service after an outage on Monday locked users out of their accounts. The \"system-wide outage\" kept clients from securing gains during Monday's broad market rally. The S&P 500 jumped 4.6…", "url": "https://www.businessinsider.com/robinhood-outage-app-back-up-after-glitch-stock-market-rebound-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5e5e5b00fee23d6db5170816-2400/gettyimages-1027918210.jpg", "publishedAt": "2020-03-03T14:01:59Z", "content": "Steve Jennings/Getty Images for TechCrunch\r\n<ul><li>Robinhood has resumed regular service after an outage on Monday locked users out of their accounts.</li><li>The \"system-wide outage\" kept clients from securing gains during Monday's broad market rally. The S… [+2462 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Matthew Champion", "title": "23 Iranian MPs Have Tested Positive For Coronavirus, Deputy Speaker Says", "description": "Iran has the third highest number of coronavirus cases outside of China, but the second highest number of deaths. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/matthewchampion/coronavirus-iran-mps-covid-19", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/3/13/enhanced/dcbc7cc25707/original-1360-1583242681-2.jpg?crop=1200:630;0,0", "publishedAt": "2020-03-03T13:36:49Z", "content": "Twenty-three Iranian MPs have so far tested positive for the novel coronavirus, the country's deputy speaker said Tuesday.\r\nAbdolreza Mesri told Iranian state television that that the MPs had contracted the virus through contact with their constituents. Iran'… [+973 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "AP", "title": "Tokyo 2020 Games Could Be Postponed Due To Coronavirus: Olympic Minister", "description": "The event could be held later in the year instead of July 24, Japan’s Olympic minister said Tuesday.", "url": "https://www.huffpost.com/entry/tokyo-2020-games-possibly-delayed_n_5e5e570ac5b67ed38b389b58", "urlToImage": "https://img.huffingtonpost.com/asset/5e5e58c4230000c41139ca3c.jpeg?ops=1778_1000", "publishedAt": "2020-03-03T13:32:08Z", "content": "TOKYO (AP) Japans Olympic minister said Tuesday the contract to hold the Tokyo Games only specifies the event has to be held during 2020.\r\nSeiko Hashimotos response to a question in the upper house of parliament implies the Olympics could be held later in the… [+3261 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Boing Boing's Shop", "title": "Full stack developers make over $110,000 a year. You can join them with this training.", "description": "Full-stack developers are the real deal. With a full breadth of front end and back end programming knowledge and a complete understanding of how those worlds work together, they’re the ones companies turn to when they really need development projects done rig…", "url": "https://boingboing.net/2020/03/03/full-stack-developers-make-ove.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/02/product_36170_product_shots5.jpg?fit=630%2C473&ssl=1", "publishedAt": "2020-03-03T14:00:31Z", "content": "Full-stack developers are the real deal. With a full breadth of front end and back end programming knowledge and a complete understanding of how those worlds work together, theyre the ones companies turn to when they really need development projects done righ… [+3355 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Rex Nutting", "title": "Rex Nutting: The coronavirus is taking aim at the heart of the American economy: Consumer spending", "description": "With the coronavirus now spreading in communities around the country, it’s becoming more likely that the epidemic will slam consumer spending.", "url": "https://www.marketwatch.com/story/the-coronavirus-is-taking-aim-at-the-heart-of-the-american-economy-consumer-spending-2020-03-03", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HT544_americ_ZG_20191017144507.jpg", "publishedAt": "2020-03-03T13:28:30Z", "content": "Americans will avoid crowds if the coronavirus spreads to their town.\r\nWe need to stop assuming that the coronavirus outbreak will have only a minor impact on the U.S. economy. With the virus that causes COVID-19 now spreading in communities around the countr… [+5545 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Heather Murphy", "title": "Surfaces? Sneezes? Sex? How the Coronavirus Can and Cannot Spread", "description": "A delicate but highly contagious virus, roughly one-900th the width of a human hair, is spreading from person to person around the world. The coronavirus, as it's known, has already infected people in at least 60 countries.Because this virus is so new, expert…", "url": "https://news.yahoo.com/surfaces-sneezes-sex-coronavirus-cannot-132505758.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UEl_Bm_FLeXd0KX6C736gA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xMDAwLjUzMzMzMzMzMzMzMzM-/https://s.yimg.com/uu/api/res/1.2/ndAPcqHD8kC.qo_gcVq6Aw--~B/aD0xNjAwO3c9MjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/64d3f5dd69f2a18a908124208136ef91", "publishedAt": "2020-03-03T13:25:05Z", "content": "A coronavirus sample collected from one of the first cases in the United States. (Elizabeth R. Fischer/National Institute of Allergy and Infection Diseases' Rocky Mountain Laboratories via The New York Times)\r\nA delicate but highly contagious virus, roughly o… [+6186 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Falling printer misses man by inches", "description": "This CCTV footage shows a man making a phone call on a patio. A printer suddenly falls out of the sky, missing him by inches. He appears unperturbed and continues his call. Read the rest", "url": "https://boingboing.net/2020/03/03/falling-printer-misses-man-by.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/printers.jpg?fit=1200%2C749&ssl=1", "publishedAt": "2020-03-03T13:25:36Z", "content": "“Fire in the hole!” shouts an engineer as a detonator sparks. A second later, the shockwave and the thunder–a close shave with the last sight some people ever saw. The video apparently depicts work on Indianapolis’ sewer system.\r\nIt’s hard to explain this pec… [+1638 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: Stocks haven’t bottomed yet, so wait for this signal, advises Charles Schwab strategist", "description": "Our call of the day from the Schwab Center for Financial Research’s vice president of trading and derivatives has this message for investors: “Don’t panic and don’t sell on the lows.”", "url": "https://www.marketwatch.com/story/stocks-havent-bottomed-yet-so-wait-for-this-signal-advises-charles-schwab-strategist-2020-03-03-910308", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-03-03T14:00:09Z", "content": "Our call of the day from the Schwab Center for Financial Researchs vice president of trading and derivatives has this message for investors: Dont panic and dont sell on the lows. See full story.\r\nG-7 pledges to use all appropriate policy tools to fight corona… [+959 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Ben Lovejoy", "title": "AAPL stock climbed 9.3% in one day, with three factors likely responsible", "description": "AAPL stock climbed 9.3% in one day yesterday, after earlier falls due to concern about the impact of the coronavirus outbreak on Apple’s supply chain and demand in China. Three factors likely explain the turnaround. First, investors seem to have decided that …", "url": "https://9to5mac.com/2020/03/03/aapl-stock-climbed/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/AAPL-stock-climbed-9.3-in-one-day.jpg?quality=82&strip=all", "publishedAt": "2020-03-03T13:31:20Z", "content": "AAPL stock climbed 9.3% in one day yesterday, after earlier falls due to concern about the impact of the coronavirus outbreak on Apple’s supply chain and demand in China.\r\nThree factors likely explain the turnaround. First, investors seem to have decided that… [+1840 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "'Coronavirus could turn into a seasonal infection'", "description": "Scientists from the United Kingdom are hinting at a possibility that Coronavirus infection might never really \"go away\" and stay like other harsh seasonal flu-like infections.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/alert-coronavirus-could-turn-into-a-seasonal-infection-urges-a-uk-scientist/articleshow/74459902.cms", "urlToImage": "https://static.toiimg.com/photo/msid-74459902/74459902.jpg?1001457", "publishedAt": "2020-03-03T13:30:00Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "India restricts drug exports as threat of coronavirus rises", "description": "The outbreak of coronavirus has shut factories in China and impacted supplies, leading to fears of a shortage of drugs and medicines.", "url": "https://www.thehindu.com/news/national/india-restricts-drug-exports-as-threat-of-coronavirus-rises/article30973338.ece", "urlToImage": "https://www.thehindu.com/news/national/osk7s6/article30973337.ece/ALTERNATES/LANDSCAPE_615/VBK-DRUGS-SOUTHKOREA-REUTERS", "publishedAt": "2020-03-03T13:49:26Z", "content": "India, the worlds largest maker of generic drugs, on March 3 restricted the export of common medicines such as paracetamol and 25 other pharmaceutical ingredients and drugs made from them, as it looks to prevent shortages amid concerns of the coronavirus outb… [+2772 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Daniel B. Kline)", "title": "Coronavirus Panic Drives Sales at Costco", "description": "The warehouse club offers consumers an easy way to stock up.", "url": "https://www.fool.com/investing/2020/03/03/coronavirus-panic-drives-sales-at-costco.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561161/costco.jpg", "publishedAt": "2020-03-03T14:07:00Z", "content": "The COVID-19 coronavirus outbreak could lead to people being forced to work from home, avoid public places, and generally not interact with other people. It could -- in extreme scenarios -- cause supply chain problems that lead to shortages in basic staples i… [+1497 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Up to fifth of UK workers 'could be off sick at same time' - BBC News", "description": "Coronavirus: Up to fifth of UK workers 'could be off sick at same time' BBC News Army on standby as Boris declares war on coronavirus with battle plan to kill off deadly bug The Sun Coronavirus: UK public could be told to work from home for 3 months - Busines…", "url": "https://www.bbc.com/news/uk-51718917", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p085j9cj.jpg", "publishedAt": "2020-03-03T13:37:23Z", "content": "Media playback is unsupported on your device\r\nMedia captionBoris Johnson: \"Keeping the country safe is the government's overriding priority\"\r\nUp to a fifth of the workforce may be off sick during the peak of a coronavirus epidemic in the UK, the government sa… [+8119 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "China to repatriate citizens from Iran over coronavirus", "description": "Charter plane sent to bring Chinese citizens from Iranian city of Qom, as outbreak eases in China.", "url": "https://www.aljazeera.com/news/2020/03/china-repatriate-citizens-iran-coronavirus-200303133447994.html", "urlToImage": "https://www.aljazeera.com/mritems/images/2020/3/3/image-20200303133448221.jpg", "publishedAt": "2020-03-03T13:34:47Z", "content": "China is sending a charter plane to repatriate citizens from the Iranian city of Qom, the first of several flights planned by Beijing.\r\nIt comes as the outbreak is easing in China.\r\nBut cases are mounting abroad, including in neighbouring South Korea and Japa… [+48 chars]"}, {"source": {"id": null, "name": "Avc.com"}, "author": "Fred Wilson", "title": "Outschool can help your school prepare for unexpected closures", "description": "Our portfolio company Outschool operates a service that allows any teacher to teach a live class over online video. They offer over 10,000 classes by teachers on almost any subject you can imagine. Over 80,000 students have used Outschool to take classes. Yes…", "url": "https://avc.com/2020/03/outschool-can-help-your-school-prepare-for-unexpected-closures/", "urlToImage": null, "publishedAt": "2020-03-03T13:29:44Z", "content": "Our portfolio company Outschool operates a service that allows any teacher to teach a live class over online video. They offer over 10,000 classes by teachers on almost any subject you can imagine. Over 80,000 students have used Outschool to take classes.\r\nYe… [+1972 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Won't Create Much Disruption for Snap-On, CEO Says", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-03/coronavirus-won-t-create-much-disruption-for-snap-on-ceo-says-video", "urlToImage": null, "publishedAt": "2020-03-03T14:08:42Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Mark Prvulovic)", "title": "2 High-Growth Cannabis Stocks at Rock-Bottom Prices", "description": "If you're looking for good deals in the cannabis market, these two companies are even more undervalued than usual with the market falling on coronavirus concerns.", "url": "https://www.fool.com/investing/2020/03/03/2-high-growth-cannabis-stocks-at-rock-bottom-price.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560905/gettyimages-833712532.jpg", "publishedAt": "2020-03-03T13:37:54Z", "content": "Over the past 12 months, cannabis stocks have seen significant losses. With many of the largest names in the industry reporting significant quarterly losses and failing to become profitable, it's not surprising that some investors have become reticent about i… [+5949 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Anders Bylund)", "title": "Is Akamai Technologies Stock a Buy?", "description": "The content delivery expert's stock took a dramatic haircut in the wake of the coronavirus epidemic. The opposite reaction would make more sense.", "url": "https://www.fool.com/investing/2020/03/03/is-akamai-technologies-stock-a-buy.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561083/confused-office-worker.jpg", "publishedAt": "2020-03-03T13:19:00Z", "content": "Content delivery specialist Akamai Technologies(NASDAQ:AKAM) was on a roll in early 2020. By the middle of February, Akamai's shares had surged 43% higher in 52 weeks thanks to an unbroken stream of earnings and revenue surprises that stretched all the way ba… [+3794 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "IE Online", "title": "Coronavirus and its threat to Tokyo Olympics", "description": "The Tokyo Olympics open in five months on July 24. But the fast-spreading coronavirus from China is making Tokyo organisers very anxious.", "url": "https://indianexpress.com/photos/sports-gallery/coronavirus-and-its-threat-to-tokyo-olympics-6297576/", "urlToImage": "https://images.indianexpress.com/2020/03/tokyo-759.jpg?w=759", "publishedAt": "2020-03-03T13:36:32Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Over 100 Coronavirus Cases Confirmed In US; More Deaths In Washington State | TODAY - TODAY", "description": "Over 100 Coronavirus Cases Confirmed In US; More Deaths In Washington State | TODAY TODAY Washington state says coronavirus death toll rises to 6 Fox News Coronavirus kills 6 in Washington state CNN Seattle-area officials report new coronavirus deaths, bringi…", "url": "https://www.youtube.com/watch?v=YE6alcjmUfs", "urlToImage": "https://i.ytimg.com/vi/YE6alcjmUfs/maxresdefault.jpg", "publishedAt": "2020-03-03T13:16:00Z", "content": "Four more coronavirus deaths have been confirmed in Washington state, bringing the total to six; in all, more than 100 U.S. coronavirus cases have been confirmed, a number that could rise dramatically as tests are conducted. NBCs Tom Costello reports from Joh… [+935 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "iPhone maker expects China plants to return to normal in coming weeks", "description": "Apple’s China-focused supply chain has faced two major tests -- first from trade tensions and more recently from manufacturing suspensions spurred by the spread of the coronavirus.", "url": "https://indianexpress.com/article/technology/mobile-tabs/iphone-maker-expects-china-plants-to-return-to-normal-in-coming-weeks-6297529/", "urlToImage": "https://images.indianexpress.com/2020/03/Apple_MacBookAir_1.jpg?w=759", "publishedAt": "2020-03-03T14:01:32Z", "content": "By: Bloomberg | \r\nUpdated: March 3, 2020 7:36:17 pm\r\nFoxconn has already slashed its 2020 revenue projections in the wake of the epidemic. (Image: AP)Hon Hai Precision Industry Co, Apple Incs most important manufacturing partner, expects its Chinese plants to… [+4977 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK now has 51 confirmed cases of coronavirus: health minister", "description": "The number of confirmed coronavirus cases in Britain has risen to 51, health minister Matt Hancock said on Tuesday, up from 39 the previous day.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-hancock-idUSKBN20Q1PH", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498162872&w=1200&r=LYNXMPEG2211D", "publishedAt": "2020-03-03T13:15:27Z", "content": "LONDON (Reuters) - The number of confirmed coronavirus cases in Britain has risen to 51, health minister Matt Hancock said on Tuesday, up from 39 the previous day. \r\nEarlier, the government unveiled its “battle plan” to tackle the spread of coronavirus, warni… [+324 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Sunny Oh", "title": "Bond Report: Treasury yields pare rise as stocks point lower on lack of pledged action from G-7", "description": "U.S. Treasury yields come off their highs on Tuesday after a statement from the Group of Seven economies shows policy makers offered no specific action to offset the economic impact from the COVID-19 outbreak, sending stock-market futures negative.", "url": "https://www.marketwatch.com/story/treasury-yields-pare-rise-as-stocks-point-lower-on-lack-of-pledged-action-from-g-7-2020-03-03", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-03-03T13:40:55Z", "content": "U.S. Treasury yields came off their highs on Tuesday after a statement from the Group of Seven economies showed policy makers offered no specific action to offset the economic impact from the COVID-19 outbreak, weighing on the performance of stocks.\r\nWhat are… [+1696 chars]"}, {"source": {"id": null, "name": "Pib.gov.in"}, "author": null, "title": "Current status of availability of Coronavirus drugs in India", "description": "Department of Pharmaceuticals has constituted a committee under the chairmanship of Dr. Eshwara Reddy, Joint Drugs Controller, Central Drugs Standard Control Organization (CDSCO) to address the issues of drug security in the country in the context of Novel Co…", "url": "https://pib.gov.in/newsite/PrintRelease.aspx?relid=199771", "urlToImage": null, "publishedAt": "2020-03-03T13:52:00Z", "content": "Department of Pharmaceuticals has constituted a committee under the chairmanship of Dr. Eshwara Reddy, Joint Drugs Controller, Central Drugs Standard Control Organization (CDSCO) to address the issues of drug security in the country in the context of Novel Co… [+2264 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Nicholas Rossolillo)", "title": "Teladoc Health's Stock Spikes 30% Amid Coronavirus Fear, but Be Wary of Chasing It", "description": "The outlook for 2020 was good, but maybe not this good.", "url": "https://www.fool.com/investing/2020/03/03/teladoc-healths-stock-spikes-30-amid-coronavirus-f.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560815/health-monitoring-getty.jpg", "publishedAt": "2020-03-03T14:05:00Z", "content": "Shares of Teladoc Health (NYSE:TDOC) have been on a tear, up more than 400% over the past three years and even bucking the steep coronavirus-fueled market sell-off during the final week of February. Driving this surge most recently was a fourth-quarter 2019 r… [+3963 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Zoe Tidman, Oliver O'Connell", "title": "Nashville tornado: 22 killed as twister destroys homes in Tennessee capital", "description": "A deadly tornado has swept through Nashville, Tennessee, in the early hours of Tuesday morning.So far, 22 people have been confirmed killed, and multiple injuries are reported with over 150 admitted to hospital.", "url": "https://news.yahoo.com/nashville-tornado-least-two-dead-094700539.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Yj7ehSe33KMZL24sACGrhg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MDI-/https://s.yimg.com/uu/api/res/1.2/GXddmjzq6rfz2tpIxTt..A--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/dfe1ff5e8401cebc69744763d3336522", "publishedAt": "2020-03-03T13:40:00Z", "content": "A man walks past storm debris following a deadly tornado on Tuesday, 3 March, 2020, in Nashville, Tennessee: AP\r\nA deadly tornado has swept through Nashville, Tennessee, in the early hours of Tuesday morning.\r\nSo far, 22 people have been confirmed killed, and… [+2321 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "COVID-19: Iran orders troops to fight coronavirus outbreak as death toll rises to 77", "description": "“Whatever helps public health and prevents the spread of the disease is good and what helps to spread it is sin,” Iran’s supreme leader Ayatollah Ali Khamenei said", "url": "https://www.thehindu.com/news/international/covid-19-iran-orders-troops-to-fight-coronavirus-outbreak-as-death-toll-rises-to-77/article30972971.ece", "urlToImage": "https://www.thehindu.com/news/international/y6jx1w/article30972970.ece/ALTERNATES/LANDSCAPE_615/VBK-IRANI-KHAMENEI-AP-1", "publishedAt": "2020-03-03T13:11:39Z", "content": "Irans supreme leader put the Islamic Republics armed forces on alert on March 3 to assist health officials in combating the outbreak of the new coronavirus the deadliest outside of China that authorities say has killed 77 people.\r\n Ayatollah Ali Khameneis dec… [+5520 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Apple cofounder Steve Wozniak caused momentary panic on Twitter when he tweeted his wife had a 'bad cough' after they returned from China (AAPL)", "description": "Apple cofounder Steve Wozniak tweeted that his wife was getting checked out for a \"bad cough\" after the couple had returned from a trip to China, sparking a mild panic on Twitter. He speculated that he and his wife were \"patient zero\" for coronavirus in the U…", "url": "https://www.businessinsider.com/apple-founder-steve-wozniak-tweets-about-coronavirus-causes-panic-2020-3", "urlToImage": "https://i.insider.com/5e5e599efee23d7bd5330a64?width=1200&format=jpeg", "publishedAt": "2020-03-03T13:58:33Z", "content": "Apple cofounder Steve Wozniak tweeted on Monday that his wife was getting checked out for a \"bad cough\" after the couple had returned from a trip to China.\r\nHe added that they both may have been \"patient zero\" for coronavirus in the United States, implying th… [+4237 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "About 1 Million People in U.S. Could Be Tested for Coronavirus This Week", "description": "A larger pool of patients will soon be tested for coronavirus as officials ease restrictions on who can administer the exams. At a White House briefing on Monday, a spokesperson for the Food and Drug Administration announced that private companies and academi…", "url": "https://people.com/health/about-1-million-people-in-u-s-could-be-tested-for-coronavirus-this-week/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Fcorona-virus37.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-03T13:30:01Z", "content": "A larger pool of patients will soon be tested for coronavirus as officials ease restrictions on who can administer the exams.\r\nAt a White House briefing on Monday, a spokesperson for the Food and Drug Administration announced that private companies and academ… [+2345 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "W. Chan Kim and Renee Mauborgne", "title": "How to Achieve Resilient Growth Throughout the Business Cycle", "description": "Know when to create a market and when to compete in an existing one.", "url": "https://hbr.org/2020/03/how-to-achieve-resilient-growth-throughout-the-business-cycle", "urlToImage": "https://hbr.org/resources/images/article_assets/2020/02/Fen20_28_656399922.jpg", "publishedAt": "2020-03-03T13:35:50Z", "content": "The world is currently in the longest business cycle since the National Bureau of Economic Research has kept records. Investors, executives, and policy makers scratch their heads in wonder as they try to make sense of this new phenomenon. The question many co… [+6165 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "No need for imminent ECB action on coronavirus: ECB's Kazimir", "description": "There is no need for any imminent action from the European Central Bank to combat the impact of the coronavirus outbreak, but global coordination to shield the world economy is a welcome step, ECB policymaker Peter Kazimir said on Tuesday.", "url": "https://www.reuters.com/article/us-ecb-policy-kazimir-idUSKBN20Q1RI", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498166905&w=1200&r=LYNXMPEG2212U", "publishedAt": "2020-03-03T13:25:49Z", "content": "FRANKFURT (Reuters) - There is no need for any imminent action from the European Central Bank to combat the impact of the coronavirus outbreak, but global coordination to shield the world economy is a welcome step, ECB policymaker Peter Kazimir said on Tuesda… [+392 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Balazs Koranyi", "title": "Exclusive: ECB working on lending scheme for coronavirus-hit companies: sources", "description": "The European Central Bank is preparing possible measures to provide liquidity to businesses hit by the economic fallout of the coronavirus outbreak, three sources familiar with the discussion told Reuters.", "url": "https://www.reuters.com/article/us-ecb-policy-lending-exclusive-idUSKBN20Q16W", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498104267&w=1200&r=LYNXMPEG220QJ", "publishedAt": "2020-03-03T13:26:02Z", "content": "FRANKFURT (Reuters) - The European Central Bank is preparing possible measures to provide liquidity to businesses hit by the economic fallout of the coronavirus outbreak, three sources familiar with the discussion told Reuters. \r\nWith the virus spreading arou… [+2397 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Etan Vlessing", "title": "Imax Limits Business Travel Amid Coronavirus Fears - Hollywood Reporter", "description": "The giant-screen exhibitor is the latest Hollywood player to take precautions against staff catching and spreading the new COVID-19 virus amid a global outbreak.", "url": "https://www.hollywoodreporter.com/news/imax-limits-essential-business-travel-coronavirus-fears-1282280", "urlToImage": "https://cdn1.thr.com/sites/default/files/2020/03/a_man_wearing_a_protective_facemask_as_a_preventive_measure_against_the_covid-19_coronavirus__-_beijing_-_getty_-_h_2020_.jpg", "publishedAt": "2020-03-03T13:36:07Z", "content": "Imax has limited nonessential business travel to protect its employees from catching and spreading the coronavirus amid a global outbreak, a representative told The Hollywood Reporter on Tuesday.\r\nThe giant-screen exhibitor was among the first Hollywood playe… [+1061 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Leo Sun)", "title": "Infinera’s Long-Term Outlook Still Looks Bright", "description": "Demand for higher-bandwidth connections should boost demand for the company’s cost-cutting optical solutions.", "url": "https://www.fool.com/investing/2020/03/03/infineras-long-term-outlook-still-looks-bright.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560903/gettyimages-1077605220.jpg", "publishedAt": "2020-03-03T13:17:00Z", "content": "Infinera's (NASDAQ:INFN) stock recently retreated from its 52-week high after the optical solutions provider posted its fourth-quarter numbers. Its adjusted revenue rose 15% annually to $386.5 million, beating estimates by $20.8 million.\r\nIt generated a non-G… [+5052 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Reuters", "title": "Japan may postpone Olympics amid coronavirus outbreak around globe - Fox Business", "description": "Tokyo’s Olympic 2020 contract allows it to postpone the Games until the end of the year, Japan’s Olympics minister said on Tuesday, amid concern the coronavirus could disrupt the event.", "url": "https://www.foxbusiness.com/sports/japan-may-postpone-olympics-over-coronavirus-fears", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/AP20063355117932.jpg?ve=1&tl=1", "publishedAt": "2020-03-03T13:42:46Z", "content": "TOKYO -- Tokyo’s Olympic 2020 contract allows it to postpone the Games until the end of the year, Japan’s Olympics minister said on Tuesday, amid concern the coronavirus could disrupt the event.\r\n“The contract calls for the Games to be held within 2020. That … [+1483 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: Coronavirus live updates: US cases surpass 100 with 6 deaths; China sees ‘comin…", "description": "CORONAVIRUS UPDATE: Coronavirus live updates: US cases surpass 100 with 6 deaths; China sees ‘coming victory.’ Coronavirus-quarantined nursing home residents “held hostage in a petri dish,” relative says. Coronavirus Infects 23 Iranian Lawmakers As Ayatollah …", "url": "https://pjmedia.com/instapundit/360209/", "urlToImage": null, "publishedAt": "2020-03-03T13:14:25Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "What airlines are doing to sanitize planes", "description": "As new cases of novel coronavirus are growing, the travel industry is feeling the impact -- with vacationers and business people debating whether or not to cancel or postpone trips, and some countries, including the US, implementing travel restrictions.", "url": "https://www.cnn.com/travel/article/airplane-hygiene-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200303124007-coronavirus-travel-airplane-super-tease.jpg", "publishedAt": "2020-03-03T13:45:39Z", "content": "But airplanes are still flying, and travelers still traveling, albeit with extra bottles of hand sanitizer and disinfectant wipes in carry-ons.\r\nStill, as you board the aircraft and sit in your seat, you might find yourself reconsidering inflight hygiene -- a… [+9231 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "CORONAVIRUS IN THE CLASSROOM: Norfolk woman back from Italy school trip is Massachusetts’ 2nd susp…", "description": "CORONAVIRUS IN THE CLASSROOM: Norfolk woman back from Italy school trip is Massachusetts’ 2nd suspected coronavirus case.", "url": "https://pjmedia.com/instapundit/360191/", "urlToImage": null, "publishedAt": "2020-03-03T13:45:43Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Voanews.com"}, "author": "Celia Mendoza", "title": "Coronavirus Threatens Both Sides of US-Mexico Border", "description": "The southern US state of Texas is preparing for a possible coronavirus outbreak - and reaching out to neighbors on both sides of the US-Mexico border. A task force of public agencies and private groups from Texas, the neighboring state of New Mexico and the M…", "url": "https://www.voanews.com/episode/coronavirus-threatens-both-sides-us-mexico-border-4210381", "urlToImage": "https://media.voltron.voanews.com/Drupal/01live-166/kaltura-video-thumbs/JP/86/rULCe2p_6rHVIzFJeVJpSS_Fsy9v87fpv0Y6u6M/1_gw57qu8q.jpg", "publishedAt": "2020-03-03T13:22:57Z", "content": "The southern US state of Texas is preparing for a possible coronavirus outbreak - and reaching out to neighbors on both sides of the US-Mexico border. A task force of public agencies and private groups from Texas, the neighboring state of New Mexico and the M… [+192 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Trump Is Trying to Pull Millions off Insurance as Coronavirus Spreads via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_ad1073fa5cb9d51b9cd6429fb2b12455", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-03T14:10:09Z", "content": "Tornado, Nashville, Tennessee\r\nAt least eight people were killed, others were injured, and 50,000 households and businesses were left without power when a tornado struck parts..."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Tips for traveling amid coronavirus chaos", "description": "Over two dozen airlines, including major U.S. carriers, have canceled all flights to mainland China while suspending some flights to and from dozens of other cities, including London, Milan and Dubai. Delta and American Airlines announced they will be waiving…", "url": "https://www.cbsnews.com/video/tips-for-traveling-amid-coronavirus-chaos/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/03/cb45f040-04c0-4e60-900c-6e27856cb902/thumbnail/1200x630/7915537ab7c580f8d6993a547f38a4c6/0303-ctm-kellycoronavirus-kelly-2040249-640x360.jpg", "publishedAt": "2020-03-03T13:30:41Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Financial Times", "title": "Coronavirus Calls for More Global Co-Operation", "description": "Coronavirus Calls for More Global Co-Operation | RealClearPolitics", "url": "https://www.realclearpolitics.com/2020/03/03/coronavirus_calls_for_more_global_co-operation_503320.html", "urlToImage": null, "publishedAt": "2020-03-03T13:37:11Z", "content": null}, {"source": {"id": null, "name": "Foodpolitics.com"}, "author": "Marion", "title": "The food politics of Coronavirus", "description": "Food politics connects to everything and Coronoavirus is no exception. I’ve been collecting items. For starters, Coca-Cola gets its artificial sweeteners from China. Oops. Its supply chain is now disrupted. Production and exports have been delayed for Coke’s …", "url": "https://www.foodpolitics.com/2020/03/the-food-politics-of-coronavirus/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-03-03T14:00:36Z", "content": "Food politics connects to everything and Coronoavirus is no exception.  I’ve been collecting items.\r\nFor starters,  Coca-Cola gets its artificial sweeteners from China.  Oops.  Its supply chain is now disrupted.\r\nProduction and exports have been delayed for C… [+2046 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "With coronavirus fears running wild, Japanese are now shamelessly stealing toilet paper and hand sanitizer from public restrooms. When will the murders begin? [Scary]", "description": "With coronavirus fears running wild, Japanese are now shamelessly stealing toilet paper and hand sanitizer from public restrooms. When will the murders begin?", "url": "https://www.fark.com/comments/10730334/With-coronavirus-fears-running-wild-Japanese-are-now-shamelessly-stealing-toilet-paper-hand-sanitizer-from-public-restrooms-When-will-murders-begin", "urlToImage": "https://fark-usrimg-850.nyc3.digitaloceanspaces.com/-/-q/fark_-qa621CW__vXNOsqFNhNFkAEK04.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583730000&Signature=8ntXuMdvNrE520CopXsvwGVN1NE%3D", "publishedAt": "2020-03-03T13:29:40Z", "content": "born_yesterday:comrade: Not only is it one of those articles that's just composed of tweets, it's an article that's just tweets in Japanese.\r\nAnd these are the links that get greened."}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Insiders debate: Israel Adesanya's risky move; bold predictions", "description": "Did Israel Adesanya make a mistake picking Yoel Romero for his first defense? Our panel answers that and makes bold predictions.", "url": "https://www.espn.com/mma/ufc/story/_/id/28821937/insiders-debate-ufc-248-israel-adesanya-risky-move-bold-predictions", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0302%2Fr673920_1296x729_16%2D9.jpg", "publishedAt": "2020-03-03T13:27:43Z", "content": "Israel Adesanya didn't have to pick Yoel Romero for his first title defense. The UFC middleweight champ could have waited until top contender Paulo Costa healed from his biceps surgery before putting his belt on the line.\r\nBut Adesanya wants to stay active an… [+12175 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Oman confirms six new cases of coronavirus, raises total number to 12: Health Ministry", "description": "Oman's ministry of health confirmed on Tuesday six new cases of coronavirus in the country, raising the total number to 12, according to the ministry's twitter account.", "url": "https://www.reuters.com/article/us-health-coronavirus-oman-idUSKBN20Q1U4", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T13:50:51Z", "content": "DUBAI (Reuters) - Oman’s ministry of health confirmed on Tuesday six new cases of coronavirus in the country, raising the total number to 12, according to the ministry’s twitter account. \r\nThe ministry said in its statement that all new cases were related to … [+124 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Pat Robertson: People With a Healthy Gut “Don’t Have to Worry About Coronavirus”", "description": "Pat Robertson then suggested eating sauerkraut to combat the disease. (Really.)", "url": "https://friendlyatheist.patheos.com/2020/03/03/pat-robertson-people-with-a-healthy-gut-dont-have-to-worry-about-coronavirus/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/03/PatHealthyGut-768x431.png", "publishedAt": "2020-03-03T13:30:57Z", "content": "You’ll be happy to know that there’s a simple way to be immune from the recent strain of coronavirus!\r\nAll you need is a healthy gut, according to televangelist Pat Robertson:\r\nPat Robertson says that as long as you have a \"healthy gut,\" you won't get sick fr… [+609 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Demitrios Kalogeropoulos)", "title": "Why Callaway Golf Company Stock Lost 21% in February", "description": "Investors were spooked as the company predicted declining sales in 2020's first quarter.", "url": "https://www.fool.com/investing/2020/03/03/why-callaway-golf-company-stock-lost-21-in-februar.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561001/woman-golfing.jpg", "publishedAt": "2020-03-03T13:25:00Z", "content": "What happened\r\nCallaway Golf (NYSE:ELY) shareholders underperformed a historically weak market last month as the stock lost 21% compared to an 8% decline in the S&amp;P 500, according to data provided by S&amp;P Global Market Intelligence.\r\nThe drop left Call… [+1162 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Huge red flag for oil: Global economic growth could be cut in half", "description": "A prolonged and wide-ranging coronavirus outbreak could cut global economic growth to just 1.5 percent this year and have serious consequences for oil demand. Read Full Article at RT.com", "url": "https://www.rt.com/business/482200-global-economic-growth-oil/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5e567e85f540242e49f620.jpg", "publishedAt": "2020-03-03T13:23:00Z", "content": "A significant drop in global economic growth is very bad news for oil demand, which has already been depressed by the outbreak.\r\nYet, the OECD’s (Organisation for Economic Cooperation and Development) base-case scenario is that the outbreak would peak in Chin… [+1943 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Head of Iran’s emergency medical services infected with coronavirus in latest high-profile case", "description": "The chief of Iran’s emergency medical services is being treated for coronavirus, state media reported, marking yet another senior Iranian official who has been infected with the deadly illness. Read Full Article at RT.com", "url": "https://www.rt.com/news/482201-iran-medical-services-chief-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5e52e820302750e43feb8d.JPG", "publishedAt": "2020-03-03T14:05:37Z", "content": "Pir Hossein Kolivand is being treated for the virus and is currently in good health, his office said in a statement, adding that there is “no need for concern.”\r\nNumerous high-level Iranian officials have fallen ill to the virus. Recently, 23 lawmakers have t… [+1312 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Iran holy-shrine-lickers face prison", "description": "Two men face jail in Iran for licking holy shrines in defiance of coronavirus health warnings.", "url": "https://www.bbc.co.uk/news/blogs-trending-51706021", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11013/production/_111115696_iran2.jpg", "publishedAt": "2020-03-03T13:51:33Z", "content": "Image copyrightGetty Images\r\nTwo men in Iran who defied coronavirus health warnings could be jailed and flogged after videos circulated of them licking holy shrines.\r\nIn one of the videos, viewed more than half a million times, a man is seen at the Masumeh sh… [+3127 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Italian tests positive for coronavirus in Jaipur; total cases in India rise to 6 - The Tribune India", "description": "Italian tests positive for coronavirus in Jaipur; total cases in India rise to 6 The Tribune India Coronavirus update: Another person tests positive in India Livemint Italian couple visited 6 districts before testing positive for coronavirus Hindustan Times I…", "url": "https://www.tribuneindia.com/news/italian-tests-positive-for-coronavirus-in-jaipur-total-cases-in-india-rise-to-6-50314", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/3/2020_3$largeimg_51698190.JPG", "publishedAt": "2020-03-03T13:18:00Z", "content": "New Delhi, March 3 \r\nAn Italian tourist in Jaipur has tested positive for novel Coronavirus, taking the total number of confirmed cases in India to six so far, Union Health Ministry sources said Tuesday.\r\nThe first sample collected from the tourist on Saturda… [+1836 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Agencies", "title": "Italian tourist's wife tests positive for coronavirus at Jaipur hospital - Livemint", "description": "Italian tourist's wife tests positive for coronavirus at Jaipur hospital Livemint Coronavirus Outbreak LIVE Updates: Indian Navy Indefinitely Postpones Mega Naval Exercise; Italian Tourist in Jaipur Tests Positive News18 Italian In Jaipur Tests Positive For C…", "url": "https://www.livemint.com/news/india/italian-tourist-s-wife-tests-positive-for-coronavirus-at-jaipur-hospital-11583243663891.html", "urlToImage": "https://images.livemint.com/img/2020/03/03/600x338/87878a5dc164407aac67ca7bcacaa8ac-87878a5dc164407aac67ca7bcacaa8ac-1_1583243871291_1583243891590.jpg", "publishedAt": "2020-03-03T13:58:59Z", "content": "Jaipur: The wife of the Italian tourist found to have been infected with coronavirus also tested positive for the virus here on Tuesday and his samples are being sent to the National Institute of Virology in Pune for another test, an official said.\"The wife o… [+1025 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Travis Gettys", "title": "Student quarantined for coronavirus days after classmates shook Mike Pence’s hand", "description": "A Florida military school student whose classmates shook hands with Vice President Mike Pence last week has been quarantined for the coronavirus. Sarasota Military Academy said a student and his mother have been placed in quarantine after coming into contact …", "url": "https://www.rawstory.com/2020/03/student-quarantined-for-coronavirus-days-after-classmates-shook-mike-pences-hand/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2016/12/abc_tw_pence_161204a-1000x563.jpg", "publishedAt": "2020-03-03T13:48:09Z", "content": "A Florida military school student whose classmates shook hands with Vice President Mike Pence last week has been quarantined for the coronavirus.\r\nSarasota Military Academy said a student and his mother have been placed in quarantine after coming into contact… [+1285 chars]"}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "US Health Authorities Debunk 'Coronavirus Protection' Mask Video Ads - BOOM", "description": "US Health Authorities Debunk 'Coronavirus Protection' Mask Video Ads BOOM How to Prepare for Coronavirus: What You Should Buy — and What You Really Shouldn't Gadgets 360 Face Masks Might Actually Increase Infection Risk for COVID-19 Interesting Engineering Co…", "url": "https://www.boomlive.in/world/us-health-authorities-debunk-coronavirus-protection-mask-video-ads-7107", "urlToImage": "https://www.boomlive.in/h-upload/2020/03/03/917211-masks.jpg", "publishedAt": "2020-03-03T13:29:03Z", "content": "A video advertisement on Facebook encourages people to buy face masks to protect against the novel coronavirus. The ad is misleading; US government health authorities do not recommend the general public wear masks for that purpose, and the video uses footage … [+3196 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Eye Opener at 8: Officials prepare for U.S. coronavirus outbreak", "description": "A look at what we've been covering on \"CBS This Morning.\"", "url": "https://www.cbsnews.com/video/eye-opener-at-8-officials-prepare-for-us-coronavirus-outbreak/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/03/67283367-eed0-4926-9e78-59cb225f2098/thumbnail/1200x630/ddd56d119c67b0d2795fdc14351d4c12/ctm-eyeopener8-2040237-640x360.jpg", "publishedAt": "2020-03-03T13:20:51Z", "content": null}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "G-7 Pledges to Fight Virus Risks, Stops Short of Specific Action - Investing.com", "description": "G-7 Pledges to Fight Virus Risks, Stops Short of Specific Action Investing.com Coronavirus: G7 fails to assuage investors with policy statement Moneycontrol G7 'ready to take action' to stem coronavirus risks Economic Times G7 finance ministers, central bank …", "url": "https://www.investing.com/news/economy/g7-pledges-to-fight-virus-risks-stops-short-of-specific-action-2099679", "urlToImage": "https://i-invdn-com.akamaized.net/news/Coronavirus_800x533_L_1580742994.jpg", "publishedAt": "2020-03-03T13:13:00Z", "content": "(Bloomberg) -- Group of Seven finance chiefs said theyre ready to act to shelter their economies from the spreading coronavirus, though they stopped short of spelling out what specific measures they would put into place.\r\nWe, G-7 Finance Ministers and Central… [+1773 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Mollie Hemingway, Federalist", "title": "Anti-Trumpers Get Punked by Fake Coronavirus Quote", "description": "Many verified Twitter users fall victim to the daily barrage of propaganda that comes out from anti-Trump corporate media.", "url": "https://www.realclearpolitics.com/2020/03/03/anti-trumpers_get_punked_by_fake_coronavirus_quote_503226.html", "urlToImage": "https://assets.realclear.com/images/50/501271_5_.jpg", "publishedAt": "2020-03-03T13:31:56Z", "content": "Many verified Twitter users fall victim to the daily barrage of propaganda that comes out from anti-Trump corporate media.\r\nRead Full Article »"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Algeria energy minister says OPEC+ countries to discuss 'substantial' oil output cuts", "description": "Algeria energy minister and OPEC president said on Tuesday OPEC+ countries will discuss new \"substantial\" oil production cuts at their meetings in Vienna this week, Algerian state news agency APS reported.", "url": "https://www.reuters.com/article/us-oil-opec-algeria-idUSKBN20Q1SK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T13:32:38Z", "content": "DUBAI (Reuters) - Algeria energy minister and OPEC president said on Tuesday OPEC+ countries will discuss new “substantial” oil production cuts at their meetings in Vienna this week, Algerian state news agency APS reported. \r\n“We will discuss the possibility … [+415 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Expert Views: G7 vows \"all appropriate tools\" to battle virus damage but no specifics", "description": "G7 finance ministers and central bank governors said on Tuesday they were committed to using \"all appropriate policy tools\" to support economic growth but stopped short of outlining specific measures to contain damage from the coronavirus. Expectations of a c…", "url": "https://finance.yahoo.com/news/expert-views-g7-vows-appropriate-132812904.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/maFdswgBv7eL.XFVbd1yJQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/dIizB_WUD_17HjV0065.xw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/2554ba51bd4158111fd0d87c0c9d5655", "publishedAt": "2020-03-03T13:28:12Z", "content": "LONDON (Reuters) - G7 finance ministers and central bank governors said on Tuesday they were committed to using \"all appropriate policy tools\" to support economic growth but stopped short of outlining specific measures to contain damage from the coronavirus.\r… [+3552 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "China to repatriate citizens from Iran over coronavirus - Al Jazeera English", "description": "China to repatriate citizens from Iran over coronavirus Al Jazeera English Live updates: Fed cuts interest rate; G7 finance chiefs stop short of announcing specific actions to contain coronavirus fallout The Washington Post WHO chief warns 'we are in uncharte…", "url": "https://www.youtube.com/watch?v=lOh3voQ7Jx0", "urlToImage": null, "publishedAt": "2020-03-03T14:08:06Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Free Coronavirus COVID-19 Employer Preparation Plan Introduced by PieMatrix", "description": "BURLINGTON, Vt.--(BUSINESS WIRE)--Pie makes available free and actionable Coronavirus COVID-19 employer preparation plan.", "url": "https://www.businesswire.com/news/home/20200303005234/en/Free-Coronavirus-COVID-19-Employer-Preparation-Plan-Introduced", "urlToImage": "https://mms.businesswire.com/media/20200303005234/en/777007/23/Logo_-_square.jpg", "publishedAt": "2020-03-03T13:23:16Z", "content": "BURLINGTON, Vt.--(BUSINESS WIRE)--PieMatrix Inc. (Pie) announced a free executable process to help employers prepare for a Coronavirus (COVID-19) epidemic or pandemic. The process content is from the CDC website and is now organized in a better way for step-b… [+1940 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Jonathan Saltzman", "title": "Thermo Fisher buys Dutch firm that tests for coronavirus in $11.5 billion deal", "description": "The $11.5 billion deal expands the Waltham-based laboratory equipment firm’s ability to detect infectious diseases, including the new coronavirus.", "url": "https://www.bostonglobe.com/2020/03/03/business/thermo-fisher-buys-dutch-firm-that-tests-coronavirus-115-billion-deal/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v25heRJEAEM7MdTvuWKJG7rDoRk=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/UIU27NV5DRHYZBZ63Z627NT4WM.jpg", "publishedAt": "2020-03-03T13:30:36Z", "content": "Thermo Fisher Scientific is buying the Dutch diagnostics company Qiagen in an $11.5 billion deal that expands the Waltham-based laboratory equipment firms ability to detect infectious diseases, including the new coronavirus.\r\nQiagen announced last week that i… [+1690 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "Tan Vinh", "title": "Growing fears of the novel coronavirus have hurt Chinese businesses in the Seattle area", "description": "Chinese restaurants in the Chinatown-International District and other parts of Seattle sit empty and events have been canceled as the coronavirus outbreak intensifies.", "url": "https://www.seattletimes.com/life/food-drink/growing-fears-of-the-novel-coronavirus-spread-have-hurt-chinese-businesses-in-the-seattle-area/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/03/03022020_teaser_tzr_173009-780x501.jpg", "publishedAt": "2020-03-03T14:00:04Z", "content": "Even before the novel coronavirus claimed six lives in King County, the hint that the virus outbreak would forever alter the course of Jing Wetzels livelihood came much earlier, when two customers walked into her Zheng Café one January afternoon and noticed W… [+7617 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "AP", "title": "Tokyo Games could be held any time in 2020: Japan Olympic Minister", "description": "The Tokyo Olympics are being threatened by a fast-spreading virus that has been blamed for 12 deaths in Japan and has shut down most sports competitions and Olympic-related events in the country.", "url": "https://indianexpress.com/article/sports/sport-others/tokyo-games-could-be-held-any-time-in-2020-japan-olympic-minister-6297571/", "urlToImage": "https://images.indianexpress.com/2020/03/Seiko-Hashimoto-759.jpg?w=759", "publishedAt": "2020-03-03T13:29:50Z", "content": "By: AP | Tokyo | \r\nPublished: March 3, 2020 6:59:50 pm\r\nSeiko Hashimoto said the contract to hold the games only specifies the event has to be held during 2020. (AP/File Photo)Japan’s Olympic minister said Tuesday the contract to hold the games only specifies… [+1258 chars]"}, {"source": {"id": null, "name": "Justjared.com"}, "author": "Just Jared", "title": "2020 Summer Olympics in Tokyo Could Be Postponed After Coronavirus Fears", "description": "The 2020 Summer Olympics are supposed to be held this summer in Tokyo, Japan. Last week, it was revealed that the games could be completely cancelled because of the Coronavirus, which has infected 90,000 worldwide so far and killed 3,000. Now, the Olympic Min…", "url": "http://www.justjared.com/2020/03/03/2020-summer-olympics-in-tokyo-could-be-postponed-after-coronavirus-fears/", "urlToImage": "http://cdn01.cdn.justjared.com/wp-content/uploads/headlines/2020/03/olympics-postponed1.jpg", "publishedAt": "2020-03-03T13:37:30Z", "content": "The 2020 Summer Olympicsare supposed to be held this summer in Tokyo, Japan. Last week, it was revealed that the games could be completely cancelled because of the Coronavirus, which has infected 90,000 worldwide so far and killed 3,000.\r\nNow, the Olympic Min… [+417 chars]"}, {"source": {"id": null, "name": "Securityweek.com"}, "author": "Associated Press", "title": "Super Tuesday Marks First Major Security Test of 2020", "description": "Tuesday’s presidential primaries across 14 states mark the first major security test since the 2018 midterm elections, with state and local election officials saying they are prepared to deal with everything from equipment problems to false information about …", "url": "https://www.securityweek.com/super-tuesday-marks-first-major-security-test-2020", "urlToImage": null, "publishedAt": "2020-03-03T14:06:35Z", "content": "Tuesdays presidential primaries across 14 states mark the first major security test since the 2018 midterm elections, with state and local election officials saying they are prepared to deal with everything from equipment problems to false information about t… [+4523 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Asian News International", "title": "‘No need to panic’: Narendra Modi holds extensive meeting to review preparedness for coronavirus outbreak", "description": "Prime Minister Narendra Modi on Tuesday reviewed the country's preparedness for the Coronavirus outbreak and urged people to not panic while assuring that all requisite steps to contain the virus are being taken. The post ‘No need to panic’: Narendra Modi hol…", "url": "https://www.firstpost.com/sports/no-need-to-panic-narendra-modi-holds-extensive-meeting-to-review-preparedness-for-coronavirus-outbreak-8113311.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/09/modi-social-2.jpg", "publishedAt": "2020-03-03T13:26:26Z", "content": "New Delhi: Prime Minister Narendra Modi on Tuesday reviewed the country's preparedness for the coronavirus outbreak and urged people to not panic while assuring that all requisite steps to contain the virus are being taken.\r\nTaking to Twitter, Modi wrote, \"Th… [+1247 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Furquan Moharkan", "title": "Coronavirus impact: Rupee tanks to 15-month low - Deccan Herald", "description": "Coronavirus impact: Rupee tanks to 15-month low Deccan Herald Rupee falls sharply beyond 73 against US dollar: 5 things to know Livemint Rupee erases gains, trades near day's low Moneycontrol.com Business Live: Supreme Court quashes RBI banking ban on cryptoc…", "url": "https://www.deccanherald.com/business/business-news/coronavirus-impact-rupee-tanks-to-15-month-low-810165.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/03/03/iStock-987768276-1583245933.jpg", "publishedAt": "2020-03-03T14:04:56Z", "content": "The Indian rupee has depreciated to a 15-month low as foreign funds have continued their withdrawals from the emerging markets amid the spread of deadly coronavirus across the globe.\r\nThe domestic currency, on Tuesday, crashed to sub-73 level for the first ti… [+2764 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "Crystal Paul", "title": "What Seattlelites should know about travel amid coronavirus outbreak", "description": "As the spring break and summer travel season near, the novel coronavirus continues to spread. Should you travel? Should you buy travel insurance? We talked to some local experts about these travel-related questions and more.", "url": "https://www.seattletimes.com/life/travel/what-seattlelites-should-know-about-traveling-amid-the-novel-coronavirus-outbreak/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/02282020_travel_tzr_165248-780x501.jpg", "publishedAt": "2020-03-03T14:00:48Z", "content": "King County residents and people across the country are scrambling to rethink their travel plans because of the rising number of cases of COVID-19, the disease caused by the novel coronavirus.\r\nKatie Kurtz, a Seattle freelance journalist, was planning to meet… [+9157 chars]"}, {"source": {"id": null, "name": "Thediplomat.com"}, "author": "Ankit Panda", "title": "Amid Coronavirus Concerns, Taiwan Takes Measures to Restrict Travel From China", "description": "The island has successfully limited the spread of COVID-19 so far.", "url": "https://thediplomat.com/2020/03/amid-coronavirus-concerns-taiwan-takes-measures-to-restrict-travel-from-china/", "urlToImage": "https://thediplomat.com/wp-content/uploads/2020/02/sizes/td-story-s-2/thediplomat-2020-02-25-3.jpg", "publishedAt": "2020-03-03T14:03:25Z", "content": "Advertisement\r\nTAIPEI Ever since it became apparent that a new strain of coronavirus originating from Wuhan, China, was a serious public health challenge, Taiwan was on alert. Now, well into the Asian epidemic around the novel coronavirus, or COVID-19, Taiwan… [+3690 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Seoul Viosys Sees Increased Demand for Its Violeds UV LED Technology for Sterilization Applications to Prevent the Spread of Coronavirus", "description": "ANSAN, South Korea--(BUSINESS WIRE)-- #COVID19--Seoul Viosys Sees Increased Demand for its violeds UV LED Technology for Sterilization Applications to Prevent the Spread of Coronavirus (COVID-19).", "url": "https://www.businesswire.com/news/home/20200303005072/en/Seoul-Viosys-Sees-Increased-Demand-Violeds-UV", "urlToImage": "https://mms.businesswire.com/media/20200303005072/en/776445/23/Fig1._handbook_and_certification.jpg", "publishedAt": "2020-03-03T14:09:39Z", "content": "ANSAN, South Korea--(BUSINESS WIRE)--Seoul Viosys, a leading global provider of UV LED technology and a subsidiary of Seoul Semiconductor, announced that customer inquiries for its violeds UV LED products, which are ideal for sterilizing bacteria, increased m… [+3939 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "Christopher Elliott", "title": "Ask yourself these 3 questions before canceling your trip due to coronavirus", "description": "The outbreak of the novel coronavirus has travelers in the Seattle area and around the globe wondering if they should cancel travel plans. Here's everything you need to know to make an informed decision.", "url": "https://www.seattletimes.com/life/travel/ask-yourself-these-3-questions-before-canceling-your-trip-due-to-coronavirus/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/03/tzr_130532-780x501.jpg", "publishedAt": "2020-03-03T14:00:41Z", "content": "As news of the novel coronavirus outbreak spreads, many travelers are asking the same question: Should I cancel my upcoming trip? \r\nCoronavirus more specifically the virus SARS-CoV-2, which causes the illness COVID-19 is spreading at an alarming rate. There a… [+7782 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sports Staff, Sports Staff", "title": "IOC 'fully committed' to Tokyo 2020 Olympics going ahead as planned despite coronavirus concerns", "description": "Japan's Olympic minister had stoked speculation that the Games could be delayed until later this year", "url": "https://www.independent.co.uk/sport/olympics/olympics-2020-tokyo-coronavirus-date-postponed-a9372551.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/27/08/olympics-tokyo.jpg", "publishedAt": "2020-03-03T13:54:00Z", "content": "The International Olympic Committee remains fully committed to staging the Tokyo 2020 Games as scheduled this summer despite concerns that the coronavirus outbreak could force a delay.\r\nOrganisers will continue to take advice from the World Health Organisatio… [+1947 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "John Puntis, John Puntis", "title": "As a doctor, I'm telling Boris Johnson – a Little Britain response to coronavirus will be deadly", "description": "We have long known that pandemics do not respect borders. If Johnson removes us from the EU's disease response network, the consequences could be disastrous", "url": "https://www.independent.co.uk/voices/boris-johnson-coronavirus-uk-nhs-eu-symptoms-a9372526.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/01/21/johnson-coronavirus.jpg", "publishedAt": "2020-03-03T13:16:00Z", "content": "In 1831, the first Asiatic cholera pandemic reached the UK via the port of Sunderland. Although the terrible nature of the disease was evident to local doctors, vested interests delayed the notification of authorities in London because of concern about negati… [+3947 chars]"}, {"source": {"id": null, "name": "Shtfplan.com"}, "author": "Contributing Author", "title": "Coronavirus CRIMINALS: CDC Deliberately Released Infected Patient in San Antonio While Positioning Itself to Financially Benefit From an Exploding Epidemic", "description": "The CDC just deliberately released an infected coronavirus patient in San Antonio, Texas. The number of “accidental” releases of infected patients, the nearly four-week withholding of diagnostic test kits and the downplaying of the severity of the outbreak ca…", "url": "https://www.shtfplan.com/headline-news/coronavirus-criminals-cdc-deliberately-released-infected-patient-in-san-antonio-while-positioning-itself-to-financially-benefit-from-an-exploding-epidemic_03032020", "urlToImage": "https://www.shtfplan.com/wp-content/uploads/2020/03/CDC-NN.jpg", "publishedAt": "2020-03-03T13:30:53Z", "content": "This article was originally published by Mike Adams at Natural News. \r\nThe CDC just deliberately released an infected coronavirus patient in San Antonio, Texas. The number of accidental releases of infected patients, the nearly four-week withholding of diagno… [+6338 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": "Jon Gaunt . Sputnik International", "title": "Boris, Close UK Down!", "description": "Boris Johnson was late off the blocks in dealing with the Coronavirus outbreak but now he has had a Cobra meeting and unveiled his big idea…. wash your hands!", "url": "https://sputniknews.com/columnists/202003031078463000-boris-close-uk-down/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107731/93/1077319308.jpg", "publishedAt": "2020-03-03T13:43:58Z", "content": "Boris Johnson was late off the blocks in dealing with the Coronavirus outbreak but now he has had a Cobra meeting and unveiled his big idea. wash your hands!He is morphing into Corporal Jones out of Dads Army, dont panic Britain! He is being aided and abetted… [+4069 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Claire Atkinson", "title": "Entertainment giants brace for outsize hit from theme park closures, cinema shutdowns", "description": "\"China alone is a third of the world’s movie screens. I can’t think of anything comparable,\" said one entertainment expert about the financial impact of cinemas across China remaining shuttered.", "url": "https://www.nbcnews.com/business/business-news/entertainment-giants-brace-outsize-hit-theme-park-closures-cinema-shutdowns-n1147506", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_10/3252246/200302-shanghai-disney-ew-550p_6d83d1f27be6bb5b0f9e971ef96725ea.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-03T14:02:08Z", "content": "Major entertainment and media conglomerates have been grappling with the unstoppable coronavirus contagion in Asia and Europe, and now its arrived on American shores.\r\nCOVID-19, the disease caused by the virus, has already claimed six lives in the United Stat… [+3485 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Ed Scarce", "title": "Fox's Brit Hume Shares His Eclectic Internet Tastes: 'Sexy Vixen Vinyl'", "description": "I suppose the moral of this story is don't send screenshots when you have your tabs still open on your prurient interests. And yes, the tweet was later deleted. Source: The Digital Fix This probably won't stay live for long, but just check out the tabs in Bri…", "url": "https://crooksandliars.com/2020/03/foxs-brit-hume-shares-his-eclectic-internet", "urlToImage": "https://crooksandliars.com/files/primary_image/20/03/pjimage_3.jpg", "publishedAt": "2020-03-03T13:53:31Z", "content": "I suppose the moral of this story is don't send screenshots when you have your tabs still open on your prurient interests. And yes, the tweet was later deleted.This probably won't stay live for long, but just check out the tabs in Brit Hume's screengrab here:… [+436 chars]"}, {"source": {"id": null, "name": "Bossip.com"}, "author": "Bossip Staff", "title": "WELP: Two Cases Of Coronavirus Confirmed In Georgia, Pandemic Panic Ensues", "description": "Georgia Governor Brian Kemp is confirming some residents' biggest fear; the coronavirus is here. During a late-night news conference, Kemp told reporters that there were two confirmed cases of coronavirus in Fulton County. WSBTV reports that the carriers of t…", "url": "http://bossip.com/1847783/two-cases-of-coronavirus-confirmed-in-georgia/", "urlToImage": "https://bossip.files.wordpress.com/2020/03/15832439798369.jpg?w=560&h=320&crop=1", "publishedAt": "2020-03-03T13:59:54Z", "content": "Here we go…\r\nSource: picture alliance / Getty\r\nGeorgia Governor Brian Kemp is confirming some residents’ biggest fear; the coronavirus is here. During a late-night news conference, Kemp told reporters that there were two confirmed cases of coronavirus in Fult… [+1661 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aimee Picchi", "title": "Twitter tells all of its employees to work at home, citing virus", "description": "Tech company said it is \"operating out of an abundance of caution\" in asking its 5,000 workers to work from home.", "url": "https://www.cbsnews.com/news/twitter-coronavirus-employees-work-at-home-because-of-outbreak/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2016/11/15/383d98b1-d9b7-446a-bb4b-a842ef209ba2/thumbnail/1200x630/05fc6c26afabe83eae86e69896efec33/twitter.jpg", "publishedAt": "2020-03-03T13:53:59Z", "content": "Twitter is asking its entire workforce of 5,000 people to work from home, part of its effort to keep employees safe and prevent the spread of the coronavirus. The company said working from home was mandatory for its workers in Hong Kong, Japan and South Korea… [+2158 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Italian tourist#39;s wife tested positive for coronavirus at Jaipur hospital", "description": "#39;The wife of the Italian tourist also developed symptoms and samples were collected. The report indicates positive signs of the virus in her. For further confirmation, we are sending her sample to the NIV, Pune,#39; the official of the Rajasthan Health Dep…", "url": "https://www.moneycontrol.com/news/trends/health-trends/italian-tourists-wife-tested-positive-for-coronavirus-at-jaipur-hospital-4998051.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/nCov-770x433.jpg", "publishedAt": "2020-03-03T13:58:05Z", "content": "The wife of the Italian tourist found to have been infected with coronavirus also tested positive for the virus here on March 3 and his samples are being sent to the National Institute of Virology in Pune for another test, an official said.\r\n\"The wife of the … [+476 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus outbreak: G7 says will use policy tools at its disposal", "description": "\"G7 central banks will continue to fulfill their mandates, thus supporting price stability and economic growth while maintaining the resilience of the financial system,\" it said in a statement.", "url": "https://www.moneycontrol.com/news/world/coronavirus-g7-fails-to-deliver-policy-action-fails-to-lift-dow-4997711.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-Reuters-1-770x435.jpg", "publishedAt": "2020-03-03T13:18:50Z", "content": "With the coronavirus triggering a global panic, investors were looking forward to the G7 meeting for a strong response.\r\nBut the statement released on March 3 failed to lift sentiments as the lack of a concrete plan to tackle the deadly virus continues to hau… [+1704 chars]"}, {"source": {"id": null, "name": "Bipblog.com"}, "author": "newsblogbip", "title": "【ワロタ】北朝鮮、コロナウイルス陽性が出るも3時間後に射殺して焼却", "description": "1 風吹けば名無し 2020/03/03(火) 20:08:44.44 ID:7AyKAOGla0303 North Korea’s First Confirmed Coronavirus Patient Shot Dead For weeks, the outside world has speculated about the severity of the coronavirus outbreak in North Korea. And the entire ti...", "url": "http://bipblog.com/archives/5695519.html", "urlToImage": "https://livedoor.blogimg.jp/bipblog/imgs/d/7/d736f178.jpg", "publishedAt": "2020-03-03T14:00:57Z", "content": "North Koreas First Confirmed Coronavirus Patient Shot Dead\r\nFor weeks, the outside world has speculated about the severity of the coronavirus outbreak in North Korea. And the entire time, North Korea has persisted in insisting thatit doesnt have a coronavirus… [+172 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jessica Smith", "title": "Here’s what the Virginia business community is watching on Super Tuesday - Yahoo Finance", "description": "The Virginia Chamber of Commerce CEO explains which issues business leaders in the Commonwealth are watching ahead of Super Tuesday.", "url": "https://finance.yahoo.com/news/heres-what-the-virginia-business-community-is-watching-on-super-tuesday-134358864.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ZBWCqY84lNORa5kFjOZf7Q--~B/aD00MDQ1O3c9NjQyOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/024a77e0-5ccc-11ea-b367-00257e77918e", "publishedAt": "2020-03-03T13:43:00Z", "content": "As Virginia voters head to the polls, the commonwealths Chamber of Commerce CEO says business leaders are looking for candidates who will invest in the nations infrastructure and defense industry without a lot of over-regulation.\r\nVirginia business owners are… [+4747 chars]"}, {"source": {"id": null, "name": "Huxiu.com"}, "author": "大西岛", "title": "冠状病毒抗争史", "description": "病毒很可怕，而比病毒更可怕的是因为不了解而产生的恐慌、歧视，和因不重视导致的贻误战机。 新型肺炎肆虐之际，我们将从人类与冠状病毒几次正面交锋出发，围绕传染病流行的三个要素：传染源，传播途径和易感人群，聊聊冠状病毒的前世今生...... 引用资料： https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5545842/#Sec10title https://zh.wikipedia.org/wiki/%E5%86%A0%E7%8A%B6%E7%97%85%E6%AF%92 htt…", "url": "https://www.huxiu.com/article/342537.html", "urlToImage": "https://img.huxiucdn.com/article/cover/202003/04/113245622246.jpg?imageView2/1/w/1440/h/810/|imageMogr2/strip/interlace/1/quality/85/format/jpg", "publishedAt": "2020-03-03T14:07:00Z", "content": "......\r\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5545842/#Sec10title\r\nhttps://zh.wikipedia.org/wiki/%E5%86%A0%E7%8A%B6%E7%97%85%E6%AF%92\r\nhttps://www.zhihu.com/question/367784886/answer/985768364\r\nhttps://zh.wikipedia.org/wiki/SARS%E4%BA%8B%E4%BB%B6\r\nhttp… [+914 chars]"}, {"source": {"id": null, "name": "Politico.eu"}, "author": "Aitor Hernández-Morales, Maïa de La Baume", "title": "Corona-chaos at the European Parliament", "description": "Over 100 events were cancelled by European Parliament President David Sassoli to slow the spread of coronavirus.", "url": "http://www.politico.eu/article/coronavirus-chaos-at-the-european-parliament/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2020/03/GettyImages-1210068627-1200x628.jpg", "publishedAt": "2020-03-03T14:07:30Z", "content": "The European Parliament is closed for coronavirus. And it's causing chaos.\r\nA day after President David Sassoli announced a set of new measures to stop the spread of the pathogen, the last-minute ban on access to the Parliament building in Brussels for visito… [+4034 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "U.S. and other big economies pledge cooperation to fight virus", "description": "G-7 group of major industrial countries vows to use \"all appropriate tools\" to cope with economic fallout.", "url": "https://www.cbsnews.com/news/us-and-other-large-economies-pledge-cooperation-to-deal-with-coronavirus/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/05/22/ddcdded0-91ea-4c46-82f8-2480585dd3c3/thumbnail/1200x630/553859ae6ba326a800e05b3e7bbe7d59/gettyimages-960935534.jpg", "publishedAt": "2020-03-03T13:37:08Z", "content": "Washington — Seven major economies, including the U.S., pledged Tuesday to use \"all appropriate tools\" to deal with the spreading coronavirus, while stopping short of immediate actions.\r\nThe group of major industrial countries, referred to as the G-7, said it… [+1877 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus outbreak: As Italian tourist in Jaipur tests positive, here#39;s what has happened in India so far", "description": "The Delhi government held an emergency meeting to discuss its preparedness in tackling the virus", "url": "https://www.moneycontrol.com/news/india/coronavirus-outbreak-as-italian-tourist-in-jaipur-tests-positive-heres-what-has-happened-in-india-so-far-4997461.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/Tour_coronavirus-770x433.jpg", "publishedAt": "2020-03-03T14:06:29Z", "content": "A day after two new cases of the novel coronavirus were reported in India one from Delhi and the other from Telangana Union Health Ministry sources told news agency PTI that an Italian tourist in Jaipur has tested positive for the viral infection.\r\nThis takes… [+3197 chars]"}, {"source": {"id": null, "name": "Wonkette.com"}, "author": "Stephen Robinson", "title": "Coronavirus Update: Schools Close, Shoppers Put A Squeeze On Charmin Supplies", "description": "I used to live in Seattle. It was tough enough even when there wasn't a coronavirus panic. So far in Washington state, there are 18 confirmed cases (the official number) and six fatalities associated with the virus. King County announced a state of emergency.…", "url": "https://www.wonkette.com/coronavirus-update-schools-close-shoppers-put-a-squeeze-on-charmin-supplies", "urlToImage": "https://wonkette-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F22839186%2F1200x600.png/2000%2C2000/KGU0Add8w9pa76SM/img.png", "publishedAt": "2020-03-03T14:00:11Z", "content": "I used to live in Seattle. It was tough enough even when there wasn't a coronavirus panic. So far in Washington state, there are 18 confirmed cases (the official number) and six fatalities associated with the virus. King County announced a state of emergency.… [+4746 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "The Associated Press", "title": "Tuesday Time Schedule", "description": "Baltimore vs. Washington at West Palm Beach, Fla., 1:05 p.m. Boston vs. N.Y. Yankees at Tampa, Fla., 1:05 p.m. Houston vs. St. Louis at Jupiter, Fla., 1:05 p.m. Tampa Bay vs. Atlanta at North Port, Fla., 1:05 p.m. Most Read Stories 6 people have now died from…", "url": "https://www.seattletimes.com/sports/tuesday-time-schedule/", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2020-03-03T14:09:07Z", "content": "Baltimore vs. Washington at West Palm Beach, Fla., 1:05 p.m.\r\nBoston vs. N.Y. Yankees at Tampa, Fla., 1:05 p.m.\r\nHouston vs. St. Louis at Jupiter, Fla., 1:05 p.m.\r\nTampa Bay vs. Atlanta at North Port, Fla., 1:05 p.m.\r\nDetroit vs. Minnesota at Fort Myers, Fla.… [+1150 chars]"}, {"source": {"id": null, "name": "Hospitalitynet.org"}, "author": "Right Revenue", "title": "Coronavirus – Now Is Not The Time To Panic…", "description": "What is Coronavirus? A coronavirus is a type of virus. As a group, coronaviruses are common across the world. Typical symptoms of coronavirus include fever and a cough that may progress to a severe pneumonia causing shortness of breath and breathing difficult…", "url": "https://www.hospitalitynet.org/news/4097293.html", "urlToImage": "https://www.hospitalitynet.org/picture/xl_153112574.jpg", "publishedAt": "2020-03-03T13:54:55Z", "content": "What is Coronavirus?\r\nA coronavirus is a type of virus. As a group, coronaviruses are common across the world. Typical symptoms of coronavirus include fever and a cough that may progress to a severe pneumonia causing shortness of breath and breathing difficul… [+654 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "‘Incompetence’ of Trump’s coronavirus response has ‘exceeded what anyone would expect’: Harvard epidemiologist", "description": "The Trump administration’s bungling of the coronavirus outbreak has left many medical professionals fuming, including an emergency room doctor at New York-Presbyterian Hospital who on Monday called the federal government’s slow response a “national scandal.” …", "url": "https://www.rawstory.com/2020/03/incompetence-of-trumps-coronavirus-response-has-exceeded-what-anyone-would-expect-harvard-epidemiologist/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2016/04/fox_fns_trump_abortion_160403a.jpg", "publishedAt": "2020-03-03T13:40:08Z", "content": "The Trump administration’s bungling of the coronavirus outbreak has left many medical professionals fuming, including an emergency room doctor at New York-Presbyterian Hospital who on Monday called the federal government’s slow response a “national scandal.”\r… [+1079 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "Rajesh Pandey", "title": "The OnePlus 8 series will reportedly launch in mid-April", "description": "The OnePlus 8 series will reportedly launch globally in the second week of April. The lineup will include three devices this time around: the OnePlus 8 Lite, OnePlus 8, and the OnePlus 8 Pro. Read more...", "url": "https://www.neowin.net/news/the-oneplus-8-series-will-reportedly-launch-in-mid-april/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2019/10/1571392770_oneplus_8_pro_renders_story.jpg", "publishedAt": "2020-03-03T13:50:01Z", "content": "It looks like OnePlus is planning on launching its OnePlus 8 series in the second week of April. A new report from TechRadar citing a \"source close to the company\" claims that the global announcement of the device is scheduled in the second week of April. A p… [+1224 chars]"}]