[{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "2020 Olympics threatened due to coronavirus", "description": "Japan has called for a two week hiatus of public events across the country, which have extended to major changes and cancelations of sporting events. The status of the 2020 Summer Olympics in Tokyo is increasingly being called into question.", "url": "https://www.cnn.com/videos/sports/2020/02/28/tokyo-2020-under-threat-coronavirus-japan-diamond-princess-spt-intl.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213050151-olympics-tokyo-2020-super-tease.jpg", "publishedAt": "2020-02-28T16:43:26Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Victoria Song", "title": "Amazon Bans 1 Million Products Falsely Claiming to Cure Coronavirus", "description": "If you do an Amazon search for “coronavirus,” you get a ton of self-published guides on how to beat it, a foul-mouthed coloring book, some sanitizing products, and of course, face masks. But in recent weeks, Amazon has banned more than 1 million products for …", "url": "https://gizmodo.com/amazon-bans-1-million-products-falsely-claiming-to-cure-1841972605", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/amojfqj4qvpauawdooaf.jpg", "publishedAt": "2020-02-28T17:00:00Z", "content": "If you do an Amazon search for coronavirus, you get a ton of self-published guides on how to beat it, a foul-mouthed coloring book, some sanitizing products, and of course, face masks. But in recent weeks, Amazon has banned more than 1 million products for fa… [+2421 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "EU health ministers to hold extraordinary virus talks next week", "description": "European Union health ministers will hold an extraordinary meeting on March 6 to discuss the coronavirus outbreak, an EU official said.", "url": "https://www.reuters.com/article/us-china-health-eu-idUSKCN20M2JG", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T16:33:43Z", "content": "BRUSSELS (Reuters) - European Union health ministers will hold an extraordinary meeting on March 6 to discuss the coronavirus outbreak, an EU official said. \r\nEU health ministers held a first extraordinary meeting earlier in February on the epidemic, where th… [+131 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Both Illinois coronavirus patients recovered and returned home-governor", "description": "Illinois Governor J.B. Pritzker on Friday said that the state had \"successfully contained\" the coronavirus to two confirmed cases, with both patients recovering fully and returning home.", "url": "https://www.reuters.com/article/us-china-health-usa-illinois-idUSKCN20M2MT", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496586679&w=1200&r=LYNXNPEG1R1NX", "publishedAt": "2020-02-28T17:07:30Z", "content": "(Reuters) - Illinois Governor J.B. Pritzker on Friday said that the state had “successfully contained” the coronavirus to two confirmed cases, with both patients recovering fully and returning home. \r\nEven so, as the deadly outbreak continues to stoke global … [+190 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "dslotnick@businessinsider.com (David Slotnick), David Slotnick", "title": "United just slashed its flights to Japan and other parts of Asia, showing how quickly coronavirus fears are hurting new airline and travel markets outside of China (UAL)", "description": "United Airlines said it will significantly reduce its capacity to Japan, Singapore, and South Korea due to the novel coronavirus outbreak. Japan has, over just a few days, become the latest hotspot of the virus. Officials said this week that all schools would…", "url": "https://www.businessinsider.com/coronavirus-united-cancels-japan-flights-outbreak-tourism-asia-2020-2", "urlToImage": "https://i.insider.com/5e593d7afee23d639f05aa2a?width=1200&format=jpeg", "publishedAt": "2020-02-28T16:57:22Z", "content": "United Airlines said on Friday that it was significantly reducing its capacity to Asia as the novel coronavirus continues to spread around the region and the rest of the world.\r\nAs part of the reduction, the airline suspended several routes to Japan through A… [+2831 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Lahut", "title": "Donald Trump Jr. says Dems hope coronavirus 'comes here and kills millions' and ends his dad's 'streak of winning'", "description": "Donald Trump Jr. accused Democrats on Friday of hoping the coronavirus \"comes here and kills millions of people so that they can end Donald Trump's streak of winning.\" The executive VP of the Trump Organization took particular issue with a New York Times opin…", "url": "https://www.businessinsider.com/don-jr-dems-want-coronavirus-to-end-dads-streak-winning-2020-2", "urlToImage": "https://i.insider.com/5e59380ffee23d54f63b56d8?width=1200&format=jpeg", "publishedAt": "2020-02-28T16:25:34Z", "content": "Donald Trump Jr. went on a tirade during a Fox &amp; Friends appearance to blame Democrats for rooting for the coronavirus to kill millions of people just to besmirch his father's presidency.\r\nThe executive VP of the Trump organization was speaking from CPAC … [+1658 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Collin Binkley / AP", "title": "How U.S. Schools Are Planning for Possible Spread of Coronavirus", "description": "Schools across America are bracing for the possibility that the new coronavirus could begin spreading in their communities.", "url": "https://time.com/5792377/us-schools-coronavirus-plans/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/us-schools-coronavirus-plans.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-02-28T16:47:22Z", "content": "Schools across the United States are canceling trips abroad, preparing online lessons and even rethinking “perfect attendance” awards as they brace for the possibility that the new coronavirus could begin spreading in their communities.\r\nDistricts have been r… [+6501 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bradley Saacks", "title": "Citadel, BlackRock, and D1 Capital are racking up hundreds of millions in gains as coronavirus fears tank airlines, cruises, and movie-theater stocks", "description": "Ken Griffin's Citadel, Larry Fink's BlackRock, and Daniel Sundheim's D1 Capital led the money managers are gaining from short positions on stocks hit hard by the coronavirus. Citadel made millions on short positions on European airlines, while BlackRock had a…", "url": "https://www.businessinsider.com/citadel-blackrock-d1-short-positions-in-coronavirus-related-shorts-2020-2", "urlToImage": "https://i.insider.com/5e56eaa3fee23d5d687a5f89?width=1200&format=jpeg", "publishedAt": "2020-02-28T16:56:18Z", "content": "What might end up being the worst week for stocks in over a decade hurt a little less for some asset managers.\r\nBlackRock, Citadel, D1 Capital, and Adelphi Capital were all able to make millions on short positions of airlines, cruise companies, movie theaters… [+2326 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Martin Pengelly", "title": "Trump 'could suck coronavirus out of 60,000 people' and he'd still be criticized – Huckabee", "description": "* Top Republican on Fox News defends Trump and Mike Pence * Vice-president leading coronavirus containment effort in US * Whistleblower: US coronavirus staff were untrained and unprotectedDonald Trump could “personally suck” the coronavirus “out of every one …", "url": "https://news.yahoo.com/trump-could-suck-coronavirus-60-161730830.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/561k0bonBrb9qaRTN7lVLw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMDA7aD02MDA-/https://s.yimg.com/uu/api/res/1.2/SizUyTvM_lx37ZPwX2mKvA--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/d2f79c28fd9ef91c9c0ca03f7a50d306", "publishedAt": "2020-02-28T16:17:30Z", "content": "Photograph: Leah Millis/Reuters\r\nDonald Trump could personally suck the coronavirus out of every one of the 60,000 people in the world, suck it out of their lungs, swim to the bottom of the ocean and spit it out, and he would be accused of pollution for messi… [+3741 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Libby Cathey", "title": "As stock market dives, White House officials defend Trump's response to CoVID-19", "description": "As the stock market continues on track for the sharpest weekly decline since 2008, President Donald Trump said \"like a miracle\" the new coronavirus \"will disappear.\"", "url": "https://abcnews.go.com/Politics/stock-market-dives-white-house-defends-trumps-response/story?id=69281750", "urlToImage": "https://s.abcnews.com/images/US/trump-black-history-2-sh-rc-200228_hpMain_16x9_992.jpg", "publishedAt": "2020-02-28T17:01:24Z", "content": "As the stock market on Friday continued to nosedive over CoVID-19 fears, the White House defended President Donald Trump's response to the new coronavirus as he and his supporters continued to downplay the threat and accuse Democrats and the news media of hyp… [+9862 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Here’s How Coronavirus Is Already Making It Harder for Americans Living Abroad to Vote in the 2020 Primaries", "description": "Americans living in China and South Korea have been told that due to the coronavirus outbreak they won’t be able to vote in person for the Democratic presidential primary next month and should instead vote online. As more cases of COVID-19 appear around the w…", "url": "https://time.com/5792039/coronavirus-2020-primaries-election-security/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/Democrats-Abroad-presidential-primary-election.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-02-28T16:33:16Z", "content": "Americans living in China and South Korea have been told that due to the coronavirus outbreak they won’t be able to vote in person for the Democratic presidential primary next month and should instead vote online. As more cases of COVID-19 appear around the w… [+4544 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Hilary Russ", "title": "Two Illinois coronavirus patients recovered and returned home: governor", "description": "Illinois has \"successfully contained\" the new coronavirus to two confirmed cases, with both patients recovering fully and returning home, Governor J.B. Pritzker said on Friday. The coronavirus has killed nearly 3,000 and infected at least 80,000 people. Most …", "url": "https://news.yahoo.com/both-illinois-coronavirus-patients-recovered-170431139.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/RgC27rn3yXqTjqnw_BlWPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/gUFs5eshtEkSwWTmFsajJg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/7a1e53f5fbc55bf278b0756251b36ee3", "publishedAt": "2020-02-28T17:04:31Z", "content": "By Hilary Russ\r\nNEW YORK (Reuters) - Illinois has \"successfully contained\" the new coronavirus to two confirmed cases, with both patients recovering fully and returning home, Governor J.B. Pritzker said on Friday.\r\nEven so, as the outbreak that began in China… [+1903 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "David Gilbert, Michael Learmonth", "title": "A Chinese Citizen Journalist Covering Coronavirus Just Live-Streamed His Own Arrest", "description": "Li Zehua quit his job at state-run TV station CCTV to expose the reality of life inside the Wuhan lockdown zone.", "url": "https://www.vice.com/en_us/article/qjdejp/a-chinese-citizen-journalist-covering-coronavirus-just-live-streamed-his-own-arrest", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e59205ea1cb4900979e9077/lede/1582905959743-Li-Zehua.png?crop=0.9333333333333333xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-02-28T16:17:38Z", "content": "A citizen journalist who was exposing the reality of life inside the Wuhan lockdown zone at the epicenter of the coronavirus outbreak was detained by Chinas security forces at his apartment in Wuhan and the whole thing was captured on camera.\r\n Li Zehua is a … [+5158 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Greg Robb", "title": "The Fed: Fed’s Bullard says markets might be ‘overestimating’ likelihood of severe global coronavirus pandemic", "description": "St. Louis Fed President James Bullard said Friday he thinks the coronavirus will be brought under control and financial markets are overestimating the chances of a severe global pandemic.", "url": "https://www.marketwatch.com/story/feds-bullard-says-markets-might-be-overestimating-likelihood-of-severe-global-coronavirus-pandemic-2020-02-28", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HT291_bullar_ZG_20191015065152.jpg", "publishedAt": "2020-02-28T16:36:14Z", "content": "St. Louis Fed President James Bullard said Friday investors might be overestimating the likelihood of a debilitating global pandemic resulting from the coronavirus.\r\nThey are certainly free to bet as they wish, Bullard told reporters after a speech in Fort Sm… [+2561 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Robert Schroeder", "title": "Key Words: Kudlow urges stock-buying as he says coronavirus threat to U.S. low", "description": "Top White House economist Larry Kudlow on Friday said investors should think about getting back into the stock market as the Dow Jones Industrial Average was on track to its worst weekly loss since 2008 over fears the COVID-19 epidemic may impact the global e…", "url": "https://www.marketwatch.com/story/kudlow-urges-stock-buying-as-he-says-coronavirus-threat-to-us-low-2020-02-28", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-GX456_kudlow_ZG_20181031232010.jpg", "publishedAt": "2020-02-28T16:58:27Z", "content": "Larry Kudlow \r\nTop White House economist Larry Kudlow on Friday said investors should think about getting back into the stock market as the Dow Jones Industrial Average was on track to its worst weekly loss since 2008 over fears the COVID-19 epidemic may impa… [+1447 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Myra P. Saefong", "title": "Commodities Corner: Coronavirus and Russia pose the biggest challenges for OPEC+ efforts to lift oil prices", "description": "The spread of the coronavirus epidemic from China poses a unique challenge for the Organization of the Petroleum Exporting Countries and their allies, as the major oil producers prepare for talks aimed at supporting prices and balancing global supply and dema…", "url": "https://www.marketwatch.com/story/coronavirus-and-russia-pose-the-biggest-challenges-for-opec-efforts-to-lift-oil-prices-2020-02-28", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HI409_oil_op_ZG_20190429054956.jpg", "publishedAt": "2020-02-28T16:45:57Z", "content": "The spread of the coronavirus epidemic from China around the world poses a unique challenge for the Organization of the Petroleum Exporting Countries and their allies, as the major oil producers prepare for talks next week aimed at supporting prices and balan… [+3484 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": "Michele Debczak", "title": "8 Ways You Can Prepare for a Coronavirus Outbreak", "description": "The CDC warns that Americans should start preparing for a coronavirus outbreak. Here's what you should know to keep yourself and your community safe.", "url": "https://www.mentalfloss.com/article/618914/how-to-prepare-for-coronavius-outbreak", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_fill,g_auto,h_1248,w_2220/v1582905683/shape/mentalfloss/618914-gettyimages-467706864.jpg?itok=v7uz0fXb", "publishedAt": "2020-02-28T17:00:00Z", "content": "On Tuesday, February 25, the Centers for Disease Control and Prevention gave an update on the status of COVID-19, the disease caused by the new coronavirus, in the U.S. Though there have been about 60 cases of the disease in the country so far, and only one f… [+6513 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Mitch Tuchman", "title": "Outside the Box: 5 ways investors can stay calm as coronavirus fears worry markets", "description": "Don’t make an emotional decision with your portfolio", "url": "https://www.marketwatch.com/story/5-ways-investors-can-stay-calm-as-coronavirus-fears-worry-markets-2020-02-28", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HI937_medita_ZG_20190506140105.jpg", "publishedAt": "2020-02-28T17:09:14Z", "content": "After more than a decade of tremendous gains in the stock market \r\nSPX, -2.13%,\r\njust about everybody in the financial advising business knew that a correction of some sort was due.\r\nIt was anybodys guess as to when or why. The news of the coronavirus spreadi… [+5359 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Myah Ward", "title": "Mulvaney dismisses coronavirus concern as media panic", "description": "But the acting White House chief of staff also conceded to the seriousness of the virus.", "url": "https://www.politico.com/news/2020/02/28/mick-mulvaney-blames-the-media-for-coronavirus-panic-118133", "urlToImage": "https://static.politico.com/4a/68/104be81a4f468bc4a33678e1d1bc/200228-mulvaney-cpac-gty-773.jpg", "publishedAt": "2020-02-28T16:25:23Z", "content": "Thats what this is all about. I got a note today from a reporter saying, what are you going to do today to calm the markets? Really what I might do today to calm the markets is tell people to turn their televisions off for 24 hours, Mulvaney said at the Conse… [+2375 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Jacob Siegal", "title": "Coronavirus is crushing Samsung’s Galaxy S20 launch, with sales down 50%", "description": "We will likely see the impact of the coronavirus outbreak for weeks and months to come, but for a concrete number to show just how disruptive the virus has been, look no further than the sales of the Galaxy S20. Citing industry sources, The Korea Herald repor…", "url": "https://bgr.com/2020/02/28/galaxy-s20-vs-galaxy-s10-sales-coronavirus-impact/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/02/samsung-galaxy-s20-ultra-2.jpg?quality=98&strip=all", "publishedAt": "2020-02-28T16:28:37Z", "content": "We will likely see the impact of the coronavirus outbreak for weeks and months to come, but for a concrete number to show just how disruptive the virus has been, look no further than the sales of the Galaxy S20. Citing industry sources, The Korea Herald repor… [+2251 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Panicked selling of AAPL lets Apple buy back billions cheaply", "description": "Media-induced panic related to the coronavirus outbreak has caused stocks to crash in value, with Apple's share price dropping to levels not seen since early December, back before it was appreciated how well Apple's iPhone 11, wearables, services, and other o…", "url": "https://appleinsider.com/articles/20/02/28/panicked-selling-of-aapl-lets-apple-buy-back-billions-cheaply", "urlToImage": "https://photos5.appleinsider.com/gallery/34475-62199-IMG_0907-xl.jpg", "publishedAt": "2020-02-28T16:50:33Z", "content": "Media-induced panic related to the coronavirus outbreak has caused stocks to crash in value, with Apple's share price dropping to levels not seen since early December, back before it was appreciated how well Apple's iPhone 11, wearables, services, and other o… [+8152 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Singapore Is Containing The Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-02-28/singapore-is-containing-the-coronavirus-video", "urlToImage": null, "publishedAt": "2020-02-28T16:41:44Z", "content": null}, {"source": {"id": "politico", "name": "Politico"}, "author": "POLITICO Staff", "title": "Mulvaney sounds off at CPAC and Pompeo dodges Dems on Capitol Hill: The latest on coronavirus", "description": "Key updates from Washington, D.C.", "url": "https://www.politico.com/news/2020/02/28/coronavirus-update-today-latest-news-usa-response-118140", "urlToImage": "https://static.politico.com/d0/fb/34db91b341f9ac2ee4aad3761135/200228-coronavirus-mexico-773.jpg", "publishedAt": "2020-02-28T17:09:19Z", "content": "If things do get materially worse, we will be on top of that, and we would be able to deal with that, he said.\r\nAs for the economy, Kudlow pointed to recent data showing a positive outlook for jobs and the housing market, as well as strong consumer spending.\r… [+4706 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Xiaomi's New Wraparound Display Phone Is Very Cool And Very Bizarre", "description": "What's the point of Xiaomi's Mi Mix Alpha's wraparound screen design? It's unclear, but it's pretty wild.", "url": "https://digg.com/video/xiaomi-mi-mix-alpha-wraparound", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/02/28165647/Screen-Shot-2020-02-28-at-11.52.20-AM.jpg", "publishedAt": "2020-02-28T17:11:20Z", "content": "With the news that the coronavirus is spreading, it's only a matter of time before people start to think—wait, do I have the coronavirus? At this point it's still extremely rare, and your cough is far more likely to be a cold or flu. Still, here's what you sh… [+7 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Watch UCLA Gymnast Nia Dennis Absolutely Crush This Beyonce-Themed Floor Exercise", "description": "This is what a 9.975 routine looks like.", "url": "https://digg.com/video/watch-nia-dennis-absolutely-crush-this-beyonce-themed-floor-exercise", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/02/28140635/Screen-Shot-2020-02-28-at-9.06.18-AM.jpg", "publishedAt": "2020-02-28T16:27:43Z", "content": "With the news that the coronavirus is spreading, it's only a matter of time before people start to think—wait, do I have the coronavirus? At this point it's still extremely rare, and your cough is far more likely to be a cold or flu. Still, here's what you sh… [+7 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "US Democrats grill Pompeo over Iran, coronavirus", "description": "The hearing was to focus on dealings with Iran and Iraq, but many of the questions centred on the coronavirus.", "url": "https://www.aljazeera.com/news/2020/02/democrats-grill-pompeo-iran-coronavirus-200228153307559.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/28/ddf8e2dc680a48d88549178e2d2a6af0_18.jpg", "publishedAt": "2020-02-28T16:15:27Z", "content": "Secretary of State Mike Pompeo defended the Trump administration's response to the spreading coronavirus and faced contentious questions from Democrats about an attack that killed Iran's most powerful general.\r\nDemocrats on the House Foreign Affairs Committee… [+2425 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Debbie  Koenig", "title": "Preparing for Coronavirus: Dos and Don’ts", "description": "Public health officials have been urging people to prepare -- not panic -- for the coronavirus (also known as COVID-19). Here’s what you need to know to protect yourself right now.", "url": "https://www.webmd.com/lung/news/20200228/preparing-for-coronavirus-dos-and-donts", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/features/_2016/09_2016/prevent_cold_and_flu_features/650x350_prevent_cold_and_flu_features.jpg", "publishedAt": "2020-02-28T16:43:31Z", "content": "Feb. 28, 2020 -- Public health officials have been urging people to prepare -- not panic -- for the coronavirus (also known as COVID-19). Those calls took on added urgency as cases of the virus have started to spike in countries outside China. Heres what you … [+1884 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What you need to know as coronavirus outbreak reaches \"decisive point\" - CBS News", "description": "What you need to know as coronavirus outbreak reaches \"decisive point\" CBS News Coronavirus outbreak hits arts and entertainment industries Al Jazeera English WHO gives briefing on coronavirus outbreak | USA TODAY USA TODAY Coronavirus: Scientists in the US r…", "url": "https://www.youtube.com/watch?v=Ihjw3cKfWFA", "urlToImage": "https://i.ytimg.com/vi/Ihjw3cKfWFA/maxresdefault.jpg", "publishedAt": "2020-02-28T16:35:52Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO gives briefing on coronavirus outbreak | USA TODAY - USA TODAY", "description": "WHO gives briefing on coronavirus outbreak | USA TODAY USA TODAY What you need to know as coronavirus outbreak reaches \"decisive point\" CBS News Coronavirus: Scientists in the US race to find a vaccine Al Jazeera English WHO warns countries to prepare for a c…", "url": "https://www.youtube.com/watch?v=85ZX3v6z1uQ", "urlToImage": null, "publishedAt": "2020-02-28T16:47:31Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Nicholas Rossolillo)", "title": "3 Top Healthcare Stocks to Buy Right Now", "description": "Coronavirus has many investors looking for a health stock bump, but these names are great for the long haul.", "url": "https://www.fool.com/investing/2020/02/28/3-top-healthcare-stocks-to-buy-right-now.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559852/research-scientists-drugs-pharma-biotech.jpg", "publishedAt": "2020-02-28T16:45:00Z", "content": "Worry over the growing spread of the novel coronavirus has sent shares of some of my favorite long-term healthcare stocks -- like leading telehealth provider Teladoc Health (NYSE:TDOC) -- skyrocketing in recent weeks against the cascade of red descending on s… [+6348 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Alex Henderson", "title": "Fox News host Laura Ingraham loses it when guest mentions \"Sharpiegate\" during coronavirus segment", "description": "\"We are talking about the coronavirus,\" Ingraham told her guest. \"You are turning this into a political diatribe\"", "url": "https://www.salon.com/2020/02/28/fox-news-host-laura-ingraham-loses-it-when-guest-mentions-sharpiegate-during-coronavirus-segment_partner/", "urlToImage": "https://media.salon.com/2018/10/laura-ingraham5.jpg", "publishedAt": "2020-02-28T16:52:01Z", "content": "Some Democrats avoid Fox News altogether, while others will avoid inflammatory far-right carnival barkers like Laura Ingraham, Sean Hannity and Tucker Carlson but will speak to some of the more reasonable people at Fox such as Chris Wallace and Andrew Napolit… [+2844 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Simon Kennedy", "title": "Goldman Economists Now See Global Contraction, Fed Cuts", "description": "Goldman Sachs Group Inc. economists said they now expect the coronavirus to inflict a “short-lived global contraction” on the world economy that forces the U.S. Federal Reserve to slash interest rates in the first half of this year.", "url": "https://www.bloomberg.com/news/articles/2020-02-28/goldman-sachs-economists-now-see-global-contraction-fed-cuts", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iLQDVOCFV9bM/v1/1200x1200.jpg", "publishedAt": "2020-02-28T16:44:40Z", "content": "Photographer: Ron Antonelli/Bloomberg\r\nGoldman Sachs Group Inc. economists said they now expect the coronavirus to inflict a “short-lived global contraction” on the world economy that forces the U.S. Federal Reserve to slash interest rates in the first half o… [+1848 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Greg Evans", "title": "Green Day Postpones Tour In Asia Due To Coronavirus Concerns", "description": "Green Day has joined the roster of bands postponing tour dates in Asia out of concern about the coronavirus. “We have unfortunately made the difficult decision to postpone our upcoming shows in Asia due to the health + travel concerns with coronavirus,” the b…", "url": "https://deadline.com/2020/02/green-day-coronavirus-cancel-tour-bts-1202870666/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/shutterstock_editorial_9287102a.jpg?w=1024", "publishedAt": "2020-02-28T16:45:18Z", "content": "Green Day has joined the roster of bands postponing tour dates in Asia out of concern about the coronavirus. “We have unfortunately made the difficult decision to postpone our upcoming shows in Asia due to the health + travel concerns with coronavirus,” the b… [+947 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "White House: 'Media stoking virus fears to take down Trump' - BBC News", "description": "White House: 'Media stoking virus fears to take down Trump' BBC News Trump chief of staff Mick Mulvaney suggests people ignore coronavirus news to calm markets CNBC Mulvaney On Coronavirus Precautions: 'We Know How To Handle This' | NBC News NBC News White Ho…", "url": "https://www.bbc.com/news/world-us-canada-51667670", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/E2C8/production/_111065085_tv060300664.jpg", "publishedAt": "2020-02-28T16:14:26Z", "content": "Image copyrightEPAImage caption\r\n Acting White House Chief of Staff Mick Mulvaney\r\nThe acting White House chief of staff says US media is stoking a coronavirus panic because they hope it will take down President Donald Trump.\r\n\"The reason they are paying so m… [+1791 chars]"}, {"source": {"id": null, "name": "Fox5ny.com"}, "author": "FOX 5 NY", "title": "Toilet paper rationing in Hawaii...", "description": "Toilet paper rationing in Hawaii... (Top headline, 5th story, link ) Related stories: FAUCI TELLS LAWMAKERS THERE WILL BE MANY MORE INFECTED... Residents Near Mystery Case Worry and Wonder... How many exposed? FDA reports 1st drug shortage... Masks Sold Out..…", "url": "https://www.fox5ny.com/news/run-on-toilet-paper-in-hawaii-over-coronavirus-fears", "urlToImage": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2020/02/724/407/FD519CB8C91A416893325B1E6426C580_3.jpg?ve=1&tl=1", "publishedAt": "2020-02-28T16:34:36Z", "content": "Worries over coronavirus have people in Hawaii stocking up on supplies.\r\nAt a Costco store in Honolulu on Thursday, there was a long line of people just trying to buy toilet paper.\r\nIt took between 10 to 15 minutes just to get into the store's parking lot.  T… [+488 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doug Collins breaks down congressional reaction to coronavirus - Fox News", "description": "Doug Collins breaks down congressional reaction to coronavirus Fox News Fox News hosts accuse Democrats and journalists of 'weaponizing' coronavirus to attack Trump CNN Fox News snags first Trump town hall of 2020 election cycle Washington Examiner Ingraham: …", "url": "https://www.youtube.com/watch?v=SapSplhsjDM", "urlToImage": null, "publishedAt": "2020-02-28T16:28:51Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Scottadamssays.com"}, "author": "Scott Adams, Scott Adams", "title": "Episode 834 Scott Adams: All The #Loserthink Around Coronavirus", "description": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a Content: The Adams Law of Slow Moving Disasters Trump administration’s coronavirus response Coronavirus #Loserthink The right amount of panic Sanjay Gupta misinterprets President Trum…", "url": "https://www.scottadamssays.com/2020/02/28/episode-834-scott-adams-all-the-loserthink-around-coronavirus/", "urlToImage": "http://www.scottadamssays.com/wp-content/uploads/2020/02/Episode-834.png", "publishedAt": "2020-02-28T16:51:46Z", "content": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a\r\nContent:\r\n<ul><li>The Adams Law of Slow Moving Disasters</li><li>Trump administration’s coronavirus response</li><li>Coronavirus #Loserthink</li><li>The right amount of panic</li><li… [+443 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Air Travel Cancellations Up 21% on Coronavirus Fears", "description": "More and more people are skipping their planned trips, and airlines are cutting flights due to falling demand.", "url": "https://www.fool.com/investing/2020/02/28/air-travel-cancellations-up-21-on-coronavirus-fear.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560669/collage-of-an-airplane-coronaviruses-and-a-world-map.jpg", "publishedAt": "2020-02-28T16:31:00Z", "content": "U.S.-based travel agencies reported a 21% increase in passengers canceling flight plans this week compared to a year ago -- a behavioral shift apparently spurred by the continuing spread of the COVID-19 coronavirus.\r\nThis is according to a new report out of S… [+1572 chars]"}, {"source": {"id": null, "name": "Ksat.com"}, "author": "Mary Claire Patton", "title": "Is it safe? WHO offers advice to public concerning coronavirus outbreak - KSAT San Antonio", "description": "Is it safe? WHO offers advice to public concerning coronavirus outbreak KSAT San Antonio South Korea virus cases surge as WHO sounds maximum alert - The Jakarta Post Jakarta Post How to prepare for a coronavirus pandemic - Business Insider Business Insider We…", "url": "https://www.ksat.com/news/2020/02/28/myth-busters-advice-for-public-concerning-coronavirus-outbreak/", "urlToImage": "https://www.ksat.com/resizer/rWtGQflaAvtI_8ZK0sGXUJUVYx0=/1600x992/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/H4UQDDFCPFFJBI5VYVV4AD4UIM.jpg", "publishedAt": "2020-02-28T16:25:16Z", "content": "SAN ANTONIO The World Health Organization is dispelling rumors and offering advice amid growing concerns about the coronavirus outbreak.\r\nCoronavirus, or COVID-19, is a new coronavirus that has not been previously identified,\" according to the Centers for Dis… [+1952 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "California Woman with Coronavirus from Unknown Source Is In ‘Serious Condition’", "description": "The California woman who tested positive for coronavirus despite having no contact with anyone with the virus is in “serious condition,” her congressman, California Rep. John Garamendi, told CNN. The source of her coronavirus transmission has been a mystery t…", "url": "https://people.com/health/california-woman-with-coronavirus-from-unknown-source-in-serious-condition/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Fgettyimages-1209113434.jpg%3Fcrop%3D0px%2C545px%2C5472px%2C2875px%26resize%3D1200%2C630", "publishedAt": "2020-02-28T17:07:30Z", "content": "The California woman who tested positive for coronavirus despite having no contact with anyone with the virus is in “serious condition,” her congressman, California Rep. John Garamendi, told CNN.\r\nThe source of her coronavirus transmission has been a mystery … [+2615 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS New York", "title": "International Travelers At JFK Appalled By Lack Of Screening...", "description": "International Travelers At JFK Appalled By Lack Of Screening... (Top headline, 9th story, link ) Related stories: FAUCI TELLS LAWMAKERS THERE WILL BE MANY MORE INFECTED... Residents Near Mystery Case Worry and Wonder... How many exposed? FDA reports 1st drug …", "url": "https://newyork.cbslocal.com/2020/02/27/coronavirus-travel-advisories/", "urlToImage": "https://newyork.cbslocal.com/wp-content/uploads/sites/14578484/2020/02/GettyImages-1203633019.jpg?w=1024", "publishedAt": "2020-02-28T16:55:36Z", "content": "NEW YORK (CBSNewYork) — With the coronavirus outbreak affecting at least 40 countries, many travelers are concerned about what’s being done to contain the virus.At JFK Airport, jetlagged passengers typically in a rush to clear immigration are now appalled by … [+3668 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Timothy Green)", "title": "Dow Jones News: Consumer Giants Tumble; Cisco Down on Layoffs", "description": "Shares of well-known companies are taking it on the chin, and Cisco is downsizing its workforce to deal with a slump in demand.", "url": "https://www.fool.com/investing/2020/02/28/dow-jones-news-consumer-giants-tumble-cisco-down-o.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560679/scared-man.jpg", "publishedAt": "2020-02-28T16:35:00Z", "content": "The stock market was carving out new all-time highs not too long ago. The novel coronavirus outbreak put an end to that. The Dow Jones Industrial Average(DJINDICES:^DJI) was down 3% at 10:55 a.m. EST Friday, bringing its weekly losses close to 15%.\r\nNo stock … [+3339 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Sarah K. Burris", "title": "Don Jr.: Democrats \"hope coronavirus comes here and kills millions\" to end my dad's winning streak", "description": "Trump's son tells Fox that alleged Democratic attempts to end his \"streak of winning is a new level of sickness\"", "url": "https://www.salon.com/2020/02/28/don-jr-democrats-hope-coronavirus-comes-here-and-kills-millions-to-end-my-dads-winning-streak_partner/", "urlToImage": "https://media.salon.com/2019/11/donald-don-jr-trump-11051.jpg", "publishedAt": "2020-02-28T16:23:03Z", "content": "President Donald Trump's son, Don Jr. went off on Democrats Friday morning saying that they hope people will die to kill the president's \"streak of winning.\" \r\nDuring an interview on \"Fox &amp; Friends\" on Fox News, the younger Trump blamed everyone else for … [+917 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Alexandra Talty, Contributor, Alexandra Talty, Contributor https://www.forbes.com/sites/alexandratalty/", "title": "Flight Bookings From US Stall By 19.3% Amid Coronavirus Fears", "description": "A new report by travel analytics firm ForwardKeys finds that coronavirus fears are impacting US flight bookings.", "url": "https://www.forbes.com/sites/alexandratalty/2020/02/28/flight-bookings-from-us-stall-by-193-amid-coronavirus-fears/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1203177088%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D3441%26cropY1%3D12%26cropY2%3D1948", "publishedAt": "2020-02-28T16:55:31Z", "content": "Coronavirus. From quarantined cruise ships to cancelled flights, COVID-19 is making an outsized impact on the travel industry as the virus infects countries around the globe. \r\nAmid fears of contagion, the travel sector has felt the economic impact of the vir… [+3875 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Cody Fenwick", "title": "White House told top doctor not to talk about coronavirus publicly without permission: report", "description": "VP Mike Pence has allegedly tried to “tighten control” of the administration’s messaging about the outbreak", "url": "https://www.salon.com/2020/02/28/white-house-told-top-doctor-not-to-talk-about-coronavirus-publicly-without-permission-report_partner/", "urlToImage": "https://media.salon.com/2015/05/hiv-study.jpeg.jpg", "publishedAt": "2020-02-28T17:02:35Z", "content": "A top expert on viruses in the administration, Dr. Anthony Fauci, has been told by the White House not to speak publicly about the emerging coronavirus outbreak without permission, according to a report Thursday in the New York Times.\r\nFauci directs the Natio… [+2785 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Clinical Characteristics of Coronavirus Disease 2019 in China | NEJM - nejm.org", "description": "Original Article from The New England Journal of Medicine — Clinical Characteristics of Coronavirus Disease 2019 in China", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2002032", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmoa2002032/20200228-01/images/img_small/nejmoa2002032_f1.jpeg", "publishedAt": "2020-02-28T17:01:23Z", "content": "From the State Key Laboratory of Respiratory Disease, National Clinical Research Center for Respiratory Disease, Guangzhou Institute of Respiratory Health, First Affiliated Hospital of Guangzhou Medical University (W.G., W.L., J.H., R.C., C.T., T.W., S.L., Ji… [+3099 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Lisette Voytko, Forbes Staff, Lisette Voytko, Forbes Staff https://www.forbes.com/sites/lisettevoytko/", "title": "WHO Raises Coronavirus Threat To 'Very High'⁠—But Not Yet A Pandemic", "description": "“This is a ‘wake up and get ready’ message for governments.”", "url": "https://www.forbes.com/sites/lisettevoytko/2020/02/28/who-raises-coronavirus-threat-to-very-high-but-not-yet-a-pandemic/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F775039515f1f4c9b856dc74dbae2306f%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D4000%26cropY1%3D169%26cropY2%3D2418", "publishedAt": "2020-02-28T17:07:35Z", "content": "Workers wearing protective gears spray disinfectant as a precaution against coronavirus at a subway ... [+] station in Seoul, South Korea.\r\nAP Photo/Ahn Young-joon\r\nTopline: The World Health Organization declined to call the coronavirus outbreak a pandemic Fr… [+4813 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rick Munarriz)", "title": "Is SeaWorld the Better Theme Park Stock Than Disney or Comcast?", "description": "All three of the major theme park operators posted growth in attendance and guest spending in the latest quarter, but the future doesn't look as encouraging.", "url": "https://www.fool.com/investing/2020/02/28/is-seaworld-the-better-theme-park-play-than-disney.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560664/seasmanta.jpg", "publishedAt": "2020-02-28T16:55:00Z", "content": "SeaWorld Entertainment(NYSE:SEAS) became the third and final major theme park operator to post financial results for its holiday-season quarter. The operator of marine life theme parks joins Disney(NYSE:DIS), which offered up fresh financials earlier this mon… [+3324 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Rockstar Games' Website May Be Teasing a New Title On the Way", "description": "Developer Rockstar Games are fueling rumors of a Grand Theft Auto 6 announcement with their newly updated website, which features several buzzwords in its dropdown menu worthy of speculation. The background images display several lines of text about \"fighting…", "url": "https://hypebeast.com/2020/2/rockstar-games-website-teasing-new-game-rumor", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F02%2Frockstar-games-website-teasing-new-game-rumor-twtr.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-02-28T16:47:43Z", "content": "Developer Rockstar Games are fueling rumors of a Grand Theft Auto 6 announcement with their newly updated website, which features several buzzwords in its dropdown menu worthy of speculation. The background images display several lines of text about “fighting… [+1807 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Rosevear)", "title": "Why Shares of Tata Motors Are Down Sharply Today", "description": "An antitrust investigation added to investors' virus worries.", "url": "https://www.fool.com/investing/2020/02/28/why-shares-of-tata-motors-are-down-sharply-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560677/jaguar-i-pace-2_0.jpg", "publishedAt": "2020-02-28T16:21:00Z", "content": "What's happening\r\nShares of Indian automaker Tata Motors (NYSE:TTM) were down sharply on Friday morning as a new antitrust investigation added to auto investors' concerns about virus-related parts shortages at its important Jaguar Land Rover subsidiary.\r\nAs o… [+1441 chars]"}, {"source": {"id": null, "name": "Searchenginejournal.com"}, "author": "Christine Zirnheld", "title": "Enhanced Bing Webmaster Tools & This Week’s Digital Marketing News [PODCAST] via @shepzirnheld", "description": "We're also talking about Google SERPs, TikTok, guest post penalties, GIPHY & Jif, and more on the latest Marketing O'Clock. The post Enhanced Bing Webmaster Tools & This Week’s Digital Marketing News [PODCAST] via @shepzirnheld appeared first on Search Engine…", "url": "https://www.searchenginejournal.com/enhanced-bing-webmaster-tools-marketing-oclock-podcast/351994/", "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2020/02/enhanced-bing-webmaster-tools-this-weeks-digital-marketing-news-5e58ebad20d03.jpeg", "publishedAt": "2020-02-28T17:00:20Z", "content": "On this week’s episode of Marketing O’Clock, we’re talking about the new Bing Webmaster Tools,  a better export experience in Search Console, bad bots, and bad boats.\r\nJoin Jess Budde, Greg Finn, and Christine “Shep” Zirnheld as we break down these digital ma… [+1955 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Elizabeth Kim", "title": "Coronavirus Update: Sick NYC Resident Tested After Italy Trip, De Blasio Demands Local Testing", "description": "The mayor accused the Trump administration of holding up the city's testing process. [ more › ]", "url": "https://gothamist.com/news/coronavirus-update-sick-nyc-resident-tested-after-italy-trip-de-blasio-demands-local-testing", "urlToImage": "https://cms.prod.nypr.digital/images/301453/fill-1200x650/", "publishedAt": "2020-02-28T16:22:00Z", "content": "Following an expansion of its testing criteria by the Centers for Disease Control and Prevention, New York City is waiting to see if an ill resident who recently returned from Italy is infected with the coronavirus. To date, there are been no confirmed cases … [+2911 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "John Del Signore", "title": "Early Addition: One Third Of American Beer Consumers Won't Drink Corona Because Of Coronavirus", "description": "Because Americans are idiots, check out today's midday links: baller fishtank, Weinstein juror goes into hiding, Pence goes to Florida to fundraise, a python ate a beach towel, and more. [ more › ]", "url": "https://gothamist.com/news/early-addition-one-third-american-beer-consumers-wont-drink-corona-because-coronavirus", "urlToImage": "https://cms.prod.nypr.digital/images/301451/fill-1200x650/", "publishedAt": "2020-02-28T16:56:47Z", "content": "Gothamist is a website about New York City news, arts and events, and food, brought to you by New York Public Radio.\r\nSupport for Gothamist is provided by Craig Newmark Philanthropies and Josh Reznick. Additional support provided by the Wyncote Foundation and… [+35 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italy's Alitalia reduces flights on 38 routes as coronavirus deters passengers", "description": "Italy's flagship carrier Alitalia said on Friday it was reducing flights on 38 national and international routes because coronavirus was leading to fewer passengers.", "url": "https://www.reuters.com/article/us-coronavirus-alitalia-idUSKCN20M2MC", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T17:02:06Z", "content": "ROME (Reuters) - Italy’s flagship carrier Alitalia said on Friday it was reducing flights on 38 national and international routes because coronavirus was leading to fewer passengers. \r\nThe carrier said in a statement seats on the domestic Genoa-Rome route wer… [+121 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pompeo testifies before the House of Representatives – watch live - Guardian News", "description": "Pompeo testifies before the House of Representatives – watch live Guardian News Democrat gets in heated exchange with Pompeo at hearing: 'Do you believe coronavirus is a hoax?' | TheHill The Hill Pompeo clashes with lawmakers over coronavirus and Iran in tens…", "url": "https://www.youtube.com/watch?v=1u77fFLhfNE", "urlToImage": "https://i.ytimg.com/vi/1u77fFLhfNE/maxresdefault.jpg", "publishedAt": "2020-02-28T16:36:41Z", "content": "U.S. Secretary of State Mike Pompeo testifies before the House of Representatives Foreign Affairs Committee on 'the Trump Administrations Policies on Iran, Iraq and the Use of Force.'"}, {"source": {"id": null, "name": "Dailystar.co.uk"}, "author": "Sofie Jackson", "title": "China enforces lockdown with drone hunting down quarantine-breakers...", "description": "China enforces lockdown with drone hunting down quarantine-breakers... (Second column, 8th story, link ) Related stories: Ex-Fed Gov sees coordinated global central bank action soon in response to virus... Fallout could be worse than financial crisis... Plung…", "url": "https://www.dailystar.co.uk/news/world-news/china-enforces-coronavirus-lockdown-drone-21596518", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article21596580.ece/ALTERNATES/s1200/1_AsiaWire-RoofGambling-06.jpg", "publishedAt": "2020-02-28T16:34:38Z", "content": "This dystopian-style video shows how drone police enforcing a quarantine in China find a group of people hiding on a roof then blast them in a furious tirade on a loudspeaker. \r\n The people were believed to be playing gambling games together in a rooftop gard… [+2195 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Dan Caplinger)", "title": "Stock Market News: The Trade Desk, Foot Locker Among Only Winners in Another Rout", "description": "The stock market once again fell sharply on Friday morning.", "url": "https://www.fool.com/investing/2020/02/28/stock-market-news-the-trade-desk-foot-locker-among.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560680/ttd-next-wave.jpg", "publishedAt": "2020-02-28T16:43:00Z", "content": "Wall Street got off to another rough start on Friday morning as coronavirus fears once again took center stage. Investors seem paralyzed by the implications of the Covid-19 outbreak for the global economy, and with little clarity on the potential impacts, mar… [+2964 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The coronavirus impact across the world l ABC News - ABC News", "description": "A soccer team played to an empty stadium, theme parks are closing for weeks, and global tourism is bracing for a major slow down. ABC News’ Kenneth Moton rep...", "url": "https://www.youtube.com/watch?v=WgMbX6yiNDw", "urlToImage": "https://i.ytimg.com/vi/WgMbX6yiNDw/maxresdefault.jpg", "publishedAt": "2020-02-28T16:32:59Z", "content": "A soccer team played to an empty stadium, theme parks are closing for weeks, and global tourism is bracing for a major slow down. ABC News Kenneth Moton reports. READ MORE: https://abcn.ws/2I6FrhL\r\nThe World Health Organization upgraded its global risk assess… [+656 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "UK top shares in worst week since financial crisis", "description": "UK's FTSE 100 share index hit by biggest one-week fall since 2008 financial crisis amid coronavirus fears", "url": "https://www.bbc.co.uk/news/business-51681620", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-02-28T16:46:00Z", "content": "UK's FTSE 100 share index hit by biggest one-week fall since 2008 financial crisis amid coronavirus fears\r\nThis breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\r\nYou can receive … [+130 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Chris Price", "title": "Friday evening news briefing: First British coronavirus death", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here.", "url": "https://www.telegraph.co.uk/news/2020/02/28/friday-evening-news-briefing-first-british-coronavirus-death/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/02/28/TELEMMGLPICT000225870321-xlarge_trans_NvBQzQNjv4BqwvkV6XTHOLaZwP-2f_zGadLiYXmI0a5wVFj0XljCMJE.jpeg?imwidth=1200", "publishedAt": "2020-02-28T16:35:10Z", "content": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here. For two-minute audio updates, try The Briefing - on podcasts, smart speakers and WhatsApp.\r\nBritish man on cruise ship dies from coronavirus \r\nA Britis… [+6149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: WHO official says virus not at stage to declare pandemic - Global News", "description": "Coronavirus outbreak: WHO official says virus not at stage to declare pandemic Global News China gets back to work — sort of — as number of new COVID-19 cases wanes MarketWatch If coronavirus spreads within the US, here's how daily life might change CNN WHO r…", "url": "https://www.youtube.com/watch?v=XQChCZWmkKg", "urlToImage": "https://i.ytimg.com/vi/XQChCZWmkKg/maxresdefault.jpg", "publishedAt": "2020-02-28T16:58:07Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Take Five: The virus data fog", "description": "We'll soon get the first proper glimpse at the economic damage the coronavirus is inflicting. China's official Purchasing Managers' Index is due on Saturday, and is expected to show the sharpest manufacturing contraction since the 2008 global financial crisis.", "url": "https://www.reuters.com/article/us-global-markets-themes-idUSKCN20M2HG", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496569406&w=1200&r=LYNXNPEG1R1KD", "publishedAt": "2020-02-28T16:24:18Z", "content": "LONDON (Reuters) - 1/DATA DIAGNOSIS \r\nWe’ll soon get the first proper glimpse at the economic damage the coronavirus is inflicting. China’s official Purchasing Managers’ Index is due on Saturday, and is expected to show the sharpest manufacturing contraction … [+5217 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Thyagaraju Adinarayan", "title": "Going viral: Six charts and the $6 trillion loss", "description": "The rapid worldwide spread of coronavirus and the economic implications of the outbreak have triggered the biggest weekly stock market rout since the 2008 financial crisis, wiping $6 trillion off global equities.", "url": "https://www.reuters.com/article/us-china-health-markets-global-idUSKCN20M2F6", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496565240&w=1200&r=LYNXNPEG1R1JT", "publishedAt": "2020-02-28T16:12:29Z", "content": "LONDON (Reuters) - Capitulation? Perhaps. \r\nThe rapid worldwide spread of coronavirus and the economic implications of the outbreak have triggered the biggest weekly stock market rout since the 2008 financial crisis, wiping $6 trillion off global equities. \r\n… [+2960 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Jonathan Garber", "title": "CDC, FDA accelerate coronavirus treatment approvals: Kudlow - Fox Business", "description": "While health experts believe risks are low in the U.S., regulators want to make sure a coronavirus treatment is found as quickly as possible, economic adviser Larry Kudlow told FOX Business' Stuart Varney.", "url": "https://www.foxbusiness.com/markets/coronavirus-treatments-sped-up-cdc-fda-kudlow", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/larry-kudlow-AP.jpg?ve=1&tl=1", "publishedAt": "2020-02-28T16:40:22Z", "content": "Both the Centers for Disease Control and Prevention and the Food and Drug Administration are speeding up the approval process for experimental drugs in order to obtain a treatment for the COVID-19 coronavirus as quickly as possible, Trump administration advis… [+1135 chars]"}, {"source": {"id": null, "name": "Opb.org"}, "author": "Sage Van Wing | Vanessa Vanzieleghem | Allison  Frost", "title": "News Roundtable | Coronavirus Business Impacts | Non-alcoholic Bar - OPB News", "description": "<p>We get opinions and analysis on the news of the week. Also, we find out how Oregon businesses are being affected by coronavirus. And learn about a possible new non-alcoholic bar.</p>", "url": "https://www.opb.org/radio/programs/thinkoutloud/segment/news-roundtable-coronavirus-business-impacts-non-alcoholic-bar/", "urlToImage": "https://images4.opb.org/c_fill%2Ch_300%2Cq_90%2Cw_400/20200114_portofportland-do-6.jpg", "publishedAt": "2020-02-28T17:04:00Z", "content": "Contact \"Think Out Loud\"\r\nIf you’d like to comment on any of the topics in this show, or suggest a topic of your own, please get in touch with us on Facebook or Twitter, send an email to thinkoutloud@opb.org, or you can leave a voicemail for us at 503-293-198… [+64 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Virus panic pushes China to offer discounts; demand stumbles elsewhere", "description": "BENGALURU/MUMBAI (Reuters) - Gold in top-consumer China was offered at a discount for the first time in more than 3-1/2 years this week as the coronavirus outbreak stifled demand, while record prices in India pushed discounts to their widest in four months. T…", "url": "https://finance.yahoo.com/news/virus-panic-pushes-china-offer-164934480.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/m8R7egOFuxAxcZxO30rGMA--~B/aD01NTI7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/46ae6993cb37d3f1a0b94db354074743", "publishedAt": "2020-02-28T16:49:34Z", "content": "By Sumita Layek and Rajendra Jadhav\r\nBENGALURU/MUMBAI (Reuters) - Gold in top-consumer China was offered at a discount for the first time in more than 3-1/2 years this week as the coronavirus outbreak stifled demand, while record prices in India pushed discou… [+2344 chars]"}, {"source": {"id": null, "name": "Cleantechnica.com"}, "author": "Steve Hanley", "title": "Geneva International Motor Show Cancelled Over Health Concerns", "description": "The Geneva auto show has been cancelled due to health concerns about the coronavirus.", "url": "https://cleantechnica.com/2020/02/28/geneva-international-motor-show-cancelled-over-health-concerns/", "urlToImage": "https://cleantechnica.com/files/2020/02/Geneva-2020.png", "publishedAt": "2020-02-28T16:45:16Z", "content": "CarsPublished on February 28th, 2020 |\r\n by Steve Hanley\r\n0\r\nFebruary 28th, 2020 by Steve Hanley \r\nThe Geneva International Motor Show was scheduled to open next week, beginning with media days on Monday and Tuesday. But the government of Switzerland has issu… [+3442 chars]"}, {"source": {"id": null, "name": "Carscoops.com"}, "author": "Michael Karkafiris", "title": "Hyundai Shuts Down Korea Factory Following Worker Tested Positive For Coronavirus", "description": "The South Korean factory produces SUV models like the Palisade, Santa Fe and the Genesis GV80.", "url": "https://www.carscoops.com/2020/02/hyundai-shuts-down-korea-factory-following-worker-tested-positive-for-coronavirus/", "urlToImage": "https://www.carscoops.com/wp-content/uploads/2020/02/Genesis-GV80-.jpg", "publishedAt": "2020-02-28T16:33:11Z", "content": "Hyundai has shut down a factory in South Korea, after a worked was found positive for coronavirus.\r\nThe closed factory is in Ulsan,producing various SUVs of the Korean car maker, including the Santa Fe, Tucson, Palisade and the recently revealed Genesis GV80.… [+1268 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "Michael Le Page", "title": "Binge-watching TV isn't as bad for the climate as some reports suggest", "description": "Two analyses suggest earlier studies have overestimated CO2 emissions due to the massive growth in internet traffic and video streaming, but they are still substantial", "url": "https://www.newscientist.com/article/2235713-binge-watching-tv-isnt-as-bad-for-the-climate-as-some-reports-suggest/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2020/02/28164031/gettyimages-1006512090.jpg", "publishedAt": "2020-02-28T16:43:02Z", "content": "By Michael Le Page\r\nWell, that’s a relief\r\nDigitalVision/Getty\r\nEvery time you search the internet or stream a video, a computer in a data centre somewhere in the world spins into action. With internet use ever on the rise, there have been fears that this is … [+3693 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus Concerns Present a Buying Opportunity for GE Stock at $10", "description": "As of this writing, General Electric (NYSE:GE) stock has posted nine consecutive days of losses on Wall Street. That's a long losing streak. And it's all because investors have grown increasingly concerned that the rapidly spreading coronavirus outbreak will …", "url": "https://finance.yahoo.com/news/coronavirus-concerns-present-buying-opportunity-163634994.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/1eq4nTo.fn6vh0HetRfvFw--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/cbb62531d7230ff2a7ea9c76ca247a0b", "publishedAt": "2020-02-28T16:36:34Z", "content": "As of this writing, General Electric (NYSE:GE) stock has posted nine consecutive days of losses on Wall Street. Thats a long losing streak. And its all because investors have grown increasingly concerned that the rapidly spreading coronavirus outbreak will ha… [+6052 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Robbie Harb", "title": "Ding dong Dell, servers in the well. Who pulled them out? Little PC stout", "description": "Client solutions to the rescue as infrastructure shrinks 7% After all those costly company takeovers, Dell has reported that yet again good old-fashioned PCs came to its rescue to offset the continued slump in its server and storage business.…", "url": "https://www.theregister.co.uk/2020/02/28/dells_server_sales_slump_yet_again/", "urlToImage": "https://regmedia.co.uk/2018/01/31/deepoldwell.jpg", "publishedAt": "2020-02-28T17:00:12Z", "content": "After all those costly company takeovers, Dell has reported that yet again good old-fashioned PCs came to its rescue to offset the continued slump in its server and storage business.\r\nThe Texan tech outfit last night filed a 1 per cent year-on-year rise in Q4… [+3350 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sejuti Banerjea", "title": "Tech Daily: Coronavirus, Google Win & More - Yahoo Finance", "description": "The coronavirus scare is really hitting the market and tech stocks will likely hurt more than others.", "url": "https://finance.yahoo.com/news/tech-daily-coronavirus-google-win-162304510.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-28T16:23:00Z", "content": "The coronavirus is impacting more than just human beings, as the world feels for the first time the problem with making one country its manufacturing capital. Chinese authorities are struggling to control the spread of the disease, cutting off transportation,… [+9041 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "3 Coronavirus Stocks to Own Until the Fear Fades", "description": "[Editor's Note: This article was updated on Feb. 28 to include the most relevant information.]More than $6 trillion of global market value has been wiped out all thanks to coronavirus fears and concerns it could significantly slow global growth.To date, the d…", "url": "https://finance.yahoo.com/news/3-coronavirus-stocks-own-until-170723043.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/gAZUZn.7Hlr7ShrnBjIdlA--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/5c33f545c7f7f402accba67f89aa319d", "publishedAt": "2020-02-28T17:07:23Z", "content": "[Editors Note: This article was updated on Feb. 28 to include the most relevant information.]\r\nMore than $6 trillion of global market value has been wiped out all thanks to coronavirus fears and concerns it could significantly slow global growth.\r\nTo date, th… [+3872 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "US Schools Start Planning for Possible Spread of Coronavirus", "description": "Schools across the United States are canceling trips abroad, preparing online lessons and even rethinking “perfect attendance” awards as they brace for the possibility that the new coronavirus could begin spreading in their communities.", "url": "https://www.snopes.com/ap/2020/02/28/us-schools-start-planning-for-possible-spread-of-coronavirus/", "urlToImage": "https://www.snopes.com/tachyon/2020/02/AP-Virus-Outbreak-US-Schools.jpg?fit=1200,799", "publishedAt": "2020-02-28T16:51:13Z", "content": "Schools across the United States are canceling trips abroad, preparing online lessons and even rethinking perfect attendance awards as they brace for the possibility that the new coronavirus could begin spreading in their communities.\r\nDistricts have been rus… [+6461 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Greece tightens border with Turkey to stop migrants", "description": "As Syria-Turkey tension intensifies, Greek PM increases border security as 'no illegal entries will be tolerated'.", "url": "https://www.aljazeera.com/news/2020/02/greece-tightens-border-turkey-stop-migrants-200228153115930.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/6/8e96576761a34799bfcde540f9cf14a1_18.jpg", "publishedAt": "2020-02-28T16:20:15Z", "content": "Greece has tightened border controls, sending security forces to hold back migrants heading for the country by land and sea after Turkey warned that it would no longer prevent refugees from leaving.\r\nGreece was the main gateway for hundreds of thousands of re… [+1548 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo Finance Video", "title": "Nouriel Roubini says 'this time could be more severe' as Coronavirus fears grip markets", "description": "As fears of the Coronavirus continue. U.S. markets are pacing toward their worse week since the 2008 financial crisis. Nouriel Roubini, Professor of Economics at NYU Stern, shares what we can expect on Yahoo Finance's On The Move.", "url": "https://finance.yahoo.com/video/nouriel-roubini-says-time-could-165921888.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-28T16:59:21Z", "content": "As fears of the Coronavirus continue. U.S. markets are pacing toward their worse week since the 2008 financial crisis. Nouriel Roubini, Professor of Economics at NYU Stern, shares what we can expect on Yahoo Finance's On The Move."}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Justin Baragona", "title": "Congressman Threatens to Beat Up Trump Jr. for Claiming Democrats Want Coronavirus Pandemic", "description": "Rep. John Garamendi (D-CA) lashed out at presidential scion Donald Trump Jr. for claiming Democrats seemingly want the coronavirus to kill “millions of people” so they can end President Donald Trump’s “streak of winning,” threatening a “serious altercation” o…", "url": "https://www.thedailybeast.com/rep-john-garamendi-threatens-to-beat-up-donald-trump-jr-for-claiming-democrats-want-coronavirus-pandemic", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_360,w_640,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1582905926/msnbc-live-hallie-jackson_gcwaha", "publishedAt": "2020-02-28T16:12:47Z", "content": "Rep. John Garamendi (D-CA) lashed out at presidential scion Donald Trump Jr. for claiming Democrats seemingly want the coronavirus to kill millions of people so they can end President Donald Trumps streak of winning, threatening a serious altercation on Frida… [+1714 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Jenni Lada", "title": "Coronavirus Will Delay Good Smile Company Figures Made in China", "description": "Coronavirus delays have hit Good Smile Company products, like figures, statues, clothing, and accessories, made in China. The post Coronavirus Will Delay Good Smile Company Figures Made in China appeared first on Siliconera.", "url": "https://www.siliconera.com/coronavirus-will-delay-good-smile-company-figures-made-in-china/", "urlToImage": "https://www.siliconera.com/wp-content/uploads/2020/02/ichigo-bleach-nendoroid-good-smile-company-coronavirus.jpg", "publishedAt": "2020-02-28T17:00:50Z", "content": "Another company wont be operating as usual due to the coronavirus. Some Good Smile Company figures, toys, and other products will see delays in 2020. As a result of the disease, some of the products it makes could end up being delayed by at least two months.\r… [+1349 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline Connor Boyd Health Reporter For Mailonline", "title": "The facemask that could spot the killer coronavirus", "description": "University of Leicester researchers believe it will be at least two months before they can test the masks on actual COVID-19 patients but they are hopeful it will work.", "url": "https://www.dailymail.co.uk/health/article-8056613/The-facemask-spot-killer-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/28/15/25323784-0-image-a-2_1582903598803.jpg", "publishedAt": "2020-02-28T16:32:37Z", "content": "Someone who is infected with the coronavirus can spread it with just a simple cough or a sneeze, scientists say.\r\nNearly 3,000 people with the virus are now confirmed to have died and more than 83,000 have been infected. Here's what we know so far:\r\nWhat is t… [+12336 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Christopher Brito", "title": "Patient's dog tests positive for coronavirus", "description": "Dogs, cats and other mammals owned as pets by confirmed coronavirus patients must now undergo a 14-day quarantine.", "url": "https://www.cbsnews.com/news/coronavirus-dog-hong-kong-tests-positive/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/02/28/e74e54a7-e74a-4740-9f54-60d86ddeaab9/thumbnail/1200x630/38d9572dee0f179abc7ab7f7a2aaa1f7/gettyimages-1199162438.jpg", "publishedAt": "2020-02-28T16:18:00Z", "content": "As humans throughout the world grapple with the widespread outbreak of the novel coronavirus, a pet dog has been found to have a \"low level\" of the virus, a spokesperson for the Hong Kong's agriculture, fisheries and conservation department said in a statemen… [+1450 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caitlin O'Kane", "title": "BTS cancels tour dates over coronavirus", "description": "The band's world tour will no longer start in South Korea – the first show will be weeks later in California.", "url": "https://www.cbsnews.com/news/bts-on-tour-south-korea-concert-tour-dates-cancelled-over-coronavirus-outbreak-in-korea-kpop-band-announces/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/18/9dd6362f-f380-4fe4-a71f-6396e073c3fb/thumbnail/1200x630/fbd18eb5a6c7cbc720e5dacf41f547dd/k-pop-boy-band-bts-interview-620.jpg", "publishedAt": "2020-02-28T16:35:34Z", "content": "One of the most popular boybands in the world, BTS, has cancelled tour dates due to coronavirus, the band announced on Twitter via its fan site Thursday. BTS isn't the only group to cancel upcoming performances, with more than 83,000 confirmed cases of the CO… [+1950 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelly McLaughlin", "title": "Garth Brooks wore a Barry Sanders Lions jersey to a Detroit concert and Trump fans thought he was supporting Bernie Sanders", "description": "Country music icon Garth Brooks wore a Lions jersey featuring NFL icon Barry Sanders' name to a concert in Detroit on February 22. He later posted a photo of his back, displaying Sanders' name on the jersey, on Instagram. Supporters of President Donald Trump …", "url": "https://www.businessinsider.com/garth-brooks-sanders-jersey-confused-trump-fans-detroit-concert-2020-2", "urlToImage": "https://i.insider.com/5e592d6bfee23d45f94243b5?width=1200&format=jpeg", "publishedAt": "2020-02-28T16:15:33Z", "content": "Country music icon Garth Brooks wore a Barry Sanders Lions jersey to a Detroit concert over the weekend, and the move confused Trump fans who thought he was supporting Sen. Bernie Sanders.\r\nBrooks shared a photo of himself in the jersey on Instagram, where su… [+1977 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louis Chilton, Louis Chilton", "title": "Netflix stock price boosted by coronavirus", "description": "Industry analysts have identified the streaming service as one of the companies set to benefit from the deadly outbreak", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/netflix-coronavirus-news-stock-price-rise-a9365511.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/12/15/17/netflix-1.jpg", "publishedAt": "2020-02-28T16:43:15Z", "content": "Netflixs stock price has risen by 0.8 per cent this week, as market analysts suggest that the ongoing coronavirus outbreak may give a boost to the company.\r\nWhile there are still fears of a global economic recession down the line, Netflix along with other in-… [+24483 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Rob Ferguson - Queen's Park Bureau", "title": "Ontario confirms another case of COVID-19 from Iran", "description": "It is the third case traced to travel in Iran in recent days as that country has become a new epicentre for the new coronavirus that originated in China late last year.", "url": "https://www.thestar.com/politics/provincial/2020/02/28/ontario-confirms-another-case-of-covid-19-from-iran.html", "urlToImage": "https://images.thestar.com/yc4KHlsbPgfwxK0P9AsIWed1Ago=/1200x899/smart/filters:cb(1582908567242)/https://www.thestar.com/content/dam/thestar/politics/provincial/2020/02/28/ontario-confirms-another-case-of-covid-19-from-iran/sunnybrook.jpg", "publishedAt": "2020-02-28T16:45:18Z", "content": "Ontario has another new case of COVID-19, a man in his 50s who returned from Iran on Tuesday and sought medical attention the following day. \r\nIt is the third case traced to travel in Iran in recent days as that country has become a new epicentre for the new … [+859 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Ken Dilanian", "title": "U.S. intel agencies warned of rising risk of outbreak like coronavirus", "description": "For years, U.S. intelligence agencies have been warning about the rising risk of a global pandemic that could strain resources and damage the global economy.", "url": "https://www.nbcnews.com/politics/national-security/u-s-intel-agencies-warned-rising-risk-outbreak-coronavirus-n1144891", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2020_09/3248506/200228-seoul-cleaning-subway-station-ew-1110a_ce192c99e2ff01cf1fefd02ba8699375.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T16:42:00Z", "content": "WASHINGTON The U.S. intelligence community has failed to anticipate some big developments, from the disintegration of the Soviet Union to the rapid rise of ISIS.\r\nBut the spies did forecast something like coronavirus.\r\nFor years, American intelligence agencie… [+3401 chars]"}, {"source": {"id": null, "name": "Fiercepharma.com"}, "author": null, "title": "AbbVie, GSK, Sanofi and more limit employee travel as coronavirus threatens business - FiercePharma", "description": "As COVID-19 continues to spread globally, fears of its impact on employee health have led several pharma majors to either outright prohibit travel to and from China—including one that just added Korea and Italy to the restriction list—or advise their employee…", "url": "https://www.fiercepharma.com/pharma/drugmakers-implements-travel-restrictions-as-coronavirus-threatens-business", "urlToImage": "https://qtxasset.com/fiercepharma/1582904926/GettyImages-680367034.jpg/GettyImages-680367034.jpg?f6zciNNmVCgaw6k7lThp77DHitB25761", "publishedAt": "2020-02-28T16:22:00Z", "content": "When the novel coronavirus first broke in China, biopharma companies local operations limited their marketing activities. Now, as fears rise over the diseases spread, drugmakers are implementing travel restrictions outside the country, too.\r\nWhile most compan… [+4786 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Grace Segers", "title": "Mike Pompeo faces skeptical lawmakers about coronavirus response", "description": "The secretary of state testified that he was \"confident\" the administration has taken actions that have \"significantly reduced risk.\"", "url": "https://www.cbsnews.com/news/mike-pompeo-testifies-before-house-foreign-affairs-committee-coronavirus-2020-02-28/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/28/82ff8d43-46e5-4183-8816-e29f8696f73e/thumbnail/1200x630g2/9a2839627d47bb009d8b189733db33de/gettyimages-1209277444.jpg", "publishedAt": "2020-02-28T16:27:38Z", "content": "Secretary of State Mike Pompeo faced questions from lawmakers skeptical about the administration's response to the coronavirus threat in a hearing before the House Foreign Affairs Committee. The hearing was ostensibly about the strike that killed Iranian mili… [+3353 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Did Lockheed Martin Stock Drop 6% This Morning?", "description": "There's really only one possible answer.", "url": "https://www.fool.com/investing/2020/02/28/why-did-lockheed-martin-stock-drop-6-this-morning.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560687/lockheed-martin-gmlrs-rocket-system-firing-a-rocket-is-lockheed-martin.jpg", "publishedAt": "2020-02-28T16:56:00Z", "content": "What happened\r\nShares of Lockheed Martin(NYSE:LMT) stock dropped nearly 6% in early Friday trading, and remain down 4.4% here at 11:30 a.m. EST. Unlike with LockMart's other big drop this week, though, there's no obvious Lockheed Martin-specific reason for th… [+1580 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Kuwait will operate a flight to Thailand to evacuate its citizens", "description": "Kuwait Airways will operate a flight to Thailand's capital, Bangkok, to evacuate Kuwaiti citizens there, the information ministry said on Twitter on Friday.", "url": "https://www.reuters.com/article/us-china-health-kuwait-idUSKCN20M2LK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T16:55:41Z", "content": "CAIRO (Reuters) - Kuwait Airways will operate a flight to Thailand’s capital, Bangkok, to evacuate Kuwaiti citizens there, the information ministry said on Twitter on Friday. \r\nThe ministry said the flight from Bangkok will leave on Saturday Feb. 29 at 11:30 … [+287 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Eric Parnell, CFA", "title": "Foreshadowing What's Next For U.S. Stocks", "description": "It has been a challenging week to say the least for U.S. stocks.While investors may feel inclined to sell equities, it is almost never prudent to sell in a cascading market. If you must sell, wait for the bounce.The epicenter of the coronavirus provides inves…", "url": "https://seekingalpha.com/article/4328182-foreshadowing-next-for-u-s-stocks", "urlToImage": "https://static.seekingalpha.com/uploads/2020/2/28/403065-15828682970601993_origin.png", "publishedAt": "2020-02-28T16:29:09Z", "content": "Bad week. U.S. stocks have struggled mightily over the last four trading days through Thursday. Overall, the S&amp;P 500 Index has fallen by a staggering -10.75% so far this week. And since its closing peak on February 19, the S&amp;P 500 has fallen by just o… [+7384 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Kit Daniels", "title": "Buchanan: Coronavirus Crisis Is Trump’s Time To Lead", "description": "Trump has the pulpit he can use daily to command the airwaves and inform, lead, unite and direct the nation during what could be a months-long crisis", "url": "https://www.infowars.com/buchanan-coronavirus-crisis-is-trumps-time-to-lead/", "urlToImage": "https://assets.infowars.com/2020/02/022820trump.jpg", "publishedAt": "2020-02-28T16:20:12Z", "content": "Not until well into the Democratic debate Tuesday night did the COVID-19 coronavirus come up, and it was Mike Bloomberg, not a CBS moderator, who raised it:\r\n“The president fired the pandemic specialist in this country two years ago,” the former New York mayo… [+4877 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: DOW Jones opens sharply down amid COVID-19, recession fears | LIVE - Global News", "description": "The Dow Jones opened sharply down Friday, Feb. 28 amid ongoing concerns surrounding the COVID-19 virus and fears of a possible recession. Stock markets are d...", "url": "https://www.youtube.com/watch?v=c7QoUqXA25Q", "urlToImage": "https://i.ytimg.com/vi/c7QoUqXA25Q/maxresdefault_live.jpg", "publishedAt": "2020-02-28T16:18:51Z", "content": "The Dow Jones opened sharply down Friday, Feb. 28 amid ongoing concerns surrounding the COVID-19 virus and fears of a possible recession. \r\nStock markets are down around the world over rising concerns about the novel coronavirus. \r\nFor more info, please go to… [+316 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "3 Signs Coronavirus Fears Are Driving A Major Falloff in Domestic Travel", "description": "As hard hit as the market is overall travel companies are bearing an especially heavy brunt from reduced demand and the expectation that things will get even worse. Airlines haven't just cut China and Hong Kong flights. What's most striking I think is the ext…", "url": "https://viewfromthewing.com/3-signs-coronavirus-fears-are-driving-a-major-falloff-in-domestic-travel/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2020/02/coro.jpg", "publishedAt": "2020-02-28T16:34:43Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Virus panic pushes China to offer discounts; demand stumbles elsewhere", "description": "BENGALURU/MUMBAI (Reuters) - Gold in top-consumer China was offered at a discount for the first time in more than 3-1/2 years this week as the coronavirus outbreak stifled demand, while record prices in India pushed discounts to their widest in four months. T…", "url": "https://news.yahoo.com/virus-panic-pushes-china-offer-164934480.html", "urlToImage": null, "publishedAt": "2020-02-28T16:49:34Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "WHO raises global risk of coronavirus from 'high' to 'very high' - Times of India", "description": "WHO raises global risk of coronavirus from 'high' to 'very high' Times of India Coronavirus: Outbreak at 'decisive point' as WHO urges action BBC News Hospitals across the world are 'just not ready' for coronavirus, WHO official warns CNBC Why WHO has not dec…", "url": "https://timesofindia.indiatimes.com/world/china/who-raises-global-risk-of-coronavirus-from-high-to-very-high/articleshow/74407173.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74407228,width-1070,height-580,imgsize-134521,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-28T17:00:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Megan Cerullo", "title": "Coronavirus causes first U.S. drug shortage, FDA says", "description": "Antibiotics and anesthetics especially at risk, agency warns, as up to 90% of their ingredients come from China.", "url": "https://www.cbsnews.com/news/coronavirus-human-drug-shortage-food-drug-administration/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/02/19/3318304e-e646-4554-8342-203822a22a05/thumbnail/1200x630/710784242dbae21c2181db10d50612a4/screen-shot-2020-02-19-at-5-16-59-pm.png", "publishedAt": "2020-02-28T16:30:43Z", "content": "The U.S. Food and Drug Administration is warning of shortages of at least one drug as the spread of the coronavirus disrupts the pharmaceutical industry's global supply chain. \r\nThe agency on Thursday said that, for the first time since the outbreak, a drugma… [+8242 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Elizabeth Elkind", "title": "Coronavirus quarantines in U.S. appear inevitable, doctor says", "description": "Agus said that making preparations would be simple, such as asking companies what their work from home policy would be, and being aware that children in the household may have to take school from home.", "url": "https://www.cbsnews.com/news/coronavirus-quarantines-in-us-likely-doctor-says/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/28/988d501c-0693-4dcf-a0d4-bf55f38888ca/thumbnail/1200x630/acf21f113ccff0fcfd3ac652384bf72d/0228-ctm-coronvirusmed-agus-2036798-640x360.jpg", "publishedAt": "2020-02-28T16:53:37Z", "content": "Amid fears of a coronavirus outbreak, one doctor suggested that Americans worried about quarantines should begin preparing. CBS News medical consultant Dr. David Agus predicted the question would be \"not if but when and where\" quarantines will be occurring du… [+1502 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Frances Langum", "title": "In Midst Of Two Crises, Trump Meets With Diamond And Silk", "description": "Please note: We have not have any correspondence from Diamond and Silk since last September when they threatened to sue us over running videos of them on our site and \"crafting besmirch statements\" about their \"brand.\" So now we continue the practice. Like ma…", "url": "https://crooksandliars.com/2020/02/midst-two-crises-trump-meets-diamond-and-0", "urlToImage": "https://crooksandliars.com/files/mediaposters/2020/02/44445.jpg", "publishedAt": "2020-02-28T16:59:36Z", "content": "Please note: We have not have any correspondence from Diamond and Silk since last September when they threatened to sue us over running videos of them on our site and \"crafting besmirch statements\" about their \"brand.\" So now we continue the practice. \r\nLike … [+797 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Chip stocks face up to the grim implications of the coronavirus outbreak", "description": "China is suffering a coronavirus epidemic. (Maybe you've heard about it?)At last report, 78,832 patients have been infected in China, and sad to say, COVID-19 hasn't been contained within China. In fact, 54 countries now report infections (up four from yester…", "url": "https://finance.yahoo.com/news/chip-stocks-face-grim-implications-161518985.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/qrN6yPsSePqpjfpCIBOnwQ--~B/aD05OTE7dz0xMzM5O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/60fa182506e47ff4e1c950fc6926b3eb", "publishedAt": "2020-02-28T16:15:18Z", "content": "China is suffering a coronavirus epidemic. (Maybe you've heard about it?)\r\nAt last report, 78,832 patients have been infected in China, and sad to say, COVID-19 hasn't been contained within China. In fact, 54 countries now report infections (up four from yest… [+3200 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Joe: WH response on virus has been one mistake after another", "description": "The Morning Joe panel reacts to statements from White House chief of staff Mick Mulvaney, who suggested that Americans should ignore media reports about the coronavirus.", "url": "https://www.msnbc.com/morning-joe/watch/joe-wh-response-has-been-one-mistake-after-another-79619141741", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_mj_last_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T17:00:53Z", "content": null}]