[{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "amiller@businessinsider.com (Anna Medaris Miller), Anna Medaris Miller", "title": "Drying your hands after washing is a key part of coronavirus prevention — here's how to do it properly", "description": "Washing your hands frequently and thoroughly is one of the most important ways to protect yourself and others from the novel coronavirus. But drying your hands properly is just as important since wet or moist hands can breed germs. Different drying methods ha…", "url": "https://www.businessinsider.com/how-to-dry-your-hands-preven-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e666860fee23d7109106c57?width=1200&format=jpeg", "publishedAt": "2020-03-09T16:01:00Z", "content": "People concerned about coronavirus outbreaks have heard the message loud and clear: Wash your hands, and wash them well and often. \r\nBut the other half of that public-health message — to dry your hands just as well — is just as important, according to Miryam … [+2145 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.S. universities should curtail study abroad during coronavirus: CDC", "description": "The U.S. Centers for Disease Control and Prevention issued special guidance on Monday that colleges and universities should consider asking students studying abroad to return to the United States and cancel or postpone upcoming travel in light of the coronavi…", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/F4UFlb6UvUk/u-s-universities-should-curtail-study-abroad-during-coronavirus-cdc-idUSKBN20W286", "urlToImage": null, "publishedAt": "2020-03-09T15:40:05Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Ryanair cuts more Italian flights to April 8 over coronavirus", "description": "Ryanair on Monday cut more international flights to Italy and domestic flights within the country until April 8 after the Italian government imposed travel restrictions in northern Italy to limit the spread of the coronavirus.", "url": "https://www.reuters.com/article/us-ryanair-italy-idUSKBN20W26W", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500842301&w=1200&r=LYNXMPEG281EM", "publishedAt": "2020-03-09T15:23:52Z", "content": "DUBLIN (Reuters) - Ryanair on Monday cut more international flights to Italy and domestic flights within the country until April 8 after the Italian government imposed travel restrictions in northern Italy to limit the spread of the coronavirus. \r\nThe Irish b… [+365 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New York state coronavirus cases hits 142, governor says", "description": "The number of people who have tested positive for the coronavirus across New York state has increased to 142 from 105 the day before, governor Andrew Cuomo said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-new-york-idUSKBN20W27L", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500846115&w=1200&r=LYNXMPEG281FF", "publishedAt": "2020-03-09T15:33:52Z", "content": "(Reuters) - The number of people who have tested positive for the coronavirus across New York state has increased to 142 from 105 the day before, governor Andrew Cuomo said on Monday. \r\nMost of the cases are in Westchester county, where a Manhattan lawyer bel… [+152 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Isaac Scher), Isaac Scher", "title": "The US is severely under-testing for coronavirus as death toll and new cases rise", "description": "Tom Brenner/Reuters The United States is severely under-testing for COVID-19, also known as the novel coronavirus. In places like South Korea and the United Kingdom, thousands have been tested. According to the Center for Disease Control and Prevention, some …", "url": "https://www.businessinsider.com/the-us-is-not-testing-enough-people-for-covid-19-2020-3", "urlToImage": "https://i.insider.com/5e62f1c2fee23d37960c5c12?width=1200&format=jpeg", "publishedAt": "2020-03-09T15:56:03Z", "content": "\"Anybody that wants a test gets a test,\" President Donald Trump said last week, attempting to dispel concerns about the United States' capacity to confront the COVID-19 outbreak, which has killed 22 Americans and infected at least 566, according to data from … [+2601 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Haven Orecchio-Egresitz", "title": "The father and sister of a Missouri woman suspected of having coronavirus broke quarantine to attend a school dance. Then she tested positive.", "description": "A Missouri woman in her 20s returned from Italy on March 2 feeling sick. Heath officials told her family, repeatedly, to self-quarantine. The woman did, but her father and sister decided to break quarantine to attend a school dance instead. Now the woman is t…", "url": "https://www.businessinsider.com/family-of-missouri-coronavirus-patient-broke-quarantine-school-dance-2020-3", "urlToImage": "https://i.insider.com/5e665b23fee23d664e35e7a5?width=1200&format=jpeg", "publishedAt": "2020-03-09T15:50:27Z", "content": "When a Missouri woman came back from Italy feeling sick, health officials told her family to self-quarantine while she was tested for the new coronavirus.\r\nWhile the patient responded to those requests, her father went to a school dance.\r\nNow, that woman appe… [+2119 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Traveling nonstop for a month gave me early exposure to coronavirus panic. Here's my advice to battling stress around the outbreak.", "description": "Traveling internationally for a month in countries with dozens of cases of coronavirus gave me an understanding of what it is like to live in a constant state of low-grade concern about getting sick. While I was never too worried about catching coronavirus, I…", "url": "https://www.businessinsider.com/coronavirus-tips-stay-healthy-avoid-panic-2020-3", "urlToImage": "https://i.insider.com/5e6615f8fee23d3f6e3a8aa4?width=1200&format=jpeg", "publishedAt": "2020-03-09T15:26:50Z", "content": "Traveling internationally over the last five weeks, visiting four countries with confirmed cases of coronavirus, gave me a window into how different regions are responding to the outbreak. \r\nIt also gave me a look into what it is like to live in a state of co… [+1564 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Yessenia Funes on Earther, shared by Brian Kahn to Gizmodo", "title": "Yearly Oil Demand Is Now Projected to Drop for the First Time in a Decade Due to COVID-19", "description": "The worsening global crisis wrought by COVID-19 is leading to canceled international negotiations and wasteful “ghost” flights. And now it’s projected to lead to the first drop in oil demand in more than a decade. Read more...", "url": "https://earther.gizmodo.com/yearly-oil-demand-is-now-projected-to-drop-for-the-firs-1842211458", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ot53phqjnes0grngf9ep.jpg", "publishedAt": "2020-03-09T16:02:00Z", "content": "The worsening global crisis wrought by COVID-19 is leading to canceled international negotiations and wasteful ghost flights. And now its projected to lead to the first drop in oil demand in more than a decade.\r\nThe International Energy Agencys (IEA) updated … [+4286 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Coronavirus will send stocks and oil into 'free fall' and shrink the global economy, 'Dr. Doom' economist warns", "description": "Nouriel Roubini anticipated Monday's market rout, warned of a global recession, and recommended policies to limit coronavirus' economic impact in a string of tweets on Sunday night and Monday morning. The \"Dr. Doom\" economist forecast declines in equity, oil …", "url": "https://markets.businessinsider.com/news/stocks/nouriel-roubini-predicts-stocks-price-oil-free-fall-coronavirus-recession-2020-3-1028977265", "urlToImage": "https://images.markets.businessinsider.com/image/5e66536efee23d5d3b150419-2400/rtr31j2g.jpg", "publishedAt": "2020-03-09T15:22:00Z", "content": "REUTERS/Fred Prouser\r\n<ul><li>Nouriel Roubini anticipated Monday's market rout, warned of a global recession, and recommended policies to limit coronavirus' economic impact in a string of tweets on Sunday night and Monday morning.</li><li>The \"Dr. Doom\" econo… [+3681 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "AP", "title": "Sheriff Accused Of Theft Makes False Coronavirus Claim To Delay His Trial", "description": "Attorneys for Alabama sheriff Mike Blakely attempted to delay his trial by falsely claiming he was being tested for the illness caused by a new coronavirus.", "url": "https://www.huffpost.com/entry/mike-blakely-sheriff-coronavisu_n_5e6660bec5b605572808d9f2", "urlToImage": "https://img.huffingtonpost.com/asset/5e666247230000cd1a0bfe85.jpeg?cache=sle7281bwr&ops=1778_1000", "publishedAt": "2020-03-09T15:40:22Z", "content": "ATHENS, Ala. (AP) Lawyers for a longtime Alabama sheriff seeking a delay in his Monday theft trial wrongly claimed the officer was being tested for the illness caused by a new coronavirus.\r\nWith Limestone County Sheriff Mike Blakely set to go on trial on felo… [+1703 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "NorthJersey.com, Anthony Zurita, NorthJersey.com", "title": "Princeton tells students to stay home after spring break amid coronavirus outbreak; classes to go virtual", "description": "Princeton University has asked students to stay home after spring break as New Jersey reported its sixth coronavirus case; classes will go online.", "url": "https://www.usatoday.com/story/news/education/2020/03/09/coronavirus-princeton-university-mandates-remote-classes-after-spring-break/5000118002/", "urlToImage": "https://www.gannett-cdn.com/presto/2018/10/15/USAT/09bd0396-935f-45c8-b505-44484dd91862-new_jersey.jpg?crop=506,282,x0,y0&width=1600&height=800&fit=bounds", "publishedAt": "2020-03-09T15:38:05Z", "content": "Social media editor Elyse Toribio has the questions you asked on social media about coronavirus in NJ. She sat down with editor Jim O'Neill of The Record to get the answers.\r\nNorthJersey.com\r\nPrinceton University classes will all go online after spring break … [+2588 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Paul Blest, VICE News", "title": "Panic in the Markets Caused NYSE Trading to Stop for 15 minutes", "description": "The continuing spread of coronavirus coupled with an oil-price plunge over the weekend sent markets plunging just minutes into the trading day Monday.", "url": "https://www.vice.com/en_us/article/dyg5ey/panic-in-the-markets-caused-nyse-trading-to-stop-for-15-minutes", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e66586cda72d7009cca11c7/lede/1583766136487-AP_20069467136336.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*", "publishedAt": "2020-03-09T15:27:29Z", "content": "The continuing spread of coronavirus coupled with an oil-price plunge over the weekend sent markets into a panic Monday morning, with the Dow losing up to 7% and trading on the New York Stock Exchange temporarily halted to stop the bleeding.\r\n Five minutes in… [+1716 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Bernadette Hogan, Kate Sheehy", "title": "The New York Post: Head of Port Authority tests positive for coronavirus", "description": "Port Authority head Rick Cotton, has the coronavirus, according to Gov. Andrew Cuomo", "url": "http://www.marketwatch.com/story/head-of-port-authority-tests-positive-for-coronavirus-2020-03-09", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB824_RickCo_ZG_20200309121434.jpg", "publishedAt": "2020-03-09T15:18:59Z", "content": "The head of the Port Authority who has been visiting local airports and other transit facilities has the coronavirus, Gov. Andrew Cuomo said Monday.\r\nCuomo said he himself could have been in contact with infected PA executive director Rick Cotton but hasnt be… [+347 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "'Onward' fell short of Pixar hits at the box office while 'The Invisible Man' held strong in its second weekend", "description": "\"Onward\" opened over the weekend with $40 million domestically, close to the debut of Pixar's lowest-grossing movie, \"The Good Dinosaur.\" The movie made just $28 million globally as it didn't open in key markets like China and Italy, which have been impacted …", "url": "https://www.businessinsider.com/box-office-weekend-pixars-onward-stumbles-invisible-man-strong-2020-3", "urlToImage": "https://i.insider.com/5e665001fee23d53f93d4346?width=1200&format=jpeg", "publishedAt": "2020-03-09T15:47:40Z", "content": "The weekend's domestic box office was down from this time last year, when \"Captain Marvel\" opened with $153 million. Another Disney release opened over the weekend this year, Pixar's \"Onward,\" but without as much excitement. \r\n\"Onward\" debuted with $40 millio… [+1980 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Sean Endicott", "title": "How Microsoft and Bill Gates are helping people affected by coronavirus", "description": "Several large organizations in the Puget Sound area will work together to help people affected by coronavirus. What you need to know Microsoft partnered with several large corporations to help launch a regional COVID-19 Response Fund (CRF) in the Puget Sound …", "url": "https://www.windowscentral.com/how-microsoft-and-bill-gates-are-helping-people-affected-coronavirus", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2019/11/microsoft-logo-ignite-2019.jpg?itok=T29z3T0D", "publishedAt": "2020-03-09T15:15:40Z", "content": "Microsoft partnered with several large organizations to launch a regional COVID-19 Response Fund (CRF) in the Puget Sound area. The Seattle Foundation, United Way of King County, Microsoft, Amazon, and Starbucks will work in coordination with King County and … [+2274 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Hazel Cills", "title": "What Is Your Shame Hoard?", "description": "As the coronavirus, also known by its fancy name COVID-19, spreads through the country like wildfire, people are hoarding assorted goods like mini preppers in the making. Read more...", "url": "https://jezebel.com/what-is-your-shame-hoard-1842210808", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/y64tr8mmrag3j4f2vdgd.jpg", "publishedAt": "2020-03-09T15:30:00Z", "content": "As the coronavirus, also known by its fancy name COVID-19, spreads through the country like wildfire, people are hoarding assorted goods like mini preppers in the making.\r\nBeans! Toilet paper! Large quantities of bottled water, for some reason! Photos of empt… [+912 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jenny Gold", "title": "Scarcity Of Health Workers A New Concern As Self-Quarantining Spreads With Virus", "description": "Should \"potential exposure\" by a health worker to someone with coronavirus be enough to send that worker home for two weeks of self-quarantine? Health systems have begun debating relative risks.", "url": "https://www.npr.org/sections/health-shots/2020/03/09/813557328/scarcity-of-health-workers-a-new-concern-as-self-quarantining-spreads-with-virus", "urlToImage": "https://media.npr.org/assets/img/2020/03/09/gettyimages-1209126277_wide-fff2b542dd6662ef1efb7f87629d35eea95e65ec.jpg?s=1400", "publishedAt": "2020-03-09T15:31:09Z", "content": "After a coronavirus test came back positive on a patient who had been treated at NorthBay VacaValley Hospital in Vacaville, Calif., in February, about 100 NorthBay workers were sent into self-quarantine for 14 days.\r\nJustin Sullivan/Getty Images\r\nAs the U.S. … [+8511 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Caitlin Oprysko", "title": "On Trump's mind while market tanks: Obama, fake news and the Dem primary", "description": "Trump fired off more than two dozen tweets and retweets but was silent on coronavirus until a Wall Street nosedive halted trading.", "url": "https://www.politico.com/news/2020/03/09/donald-trump-obama-fake-news-tweets-124320", "urlToImage": "https://static.politico.com/08/8d/30c8a80c4596997a06891e3ed881/200309-donald-trump-getty-773.jpg", "publishedAt": "2020-03-09T15:39:42Z", "content": "Trump later favorably compared the annual death toll of the flu to that of the coronavirus thus far, though health experts have cautioned against drawing similarities as they scramble to learn more about the new outbreak. He noted the relatively small number … [+3127 chars]"}, {"source": {"id": null, "name": "Petapixel.com"}, "author": "Michael Zhang", "title": "Nikon D6 Delayed as Parts Held Up by Coronavirus Outbreak", "description": "Nikon announced today that its new D6 flagship DSLR will be delayed by at least two months due to the ongoing coronavirus outbreak holding up critical parts. “As a result of delays in the procurement of parts and components from a third-party cooperating comp…", "url": "https://petapixel.com/2020/03/09/nikon-d6-delayed-as-parts-held-up-by-coronavirus-measures/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PetaPixel+%28PetaPixel%29", "urlToImage": "https://petapixel.com/assets/uploads/2020/03/nikond6delayfeat.jpg", "publishedAt": "2020-03-09T15:58:21Z", "content": "Nikon announced today that its new D6 flagship DSLR will be delayed by at least two months due to the ongoing coronavirus outbreak holding up critical parts.\r\n“As a result of delays in the procurement of parts and components from a third-party cooperating com… [+1534 chars]"}, {"source": {"id": null, "name": "Diyphotography.net"}, "author": "Dunja Djudjic", "title": "Nikon D6 delayed until May; another delay due to the coronavirus outbreak", "description": "The development of the Nikon D6 was announced six months ago, and we were hoping to finally see it at The Photography Show in Birmingham this March. However, we’ll have to wait a bit longer. According to the latest news, the Nikon D6 is being delayed and it w…", "url": "https://www.diyphotography.net/nikon-d6-delayed-until-may-another-delay-due-to-the-coronavirus-outbreak/", "urlToImage": "https://s23527.pcdn.co/wp-content/uploads/2020/03/nikon-d6-delayed.jpg.optimal.jpg", "publishedAt": "2020-03-09T16:03:44Z", "content": "The development of the Nikon D6 was announced six months ago, and we were hoping to finally see it at The Photography Show in Birmingham this March. However, well have to wait a bit longer. According to the latest news, the Nikon D6 is being delayed and it wo… [+1440 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Germany Reports First Death From Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/germany-reports-first-death-from-coronavirus-outbreak-dpa-says", "urlToImage": null, "publishedAt": "2020-03-09T15:49:07Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Axon, AeroVironment, and iRobot Stocks Plunged 10% to 15% This Morning", "description": "Plummeting oil prices and coronavirus fears crashed the market.", "url": "https://www.fool.com/investing/2020/03/09/why-axon-aerovironment-and-irobot-stocks-plunged-1.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562197/3-red-arrows-going-down-and-crashing-through-the-floor.jpg", "publishedAt": "2020-03-09T15:14:46Z", "content": "What happened\r\nAxon Enterprise(NASDAQ:AAXN). AeroVironment(NASDAQ:AVAV). iRobot(NASDAQ:IRBT). Small, fast-growing industrial companies such as these, bringing disruptive technologies to market, are some of the most exciting stocks an investor can own -- but n… [+2102 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Paris-Nice: Giacomo Nizzolo wins stage two of 'behind closed doors' race", "description": "Italy's Giacomo Nizzolo wins the second stage of a Paris-Nice race which is now being held \"behind closed doors\" because of coronavirus.", "url": "https://www.bbc.co.uk/sport/cycling/51807208", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/7A39/production/_111198213_giacomonizollo.jpg", "publishedAt": "2020-03-09T16:00:11Z", "content": "Giacomo Nizzolo has twice won the points classification at the Giro d'Italia\r\nItaly's Giacomo Nizzolo won the second stage of a Paris-Nice race now being held \"behind closed doors\" because of coronavirus.\r\nNizzolo, of Team NTT, won a sprint finish at the end … [+1790 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of Grupo Aeroportuario del Pacífico Are Falling Today", "description": "The coronavirus sell-off ripples into companies that are impacted by flight demand.", "url": "https://www.fool.com/investing/2020/03/09/why-shares-of-grupo-aeroportuario-del-pacifico-are.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562213/airplane-airport-source-getty.jpg", "publishedAt": "2020-03-09T15:46:00Z", "content": "What happened\r\nShares of Grupo Aeroportuario del Pacifico(NYSE:PAC) fell more than 10% on Monday, outpacing the broader market sell-off, on fears that the COVID-19 coronavirus would eat into vacation travel demand and ruin the key spring season for the airpor… [+1538 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Timothy Green)", "title": "Dow Jones News: Markets Panic; Boeing, Oil Majors Tumble", "description": "The novel coronavirus outbreak and chaos in the oil markets have investors running scared.", "url": "https://www.fool.com/investing/2020/03/09/dow-jones-news-markets-panic-boeing-oil-majors-tum.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562200/man-holding-head-as-stock-chart-falls.jpg", "publishedAt": "2020-03-09T15:14:00Z", "content": "The stock market was in full-blown panic mode on Monday, with steep declines in all the major indexes triggering a brief halt to trading after circuit breaker rules were activated. The Dow Jones Industrial Average(DJINDICES:^DJI) was down 5.5% at 10:40 a.m. E… [+2709 chars]"}, {"source": {"id": null, "name": "Imore.com"}, "author": "Oliver Haslam", "title": "Stores run out of iPhone 11 stock as coronavirus stranglehold continues", "description": "If you're in New York City and want an iPhone 11 or iPhone 11 Pro, you're probably out of luck.", "url": "https://www.imore.com/stores-run-out-iphone-11-stock-coronavirus-stranglehold-continues", "urlToImage": "https://www.imore.com/sites/imore.com/files/styles/large/public/field/image/2019/09/iphone-11-pro-max-camera-hero.jpg?itok=A4g_r36T", "publishedAt": "2020-03-09T15:36:10Z", "content": "If you're a New Yorker who planned on picking up a new iPhone 11 or iPhone 11 Pro this past weekend, you probably came up short. Stocks of Apple's hottest iPhones are reportedly very low across New York City, according to a New York Post report.\r\nThat report … [+1246 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Fake Coronavirus Treatments Bring Warnings From Federal Agencies", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/fake-coronavirus-treatments-bring-warnings-from-federal-agencies", "urlToImage": null, "publishedAt": "2020-03-09T15:48:20Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Wells Fargo Worker in California Tests Positive for Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/wells-fargo-worker-in-california-tests-positive-for-coronavirus", "urlToImage": null, "publishedAt": "2020-03-09T16:02:19Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Port Authority Executive Director Has Coronavirus, Andrew Cuomo Says", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/port-authority-executive-director-has-coronavirus-cuomo-says", "urlToImage": null, "publishedAt": "2020-03-09T15:26:34Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Don't Fully Know the Coronavirus Death Rate, Says Stanford Professor", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-09/don-t-fully-know-the-coronavirus-death-rate-says-stanford-professor-video", "urlToImage": null, "publishedAt": "2020-03-09T15:49:38Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "States Seek to Ease Costs for Coronavirus Testing (Radio)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-09/states-seek-to-ease-costs-for-coronavirus-testing-radio", "urlToImage": null, "publishedAt": "2020-03-09T15:14:59Z", "content": null}, {"source": {"id": null, "name": "Salon.com"}, "author": "Travis Gettys", "title": "Joe Scarborough slams \"arrogant, boastful and lying\" Kellyanne Conway for false coronavirus claims", "description": "The \"Morning Joe\" host blasts the White House senior adviser for claiming the coronavirus outbreak was contained", "url": "https://www.salon.com/2020/03/09/joe-scarborough-slams-arrogant-boastful-and-lying-kellyanne-conway-for-false-coronavirus-claims_partner/", "urlToImage": "https://media.salon.com/2019/05/kellyanne-conway14.jpg", "publishedAt": "2020-03-09T15:18:39Z", "content": "MSNBC's Joe Scarborough blasted White House senior adviser Kellyanne Conway for insisting the coronavirus outbreak was contained.\r\nThe \"Morning Joe\" host played video of Conway making the claim just two days before the surgeon general, on another TV program, … [+1691 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Timothy A Pychyl Ph.D.", "title": "The Coronavirus and Travel Procrastination", "description": "As my wife contemplates travel for work and holidays, she’s suffering from what she calls “corona-astinating.” Is it procrastination or a wise delay?", "url": "https://www.psychologytoday.com/ca/blog/dont-delay/202003/the-coronavirus-and-travel-procrastination", "urlToImage": null, "publishedAt": "2020-03-09T15:56:36Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Germany reports first death cases due to coronavirus", "description": "Germany on Monday reported its first two confirmed death cases of the coronavirus, local authorities said.", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-death-idUSKBN20W295", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T15:49:49Z", "content": "BERLIN (Reuters) - Germany on Monday reported its first two confirmed death cases of the coronavirus, local authorities said. \r\nA spokesman for the health ministry in the western state of North Rhine-Westphalia said that an 89 year-old woman with coronavirus … [+187 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kumar Mehta, Contributor, Kumar Mehta, Contributor https://www.forbes.com/sites/kmehta/", "title": "Why Coronavirus Will Stimulate Innovation", "description": "If the history of pandemics is a guide, coronavirus, like all others, will spark a wave of innovation, proportional to how it alters the shape of society.", "url": "https://www.forbes.com/sites/kmehta/2020/03/09/why-coronavirus-will-stimulate-innovation/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F530067489%2F0x0.jpg", "publishedAt": "2020-03-09T16:08:09Z", "content": "LIfestyle changes always spark a wave of innovation\r\nGetty\r\nIn addition to the immeasurable suffering and loss of life, the deadly coronavirus is already impacting the world economy, hurting stocks, halting travel and meetings, impacting the daily ritual of g… [+8399 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "The Cost of Canceling SXSW Could Keep the Festival from Returning in 2021", "description": "The entertainment industry is starting to take a hit as large gatherings of people for major events create concerns about spreading coronavirus to more of the population. The global release of No Time to Die was pushed back from April to November, but it’s th…", "url": "https://www.slashfilm.com/the-cost-of-canceling-sxsw-could-keep-the-festival-from-returning-in-2021/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/sxsw-2020-logo.jpg", "publishedAt": "2020-03-09T15:30:02Z", "content": "The entertainment industry is starting to take a hit as large gatherings of people for major events create concerns about spreading coronavirus to more of the population. The global release of No Time to Die was pushed back from April to November, but it’s th… [+3731 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "Coronavirus Quarantine Center in China Collapses, Killing at Least 10", "description": "A hotel serving as a coronavirus quarantine center collapsed on Saturday night in China, killing at least 10 people. Another 23 people remain missing. Rescue workers are sorting through the rubble of the seven-story Xinjia Hotel in the city of Quanzhou, in so…", "url": "https://people.com/health/coronavirus-quarantine-center-china-collapses-killing-at-least-10/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fshutterstock_editorial_10576563a.jpg%3Fcrop%3D0px%2C428px%2C3000px%2C1576px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T15:57:12Z", "content": "A hotel serving as a coronavirus quarantine center collapsed on Saturday night in China, killing at least 10 people. Another 23 people remain missing.\r\nRescue workers are sorting through the rubble of the seven-story Xinjia Hotel in the city of Quanzhou, in s… [+1962 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/paul-bedard", "title": "CPAC: No new virus cases and only a dozen touched by infected guest - Washington Examiner", "description": "CPAC: No new virus cases and only a dozen touched by infected guest Washington Examiner Coronavirus case at CPAC brings outbreak closer to Trump, threatening to upend his routine amid reelection bid The Washington Post ‘My phone’s been blowing up’: CPAC atten…", "url": "https://www.washingtonexaminer.com/washington-secrets/cpac-no-new-virus-cases-only-a-dozen-touched-by-infected-guest", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/14d67d9/2147483647/strip/true/crop/4457x2340+0+481/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F70%2Fa5%2F3de33d54484bb7960785f18ef98f%2Fap469038742398.jpg", "publishedAt": "2020-03-09T15:31:00Z", "content": "Officials in charge of the Conservative Political Action Conference said Monday that there have been no new cases of the coronavirus experienced by any of the speakers and guests who came into contact with a high-level supporter during the recent gathering.\r\n… [+2418 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: WHO hold news conference on Covid-19 outbreak – watch live - Guardian News", "description": "Coronavirus: WHO hold news conference on Covid-19 outbreak – watch live Guardian News Wuhan top party officials demands 'gratitude education' for citizens - Business Insider Business Insider Top Virus Doctor Says High Blood Pressure Is Major Death Risk Bloomb…", "url": "https://www.youtube.com/watch?v=wHfm-ai9h8c", "urlToImage": null, "publishedAt": "2020-03-09T15:28:30Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: Is COVID-19 worse than the flu? - Global News", "description": "Coronavirus outbreak: Is COVID-19 worse than the flu? Global News Can a face mask stop coronavirus? Covid-19 facts checked The Guardian Covid-19: More than just the flu Marin Independent Journal What to do if you think you have the coronavirus WREG NewsChanne…", "url": "https://www.youtube.com/watch?v=1BJRF7ZaOlQ", "urlToImage": null, "publishedAt": "2020-03-09T16:05:10Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Holi 2020 LIVE updates: Celebrations kick off amid coronavirus fears", "description": "Happy Holi 2020 LIVE: In view of the coronavirus outbreak, PM Narendra Modi has decided to skip Holi events this year, to avoid mass gatherings.", "url": "https://indianexpress.com/article/india/holi-india-celebrations-live-updates-6307110/", "urlToImage": "https://images.indianexpress.com/2020/03/Holi_Image_1.jpg?w=759", "publishedAt": "2020-03-09T15:58:34Z", "content": "Participants during Basanta Utsav celebrations in North Kolkata on Monday. (Express photo: Partha Paul)Happy Holi 2020 LIVE: Holi, also known as the festival of colours, will be celebrated with great fervour across the country on Tuesday. The festival marks t… [+1787 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Fourth person dies from coronavirus in Britain: health minister", "description": "A fourth person in Britain has died from coronavirus, health minister Matt Hancock said on Monday in a statement to parliament.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-death-idUSKBN20W28U", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T16:03:01Z", "content": "LONDON (Reuters) - A fourth person in Britain has died from coronavirus, health minister Matt Hancock said on Monday in a statement to parliament. \r\n“Here in the UK, as of this morning, there were 319 confirmed cases, very sadly this now includes four confirm… [+379 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Mai Shams El-Din", "title": "Egypt steps up coronavirus checks after outbreak in Luxor", "description": "Egypt has stepped up action to contain the coronavirus in the popular tourist destination of Luxor following an outbreak of the disease on a River Nile cruise ship.", "url": "https://www.reuters.com/article/us-health-coronavirus-luxor-idUSKBN20W2BC", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500863008&w=1200&r=LYNXMPEG281K5", "publishedAt": "2020-03-09T16:10:21Z", "content": "LUXOR, Egypt (Reuters) - Egypt has stepped up action to contain the coronavirus in the popular tourist destination of Luxor following an outbreak of the disease on a River Nile cruise ship. \r\nAt least 45 coronavirus cases have been detected on the ship since … [+2436 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK confident of food supply even in coronavirus worst-case scenario", "description": "Health minister Matt Hancock said on Monday he was confident Britain's food supply would not be interrupted by coronavirus even in the government's reasonable worst-case scenario.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-food-idUSKBN20W2AG", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500857309&w=1200&r=LYNXMPEG281HZ", "publishedAt": "2020-03-09T16:02:46Z", "content": "LONDON (Reuters) - Health minister Matt Hancock said on Monday he was confident Britain’s food supply would not be interrupted by coronavirus even in the government’s reasonable worst-case scenario. \r\n“We are confident that food supply will continue even in o… [+312 chars]"}, {"source": {"id": null, "name": "Nakedcapitalism.com"}, "author": "Jerri-Lynn Scofield", "title": "A Tale of Two Cities: How Hong Kong Has Controlled its Coronavirus Outbreak, While New York City Scrambles", "description": "Discussion with Dr. Sarah Borwein, a Canadian doctor practicing medicine in Hong Kong, on that city’s management of the coronavirus crisis.", "url": "https://www.nakedcapitalism.com/2020/03/a-tale-of-two-cities-how-hong-kong-has-controlled-its-coronavirus-outbreak-while-new-york-city-scrambles.html", "urlToImage": null, "publishedAt": "2020-03-09T15:30:45Z", "content": "By Jerri-Lynn Scofield, who has worked as a securities lawyer and a derivatives trader. She is currently writing a book about textile artisans.\r\nI was chatting on Facebook the other day about the topic de jour – protecting friends, family, and myself from cor… [+16309 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Top Coronavirus Doctor in Wuhan Says High Blood Pressure Is Major Death Risk", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/top-virus-doctor-says-high-blood-pressure-is-major-death-risk", "urlToImage": null, "publishedAt": "2020-03-09T16:00:02Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Michael Bernick, Contributor, Michael Bernick, Contributor https://www.forbes.com/sites/michaelbernick/", "title": "The Workplace In The Time Of Coronavirus (Part I): Legal Guidelines For Navigating The Upheaval", "description": "Each day, employers are facing new management challenges with the coronavirus. Here are main legal (and practical) guidelines.", "url": "https://www.forbes.com/sites/michaelbernick/2020/03/09/the-workplace-in-the-time-of--coronavirus-part-i-legal-guidelines-for-navigating-the-upheaval/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e6581bd7d6f2600068efbb3%2F0x0.jpg", "publishedAt": "2020-03-09T15:47:37Z", "content": "A workplace in the early 1900s. In just the past two weeks, the coronavirus is bringing rapid shifts ... [+] in workplace practices, that employers need to respond to.\r\nEarly Office Museum\r\n(This is the first in a periodic series on the short term and long te… [+8829 chars]"}, {"source": {"id": null, "name": "Scottadamssays.com"}, "author": "Scott Adams, Scott Adams", "title": "Episode 845 Scott Adams: Oil Prices, Coronavirus, Stock Market, Oh My! Sip Coffee and Chillax With Me", "description": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a Content: Coronavirus questions and issues Russia producing oil VERY inexpensively American shale oil industry in danger Talking people out of panic If you would like my channel to hav…", "url": "https://www.scottadamssays.com/2020/03/09/episode-845-scott-adams-oil-prices-coronavirus-stock-market-oh-my-sip-coffee-and-chillax-with-me/", "urlToImage": "http://www.scottadamssays.com/wp-content/uploads/2020/03/Episode-845.png", "publishedAt": "2020-03-09T15:49:27Z", "content": "My new book LOSERTHINK, available now on Amazon https://tinyurl.com/rqmjc2a\r\nContent:\r\n<ul><li>Coronavirus questions and issues</li><li>Russia producing oil VERY inexpensively\r\n<ul><li>American shale oil industry in danger</li></ul></li><li>Talking people out… [+409 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "‘Can you get coronavirus from Chinese goods? Can you get from food?’: What people are googling about COVID-19", "description": "With the death toll crossing 3,800, people are looking up every possible guidebook — the most common being Google — to find answers to their queries on the infection. Here the top questions that people are asking about COVID-19, according to Google.", "url": "https://indianexpress.com/article/world/coronavirus-outbreak-google-questions-search-6306914/", "urlToImage": "https://images.indianexpress.com/2020/03/google.jpg?w=759", "publishedAt": "2020-03-09T15:18:10Z", "content": "Here are some of the frequently Googled questions on coronavirus.The novel coronavirus, that originated in the Chinese province of Wuhan and has now spread to over 90 countries, including India, has put people across the world in panic mode and set off parano… [+5521 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Francesco Guarascio", "title": "EU leaders to hold crisis teleconference to tackle coronavirus", "description": "European Union leaders will hold emergency talks soon to discuss a joint response to the coronavirus, officials said on Monday, as the bloc's executive considers relaxing state subsidy rules to allow extra public spending.", "url": "https://www.reuters.com/article/us-health-coronavirus-eu-idUSKBN20W29B", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500853262&w=1200&r=LYNXMPEG281H8", "publishedAt": "2020-03-09T15:52:17Z", "content": "BRUSSELS (Reuters) - European Union leaders will hold emergency talks soon to discuss a joint response to the coronavirus, officials said on Monday, as the bloc’s executive considers relaxing state subsidy rules to allow extra public spending. \r\nThe announcem… [+2686 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Thomas Brewster, Forbes Staff, Thomas Brewster, Forbes Staff https://www.forbes.com/sites/thomasbrewster/", "title": "Teas, Essential Oils And Drinking Silver: FTC Warns About Dubious Coronavirus ‘Cures’", "description": "Science says drinking silver won’t cure coronavirus, but companies offering the “cure” are trying to capitalize on the COVID-19 panic across Facebook and Twitter.", "url": "https://www.forbes.com/sites/thomasbrewster/2020/03/09/teas-essential-oils-and-drinking-silver-ftc-warns-about-dubious-coronavirus-cures/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1211336289%2F0x0.jpg", "publishedAt": "2020-03-09T15:25:52Z", "content": "Companies are offering dubious cures and treatments for COVID-19, or coronavirus, as misinformation ... [+] spreads across Facebook and Twitter, according to the FTC.. (Photo by Alex Grimm/Getty Images)\r\nGetty Images\r\nAmongst the mess of misinformation around… [+4627 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": null, "title": "Posthaste: Canadian oil prices already below US$28; Canadian Natural, Suncor and Cenovus see double-digit declines amid 'bloodshed' - Financial Post", "description": "Posthaste: Canadian oil prices already below US$28; Canadian Natural, Suncor and Cenovus see double-digit declines amid 'bloodshed' Financial Post View Full coverage on Google News", "url": "https://business.financialpost.com/executive/posthaste-canadian-oil-prices-already-below-us28-canadian-natural-suncor-and-cenovus-futures-see-double-digit-declines-amid-bloodshed", "urlToImage": "https://financialpostcom.files.wordpress.com/2020/03/saudi.jpg", "publishedAt": "2020-03-09T15:49:00Z", "content": "Good Morning!\r\nSpurned by Russia last week, Saudi Arabia has unleashed an all-out war on rival producers with plans to raise its crude oil production significantly above 10 million barrels per day in April, at a time of demand destruction.\r\nRiyadh and its OPE… [+3987 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": null, "title": "Coronavirus case confirmed in AT&T Tower - Nashville Business Journal", "description": "Coronavirus case confirmed in AT&T Tower Nashville Business Journal", "url": "https://www.bizjournals.com/nashville/news/2020/03/09/at-t-tower-closed-after-confirmed-coronavirus-case.html", "urlToImage": null, "publishedAt": "2020-03-09T15:17:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Mustafa Abu Ganeyeh", "title": "U.S. church group heads back from Holy Land after virus scare: Palestinian mayor", "description": "Thirteen Americans were heading home from the Holy Land on Monday after they were cleared in a coronavirus scare, the mayor of the Palestinian town where they were quarantined said.", "url": "https://www.reuters.com/article/us-health-coronavirus-palestinians-us-idUSKBN20W2B6", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500858254&w=1200&r=LYNXMPEG281IK", "publishedAt": "2020-03-09T16:06:34Z", "content": "BEIT JALA, West Bank (Reuters) - Thirteen Americans were heading home from the Holy Land on Monday after they were cleared in a coronavirus scare, the mayor of the Palestinian town where they were quarantined said. \r\nThe group, from the 3Circle Church in Fair… [+939 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH LIVE: New York Gov. Cuomo provides update on coronavirus cases, response - Washington Post", "description": "Gov. Andrew M. Cuomo (D) holds a news conference on coronavirus cases in the state. More than 30 states have announced infections, as well as the District of...", "url": "https://www.youtube.com/watch?v=2DM3_wPZ-gw", "urlToImage": "https://i.ytimg.com/vi/2DM3_wPZ-gw/maxresdefault.jpg", "publishedAt": "2020-03-09T15:53:17Z", "content": "Gov. Andrew M. Cuomo (D) holds a news conference on coronavirus cases in the state. More than 30 states have announced infections, as well as the District of Columbia. Read more: https://wapo.st/2TJuSqg. Subscribe to The Washington Post on YouTube: https://wa… [+168 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "tedstew1", "title": "New York Governor: Port Authority Director Rick Cotton, Former Top NBC Universal Executive, Tests Positive For Coronavirus", "description": "New York Governor Andrew Cuomo said on Monday that the executive director of the Port Authority of New York and New Jersey, Rick Cotton, has tested positive for the coronavirus. Cotton was a longtime executive at NBCUniversal, including serving as it general …", "url": "https://deadline.com/2020/03/coronavirus-rick-cotton-new-york-nbcuniversal-andrew-cuomo-1202877486/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/coronavirus-2-1.jpg?w=1024", "publishedAt": "2020-03-09T16:00:26Z", "content": "New York Governor Andrew Cuomo said on Monday that the executive director of the Port Authority of New York and New Jersey, Rick Cotton, has tested positive for the coronavirus.\r\nCotton was a longtime executive at NBCUniversal, including serving as it general… [+1142 chars]"}, {"source": {"id": null, "name": "Project-syndicate.org"}, "author": "Daniel Gros", "title": "How Europe Should Manage the Coronavirus-Induced Crisis", "description": "Neither interest-rate cuts nor new government spending would do much to offset the short-term effects of COVID-19 in Europe. Central banks and government authorities should explain this to the public, and then focus their attention on the less glamorous work …", "url": "https://www.project-syndicate.org/commentary/avoding-eurozone-covid19-economic-crisis-by-daniel-gro-2020-03", "urlToImage": "https://webapi.project-syndicate.org/library/1d60f9d6815885c99abca62ae9ebab02.2-1-super.1.jpg", "publishedAt": "2020-03-09T15:36:38Z", "content": "Neither interest-rate cuts nor new government spending would do much to offset the short-term effects of COVID-19 in Europe. Central banks and government authorities should explain this to the public, and then focus their attention on the less glamorous work … [+6577 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Davies", "title": "Fake coronavirus cures targeted by feds as infections rise", "description": "The FDA and FTC are clamping down on companies claiming to offer coronavirus treatments or cures, the first step in tackling fraudulent COVID-19 medicines and new-age cures. The US Food and Drug Administration and the Federal Trade Commission confirmed today …", "url": "https://www.slashgear.com/fake-coronavirus-cures-targeted-by-feds-as-infections-rise-09612582/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/photo-of-medicines-on-person-s-palm-3873168-pexels.jpg", "publishedAt": "2020-03-09T15:32:32Z", "content": "The FDA and FTC are clamping down on companies claiming to offer coronavirus treatments or cures, the first step in tackling fraudulent COVID-19 medicines and new-age cures. The US Food and Drug Administration and the Federal Trade Commission confirmed today … [+2764 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Prisoners across Italy riot over new restrictions - BBC News", "description": "Coronavirus: Prisoners across Italy riot over new restrictions BBC News Italian inmates die during protest over coronavirus measures Fox News Six Inmates Dead, Scores Escape as Prisoners Riot Across Italy After Visitor Restrictions Over Coronavirus The Daily …", "url": "https://www.bbc.com/news/world-europe-51805727", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/92C1/production/_111196573_hi060529004.jpg", "publishedAt": "2020-03-09T16:07:28Z", "content": "Image copyrightEPAImage caption\r\n Detainees protest on the roof of the San Vittore prison in Milan\r\nSix inmates have died after riots broke out at 27 prisons in Italy over new restrictions aimed at controlling the spread of coronavirus, local media say.\r\nIn M… [+6857 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Joe Maring", "title": "The Galaxy Note 20 is coming — here's everything you need to know", "description": "Here's the lowdown on Samsung's newest Note. Every year, there are certain phones we just can't help but get excited about — one of which is the Galaxy Note. From the first Note that debuted in 2011 up to last year's Note 10, Samsung's stylus-equipped flagshi…", "url": "https://www.androidcentral.com/samsung-galaxy-note-20", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/08/galaxy-note-10-plus-review-20.jpg?itok=DxxmBzLe", "publishedAt": "2020-03-09T15:20:44Z", "content": "Source: Harish Jonnalagadda/Android Central\r\nEvery year, there are certain phones we just can't help but get excited about one of which is the Galaxy Note. From the first Note that debuted in 2011 up to last year's Note 10, Samsung's stylus-equipped flagships… [+5999 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Stephanie Petit", "title": "Prince Charles Offers Namastes Rather Than Handshakes at Commonwealth Service Amid Coronavirus Scare", "description": "Coronavirus was top of mind during Monday’s Commonwealth Day service. Members of the royal family gathered at Westminster Abbey for the annual ceremony, but they refrained from the usual handshakes as they greeted dignitaries. Instead, Prince Charles placed h…", "url": "https://people.com/royals/prince-charles-offers-namastes-rather-than-handshakes-at-commonwealth-service-amid-coronavirus-scare/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcommonwealth-day-21.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T15:42:17Z", "content": "Coronavirus was top of mind during Monday’s Commonwealth Day service.\r\nMembers of the royal family gathered at Westminster Abbey for the annual ceremony, but they refrained from the usual handshakes as they greeted dignitaries. Instead, Prince Charles placed … [+1702 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Claudia Harmata", "title": "NBA Star Stephen Curry Has the Flu After Returning to the Court — but No Signs of Coronavirus", "description": "Golden State Warriors star Stephen Curry was diagnosed with the seasonal flu ahead of Saturday’s game against the Philadelphia 76ers and had to sit out the game. The team’s physician, Dr. Robert Nied, released a statement on Saturday and said Curry was not sh…", "url": "https://people.com/sports/nba-star-stephen-curry-has-the-flu-after-returning-to-the-court-but-no-signs-of-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2018%2F10%2Fgettyimages-1052333364.jpeg%3Fcrop%3D0px%2C0px%2C3054px%2C1603.35px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T16:07:53Z", "content": "Golden State Warriors star Stephen Curry was diagnosed with the seasonal flu ahead of Saturday’s game against the Philadelphia 76ers and had to sit out the game.\r\nThe team’s physician, Dr. Robert Nied, released a statement on Saturday and said Curry was not s… [+3125 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The Coronavirus Matters. The Stock Market Doesnt. via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_c005fc73df6326c8002b11a05be4fcff", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-09T15:40:09Z", "content": "United Arab Emirates, Stock, Stock market, Dubai, Abu Dhabi, Stock exchange\r\nDubai: UAE stock exchanges were catching the Asian flu, dropping 8.5 per cent less than an hour into Monday's trading. Even blue-chips such as..."}, {"source": {"id": null, "name": "Fox5ny.com"}, "author": "FOX 5 NY", "title": "NYC considers shutting subway system...", "description": "NYC considers shutting subway system... (Top headline, 1st story, link ) Related stories: Top Transit Official Tests Positive... CRAMER: Worse than chaos of 2007-2009... 'We All Want More Leadership -- We Don't Want Golfing'... White House Drafting Economic S…", "url": "https://www.fox5ny.com/news/officials-not-ruling-out-shutting-down-mass-transit-in-wake-of-coronavirus", "urlToImage": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2020/03/724/407/Subwya2.gif?ve=1&tl=1", "publishedAt": "2020-03-09T15:55:36Z", "content": "NEW YORK - Despite the spread of coronavirus, state and local officials are not shutting down mass transit in the city and state, at least not yet.\r\nMTA Interim Chairperson Sarah Feinberg told FOX 5 NY morning program 'Good Day New York' and echoed statements… [+1812 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "In Kerala district with 5 coronavirus cases, govt calls for marriages, festivals to be postponed", "description": "The five positive patients include a couple and their 25-year-old son who returned from Italy last week where 360 people have succumbed to the virus.", "url": "https://indianexpress.com/article/india/kerala/in-kerala-district-with-5-coronavirus-cases-govt-calls-for-marriages-festivals-to-be-postponed-6307190/", "urlToImage": "https://images.indianexpress.com/2020/03/AP20065432710895.jpg?w=759", "publishedAt": "2020-03-09T15:54:07Z", "content": "A security officer wears a mask outside a special ward set aside for possible COVID-19 patients. (AP)A day after five of a family reported positive for the COVID-19 virus and allegedly risked the spread of the infection into the community, the Pathanamthitta … [+2173 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "IE Online", "title": "Tourism in a tailspin on coronavirus scare, TTAI seeks govt help", "description": "The industry body also urged the government to create a corpus for survival of the industry, the official said.", "url": "https://indianexpress.com/article/india/coronavirus-scare-ttai-govt-help-tourism-6307168/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus1-6.jpg?w=759", "publishedAt": "2020-03-09T15:18:06Z", "content": "Kolkata | \r\nPublished: March 9, 2020 8:48:06 pm\r\nPeople wearing mask to take simple precautions to protect themselves from coronavirus infection while visiting Sukhna Lake, Chandigarh, on Saturday. (Express Photo: Kamleshwar Singh)The Travel Agents Associatio… [+2150 chars]"}, {"source": {"id": null, "name": "Herefordtimes.com"}, "author": "Charlotte Moreau", "title": "Coronavirus: Employment law advice for business owners - Hereford Times", "description": "BUSINESS owners worrying about the effects of the coronavirus outbreak are being invited to a seminar with Herefordshire employment law experts.", "url": "https://www.herefordtimes.com/news/18292486.coronavirus-employment-law-advice-business-owners/", "urlToImage": "https://www.herefordtimes.com/resources/images/11085585/", "publishedAt": "2020-03-09T15:57:16Z", "content": "BUSINESS owners worrying about the effects of the coronavirus outbreak are being invited to a seminar with Herefordshire employment law experts.\r\nMany businesses are concerned about their legal responsibilities if they need to temporarily close or are faced w… [+1583 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Trump tweets on Coronavirus outbreak raises eyebrows", "description": "Democrats continue to criticize the lack of response from the administration as coronavirus continues to spread across the country. Yahoo Finance's Jessica Smith in Washington explains.", "url": "https://finance.yahoo.com/video/trump-tweets-coronavirus-outbreak-raises-155852375.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/6a_SsAl95achR0WRr.yunQ--~B/aD0yOTY2O3c9NTI4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/09/5e6667bede7e2726cc4e0bf7/5e6667bede7e2726cc4e0bf8_o_U_v2.jpg", "publishedAt": "2020-03-09T15:58:52Z", "content": "Democrats continue to criticize the lack of response from the administration as coronavirus continues to spread across the country.\r\nYahoo Finance's Jessica Smith in Washington explains."}, {"source": {"id": null, "name": "Adweek.com"}, "author": "Jason Lynch", "title": "A+E Networks Cancels Live Event, Plans ‘Virtual Upfront’ in Light of Coronavirus", "description": "A+E Networks has become the latest media company to cancel its in-person upfront event this month due to concerns about the spread of the new coronavirus. Instead of the live event, which had been scheduled for March 25 at New York's Jazz at Lincoln Center, t…", "url": "https://www.adweek.com/tv-video/ae-networks-cancels-upfront-event-due-to-coronavirus-concerns/", "urlToImage": "https://www.adweek.com/wp-content/uploads/2020/03/ae-cancels-upfront-CONTENT-2020-600x315.jpg", "publishedAt": "2020-03-09T16:08:46Z", "content": "A+E Networks has become the latest media company to cancel its in-person upfront event this month due to concerns about the spread of the new coronavirus.Instead of the live event, which had been scheduled for March 25 at New Yorks Jazz at Lincoln Center, the… [+2478 chars]"}, {"source": {"id": null, "name": "Infosecurity-magazine.com"}, "author": "Dan  Raywood", "title": "Cybersecurity Conferences Postponed and Canceled Over #Coronavirus Fears", "description": "A raft of cyber and infosec conferences have been postponed or canceled due to Coronavirus", "url": "https://www.infosecurity-magazine.com:443/news/cancel-coronavirus-fears/", "urlToImage": "https://assets.infosecurity-magazine.com/webpage/og/5aa971fd-694b-4db5-bf46-99743bcd6487.jpg", "publishedAt": "2020-03-09T16:05:00Z", "content": "The global pandemic of Coronavirus, and the concerns of people traveling and gathering indoors at large events, has hit the cybersecurity events calendar with events now being canceled.\r\nInitially Mobile World Congress was canceled, after being due to take pl… [+2541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Italians who attempt to flee coronavirus lockdown may face jail", "description": null, "url": "https://www.cnn.com/collections/intl-coronavirus-0309/", "urlToImage": null, "publishedAt": "2020-03-09T15:41:24Z", "content": null}, {"source": {"id": null, "name": "Archinect.com"}, "author": "Sean Joyner", "title": "108th ACSA Annual Meeting postponed due to coronavirus", "description": "ACSA President Rashida Ng announced Saturday that the 108th ACSA Annual Meeting will not place in San Diego this week. In the statement, she says: The Board of Directors reviewed public health data about the coronavirus and its impact on travel and our confer…", "url": "https://archinect.com/news/article/150188709/108th-acsa-annual-meeting-postponed-due-to-coronavirus", "urlToImage": "https://archinect.imgix.net/uploads/89/898861eba5d6f8f6e1ebc84e10ac0b87.jpeg?fit=crop&auto=compress%2Cformat&w=1200", "publishedAt": "2020-03-09T16:08:00Z", "content": "ACSA President Rashida Ng announced Saturday that the 108th ACSA Annual Meeting will not place in San Diego this week. In the statement, she says:\r\nThe Board of Directors reviewed public health data about the coronavirus and its impact on travel and our confe… [+780 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "GOVERNMENT: Why Is the CDC Lowballing Numbers for the Coronavirus? Related (From Ed): Coronavi…", "description": "GOVERNMENT: Why Is the CDC Lowballing Numbers for the Coronavirus? Related (From Ed): Coronavirus: Head of NY-NJ Port Authority Rick Cotton has coronavirus. 15 new coronavirus cases in Massachusetts, doubling overnight. California has 114 coronavirus cases, L…", "url": "https://pjmedia.com/instapundit/360786/", "urlToImage": null, "publishedAt": "2020-03-09T16:02:57Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "How do scientists create vaccines for new viruses?", "description": "Hundreds of scientists around the world have begun to create a COVID-19 coronavirus vaccine, which, according to WHO estimates, could take a year and a half to produce.", "url": "https://www.euronews.com/2020/03/09/how-do-scientists-create-vaccines-for-new-viruses", "urlToImage": "https://static.euronews.com/articles/stories/04/55/68/24/1000x563_cmsv2_8529e625-f74c-5f5a-8631-80e0adfe41ff-4556824.jpg", "publishedAt": "2020-03-09T15:49:19Z", "content": "As concern about the COVID-19 coronavirus outbreak spreads across the world, scientists are working to develop a vaccine.\r\nOver 3,800 worldwide have died of the virus, which first appeared in the Chinese city of Wuhan in December. The World Health Organizatio… [+5618 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Duprey)", "title": "Apple's iPhone Sales Plunged 61% in China in February", "description": "The drop-off in shipments of the popular smartphone was even worse when compared to January.", "url": "https://www.fool.com/investing/2020/03/09/apples-iphone-sales-plunged-61-in-china-in-februar.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562193/apple-aapl-iphone-se-smartphone-source-aapl.jpg", "publishedAt": "2020-03-09T15:34:00Z", "content": "The COVID-19 coronavirus outbreak hit China's smartphone market hard in February: Device shipments there fell nearly 55% for the month. But few smartphone manufacturers fared worse than Apple(NASDAQ:AAPL) -- iPhone sales in China plunged 61%.\r\nData from the C… [+1497 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Marc Schneider", "title": "Entertainment Stocks Hit 52-Week Lows Amid Latest Coronavirus Market Drop", "description": "Entertainment industry stocks on Monday hit new 52-week lows or were trading near their year lows amid the latest coronavirus-driven stock market drop.", "url": "https://www.billboard.com/articles/business/9330662/entertainment-stocks-hit-52-week-lows-amid-latest-coronavirus-market-drop", "urlToImage": "https://static.billboard.com/files/media/Global-stocks-a-billboard-1548.jpg", "publishedAt": "2020-03-09T15:31:44Z", "content": "Entertainment industry stocks on Monday hit new 52-week lows or were trading near their year lows amid the latest coronavirus-driven stock market drop. Trading was briefly halted as the S&amp;P 500 stock index plunged 7 percent.\r\nWalt Disney's stock hit $108 … [+1645 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Anita Chabria, Joe Mozingo, Alex Wigglesworth", "title": "Plans set for keeping the public safe from coronavirus as cruise ship passengers exit in Oakland", "description": "The Grand Princess will dock Monday in Oakland as officials act to keep passengers who might have the coronavirus isolated from the larger population.", "url": "https://www.latimes.com/california/story/2020-03-09/coronavirus-grand-princess-passengers-exit-oakland", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/d29908e/2147483647/strip/true/crop/1905x1000+48+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2F6b%2F821974874c34a661b50d192384e8%2Fship-large.jpg", "publishedAt": "2020-03-09T16:02:48Z", "content": "The Grand Princess cruise ship stuck off the San Francisco coast for days because of a coronavirus outbreak will dock at noon Monday in Oakland.\r\nOfficials stressed they are taking aggressive action to keep passengers who might have the virus isolated from th… [+1737 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New York Governor Cuomo Makes Coronavirus Announcement | NBC News (Live Stream) - NBC News", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=HqkzbmizjZc", "urlToImage": null, "publishedAt": "2020-03-09T15:49:27Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson, Contributor, Scott Mendelson, Contributor https://www.forbes.com/sites/scottmendelson/", "title": "‘Onward’ Box Office: Coronavirus Not To Blame For Poor Pixar Debut", "description": "The good news is that if the past predicts the future, then Pixar’s 'Soul' is going to be a huge blockbuster when it opens in June.", "url": "https://www.forbes.com/sites/scottmendelson/2020/03/09/onward-box-office-coronavirus-not-to-blame-for-poor-pixar-debut/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5d49dbd378190007f4c55d%2F0x0.jpg%3FcropX1%3D312%26cropX2%3D1635%26cropY1%3D0%26cropY2%3D744", "publishedAt": "2020-03-09T16:00:44Z", "content": "Chris Pratt and Tom Holland in 'Onward'\r\nDisney and Pixar\r\nThe good news is that if the past predicts the future, then Pixars Soul is going to be a huge blockbuster when it opens in June.\r\nThere is little evidence that the $40 million domestic debut for Onwar… [+6667 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS New York", "title": "NJ's First Patient Warns 'It Happened So Quick'...", "description": "NJ's First Patient Warns 'It Happened So Quick'... (Top headline, 3rd story, link ) Related stories: NYC considers shutting subway system... Top Transit Official Tests Positive... Shocking escalation from 'no symptoms to death' in just hours... CRAMER BLASTS …", "url": "https://newyork.cbslocal.com/2020/03/09/coronavirus-update-new-jersey-patiet-speaks-out/", "urlToImage": "https://newyork.cbslocal.com/wp-content/uploads/sites/14578484/2020/03/James-Cai-Fort-Lee-coronavirus.jpg?w=1024", "publishedAt": "2020-03-09T16:07:36Z", "content": "NEW YORK (CBSNewYork) – The number of confirmed coronavirus cases in New York has grown to 142 over, Gov. Andrew Cuomo said Monday. That makes it the state with largest number of confirmed cases in the country.In New York, most cases are in Westchester County… [+3574 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "‘This is much more like a 9/11 than a fundamental flaw in market structure’: Jefferies Chief Market Strategist", "description": "The number of coronavirus cases has surpassed 119 cases in the United States, Jefferies Chief Market Strategist David Zervos joins the On the Move panel to discuss the impact on markets.", "url": "https://finance.yahoo.com/video/much-more-9-11-fundamental-160628255.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rzc4ZUNGsVdijc_rYSzSqw--~B/aD00NjM4O3c9ODI1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/09/5e66698669e6c51d61e11721/5e666d1d9947850cd2ed940b_o_U_v3.jpg", "publishedAt": "2020-03-09T16:06:28Z", "content": "The number of coronavirus cases has surpassed 119 cases in the United States, Jefferies Chief Market Strategist David Zervos joins the On the Move panel to discuss the impact on markets."}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Thousands Prepare to Get Off Ship Hit by Virus in California", "description": "Federal and state officials in California prepared to receive thousands of people from a cruise ship that has been idling off the coast of San Francisco with at least 21 people aboard infected with the coronavirus.", "url": "https://www.snopes.com/ap/2020/03/09/thousands-prepare-to-get-off-ship-hit-by-virus-in-california/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/AP-Virus-Outbreak-California-e1583769246832.jpg?fit=1200,600", "publishedAt": "2020-03-09T15:57:46Z", "content": "SAN FRANCISCO (AP) Federal and state officials in California prepared to receive thousands of people from a cruise ship that has been idling off the coast of San Francisco with at least 21 people aboard infected with the coronavirus.\r\nPersonnel covered head t… [+4282 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "NewsHound Ellen", "title": "Donna Edwards: On Coronavirus, Trump Should 'Just Shut Up'", "description": "Former Congresswoman Donna Edwards opined that Donald Trump’s mismanagement of the coronavirus is at least partly due to the fact that he keeps blabbing misinformation. Not one of the conservatives on the panel defended Trump. On today’s Fox News Sunday, none…", "url": "https://crooksandliars.com/2020/03/donna-edwards-trump-should-just-shut", "urlToImage": "https://crooksandliars.com/files/embeds/2020/03/39448.jpg", "publishedAt": "2020-03-09T15:47:35Z", "content": "Former Congresswoman Donna Edwards opined that Donald Trumps mismanagement of the coronavirus is at least partly due to the fact that he keeps blabbing misinformation. Not one of the conservatives on the panel defended Trump.\r\nOn todays Fox News Sunday, none … [+4581 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Northern Ireland schools close over positive case", "description": "Health Minister Robin Swann says two schools on the same site have closed for a deep clean.", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-51807264", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-09T16:06:46Z", "content": "Two schools in Northern Ireland have been closed for a deep clean after a student tested positive for coronavirus, Health Minister Robin Swann has said.\r\nThe minister said the schools are located on the same site. \r\nMore to follow."}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Arif Bacchus", "title": "As Coronavirus continues to spread, new features in Microsoft 365 are helping empower healthcare workers", "description": "Microsoft announced that it would be adding new capabilities to Microsoft 365 which will empower those in the healthcare industry with delivering \"high-quality patient care.\"", "url": "https://www.onmsft.com/news/as-coronavirus-continues-to-spread-new-features-in-microsoft-365-are-helping-empower-healthcare-workers", "urlToImage": "https://i0.wp.com/www.onmsft.com/wp-content/uploads/2020/03/Lifestyle_patientviewing1_BROWSER.png?fit=1024%2C682&ssl=1", "publishedAt": "2020-03-09T15:41:16Z", "content": "Coronavirus is spreading rapidly across the world and in the United States, and it is putting extra stress on the healthcare industry. Microsoft, though, is here to help. The company recently announced that it would be adding new capabilities to Microsoft 365… [+1417 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jackie Salo", "title": "Seattle hospital offers drive-through coronavirus testing", "description": "University of Washington Medical Center Northwest converted the first floor of a parking garage into the infectious disease clinic.", "url": "https://nypost.com/2020/03/09/seattle-hospital-offers-drive-through-coronavirus-testing/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/29377308.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-09T15:44:40Z", "content": "A Seattle hospital has opened a drive-through clinic to test employees for coronavirus, allowing them to limit potentially exposing others, according to a report.\r\nUniversity of Washington Medical Center Northwest converted the first floor of a parking garage… [+1482 chars]"}, {"source": {"id": null, "name": "Globes.co.il"}, "author": "Omri Zerachovitz", "title": "Coronavirus and Israeli tech: Who'll prosper, who'll struggle? - Globes", "description": "Seven technology investors discuss how entrepreneurs should face up to a changed world.", "url": "https://en.globes.co.il/en/article-coronavirus-and-israeli-tech-wholl-prosper-wholl-struggle-1001321215", "urlToImage": "https://images.globes.co.il/Images/NewGlobes/big_image/2011/71086157[575].jpg", "publishedAt": "2020-03-09T15:53:13Z", "content": "Sequoia Capital, one of the world's leading venture capital firms, has published a letter that it sent to its entrepreneurs about the effects of the coronavirus, or what it calls \"the black swan of 2020.\" The fund sent a similar letter during the 2008 financi… [+9644 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Canada says its citizens should avoid all cruise ship travel: chief medical officer", "description": "Canadian citizens should avoid all cruise ship travel amid the outbreak of the new coronavirus, the country's chief medical officer Theresa Tam said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-canada-idUSKBN20W29W", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500856523&w=1200&r=LYNXMPEG281HK", "publishedAt": "2020-03-09T16:00:44Z", "content": "OTTAWA (Reuters) - Canadian citizens should avoid all cruise ship travel amid the outbreak of the new coronavirus, the country’s chief medical officer Theresa Tam said on Monday. \r\n“We’re recommending that Canadians avoid all cruise ship travel,” Tam told rep… [+412 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Coronavirus: Mizoram’s international borders to be sealed", "description": "Mizoram shares a 510km border with Myanmar and a 318km border with Bangladesh.", "url": "https://www.thehindu.com/news/national/other-states/coronavirus-mizorams-international-borders-to-be-sealed/article31025105.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/nqntwa/article31025243.ece/ALTERNATES/LANDSCAPE_615/09IN-CHENNNAI", "publishedAt": "2020-03-09T15:12:11Z", "content": "Mizorams borders with Myanmar and Bangladesh will be sealed and the entry of foreigners banned to prevent the spread of novel coronavirus (COVID-19) in the State, a top official said on Monday.\r\n| \r\n| How is India containing COVID-19?\r\nMizoram shares a 510km … [+1573 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "RI Gov. Gina Raimondo on coronavirus precautions", "description": "Governor of Rhode Island, Gina Raimondo joins Stephanie Ruhle to share her state's plan to combat coronavirus and her message for the administration.", "url": "https://www.msnbc.com/stephanie-ruhle/watch/ri-gov-gina-raimondo-on-coronavirus-precautions-80328773726", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_ruhle_gov_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-09T15:24:15Z", "content": null}, {"source": {"id": null, "name": "Ksat.com"}, "author": "Ricardo Alonso-Zaldivar, Associated Press", "title": "Amid virus crisis, officials announce health care tech rules - KSAT San Antonio", "description": "With <a href=\"https://apnews.com/VirusOutbreak\">coronavirus</a> topping Americans' concerns, senior Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering on the unfulfilled promise of electronic health re…", "url": "https://www.ksat.com/news/politics/2020/03/09/amid-virus-crisis-officials-announce-health-care-tech-rules/", "urlToImage": "https://www.ksat.com/resizer/NKG-aOCWB7je1hnkV3M-ClRBd2U=/1600x1066/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/IVYDHFO6WZHSVBLF3NEOEHV75Y.jpg", "publishedAt": "2020-03-09T15:26:15Z", "content": "WASHINGTON, D.C. With coronavirus topping Americans' concerns, senior Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering on the unfulfilled promise of electronic health records.\r\nIt did not go smoothly… [+3706 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Ricardo Alonso-Zaldivar, Associated Press", "title": "Amid virus crisis, officials announce health care tech rules - WJXT News4JAX", "description": "With <a href=\"https://apnews.com/VirusOutbreak\">coronavirus</a> topping Americans' concerns, top Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering on the unfulfilled promise of electronic health recor…", "url": "https://www.news4jax.com/news/politics/2020/03/09/amid-virus-crisis-officials-announce-health-care-tech-rules/", "urlToImage": "https://www.news4jax.com/resizer/NKG-aOCWB7je1hnkV3M-ClRBd2U=/1600x1066/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/IVYDHFO6WZHSVBLF3NEOEHV75Y.jpg", "publishedAt": "2020-03-09T15:11:48Z", "content": "WASHINGTON, D.C. With coronavirus topping Americans' concerns, top Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering on the unfulfilled promise of electronic health records.\r\nIt did not go smoothly as… [+2833 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Italian prisoners RIOT over coronavirus safety measures (WATCH LIVE)", "description": "Italy, which is battling the worst Covid-19 outbreak in Europe, has experienced a series of prison riots in virus-plagued areas. The unrest has been triggered by a move to suspend family visits over the coronavirus threat. Read Full Article at RT.com", "url": "https://www.rt.com/news/482656-italy-coronavirus-prisoner-riots/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e665cff85f5405a2e571d81.jpg", "publishedAt": "2020-03-09T15:20:00Z", "content": "“There have been a series of rebellions across the country,” Italy's prison administration head Francesco Basentini said on Monday.\r\nThe government’s efforts to contain the virus, which has already killed over 360 people across the nation, triggered riots at … [+1568 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "UNSURPRISING: Vitamin D: Deficiency May Increase Coronavirus Infection Risk….", "description": "UNSURPRISING: Vitamin D: Deficiency May Increase Coronavirus Infection Risk.", "url": "https://pjmedia.com/instapundit/360809/", "urlToImage": null, "publishedAt": "2020-03-09T16:08:08Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Josh Bivens", "title": "Outside the Box: Here’s how Congress should respond today to the COVID-19 recession", "description": "It is time to get serious about the economic policy response to the COVID-19 outbreak. If it comes, it’ll come fast, and it will hit low-income workers and state and local governments hardest.", "url": "http://www.marketwatch.com/story/heres-how-congress-should-respond-today-to-the-covid-19-recession-2020-03-09", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB825_airpor_ZG_20200309121600.jpg", "publishedAt": "2020-03-09T15:20:14Z", "content": "With the stock market plummeting and hysteria around COVID-19 (commonly known as the coronavirus) escalating, it is time to get serious about the economic policy response. Policy makers and the public will need help in distinguishing between smart responses a… [+7998 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "Monica Nickelsburg", "title": "Microsoft, Amazon and others form $2.5M coronavirus response fund", "description": "Microsoft, Amazon, and other Seattle-area companies are partnering with nonprofits and governments to launch a relief fund in response to the coronavirus outbreak. The COVID-19 Response Fund will provide grants to organizations helping at-risk populations, li…", "url": "https://www.geekwire.com/2020/microsoft-amazon-others-form-2-5m-coronavirus-response-fund/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2019/09/20190920_Brad_Smith_1301-1260x900.jpg", "publishedAt": "2020-03-09T15:49:15Z", "content": "Microsoft President Brad Smith speaks at a 2019 Town Hall event in Seattle. (GeekWire Photo / Kevin Lisota)\r\nMicrosoft, Amazon, and other Seattle-area companies are partnering with nonprofits and governments to launch a relief fund in response to the coronavi… [+2452 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Irish St. Patrick's Day parades canceled over coronavirus: RTE", "description": "All Irish St. Patrick's Day parades, including Dublin's main celebration that draws around 500,000 revelers from all over the world each year, were canceled on Monday due to the risk of a further coronavirus spread, local media reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-ireland-idUSKBN20W292", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T15:47:58Z", "content": "DUBLIN (Reuters) - All Irish St. Patrick’s Day parades, including Dublin’s main celebration that draws around 500,000 revelers from all over the world each year, were canceled on Monday due to the risk of a further coronavirus spread, local media reported. \r\n… [+334 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Timothy Green)", "title": "Why Shares of 2U Dropped Today", "description": "The software stock got caught up in a rough day for the stock market.", "url": "https://www.fool.com/investing/2020/03/09/why-shares-of-2u-dropped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562210/stock-chart-going-down.jpg", "publishedAt": "2020-03-09T15:44:00Z", "content": "What happened\r\nShares of 2U(NASDAQ:TWOU) slumped on Monday along with the broader market. The education-focused software-as-a-service provider has been dragged up and down by a tumultuous stock market in recent days. Last Wednesday, the stock soared for no re… [+1113 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Rosevear)", "title": "Why Shares of Nordstrom Are Down Sharply Today", "description": "Virus fears and the possibility of a recession have investors worried.", "url": "https://www.fool.com/investing/2020/03/09/why-shares-of-nordstrom-are-down-sharply-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562212/add-nordstrom-chinook-centre.jpg", "publishedAt": "2020-03-09T15:58:00Z", "content": "What's happening\r\nShares of upscale retailer Nordstrom (NYSE:JWN) were down sharply on Monday morning as a steep drop in oil prices and growing concerns about a virus pandemic drove a broad-based market sell-off. \r\nAs of 11 a.m. EDT, Nordstrom's shares were d… [+1187 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anthony Zurita, NorthJersey.com", "title": "Princeton tells students to stay home after spring break amid coronavirus outbreak; classes to go virtual", "description": "Princeton University has asked students to stay home after spring break as New Jersey reported its sixth coronavirus case; classes will go online.", "url": "https://news.yahoo.com/coronavirus-princeton-tells-students-stay-152729794.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/k.0riupwliT_Nehru0xoFw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMTQ7aD02NzY-/https://s.yimg.com/uu/api/res/1.2/JBAS.qAU7LSiPhIX4GCZ1w--~B/aD0zMzg7dz01MDc7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/42404efb52143e352351a717899a6f9f", "publishedAt": "2020-03-09T15:38:05Z", "content": "Princeton University classes will all go online after spring break as a response to the spread of the coronavirus, officials said. \r\nThe announcement came less than 24 hours after New Jersey announced its sixth case of the virus, with the number of confirmed … [+2298 chars]"}]