[{"source": {"id": null, "name": "Theprint.in"}, "author": "Aaron Brown", "title": "Three ways coronavirus can affect markets - ThePrint", "description": "Three ways coronavirus can affect markets ThePrint Coronavirus: What you need to know to prepare for a covid-19 pandemic New Scientist News What could a coronavirus worst-case scenario really look like in the UK? Yahoo News UK Covid-19 is now in 50 countries,…", "url": "https://theprint.in/economy/three-ways-coronavirus-can-affect-markets/371987/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/02/Coronavirus-China.jpg", "publishedAt": "2020-02-27T05:45:22Z", "content": "The coronavirus seems to be near the tipping point of becoming a global pandemic. The next few weeks may see infection rates peak for the virus that causes a lung illness dubbed Covid-19 and start to decline, aided by containment efforts and warmer weather in… [+5705 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraq reports sixth case of coronavirus in man who had been to Iran", "description": "Iraq has confirmed its sixth case of coronavirus, in a young Iraqi man in Baghdad who had traveled from Iran, the health ministry said on Thursday.", "url": "https://www.reuters.com/article/us-china-health-iraq-idUSKCN20L0J9", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1495829777&w=1200&r=LYNXNPEG1Q0CQ", "publishedAt": "2020-02-27T06:06:53Z", "content": "(Reuters) - Iraq has confirmed its sixth case of coronavirus, in a young Iraqi man in Baghdad who had traveled from Iran, the health ministry said on Thursday. \r\nReporting by Ahmed Aboulenein; Editing by Kim Coghill"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "World about to be gripped by coronavirus pandemic, Australia's Morrison says", "description": "There is every sign the world is about to be gripped by a pandemic of coronavirus, Prime Minister Scott Morrison warned on Thursday, as Australia kicked off emergency measures to restrain the spread of the disease.", "url": "https://www.reuters.com/article/us-china-health-australia-idUSKCN20L0H4", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1495814166&w=1200&r=LYNXNPEG1Q0BJ", "publishedAt": "2020-02-27T05:19:07Z", "content": "SYDNEY (Reuters) - There is every sign the world is about to be gripped by a pandemic of coronavirus, Prime Minister Scott Morrison warned on Thursday, as Australia kicked off emergency measures to restrain the spread of the disease. \r\n“The advice we have rec… [+527 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "China city offers $1,400 reward for virus patients who report to authorities", "description": "A city in China's Hubei province, the epicenter of the global coronavirus epidemic, will pay residents as much as 10,000 yuan ($1,425.96) if they proactively report symptoms of the illness and it is confirmed after testing.", "url": "https://www.reuters.com/article/us-china-health-rewards-idUSKCN20L0GE", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1495810731&w=1200&r=LYNXNPEG1Q0B9", "publishedAt": "2020-02-27T05:19:07Z", "content": "SHANGHAI (Reuters) - A city in China’s Hubei province, the epicenter of the global coronavirus epidemic, will pay residents as much as 10,000 yuan ($1,425.96) if they proactively report symptoms of the illness and it is confirmed after testing. \r\nQianjiang, a… [+1625 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "China asks low-risk coronavirus areas to resume visa, passport services", "description": "Regions in China at low risk for the coronavirus should resume visa and passport services for both Chinese and foreign travelers to help the nation get back to work, immigration authorities said on Thursday.", "url": "https://www.reuters.com/article/us-china-health-immigration-idUSKCN20L0JI", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T06:09:03Z", "content": "SHANGHAI (Reuters) - Regions in China at low risk for the coronavirus should resume visa and passport services for both Chinese and foreign travelers to help the nation get back to work, immigration authorities said on Thursday. \r\nMedium-risk areas should do … [+336 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Reuters", "title": "Japanese Woman Tests Positive For Coronavirus For A Second Time", "description": "The tour bus guide in Japan is the first person in the country to do so.", "url": "https://www.huffpost.com/entry/coronavirus-japan-2nd-positive-test_n_5e575459c5b66622ed769ea8", "urlToImage": "https://img.huffingtonpost.com/asset/5e5755cb230000960c39c55d.jpeg?cache=eklkp1sf5w&ops=1778_1000", "publishedAt": "2020-02-27T05:40:09Z", "content": "TOKYO, Feb 27 (Reuters) - A woman working as a tour-bus guide in Japan tested positive for the coronavirus for a second time, Osakas prefectural government said on Wednesday, the first person in the country to do so amid growing concerns about the spread of t… [+2948 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Josephine Harvey", "title": "Late Night Hosts Are Not Comforted By Trump’s Coronavirus Advice", "description": "Trevor Noah and Stephen Colbert aren't feeling reassured by the president's guidance that \"there's a very good chance you're not going to die.\"", "url": "https://www.huffpost.com/entry/late-night-hosts-trump-coronavirus_n_5e574adec5b66137fb5d9a1b", "urlToImage": "https://img.huffingtonpost.com/asset/5e574f652300007f0a0bf3c9.jpeg?cache=kZ841UmzQt&ops=1200_630", "publishedAt": "2020-02-27T05:59:41Z", "content": "President Donald Trump’s advice about the coronavirus did little to reassure the comedians of late-night TV.\r\nTrevor Noah and Stephen Colbert both dedicated segments Wednesday night to the president’s response to the new coronavirus after public health offici… [+810 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Reuters", "title": "WHO: Number Of New Coronavirus Cases Outside China Exceed Country Of Origin", "description": "The new disease - COVID-19 - was also detected for the first time in Pakistan, Sweden, Norway, Greece, Romania and Algeria.", "url": "https://www.huffpost.com/entry/coronavirus-global-fears_n_5e574ef4c5b66622ed769918", "urlToImage": "https://img.huffingtonpost.com/asset/5e5751e8230000960c39c559.jpeg?ops=1778_1000", "publishedAt": "2020-02-27T05:22:19Z", "content": "SHANGHAI/SEOUL (Reuters) - The number of new coronavirus infections inside China - the source of the outbreak - was for the first time overtaken by fresh cases elsewhere on Wednesday, with Italy and Iran emerging as epicenters of the rapidly spreading illness… [+5296 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Anmol", "title": "Facebook is cracking down on ads that promise to cure coronavirus", "description": "The Coronavirus outbreak has taken the world by storm and countries have been scrambling to control the spread of the virus. Unfortunately, the virus isn’t the only thing that’s spreading as social media platforms have seen a surge in content surrounding the …", "url": "https://mspoweruser.com/facebook-is-banning-ads-that-promise-to-cure-coronavirus/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2019/03/Mark-Zuckerberg.jpg", "publishedAt": "2020-02-27T06:00:50Z", "content": "The Coronavirus outbreak has taken the world by storm and countries have been scrambling to control the spread of the virus. Unfortunately, the virus isnt the only thing thats spreading as social media platforms have seen a surge in content surrounding the ou… [+1977 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Denmark Confirms Its First Case of Coronavirus, Ritzau Says", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/denmark-confirms-its-first-case-of-coronavirus-ritzau-says-k74c0kx4", "urlToImage": null, "publishedAt": "2020-02-27T05:53:24Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Corona Beer Takes a Hit From Coronavirus as Brand Image Suffers", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/corona-beer-takes-a-hit-from-coronavirus-as-brand-image-suffers", "urlToImage": null, "publishedAt": "2020-02-27T06:03:59Z", "content": null}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Ken Martin", "title": "Stock selling continues after Trump announces coronavirus plans - Fox Business", "description": "Stock selling continues after Trump announces coronavirus plans Fox Business", "url": "https://www.foxbusiness.com/markets/stock-carnage-continues-dow-futures-plunge-overnight", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/VirusThu2.jpg?ve=1&tl=1", "publishedAt": "2020-02-27T06:03:53Z", "content": "U.S. equity futures are trading lower after President Trump announced the U.S. was stepping up its efforts to combat the coronavirus outbreak that began in China.\r\nThe major futures indexes are indicating a loss of 0.8 percent.  Dow futures were down by as ma… [+3408 chars]"}, {"source": {"id": null, "name": "Kwch.com"}, "author": "KWCH", "title": "Coronavirus outbreak starting to impact businesses in differing ways - KWCH", "description": "As the coronavirus continues to spread around the world, businesses are starting to see the side effect on the economy.", "url": "https://www.kwch.com/content/news/Coronavirus-outbreak-starting-to-impact-businesses-in-differing-ways-568236041.html", "urlToImage": "https://media.graytvinc.com/images/home+buying+market.JPG", "publishedAt": "2020-02-27T05:17:41Z", "content": "WICHITA, Kan. (KWCH) As the coronavirus continues to spread around the world, businesses are starting to see the side effect on the economy. \r\nIf you're thinking about buying a home, now might be the time to get into the market. If you're shopping for a weddi… [+2257 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Contributor", "title": "View: Solidarity and cooperation among countries are our most formidable weapons in the battle against coronavirus", "description": "By working together countries promote efficiency. Each country in the region has different strengths and faces different risks. By continuing to share knowledge and resources, countries will build surge capacity – a crucial asset that will help them prepare f…", "url": "https://economictimes.indiatimes.com/news/international/world-news/view-solidarity-and-cooperation-among-countries-are-our-most-formidable-weapons-in-the-battle-against-coronavirus/articleshow/74329597.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74329912,width-1070,height-580,imgsize-112139,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-27T05:55:32Z", "content": "by Poonam Khetrapal SinghThe approach of the WHO Southeast Asia Region to health security is guided by a simple yet powerful logic: When we work together we are protected together. Never has this been more important. The outbreak of Covid-19 is a Public Healt… [+4499 chars]"}, {"source": {"id": null, "name": "Wmtw.com"}, "author": "Mary Cate Mannion", "title": "Coronavirus causing iPhone supply shortages, impacting tech supplies in U.S. - WMTW Portland", "description": "Coronavirus causing iPhone supply shortages, impacting tech supplies in U.S. WMTW Portland", "url": "https://www.wmtw.com/article/coronavirus-causing-iphone-supply-shortages-impacting-tech-supplies-in-us/31125227", "urlToImage": "https://kubrick.htvapps.com/vidthumb/c59a11aa-abf6-47c5-a129-c789b0f75363/c59a11aa-abf6-47c5-a129-c789b0f75363_image.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "publishedAt": "2020-02-27T05:31:00Z", "content": "The deadly new coronavirus is having a ripple effect on the economy across the world. \r\niPhone parts are in short supply Chinese factories are being shut down amid fears of the virus spreading. In Maine, those concerns are putting a strain on an iPhone repair… [+401 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Billy Bambrough, Contributor, Billy Bambrough, Contributor https://www.forbes.com/sites/billybambrough/", "title": "Bitcoin Has Crashed—Now What?", "description": "Bitcoin, along with the wider cryptocurrency market, has plummeted—dashing hopes the digital token had begun performing as a so-called safe haven asset...", "url": "https://www.forbes.com/sites/billybambrough/2020/02/27/bitcoin-has-crashed-now-what/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e574fbfd378190007f46571%2F960x0.jpg", "publishedAt": "2020-02-27T05:58:54Z", "content": "Bitcoin, along with the wider cryptocurrency market, has crasheddashing hopes the digital token had begun performing as a so-called safe haven asset. The bitcoin price is down some 10% over the last three days with many major cryptocurrencies, including ether… [+7348 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Denmark confirms first coronavirus case in man returning from holiday in Italy", "description": "Denmark has confirmed its first coronavirus infection in a man who returned from a ski holiday in northern Italy, the Danish health authority said on Thursday.", "url": "https://www.reuters.com/article/us-china-health-denmark-case-idUSKCN20L0IB", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T05:49:20Z", "content": "(Reuters) - Denmark has confirmed its first coronavirus infection in a man who returned from a ski holiday in northern Italy, the Danish health authority said on Thursday. \r\nThe man was put in isolation in his own home. \r\nReporting Jacob Gronholt-Pedersen; Ed… [+42 chars]"}, {"source": {"id": null, "name": "Americanthinker.com"}, "author": null, "title": "Hypocritical Democrats Block Born Alive Protection", "description": "Following Rahm Emanuel’s maxim that a crisis is a terrible thing to waste, Senate Minority Leader Chuck Schumer says the Trump reaction to the coronavirus is too little too late and quibbles over how much money is “enough” to fight ...", "url": "https://www.americanthinker.com/articles/2020/02/hypocritical_democrats_block_born_alive_protection.html", "urlToImage": "https://www.americanthinker.com/images/bucket/2020-02/219328.png", "publishedAt": "2020-02-27T06:00:00Z", "content": "Following Rahm Emanuel’s maxim that a crisis is a terrible thing to waste, Senate Minority Leader Chuck Schumer says the Trump reaction to the coronavirus is too little too late and quibbles over how much money is “enough” to fight a possible pandemic. Yet at… [+14443 chars]"}, {"source": {"id": null, "name": "Juancole.com"}, "author": "Juan Cole", "title": "Anti-Science and Opportunistic: Trump and Iran’s Ayatollahs both Play down Coronavirus", "description": "Ann Arbor (Informed Comment) - Christine Romans at CNN wonders if Trump's news conference on Wednesday evening on the Covid-19 coronavirus was his 'Mission Accomplished' moment. After he invaded Iraq in the spring of 2003, George W. Bush gave a triumphant spe…", "url": "https://www.juancole.com/2020/02/antiscience-trump-ayatollahs.html", "urlToImage": "https://media.juancole.com/images/2020/02/anti-science-and-opportunistic-t.jpg", "publishedAt": "2020-02-27T05:46:10Z", "content": "Ann Arbor (Informed Comment) – Christine Romans at CNN wonders if Trump’s news conference on Wednesday evening on the Covid-19 coronavirus was his “Mission Accomplished” moment. After he invaded Iraq in the spring of 2003, George W. Bush gave a triumphant spe… [+4207 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Saudi Arabia suspends entry for pilgrims over coronavirus", "description": "The government is \"suspending entry to the Kingdom for the purpose of Umrah and visiting the Prophet#39;s Mosque temporarily\", the foreign ministry said in a statement, referring to the Islamic pilgrimage to Mecca that can be undertaken at any time of year.", "url": "https://www.moneycontrol.com/news/world/saudi-arabia-suspends-entry-for-pilgrims-over-coronavirus-4982171.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/hajj-pilgrimage-770x433.jpg", "publishedAt": "2020-02-27T05:42:06Z", "content": "Saudi Arabia on Thursday suspended visas for pilgrims wishing to visit Mecca over coronavirus fears, the foreign ministry said.\r\nThe government is \"suspending entry to the Kingdom for the purpose of Umrah and visiting the Prophet's Mosque temporarily\", the fo… [+846 chars]"}, {"source": {"id": null, "name": "Offgridsurvival.com"}, "author": "Off Grid Survival", "title": "U.S Has Its First ‘Community Spread’ Coronavirus Case – Incompetent CDC Refused to Test Patient", "description": "U.S Has Its First ‘Community Spread’ Coronavirus Case – Incompetent CDC Refused to Test Patient A resident of Solano County, California, who has novel coronavirus might be the first example in the country of community spread, a situation in which the patient …", "url": "https://offgridsurvival.com/u-s-has-its-first-community-spread-coronavirus-case-incompetent-cdc-refused-to-test-patient/", "urlToImage": "https://offgridsurvival.com/wp-content/themes/church_10/images/2020/01/coronavirus.jpg", "publishedAt": "2020-02-27T05:47:21Z", "content": "Thanks in large part to the United States governments incompetent\r\nresponse to the Coronavirus outbreak, the United States now has its first\r\nCommunity Spread case of Coronavirus.\r\nA resident of Solano County, California, who has novel coronavirus\r\nmight be t… [+4376 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Expect Tokyo Olympics to go ahead as scheduled despite coronavirus concerns: Kiren Rijiju", "description": "The Olympic Games are scheduled to be held in July-August this year but a senior IOC member Dick Pound has said that the event might have to be cancelled if the deadly coronavirus outbreak is not brought under control by May.", "url": "https://www.moneycontrol.com/news/trends/sports-trends/expect-tokyo-olympics-to-go-ahead-as-scheduled-despite-coronavirus-concerns-kiren-rijiju-4982161.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/10/Kiren-Rijiju-770x433.jpg", "publishedAt": "2020-02-27T05:43:05Z", "content": "Sports Minister Kiren Rijiju on Thursday said he expects this year's Tokyo Olympics to go ahead smoothly despite fears being expressed over the fate of the Games amid the novel coronavirus threat.\r\nThe Olympic Games are scheduled to be held in July-August thi… [+913 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Lauren Ward, Skift", "title": "Puerto Rico Events Sector Grows, Fueled by First Hotel Launch in El Distrito", "description": "Puerto Rico has seen its share of setbacks recently, but a fresh approach to experiential events paired with the launch of a tech-centered complex make the island an emerging leader for destination events. -Lauren Ward", "url": "https://skift.com/2020/02/27/puerto-rico-events-sector-grows-fueled-by-first-hotel-launch-in-el-distrito/", "urlToImage": "https://skift.com/wp-content/uploads/2020/02/ALOFT-El-Distrito_Credit-Aloft-San-Juan-scaled-e1582647746566.jpg", "publishedAt": "2020-02-27T05:30:03Z", "content": "Despite challenges from earthquakes and the loss of a major event in early 2020, Puerto Ricos efforts to become a premier event destination are finally coming to fruition. Discover Puerto Rico CEO Brad Dean largely credits a new approach to event planner site… [+3977 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Denmark Reportedly Registers Its First Coronavirus Case", "description": "The deadly disease hit Europe earlier this month with a major outbreak in Italy. According to authorities, 332 individuals have been infected with coronavirus in the country, while many European states have reported their first cases.", "url": "https://sputniknews.com/europe/202002271078415766-denmark-reportedly-registers-its-first-coronavirus-case/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107831/03/1078310315.jpg", "publishedAt": "2020-02-27T05:46:42Z", "content": null}, {"source": {"id": null, "name": "Wired.co.uk"}, "author": "Chris Stokel-Walker", "title": "Iran’s coronavirus outbreak makes no sense. What’s really going on?", "description": "Iran says it has fewer than 100 coronavirus cases, but the number of deaths points to a much higher number of infections – and that’s bad news for us all", "url": "https://www.wired.co.uk/article/iran-coronavirus-cases", "urlToImage": "https://wi-images.condecdn.net/image/V0bO84NvbaY/crop/1440/0.5235602094240838/f/wired-iran-corona.jpg", "publishedAt": "2020-02-27T06:00:00Z", "content": "For six weeks after China first reported details of a previously-unknown coronavirus spreading in the city of Wuhan, the disease now called Covid-19 stayed mostly confined to China. But in the last two weeks, major outbreaks have sprung up outside the country… [+7275 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "David P. Barash Ph.D.", "title": "Would Our Extinction Be Bad?", "description": "We're not about to go extinct because of the latest virus. But there are other creatures who probably wouldn't care, and might even celebrate, if we did.", "url": "https://www.psychologytoday.com/us/blog/peace-and-war/202002/would-our-extinction-be-bad", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-02/1920px-1ghost_bats-6.jpg?itok=LVpwP5JA", "publishedAt": "2020-02-27T05:27:58Z", "content": "I dont know and I doubt that anyone does whether we (as a species or a country) are over-reacting to the threat posed by the coronavirus, or under-reacting, or getting it about right. But as someone who feels strongly that Homo sapiens has done an immense amo… [+2208 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Gold Prices Rise as U.S. Confirms First Community Transmission of Coronavirus - Investing.com", "description": "Gold Prices Rise as U.S. Confirms First Community Transmission of Coronavirus Investing.com Gold prices rise today but still down over ₹1,000 per gram in three days Livemint Gold set for third monthly gain; pandemic fears lift rate-cut bets CNBC Gold price to…", "url": "https://www.investing.com/news/commodities-news/gold-prices-rise-as-us-confirms-first-community-transmission-of-coronavirus-2095401", "urlToImage": "https://i-invdn-com.akamaized.net/news/LYNXMPED1M0ED_L.jpg", "publishedAt": "2020-02-27T05:53:00Z", "content": "By Alex Ho\r\nInvesting.com - Gold prices rose again on Thursday in Asia after the U.S. confirmed the first possible “community spread” of the coronavirus in thecountry. \r\nGold Futures for April delivery gained 0.6% to $1,652.65.\r\nThe yellow metal is trading ne… [+1401 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus patient at UC Davis Medical Center since Feb. 19 wasn’t tested for days - Sacramento Bee", "description": "Coronavirus patient at UC Davis Medical Center since Feb. 19 wasn’t tested for days Sacramento Bee If coronavirus spreads within the US, here's how daily life might change CNN California is monitoring at least 8,400 people for the coronavirus CNBC CDC Issues …", "url": "https://news.google.com/__i/rss/rd/articles/CBMiN2h0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9sb2NhbC9hcnRpY2xlMjQwNjgyMzExLmh0bWzSATdodHRwczovL2FtcC5zYWNiZWUuY29tL25ld3MvbG9jYWwvYXJ0aWNsZTI0MDY4MjMxMS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-02-27T05:28:00Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Congress govt in Punjab suffering from #39;karo na#39; virus: Opposition", "description": "\"Employees have not been given anything in the last three years. Be it pending dearness allowance and arrears,\" Shiromani Akali Dal leader Parambans Singh Romana said outside the Assembly.", "url": "https://www.moneycontrol.com/news/politics/congress-govt-in-punjab-suffering-from-karo-na-virus-opposition-4982291.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/08/Congress-770x433-770x433.jpg", "publishedAt": "2020-02-27T06:09:05Z", "content": "The Opposition in Punjab Assembly held a protest outside the House against the Congress-led government on Thursday, alleging that the current dispensation was suffering from the \"Karo na (don't do) virus\".\r\n\"Employees have not been given anything in the last … [+759 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Rupee rises 5 paise to 71.60 against U.S. dollar in early trade", "description": "Forex traders said easing crude oil prices and weakening of the American currency vis-a-vis other currencies overseas supported the rupee, while weak opening in domestic equities and sustained foreign fund outflows weighed on the local unit.", "url": "https://www.thehindu.com/business/markets/rupee-rises-5-paise-to-7160-against-us-dollar-in-early-trade/article30929022.ece", "urlToImage": "https://www.thehindu.com/business/mhyd16/article30734798.ece/ALTERNATES/LANDSCAPE_615/21-ISBS-RICH-POGU870IAK53jpgjpg-123", "publishedAt": "2020-02-27T05:22:31Z", "content": "The Indian rupee appreciated by 5 paise to 71.60 against the U.S. dollar in early trade on Thursday amid easing crude oil prices and weakening of the greenback in the overseas market.\r\n Forex traders said easing crude oil prices and weakening of the American … [+1664 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "First person in U.S. tests positive for coronavirus with no known link to foreign travel (Washington Post)", "description": "Washington Post : First person in U.S. tests positive for coronavirus with no known link to foreign travel — A person in Northern California has contracted the coronavirus without traveling to regions hit by the outbreak or coming in contact with anyone known…", "url": "https://www.memeorandum.com/200227/p1", "urlToImage": "https://www.washingtonpost.com/resizer/6Xa4FlFn7vztm4Hz1Zo22ai6u6k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCTPV4SZAAI6VEAA6PH75YRQGY.jpg", "publishedAt": "2020-02-27T06:10:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Cointelegraph.com"}, "author": "Cointelegraph By Samuel Haig", "title": "Virgin Galactic CEO: Everyone Should Have 1% of their Assets in Bitcoin", "description": "Virgin Galactic’s chief executive believes that every person should invest 1% of their net wealth in Bitcoin as crisis insurance", "url": "https://cointelegraph.com/news/virgin-galactic-ceo-everyone-should-have-1-of-their-assets-in-bitcoin", "urlToImage": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8yNDFlZTNjMGY4YWViY2E5ZmIwMDQ5OTk4YTNlMjg5Yy5qcGc=.jpg", "publishedAt": "2020-02-27T06:09:00Z", "content": "Chamath Palihapitiya, the billionaire chairman of spaceflight company Virgin Galactic, has recommended that everyone hold Bitcoin (BTC) as a form of crisis insurance. \r\nSpeaking on CNBC’s Squawk Box, Palihapitiya said he believes that “everybody should probab… [+2304 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Sarah K. Burris", "title": "‘Rather than leading — he lies’: MSNBC panel says Trump is a ‘danger to the country’ because he can’t be trusted", "description": "MSNBC commentators, former assistant US Attorney Maya Wiley and Rick Wilson, explained that President Donald Trump’s most significant barrier is making it past his own lies to save America from the coronavirus. “There’s a case tonight being tested in Walton C…", "url": "https://www.rawstory.com/2020/02/rather-than-leading-he-lies-msnbc-panel-says-trump-is-a-danger-to-the-country-because-he-cant-be-trusted/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-27-at-12.09.43-AM.png", "publishedAt": "2020-02-27T05:14:36Z", "content": "MSNBC commentators, former assistant US Attorney Maya Wiley and Rick Wilson, explained that President Donald Trump’s most significant barrier is making it past his own lies to save America from the coronavirus.\r\n“There’s a case tonight being tested in Walton … [+1915 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | Saudi Arabia suspends entry for Mecca pilgrims over coronavirus", "description": "Saudi Arabia has suspended visas for pilgrims wishing to visit Mecca over coronavirus fears, the foreign ministry has said.", "url": "https://www.news24.com/World/News/saudi-arabia-suspends-entry-for-mecca-pilgrims-over-coronavirus-20200227", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/7060/de7d980911a94bf486c4b1520e6c82c5.jpg", "publishedAt": "2020-02-27T05:34:22Z", "content": "Saudi Arabia on Thursday suspended visas for pilgrims wishing to visit Mecca over coronavirus fears, the foreign ministry said.\r\nThe government is \"suspending entry to the Kingdom for the purpose of Umrah and visiting the Prophet's Mosque temporarily\", the fo… [+722 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "New US coronavirus case may be 1st from unknown origin", "description": "Hospital says it was four days before the CDC heeded a request to test the patient for COVID-19; patient has no known connection to travel abroad or any other cases", "url": "https://www.timesofisrael.com/new-us-coronavirus-case-may-be-1st-from-unknown-origin/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/02/AP_20048065112016-1024x640.jpg", "publishedAt": "2020-02-27T06:01:55Z", "content": "LOS ANGELES (AP) A new coronavirus case in California could be the first in the US that has no known connection to travel abroad or another known case, a possible sign the virus is spreading in a US community, health officials said.\r\nThe Centers for Disease C… [+3597 chars]"}, {"source": {"id": null, "name": "Retireby40.org"}, "author": "retirebyforty", "title": "Should We Worry About The Coronavirus?", "description": "Well, it looks like investors are finally taking the coronavirus seriously. The stock market plunged this week and turned negative for the year. I was wondering when this was going to happen. Just a week ago, investors were ignoring the coronavirus and the st…", "url": "https://retireby40.org/should-we-worry-about-the-coronavirus/", "urlToImage": "https://retireby40.org/wp-content/uploads/2020/02/corona-twitter.jpg", "publishedAt": "2020-02-27T06:00:13Z", "content": "Well, it looks like investors are finally taking the coronavirus seriously. The stock market plunged this week and turned negative for the year. I was wondering when this was going to happen. Just a week ago, investors were ignoring the coronavirus and the st… [+4830 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "Forex Today: Coronavirus pandemic fears intensify, US 10-year T-yields hit fresh record lows", "description": "With the coronavirus pandemic fears intensifying each passing day, especially after the World Health Organization (WHO) said that the virus is spreadi", "url": "https://www.fxstreet.com/news/forex-today-coronavirus-pandemic-fears-intensify-us-10-year-t-yields-hit-fresh-record-lows-202002270551", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/China/coronavirus2_Large.jpg", "publishedAt": "2020-02-27T05:51:12Z", "content": "With the coronavirus pandemic fears intensifying each passing day, especially after the World Health Organization (WHO) said that the virus is spreading faster outside China, the risk sentiment remained soured in Thursday’s Asian trading.\r\nMarkets shunned ris… [+4024 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Yohay Elam", "title": "Gold Price Analysis: $1,652 resistance critical after Trump's coronavirus speech – Confluence Detector", "description": "Coronavirus news continues hogging the headlines as President Donald Trump addressed the press about the outbreak. Gold, the safe-haven asset, has sta", "url": "https://www.fxstreet.com/news/gold-price-analysis-1-652-resistance-critical-after-trumps-coronavirus-speech-confluence-detector-202002270550", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Commodities/Metals/Gold/aurum-37842316_Large.jpg", "publishedAt": "2020-02-27T05:50:16Z", "content": "Coronavirus news continues hogging the headlines as President Donald Trump addressed the press about the outbreak. Gold, the safe-haven asset, has stabilized after a massive rally. What are the technical levels to watch in XAU/USD? \r\nThe Technical Confluences… [+1643 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "Asian stocks outside China remain depressed due to coronavirus", "description": "The first case of coronavirus in the US, coupled with President Donald Trump’s measured comments, escalate the fears that the Chinese virus is yet to", "url": "https://www.fxstreet.com/news/asian-stocks-outside-china-remain-depressed-due-to-coronavirus-202002270601", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Equities/display-panel-of-daily-stock-market-59908972_Large.jpg", "publishedAt": "2020-02-27T06:01:17Z", "content": "<ul><li>MSCI’s index of Asia-Pacific shares outside Japan declines more than 4.0% this week.</li><li>The US and Aussie 10-year Treasury yields drop the fresh record low.</li><li>Coronavirus is spreading faster outside China, likely to affect the global supply… [+1383 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "USD/JPY attacks 110.00 as US 10-year treasury yields flash fresh record lows", "description": "USD/JPY seesaws around 110.10, down 0.30%, following its brief dip to the intra-day low of 109.9950, ahead of the European open on Thursday.", "url": "https://www.fxstreet.com/news/usd-jpy-attacks-11000-as-us-10-year-treasury-yields-flash-fresh-record-lows-202002270530", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/USDJPY/japanese-10000-yen-and-100-dollar-bills-14367199_Large.jpg", "publishedAt": "2020-02-27T05:30:44Z", "content": "<ul><li>USD/JPY keeps the losses as coronavirus-led risk-off continues.</li><li>The US 10-year treasury yields, equity futures keep dwindle as President Trump failed to hide the fears.</li><li>US data, Coronavirus task force meeting in the spotlight.</li></ul… [+1596 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "SAS Airline Crashes on Stock Exchange Amid Failed Globalist Ad, Coronavirus Fears", "description": "Earlier in February, Scandinavia's largest airline enraged many customers with its overtly globalist ad claiming that there is no such thing as being Scandinavian and that all of Scandinavia's inventions or cultural expressions commonly associated with the re…", "url": "https://sputniknews.com/business/202002271078415606-sas-airline-crashes-on-stock-exchange-amid-failed-globalist-ad-coronavirus-fears/", "urlToImage": "https://cdn5.img.sputniknews.com/images/105319/21/1053192121.jpg", "publishedAt": "2020-02-27T05:39:07Z", "content": "Earlier in February, Scandinavia's largest airline enraged many customers with its overtly globalist ad claiming that there is no such thing as being Scandinavian and that all of Scandinavia's inventions or cultural expressions commonly associated with the re… [+3390 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Virus strikes another blow at religious tourism in Iraq", "description": "In the southern Shiite holy city of Karbala, hotels have closed and face masks are more common on the street than the full-length black veils worn by female pilgrims.", "url": "https://www.moneycontrol.com/news/world/virus-strikes-another-blow-at-religious-tourism-in-iraq-4982301.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-1-770x433.jpg", "publishedAt": "2020-02-27T06:11:05Z", "content": "Iraq's vital religious tourism sector was already suffering after months of protests, political turmoil and sanctions hitting pilgrims from neighbouring Iran - then the novel coronavirus arrived.\r\nIn the southern Shiite holy city of Karbala, hotels have close… [+4268 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Pablo Piovano", "title": "Indonesia: Coronavirus fears prompt new incentive programs – UOB", "description": "Haris Handy and Economist Enrico Tanuwidjaja at UOB Group reviewed the recently announced incentive programs in Indonesia. Key Quotes “Indonesia’s gov", "url": "https://www.fxstreet.com/news/indonesia-coronavirus-fears-prompt-new-incentive-programs-uob-202002270608", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/Indonesia/farmer-thresh-rice-bali-indonesia-34095940_Large.jpg", "publishedAt": "2020-02-27T06:08:25Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribers)", "title": "Booking Holdings Inc. (BKNG) Q4 2019 Earnings Call Transcript", "description": "BKNG earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/27/booking-holdings-inc-bkng-q4-2019-earnings-call-tr.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-27T05:31:04Z", "content": "Image source: The Motley Fool.\r\nBooking Holdings Inc. (NASDAQ:BKNG)Q4 2019 Earnings CallFeb 26, 2020, 4:30 p.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nWelcome to Bo… [+69332 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Shincheonji: The secretive sect in South Korea's COVID-19 outbreak", "description": "The secretive South Korean religious group at the centre of the country's new coronavirus outbreak is a sprawling network so wealthy it can mobilise thousands of believers to hold Pyongyang-style mass performances at Seoul's Olympic stadium.", "url": "https://www.channelnewsasia.com/news/asia/coronavirus-shincheonji-secretive-sect-south-korea-covid19-12475122", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12475120/16x9/991/557/ae3ee52f259d594a443b5b110993df42/fp/shincheonji----a-secretive-religious-group-in-south-korea----proclaims-its-founder-has-donned-the-mantle-of-jesus-christ-and-will-take-144000-people-with-him-to-heaven-on-the-day-of-judgement-1582777180395-2.jpg", "publishedAt": "2020-02-27T06:04:16Z", "content": "SEOUL: The secretive South Korean religious group at the centre of the country's new coronavirus outbreak is a sprawling network so wealthy it can mobilise thousands of believers to hold Pyongyang-style mass performances at Seoul's Olympic stadium.\r\nIt has mo… [+3899 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "David A. Savage and Benno Torgler, The Conversation", "title": "Here's The Difference Between 'Panic Buying' And Reasonably Preparing For a Crisis", "description": "Recent days have brought reports of shoppers clearing out supermarket shelves from Wuhan and Hong Kong to Singapore and Milan in response to the spread of coronavirus. This behaviour is often described as \"panic buying\".", "url": "https://www.sciencealert.com/reasonable-preparations-before-a-crisis-isn-t-panic-buying-here-s-the-difference", "urlToImage": "https://www.sciencealert.com/images/2020-02/processed/panic_buy_rational_1024.jpg", "publishedAt": "2020-02-27T05:54:59Z", "content": "Recent days have brought reports of shoppers clearing out supermarket shelves from Wuhan and Hong Kong to Singapore and Milan in response to the spread of coronavirus. This behaviour is often described as \"panic buying\".\r\nHowever, the research shows that what… [+5398 chars]"}, {"source": {"id": null, "name": "Worldsoccertalk.com"}, "author": "AFP", "title": "Chinese football transfer market collapses in face of coronavirus", "description": "Hong Kong (AFP) – A double blow of the coronavirus and a new salary cap has seen the bottom fall out of Chinese football’s transfer market, while Odion Ighalo led what could become an exodus...", "url": "https://worldsoccertalk.com/2020/02/27/chinese-football-transfer-market-collapses-in-face-of-coronavirus/", "urlToImage": "https://worldsoccertalk.com/wp-content/uploads/2020/02/d82c8af2323edb1104f02eb247ceaff3d80489be.jpg", "publishedAt": "2020-02-27T05:50:10Z", "content": "Hong Kong (AFP) – A double blow of the coronavirus and a new salary cap has seen the bottom fall out of Chinese football’s transfer market, while Odion Ighalo led what could become an exodus of foreign stars.Shanghai SIPG smashed the Asian transfer record whe… [+2218 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "BOJ’s Kataoka: Must send message to markets that it will not tolerate price falls", "description": "The Bank of Japan (BOJ) board member Kataoka is back on the wires now, via Reuters, noting that BOJ must send message to markets that it will not tole", "url": "https://www.fxstreet.com/news/bojs-kataoka-must-send-message-to-markets-that-it-will-not-tolerate-price-falls-202002270607", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/CentralBanks/BOJ/Haruhiko_Kuroda_-_World_Economic_Forum_Annual_Meeting_Davos_2010_Large.jpg", "publishedAt": "2020-02-27T06:07:58Z", "content": "The Bank of Japan (BOJ) board member Kataoka is back on the wires now, via Reuters, noting that BOJ must send message to markets that it will not tolerate price falls.Doesn't think additional easing is needed against coronavirus risks.\r\nIt is most important f… [+680 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "AP", "title": "World battles coronavirus epidemic as cases multiply outside China", "description": "About 81,000 people around the globe have been sickened by the coronavirus", "url": "https://indianexpress.com/article/world/coronavirus-epidemic-china-south-korea-japan-us-6288943/", "urlToImage": "https://images.indianexpress.com/2020/02/coronavirus-south-korea-759.jpg?w=759", "publishedAt": "2020-02-27T05:38:12Z", "content": "By: AP | Seoul, South Korea | \r\nPublished: February 27, 2020 11:08:12 am\r\nWorries over the ever-expanding economic fallout of the COVID-19 crisis multiplied, with factories idled, trade routes frozen and tourism crippled, while a growing list of nations brace… [+8268 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Stock markets taken sick again on speed of coronavirus spread", "description": "Stock markets are falling sharply again as countries report a surge in coronavirus cases - bolstering investor fears that the outbreak will cause widespread economic damage.", "url": "https://news.sky.com/story/coronavirus-stock-markets-taken-sick-again-on-speed-of-spread-11944193", "urlToImage": "https://e3.365dm.com/19/12/1600x900/skynews-financial-markets-brexit-election_4858372.jpg?20191206123726", "publishedAt": "2020-02-27T05:47:00Z", "content": null}, {"source": {"id": null, "name": "Politico.eu"}, "author": "Matthew Choi", "title": "Trump puts Pence in charge of coronavirus response", "description": "In naming Pence, Trump defied calls to appoint an outside expert to coordinate the response.", "url": "http://www.politico.eu/article/trump-puts-pence-in-charge-of-coronavirus-response/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2020/02/GettyImages-1208916326-1024x628.jpg", "publishedAt": "2020-02-27T05:30:50Z", "content": "U.S. President Donald Trump speaks at the beginning of a press conference with members of the coronavirus task force, including Vice President Mike Pence | Tasos Katopodis/Getty Images\r\nDonald Trump appointed his Vice President Mike Pence to lead a task force… [+5312 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Selloff in US markets due to virus not significant: Johnson", "description": "The selloff is not nearly as significant as one would have expected given this high level of uncertainty and that gives me some optimism, says the Chairman and Chief Investment Officer of Hugh Johnson Advisors", "url": "https://economictimes.indiatimes.com/markets/expert-view/selloff-in-global-and-us-markets-due-to-virus-not-significant-hugh-albert-johnson/articleshow/74330022.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74330042,width-1070,height-580,imgsize-172355,overlay-etmarkets/photo.jpg", "publishedAt": "2020-02-27T06:03:44Z", "content": "Let us take your view on the entire global markets. Trump actually came out and said that coronavirus could worsen but the US is prepared. But how prepared is the US? Do you think they are prepared enough to counter this particular virus?If there is one word … [+3180 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Pablo Piovano", "title": "US Dollar Index looks weak below 99.00 ahead of key data", "description": "The greenback, when tracked by the US Dollar Index (DXY), is trading on the defensive and navigates the area below the key 99.00 mark in the second ha", "url": "https://www.fxstreet.com/news/us-dollar-index-looks-weak-below-9900-ahead-of-key-data-202002270553", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/DollarIndex/macroeconomics-1775959_Large.jpg", "publishedAt": "2020-02-27T05:53:40Z", "content": "<ul><li>DXY breaks below the 99.00 barrier on Thursday.</li><li>Coronavirus stays in centre stage and spreads outside China.</li><li>Flash Q4 GDP, Durable Goods Orders, Claims, housing data next on tap.</li></ul>The greenback, when tracked by the US Dollar In… [+1708 chars]"}, {"source": {"id": null, "name": "Euobserver.com"}, "author": "EUobserver", "title": "[Ticker] Unionist parties criticise talks between Spain and Catalonia", "description": "The head of the Spanish People's Party, Pablo Casado, said on Wednesday that the bilateral negotiation between Spain and Catalonia would break up Spain's sovereignty. \"[Spanish prime minister] is even taking the health minister with him [to talks with the Cat…", "url": "https://euobserver.com/tickers/147570", "urlToImage": "https://s3.eu-central-1.amazonaws.com/euobs-media/6e5f90e3e78121ba09aefe7419b47a16-480x.jpg", "publishedAt": "2020-02-27T06:07:45Z", "content": "Opinion\r\nToday, 07:09As the European Commission meets the African Union in the Ethiopian capital, Addis Ababa, on Thursday, prior to a new EU-Africa strategy, the obsolete donor-recipient mentality must be junked, writes European Parliament development commit… [+27 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP Relax News", "title": "Saudi Arabia suspends entry for pilgrims over coronavirus", "description": "Saudi Arabia on Thursday suspended visas for pilgrims wishing to visit Mecca over coronavirus fears, the foreign ministry said. The government is \"suspending entry to the Kingdom for the purpose of Umrah and visiting the Prophet's Mosque temporarily\", the for…", "url": "https://news.yahoo.com/saudi-arabia-suspends-entry-pilgrims-over-coronavirus-060717932.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sD2s0e5QkZm9MU.rFbLSxw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NTQuMTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/K4xy67MQ8g5aHP2LInffVg--~B/aD0yNDAwO3c9NDA3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/000_18i1he.5dc67121619.original.jpg", "publishedAt": "2020-02-27T06:07:17Z", "content": "Saudi Arabia on Thursday suspended visas for pilgrims wishing to visit Mecca over coronavirus fears, the foreign ministry said.\r\nThe government is \"suspending entry to the Kingdom for the purpose of Umrah and visiting the Prophet's Mosque temporarily\", the fo… [+723 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "D-Street Buzz: Metal stocks tumble led by JSW Steel; YES Bank up 2%, VIX jumps", "description": "About 504 shares have advanced, 1470 shares declined, and 94 shares are unchanged.", "url": "https://www.moneycontrol.com/news/business/markets/d-street-buzz-metal-stocks-tumble-led-by-jsw-steel-yes-bank-up-2-vix-jumps-4982141.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/12/DealingRoom_Sensex_Nifty_Market_Broker-770x433-770x433.jpg", "publishedAt": "2020-02-27T06:04:35Z", "content": "Coronavirus outbreak is fast developing into a pandemic and that has unnerved investors as the Indian stock market have fallen for the fifth consecutive day.\r\nSensex is down 382.37 points or 0.96 percent at 39506.59, and the Nifty shed 115 points and is tradi… [+1922 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Haidar Hamdani with Salman Ameen in Karbala", "title": "Virus strikes another blow at religious tourism in Iraq", "description": "Iraq's vital religious tourism sector was already suffering after months of protests, political turmoil and sanctions hitting pilgrims from neighbouring Iran -- then the novel coronavirus arrived. In the southern Shiite holy city of Karbala, hotels have close…", "url": "https://news.yahoo.com/virus-strikes-another-blow-religious-tourism-iraq-052631587.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/grl7BSl0P5CPl7YHLpfrAg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/tV6MwfKxI35puJg0qfZ2hA--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/4dbfa5ea8518ca0d2668583575531a8419532d2c.jpg", "publishedAt": "2020-02-27T05:26:31Z", "content": "Najaf (Iraq) (AFP) - Iraq's vital religious tourism sector was already suffering after months of protests, political turmoil and sanctions hitting pilgrims from neighbouring Iran -- then the novel coronavirus arrived.\r\nIn the southern Shiite holy city of Karb… [+4225 chars]"}, {"source": {"id": null, "name": "Americanthinker.com"}, "author": null, "title": "The Democrat response to the coronavirus is scarier than the virus", "description": "The Democrats claim Trump is mishandling the coronavirus threat and that they’d do better. They’re wrong. Their proposals are redundant, vapid, or dangerous. \r\n\r\nDuring the recent debate, three candidates discussed coronavirus:\r\n\r\nAmy Klo...", "url": "https://www.americanthinker.com/blog/2020/02/the_democrat_response_to_the_coronavirus_is_scarier_than_the_virus.html", "urlToImage": "https://www.americanthinker.com/images/bucket/2020-02/219332.jpg", "publishedAt": "2020-02-27T06:00:00Z", "content": "The Democrats claim Trump is mishandling the coronavirus threat and that they’d do better. They’re wrong. Their proposals are redundant, vapid, or dangerous. \r\nDuring the recent debate, three candidates discussed coronavirus:\r\nAmy Klobuchar urged treatment an… [+10668 chars]"}, {"source": {"id": null, "name": "Dailyfintech.com"}, "author": "Pat Kelahan", "title": "Dominoes fall- business disruption and risk management in the COVID 19 environment", "description": "It’s clear there is much of which to be concerned regarding novel Coronavirus 2019 (aka COVID 19), including the direct impact of illness and death among those who have contracted the disease, and the indirect effect of closure of travel, quarantine, closures…", "url": "https://dailyfintech.com/2020/02/27/dominoes-fall-business-disruption-and-risk-management-in-the-covid-19-environment/", "urlToImage": "https://dailyfintech.com/wp-content/uploads/2020/02/th-1.jpg", "publishedAt": "2020-02-27T06:00:07Z", "content": "Its clear there is much of which to be concerned regarding novel Coronavirus 2019 (aka COVID 19), including  the direct impact of illness and death among those who have contracted the disease, and the indirect effect of closure of travel, quarantine, closures… [+10304 chars]"}, {"source": {"id": null, "name": "Theonlinecitizen.com"}, "author": "S.Ling", "title": "Source of new Covid-19 case in California is unknown; community spread of virus may happen in US", "description": "A confirmed case of Covid-19 of a person who appeared to not have relevant travel history to China or been exposed to another infected patient could be an instance of community spread of the coronavirus, said the United States Centers for Disease Control and …", "url": "https://www.theonlinecitizen.com/2020/02/27/source-of-new-covid-19-case-in-california-is-unknown-community-spread-of-virus-may-happen-in-us/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/02/featured-image-corona-test-wuhan-768x384-1.png", "publishedAt": "2020-02-27T05:34:39Z", "content": "A confirmed case of Covid-19 of a person who appeared to not have relevant travel history to China or been exposed to another infected patient could be an instance of community spread of the coronavirus, said the United States Centers for Disease Control and … [+1831 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP Relax News", "title": "North Korea extends school breaks over virus fears", "description": "North Korea has postponed the new school term to prevent the spread of the new coronavirus, reports said Thursday, the latest measure as the ill-equipped country ramps up efforts to prevent a devastating outbreak. Pyongyang has not reported a single case of t…", "url": "https://news.yahoo.com/north-korea-extends-school-breaks-over-virus-fears-055849955.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/DZz5VRf5DQavHs6HfQuZeQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/p7hhgMOiw1BeiBDOKJLY8Q--~B/aD00MjM4O3c9NjM1MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/000_hkg8836417.1e8c7082459.original.jpg", "publishedAt": "2020-02-27T05:58:49Z", "content": "North Korea has postponed the new school term to prevent the spread of the new coronavirus, reports said Thursday, the latest measure as the ill-equipped country ramps up efforts to prevent a devastating outbreak.\r\nPyongyang has not reported a single case of … [+1913 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "LAURAN NEERGAARD and RICARDO ALONSO-ZALDIVAR", "title": "Trump urges calm even as US reports worrisome new virus case", "description": "WASHINGTON (AP) — President Donald Trump declared Wednesday that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn’t inevitable even as top health authorities at his side warned Americans that more infections are coming. Shortly a…", "url": "https://www.seattletimes.com/seattle-news/health/trump-urges-calm-even-as-us-reports-worrisome-new-virus-case/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-37f7a2ce5392c7d3b433df41fcdab66bTrump_Virus_Outbreak_33510-1200x630.jpg", "publishedAt": "2020-02-27T05:24:07Z", "content": "WASHINGTON (AP) President Donald Trump declared Wednesday that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn’t inevitable even as top health authorities at his side warned Americans that more infections are coming.\r\nShortly af… [+5880 chars]"}, {"source": {"id": null, "name": "Protothema.gr"}, "author": "ProtoThema.gr", "title": "Supermarket customers puch it out in Italian city quarantined due to coronavirus (video)", "description": "<div class=\"entry-excerpt-in\">\r\n<p>The town is among ten Italian cities quarantined</p>\r\n</div>\r\n<div class=\"entry-content\"></div>", "url": "https://www.protothema.gr/english-news/article/978846/supermarket-customers-puch-it-out-in-italian-city-quarantined-due-to-coronavirus-video/", "urlToImage": "https://i1.prth.gr/images/640x360share/files/2020-02-26/ita55.jpg", "publishedAt": "2020-02-27T05:30:00Z", "content": "The town is among ten Italian cities quarantined"}, {"source": {"id": null, "name": "Protothema.gr"}, "author": "ProtoThema.gr", "title": "Porn site offers free access to people living in coronavirus-affected area (which areas are they?)", "description": "<div class=\"entry-excerpt-in\">\r\n<p>xHamster is encouraging people to stay inside to help battle the disease</p>\r\n</div>\r\n<div class=\"entry-content\"></div>", "url": "https://www.protothema.gr/english-news/article/978845/porn-site-offers-free-access-to-people-living-in-coronavirus-affected-area-which-areas-are-they/", "urlToImage": "https://i1.prth.gr/images/640x360share/files/2020-02-26/xham66.png", "publishedAt": "2020-02-27T06:00:00Z", "content": "xHamster is encouraging people to stay inside to help battle the disease"}, {"source": {"id": null, "name": "Thejournal.ie"}, "author": "Dominic McGrath", "title": "Countries around the world are assessing Covid-19's impact on St Patrick's Day celebrations", "description": "In some countries, St Patrick’s Day events have already been cancelled.", "url": "https://www.thejournal.ie/st-patricks-day-worldwide-japan-china-coronavirus-london-5022758-Feb2020/", "urlToImage": "https://img2.thejournal.ie/article/5022758/river/?height=400&version=5022837", "publishedAt": "2020-02-27T06:00:30Z", "content": "AS THE GOVERNMENT considers whether Dublins St Patricks Day parade should go ahead, other countries around the world are facing similar dilemmas about the fate of their 17 March celebrations in the wake of the coronavirus outbreak. \r\nA decision on the upcomin… [+4562 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "AFP", "title": "Virus-hit Iran slaps curbs on travel, shrine visits", "description": "Weekly Friday prayers will be suspended due to outbreak.", "url": "https://www.freemalaysiatoday.com/category/world/2020/02/27/virus-hit-iran-slaps-curbs-on-travel-shrine-visits/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/Iran-coronavirus-subway-clean-270220-AP.jpg", "publishedAt": "2020-02-27T05:42:28Z", "content": "Workers disinfect subway trains against coronavirus in Tehran on Feb 26. (AP pic)\r\nTEHRAN: Iranian authorities on Wednesday announced domestic travel restrictions for people with confirmed or suspected cases of the novel coronavirus, which has claimed 19 live… [+4742 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "AFP", "title": "Parade marking plague goes on in spite of Covid-19 fears", "description": "Italy, with 12 deaths reported, has attempted to cancel many cultural and sporting events.", "url": "https://www.freemalaysiatoday.com/category/leisure/2020/02/27/parade-marking-plague-goes-on-in-spite-of-covid-19-fears/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/Parade-Lifestyl-Masked-revellers-270220-AFP-.jpg", "publishedAt": "2020-02-27T06:00:09Z", "content": "Masked revellers take part in the ‘Plague Doctors’ Procession on Saint Mark Square in Venice. Other Carnival festivities have been cancelled following an outbreak of the Covid-19 novel coronavirus in northern Italy. (AFP pic)\r\nVENICE: Cloaked in black with th… [+1481 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "LAURAN NEERGAARD and RICARDO ALONSO-ZALDIVAR Associated Press", "title": "Trump urges calm even as US reports worrisome new virus case", "description": "President Donald Trump says the U.S. is “very, very ready” for whatever the new coronavirus threat brings, even as health authorities warn Americans that more infections are coming", "url": "https://abcnews.go.com/Health/wireStory/trump-urges-calm-us-reports-worrisome-virus-case-69250000", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_d64dd6b4b01a4b769f93630171649f0a_16x9_992.jpg", "publishedAt": "2020-02-27T05:24:33Z", "content": "WASHINGTON -- \r\nPresident Donald Trump declared Wednesday that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn't inevitable even as top health authorities at his side warned Americans that more infections are coming.\r\nShortly af… [+5876 chars]"}, {"source": {"id": null, "name": "Americanthinker.com"}, "author": null, "title": "Despite a hostile press, Trump’s coronavirus press conference hit the right notes", "description": "President Trump held a press conference on Wednesday to discuss coronavirus. Although many in the assembled press wanted to play “gotcha,” Trump struck a great balance between relaxed and serious and refused to play the media’s game...", "url": "https://www.americanthinker.com/blog/2020/02/despite_a_hostile_press_trumps_coronavirus_press_conference_hit_the_right_notes.html", "urlToImage": "https://www.americanthinker.com/images/bucket/2020-02/219327.jpg", "publishedAt": "2020-02-27T06:00:00Z", "content": "President Trump held a press conference on Wednesday to discuss coronavirus. Although many in the assembled press wanted to play “gotcha,” Trump struck a great balance between relaxed and serious and refused to play the media’s game. It was the perfect mien t… [+9174 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "Vineet Washington", "title": "CD Projekt Red, PUBG Corp Won't Attend PAX East Due to Coronavirus Outbreak", "description": "CD Projekt Red, PUBG Corp, and Thatgamecompany have joined the growing list of attendees to cancel their plans for PAX East. CD Projekt Red will still attend the Game Developers Conference in San Francisco.", "url": "https://gadgets.ndtv.com/games/news/cd-projekt-red-pubg-corp-thatgamecompany-coronavirus-pax-east-gdc-2186448", "urlToImage": "https://i.gadgets360cdn.com/large/CD_projekt_red_1582783190033.jpg", "publishedAt": "2020-02-27T06:01:54Z", "content": "CD Projekt Red and PUBG Corp have been added to list of cancellations for PAX East, which was scheduled for February 27 in Boston. The latter cited concerns over coronavirus for cancelling their participation in the event. CD Projekt Red's communications lead… [+1744 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "Denmark confirms first COVID-19 case in man returning from holiday in Italy", "description": "The man was put in isolation in his own home.", "url": "https://www.thehindu.com/news/international/denmark-confirms-first-coronavirus-case-in-man-returning-from-holiday-in-italy/article30929153.ece", "urlToImage": "https://www.thehindu.com/news/international/5zxcwe/article30789473.ece/ALTERNATES/LANDSCAPE_615/BreakNews", "publishedAt": "2020-02-27T05:58:07Z", "content": "Denmark has confirmed its first coronavirus infection in a man who returned from a ski holiday in northern Italy, the Danish health authority said on Thursday.\r\nThe man was put in isolation in his own home.\r\nSign up for a 30-day free trial. Sign Up\r\nNot convi… [+271 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Gold Futures Regain Rs 42,800 Mark Amid Coronavirus Fears", "description": "Gold Price Today: Gold prices vary in different parts of India - the second largest consumer of the precious metal - due to factors such as excise duty, state taxes and making charges.", "url": "https://www.ndtv.com/business/gold-rate-india-today-gold-bullion-price-gold-futures-regain-inr-42800-mark-amid-coronavirus-fears-2185326", "urlToImage": "https://i.ndtvimg.com/i/2017-02/gold-jewellery-gold-chain-650_650x400_61487902416.jpg", "publishedAt": "2020-02-27T05:43:47Z", "content": "Today's Gold Rate: At 11:00 am, gold futures on MCX traded 0.48% higher at Rs 42,709.00 per 10 grams\r\nGold Rate Today: Gold prices rebounded on Thursday following two days of losses. MCX Gold futures rose by as much as Rs 316 per 10 grams - or 0.74 per cent -… [+1598 chars]"}, {"source": {"id": null, "name": "Allafrica.com"}, "author": null, "title": "Coronavirus, Ebola, Lassa Fevers Caused By Corruption, Magu Insists", "description": "[Premium Times] The acting chairman of the Economic and Financial Crimes Commission, Ibrahim Magu, has insisted that the raging Corona virus is caused by corruption.", "url": "https://allafrica.com/stories/202002270083.html", "urlToImage": "https://cdn07.allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "publishedAt": "2020-02-27T05:36:37Z", "content": "The acting chairman of the Economic and Financial Crimes Commission, Ibrahim Magu, has insisted that the raging Corona virus is caused by corruption.\r\nHe alleged that some lab scientists many have also created the Lassa fever and Ebola viruses with an intenti… [+2926 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "LAURAN NEERGAARD and RICARDO ALONSO-ZALDIVAR", "title": "Trump urges calm even as US reports worrisome new virus case", "description": "President Donald Trump declared that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn't inevitable even as top health authorities at his side warned Americans that more infections are coming. Shortly after Trump spoke Wednesday, …", "url": "https://news.yahoo.com/trump-urges-calm-even-us-052405665.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5qcjfr1mg82iQaYZ17LB7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/3Y1p4auK5rAkYTvzxfTEuw--~B/aD0zMzA2O3c9NDk2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/6ecb91e1daa3d28a3799f0254117e73d", "publishedAt": "2020-02-27T05:24:05Z", "content": "WASHINGTON (AP) President Donald Trump declared that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn't inevitable even as top health authorities at his side warned Americans that more infections are coming.\r\nShortly after Trump … [+5863 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Bloomberg", "title": "Italian opposition chief demands €10 bil virus aid", "description": "The right-wing populist leader Matteo Salvini accused PM Giuseppe Conte of underestimating outbreak.", "url": "https://www.freemalaysiatoday.com/category/world/2020/02/27/italian-opposition-chief-demands-e10-bil-virus-aid/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/Matteo-Salvini-270220-AP.jpg", "publishedAt": "2020-02-27T05:53:21Z", "content": "Salvini says the virus underlines how urgently Italy needs to close its ports to North African migrants. (AP pic)\r\nROME: Italian opposition leader Matteo Salvini accused Prime Minister Giuseppe Conte of underestimating the threat of the coronavirus outbreak a… [+4533 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribers)", "title": "Teladoc Inc (TDOC) Q4 2019 Earnings Call Transcript", "description": "TDOC earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/27/teladoc-inc-tdoc-q4-2019-earnings-call-transcript.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-27T06:01:22Z", "content": "Image source: The Motley Fool.\r\nTeladoc Inc (NYSE:TDOC)Q4 2019 Earnings CallFeb 26, 2020, 4:30 p.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nWelcome to Teladoc's Four… [+43673 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Nick Visser", "title": "California Patient Contracted Coronavirus From No Known Origin, CDC Says", "description": "The person had not been abroad and had no known contact with an infected person. The agency said it may be the first \"community spread\" case in the U.S.", "url": "https://www.huffpost.com/entry/cdc-coronavirus-california-community-spread_n_5e573b89c5b66137fb5d9023", "urlToImage": "https://img.huffingtonpost.com/asset/5e57492d230000960c39c555.jpeg?cache=U8ACrFwDw0&ops=1200_630", "publishedAt": "2020-02-27T05:13:15Z", "content": "The U.S. Centers for Disease Control and Prevention reported the first case of coronavirus in a person with no international travel history or known contact with an infected person in what officials have warned could be a significant sign that the virus may s… [+2921 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Holly Ellyatt", "title": "European markets set to fall further amid rapid spread of coronavirus", "description": "European stocks are set to decline further at the open Thursday as the rapid spread of coronavirus continues to dominate market sentiment.", "url": "https://www.cnbc.com/2020/02/27/european-markets-focus-on-rapid-spread-of-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106412017-15827564174222020-02-24t173143z_553154464_rc257f9a808v_rtrmadp_3_china-health-italy-red-zone-diary.jpg?v=1582756536", "publishedAt": "2020-02-27T05:36:00Z", "content": "European stocks are set to decline further at the open Thursday as the rapid spread of coronavirus continues to dominate market sentiment.\r\nLondon's FTSE index is expected to open 144 points lower at 6,869, the German DAX is seen 319 points lower at 12,454, t… [+1752 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "LAURAN NEERGAARD and RICARDO ALONSO-ZALDIVAR", "title": "Trump urges calm even as US reports worrisome new virus case", "description": "WASHINGTON (AP) — President Donald Trump declared that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn’t inevitable even as top health authorities at his side warned Americans that more infections are coming. Shortly after Trump…", "url": "https://www.seattletimes.com/nation-world/trump-urges-calm-even-as-us-reports-worrisome-new-virus-case/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/02262020_trumpPenceVirus_tzr_tzr_220934-780x501.jpg", "publishedAt": "2020-02-27T05:24:07Z", "content": "WASHINGTON (AP) President Donald Trump declared that a widespread U.S. outbreak of the new respiratory virus sweeping the globe isn’t inevitable even as top health authorities at his side warned Americans that more infections are coming.\r\nShortly after Trump … [+5908 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "World about to be gripped by coronavirus pandemic, Australia's Morrison says", "description": "There is every sign the world is about to be gripped by a pandemic of coronavirus, Australian Prime Minister Scott Morrison warned on Thursday, as Canberra kicked off emergency measures to restrain the spread of the disease.", "url": "https://economictimes.indiatimes.com/news/international/world-news/world-about-to-be-gripped-by-coronavirus-pandemic-australias-morrison-says/articleshow/74330166.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74330148,width-1070,height-580,imgsize-669350,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-27T06:10:53Z", "content": "SYDNEY: There is every sign the world is about to be gripped by a pandemic of coronavirus, Australian Prime Minister Scott Morrison warned on Thursday, as Canberra kicked off emergency measures to restrain the spread of the disease.\r\nCoronavius has infected a… [+1364 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Bloomberg", "title": "Disney falls as Wall Street says Bob Chapek lacks content experience", "description": "Shares in the entertainment company reached a 10-month low Wednesday, declining as much as 4.7%.", "url": "https://www.freemalaysiatoday.com/category/business/2020/02/27/disney-falls-as-wall-street-says-bob-chapek-lacks-content-experience/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/Bob-Chapek-270220-AP.jpg", "publishedAt": "2020-02-27T05:35:55Z", "content": "Chapek has been named Bob Iger’s successor effective immediately. (AP pic)\r\nNEW YORK: Wall Street isnt letting Walt Disney Co off the hook just yet, having pulled a switcheroo of Bob Iger for parks chairman Bob Chapek as the new chief executive officer.\r\nShar… [+4218 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlie Coë For Daily Mail Australia Australian Associated Press Ap", "title": "Air New Zealand cuts 20 per cent of its flights to Asia due to coronavirus outbreak", "description": "The airline expects the impact of the virus on earnings to be in the range of $NZD35 million ($AUD34 million) to $NZD75 million ($AUD72 million) due to lower demand and capacity cuts.", "url": "https://www.dailymail.co.uk/news/article-8049963/Air-New-Zealand-cuts-20-cent-flights-Asia-coronavirus-outbreak.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/27/04/25256806-0-image-a-32_1582779046875.jpg", "publishedAt": "2020-02-27T05:51:00Z", "content": "Air New Zealand is slashing capacity by almost 20 per cent in Asia to reduce the impact of the coronavirus on its bottom line.\r\nThe airline expects the impact of the virus on earnings to be in the range of $NZD35 million ($AUD34 million) to $NZD75 million ($A… [+6382 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Top 5 stocks for FO expiry day that can give double-digit return", "description": "A break below 11,614 will see a continuation of the decline in the Nifty, initially towards 11,490 and then 11,340. On the upside, the Nifty needs to cross Wednesdayâ\u0080\u0099s high of 11,800.", "url": "https://www.moneycontrol.com/news/business/markets/top-5-stocks-for-fo-expiry-day-that-can-give-double-digit-return-4981931.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/03/BUY_Sell_hold_BUY_Sell_hold1-770x433.jpg", "publishedAt": "2020-02-27T05:30:56Z", "content": "Ashish Chaturmohta\r\nGrowing concerns over coronavirus spread continue to batter financial markets across the world. Though the Nifty saw a brief intraday bounce back, it quickly got sold into and the market ended lower for the fourth consecutive day on Februa… [+5888 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "Israeli coronavirus patient will be released from Sheba Hospital", "description": null, "url": "http://www.israelnationalnews.com/News/Flash.aspx/489527", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/799/799624.jpg", "publishedAt": "2020-02-27T05:50:28Z", "content": "Tests have come back negative for an Israeli in isolation at Shiba Hospital after he contracted the coronavirus.\r\nAs a result, he will be released soon and will no longer have to stay in isolation."}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Agencies, Agencies", "title": "Coronavirus: how Latin America is preparing for an outbreak after Brazil’s first reported case", "description": "A Sao Paulo resident who recently travelled to Italy has tested positive for the novel coronavirus, Brazil’s Health Ministry said on Wednesday, the first confirmed case in Latin America.“The test carried out by the Instituto Adolfo Lutz came back with a posit…", "url": "https://www.scmp.com/news/world/americas/article/3052635/coronavirus-how-latin-america-preparing-outbreak-after-brazils", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/27/b0a724a0-5920-11ea-b438-8452af50d521_image_hires_134918.jpg?itok=MeLoyOU9&v=1582782564", "publishedAt": "2020-02-27T05:49:25Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "Alexander & Baldwin (ALEX) Q4 2019 Earnings Call Transcript", "description": "ALEX earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/27/alexander-baldwin-alex-q4-2019-earnings-call-trans.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-27T06:01:51Z", "content": "Image source: The Motley Fool.\r\nAlexander &amp; Baldwin (NYSE:ALEX)Q4 2019 Earnings CallFeb 26, 2020, 5:00 p.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nLadies and ge… [+44080 chars]"}, {"source": {"id": null, "name": "Jamaicaobserver.com"}, "author": null, "title": "Caution, cancellations mark Ash Wednesday in time of virus", "description": "VATICAN CITY (AP) — Pope Francis celebrated the Ash Wednesday ritual kicking off the Catholic Church’s Lenten season in traditional fashion, while other Masses in northern Italy were cancelled over fears of the new coronavirus.Francis and a long line of pries…", "url": "http://www.jamaicaobserver.com/news/Caution,_cancellations_mark_Ash_Wednesday_in_time_of_virus?profile=1470", "urlToImage": "http://www.jamaicaobserver.com/apps/pbcsi.dll/storyimage/JO/20200227/ARTICLE/200229738/AR/0/AR-200229738.jpg", "publishedAt": "2020-02-27T05:53:15Z", "content": "VATICAN CITY (AP) — Pope Francis celebrated the Ash Wednesday ritual kicking off the Catholic Church’s Lenten season in traditional fashion, while other Masses in northern Italy were cancelled over fears of the new coronavirus.\r\nFrancis and a long line of pri… [+3250 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "Jagmeet Singh", "title": "Apple to Launch Its Online Store in India This Year, Physical Retail Outlets Planned for 2021: CEO Tim Cook Reveals", "description": "Apple CEO Tim Cook while answering questions at the company’s annual shareholder meeting on Wednesday said that it would open its online store in India this year, while its first retail stores opening would take place in 2021.", "url": "https://gadgets.ndtv.com/mobiles/news/apple-india-online-store-launch-2020-physical-outlet-2021-ceo-tim-cook-comments-2186442", "urlToImage": "https://i.gadgets360cdn.com/large/donald_trump_reuters_full_1566191349557.JPG", "publishedAt": "2020-02-27T05:49:47Z", "content": "Apple will launch its online store in India this year, while its first physical retail stores will open in the country in 2021, CEO Tim Cook reportedly revealed while answering questions at the company's annual shareholder meeting held in Cupertino, Californi… [+2517 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "Jagmeet Singh", "title": "Apple to Launch Its Online Store in India This Year, Physical Retail Outlets Planned for 2021: CEO Tim Cook Reveals", "description": "Apple CEO Tim Cook while answering questions at the company’s annual shareholder meeting on Wednesday said that it would open its online store in India this year, while its first retail stores opening would take place in 2021.", "url": "https://gadgets.ndtv.com/mobiles/news/apple-india-online-store-launch-2020-physical-outlet-2021-ceo-tim-cook-comments-2186441", "urlToImage": "https://i.gadgets360cdn.com/large/donald_trump_reuters_full_1566191349557.JPG", "publishedAt": "2020-02-27T05:49:47Z", "content": "Apple will launch its online store in India this year, while its first physical retail stores will open in the country in 2021, CEO Tim Cook reportedly revealed while answering questions at the company's annual shareholder meeting held in Cupertino, Californi… [+2517 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "newsfeeds@nzherald.co.nz", "title": "Coronavirus in the US: Donald Trump plays down the threat in public, but in private he's worried", "description": "President Donald Trump faces a critical personal challenge in grappling with the new coronavirus outbreak: Asking Americans to believe him after he and some of his top advisers have contradicted federal scientists in playing down...", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12312328", "urlToImage": "https://www.nzherald.co.nz/resizer/RusxofZDYSw5MajEkWclrHuU0wM=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/IQK6E5PQ4RBUVADDP56JHO7OOI.jpg", "publishedAt": "2020-02-27T05:57:08Z", "content": "President Donald Trump faces a critical personal challenge in grappling with the new coronavirus outbreak: Asking Americans to believe him after he and some of his top advisers have contradicted federal scientists in playing down the threat.\r\n Keenly aware of… [+8024 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "Denmark confirms first coronavirus case in man returning from holiday in Italy", "description": "Denmark has confirmed its first coronavirus infection in a man who returned from a ski holiday in northern Italy, the Danish health authority said on Thursday.", "url": "https://bdnews24.com/world/2020/02/27/denmark-confirms-first-coronavirus-case-in-man-returning-from-holiday-in-italy", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/27/coronavirus-denmark-270220-01.jpg/ALTERNATES/w640/coronavirus-denmark-270220-01.jpg", "publishedAt": "2020-02-27T05:58:03Z", "content": "A train staff wearing a mask is seen at the Shanghai railway station in Shanghai, China, as the country is hit by an outbreak of a new coronavirus, Feb 27, 2020. REUTERS"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "One America News: Democrats Exaggerate Coronavirus Fears To Attack Trump", "description": "OAN News: Federal Reserve officials are confident the latest outbreak of the coronavirus is not hurting the American economy, despite rampant fear-mongering in the financial markets. However, Democrat Party officials are stirring speculation of a looming viru…", "url": "https://www.realclearpolitics.com/video/2020/02/27/one_america_news_democrats_exaggerate_coronavirus_fears_to_attack_trump.html", "urlToImage": "https://assets.realclear.com/images/50/502660.jpg", "publishedAt": "2020-02-27T06:09:01Z", "content": null}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "Asian shares slump after Trump announcement on virus plans", "description": "Shares fell in Asia on Thursday after President Donald Trump announced the U.S. was stepping up its efforts to combat the virus outbreak that began in China.", "url": "https://www.bostonherald.com/2020/02/27/asian-shares-slump-after-trump-announcement-on-virus-plans/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/02/Hong_Kong_Financial_Markets_88543-1.jpg?w=1024&h=683", "publishedAt": "2020-02-27T05:46:10Z", "content": "By ELAINE KURTENBACH\r\nShares fell in Asia on Thursday after President Donald Trump announced the U.S. was stepping up its efforts to combat the virus outbreak that began in China.\r\nJapan’s Nikkei 225 index lost 2.1% to 21,951.78, while in Australia, the S&amp… [+3714 chars]"}, {"source": {"id": null, "name": "Iol.co.za"}, "author": "CHELSEA NTULI", "title": "Coronavirus scare affects trade at Oriental City Centurion", "description": "Store owners unable to get stock from China as fearful shoppers shun centre", "url": "https://www.iol.co.za/pretoria-news/coronavirus-scare-affects-trade-at-oriental-city-centurion-43586392", "urlToImage": "https://image.iol.co.za/image/1/process/960x540?source=https://cdn.africannewsagency.com/public/ana/media/media/2020/02/27/media-reference%3Ace39e01d49ff4bd6b33017e58ed81a62.jpg&operation=CROP&offset=0x235&resize=2999x1684", "publishedAt": "2020-02-27T05:23:00Z", "content": "By CHELSEA NTULI17m ago\r\nPretoria - The threat of coronavirus has affected traders at Oriental City Centurion.\r\nIt emerged yesterday that some were stuck in South Africa unable to travel to China to collect stock, while others were stranded in China, unable t… [+1918 chars]"}, {"source": {"id": null, "name": "Jamaicaobserver.com"}, "author": null, "title": "Globe battles virus as cases multiply outside China", "description": "SEOUL, South Korea (AP) — Crews scrubbed everything from money to buses, military bases were on high alert and quarantines were enforced yesterday from a beachfront resort in the Atlantic to a remote island in the Pacific, as the world worked to halt the fast…", "url": "http://www.jamaicaobserver.com/news/globe-battles-virus-as-cases_188159?profile=1470", "urlToImage": "http://www.jamaicaobserver.com/apps/pbcsi.dll/storyimage/JO/20200227/ARTICLE/302279952/AR/0/AR-302279952.jpg", "publishedAt": "2020-02-27T05:53:15Z", "content": "SEOUL, South Korea (AP) — Crews scrubbed everything from money to buses, military bases were on high alert and quarantines were enforced yesterday from a beachfront resort in the Atlantic to a remote island in the Pacific, as the world worked to halt the fast… [+6679 chars]"}, {"source": {"id": null, "name": "Sport24.co.za"}, "author": null, "title": "Sport24.co.za | Australia team to 'wait and see' on Olympics as virus fears rise", "description": "Athletes preparing for the Tokyo Olympics will have to \"wait and see\" whether the Games go ahead as concerns soar about the coronavirus, the head of Australia's team said.", "url": "https://www.sport24.co.za/OtherSport/International/australia-team-to-wait-and-see-on-olympics-as-virus-fears-rise-20200227", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9047/b29e688955164e7aaf526963a59ce4f8.png", "publishedAt": "2020-02-27T05:53:53Z", "content": "Sydney - Athletes preparing for the Tokyo Olympics will have to \"wait and see\" whether the Games go ahead as concerns soar about the coronavirus, the head of Australia's team said Thursday.\r\nDespite reassurances from Tokyo organisers that all plans were on tr… [+1837 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "India evacuates 23 Bangladeshi nationals from virus-hit Wuhan", "description": "A group of 23 Bangladeshi nationals have been evacuated from the Chinese city of Wuhan, the locked down epicentre of a deadly coronavirus, with the help of the Indian government.", "url": "https://bdnews24.com/bangladesh/2020/02/27/india-evacuates-23-bangladeshi-nationals-from-virus-hit-wuhan", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/27/bangladeshis-delhi-from-wuhan-270220-03.jpg/ALTERNATES/w640/bangladeshis-delhi-from-wuhan-270220-03.jpg", "publishedAt": "2020-02-27T05:35:06Z", "content": "A special Indian Air Force with the Bangladeshis onboard landed in Delhi on Thursday morning, according to the Indian High Commission in Dhaka.\r\nThe Bangladeshi citizens along with the other evacuees will be quarantined in special facilities in the suburbs of… [+903 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "World about to be gripped by coronavirus pandemic, Australia's Morrison says", "description": "There is every sign the world is about to be gripped by a pandemic of coronavirus, Australian Prime Minister Scott Morrison warned on Thursday, as Canberra kicked off emergency measures to restrain the spread of the disease.", "url": "https://bdnews24.com/world/2020/02/27/world-about-to-be-gripped-by-coronavirus-pandemic-australia-s-morrison-says", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/27/australia-morrison-270220-01.jpg/ALTERNATES/w640/australia-morrison-270220-01.jpg", "publishedAt": "2020-02-27T06:00:49Z", "content": "Coronavius has infected about 80,000 people worldwide and killed more than 2,700, the vast majority in China.\r\nWhile the spread has slowed within China, Morrison said the escalation across Europe, Asia and the Americas makes the chance of a pandemic more like… [+1128 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "China investigates release of coronavirus-infected inmate in Hubei", "description": "BEIJING: China has sent an investigation team to Wuhan, the city at the epicentre of a COVID-19 outbreak, after reports that a prison released an infected inmate who then travelled to Beijing.", "url": "https://www.channelnewsasia.com/news/asia/coronavirus-wuhan-china-hubei-released-inmate-investigation-12475442", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12470606/16x9/991/557/4752da0fcd0dee6a3a535bd732cd1b7a/AB/man-wearing-a-face-mask-crosses-a-road-in-wuhan--the-epicentre-of-the-novel-coronavirus-outbreak-2.jpg", "publishedAt": "2020-02-27T05:20:01Z", "content": "BEIJING: China has sent an investigation team to Wuhan, the city at the epicentre of a COVID-19 outbreak, after reports that a prison released an infected inmate who then travelled to Beijing.\r\nA team led by the Ministry of Justice, Supreme Court and Ministry… [+1951 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "China city offers US$1,400 reward for COVID-19 patients who report to authorities", "description": "SHANGHAI: A city in China's Hubei province, the epicentre of the global coronavirus epidemic, will pay residents as much as 10,000 yuan (US$1,425.96) if they proactively report symptoms of the illness and it is confirmed after testing.", "url": "https://www.channelnewsasia.com/news/asia/china-hubei-coronavirus-covid-19-reward-report-12475446", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12475472/16x9/991/557/30552b588ba2e6af4be1b0e81bd7fd49/vN/wuhan-virus-empty-streetss.jpg", "publishedAt": "2020-02-27T05:43:00Z", "content": "SHANGHAI: A city in China's Hubei province, the epicentre of the global coronavirus epidemic, will pay residents as much as 10,000 yuan (US$1,425.96) if they proactively report symptoms of the illness and it is confirmed after testing.\r\nQianjiang, a city of a… [+1716 chars]"}]