[{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "20 Countries Report First Cases of Coronavirus This Week As Infections Skyrocket", "description": "Twenty countries have reported their first cases of the new coronavirus this week, bringing the total number of confirmed cases to over 82,000 in 50 countries since the outbreak began in December. At least 2,800 people have died worldwide. Read more...", "url": "https://gizmodo.com/20-countries-report-first-cases-of-coronavirus-this-wee-1841949283", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ostvpuze6hzwx3zlgnkt.jpg", "publishedAt": "2020-02-27T14:10:00Z", "content": "Twenty countries have reported their first cases of the new coronavirus this week, bringing the total number of confirmed cases to over 82,000 in 50 countries since the outbreak began in December. At least 2,800 people have died worldwide.\r\nThe number of COVI… [+11003 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iran bans Chinese citizens from entering the country: IRNA", "description": "Iran has banned Chinese citizens from entering the country, Iranian state news agency IRNA reported on Thursday, amid the spread of the new coronavirus across the Islamic Republic that had killed 26 Iranians.", "url": "https://www.reuters.com/article/us-china-health-iran-ban-idUSKCN20L1V7", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T13:14:14Z", "content": "DUBAI (Reuters) - Iran has banned Chinese citizens from entering the country, Iranian state news agency IRNA reported on Thursday, amid the spread of the new coronavirus across the Islamic Republic that had killed 26 Iranians. \r\nIran, which has the highest nu… [+174 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: China aims to ban wildlife trade even as new deaths reach lowest daily tally - Global News", "description": "Coronavirus outbreak: China aims to ban wildlife trade even as new deaths reach lowest daily tally Global News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=genOEyajQGY", "urlToImage": null, "publishedAt": "2020-02-27T13:24:04Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashley Rodriguez and Travis Clark", "title": "Disney's surprise CEO change makes sense because of the coronavirus' growing impact on its business, according to a Wall Street analyst (DIS)", "description": "Disney's abrupt appointment of CEO Bob Chapek on Tuesday was good thinking given the growing threat of the coronavirus outbreak, according to analysts at Rosenblatt Securities. The day-to-day pressures of the Disney CEO may mount if the coronavirus continues …", "url": "https://www.businessinsider.com/disney-ceo-change-could-help-during-coronavirus-outbreak-analyst-2020-2", "urlToImage": "https://i.insider.com/5e57c8d4fee23d326f0aba04?width=1200&format=jpeg", "publishedAt": "2020-02-27T14:00:23Z", "content": "Disney's sudden CEO appointment on Tuesday, 22 months before its former-chief executive was due to depart the company, was good thinking given the growing threat of the coronavirus outbreak, according to one Wall Street firm.\r\nThe spread of the virus is alrea… [+3814 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gwen Everett", "title": "Oil prices unravel to lowest level in 12 months as coronavirus threat looms", "description": "The key US and global gauges of oil prices tumbled Thursday, after The Wall Street Journal reported WTI closed on Wednesday at its lowest price since January 2019. As reports around the coronavirus health crisis worsen, investors fear the economic slowdown re…", "url": "https://www.businessinsider.com/oil-prices-unravel-sink-lowest-level-year-coronavirus-threat-impact-2020-2", "urlToImage": "https://i.insider.com/5e57c31afee23d35e8683c12?width=1200&format=jpeg", "publishedAt": "2020-02-27T13:42:13Z", "content": "The downward spiral in oil continues. \r\nWTI crude toppled 2.71% from its previous closing price to trade at $47.41 per barrel Thursday. Making that decline more dramatic: Wednesday's closing price was a 12-month low for U.S. crude, The Wall Street Journal pre… [+1364 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Kayla Goodfield", "title": "Husband of Ontario's fifth COVID-19 patient also tests positive for virus - CTV News", "description": "Husband of Ontario's fifth COVID-19 patient also tests positive for virus CTV News Husband of Toronto woman who returned from Iran now Ontario's sixth COVID-19 case CP24 Toronto's Breaking News Timeline coronavirus (COVID-19) in Canada CTV News Husband of COV…", "url": "https://toronto.ctvnews.ca/husband-of-ontario-s-fifth-covid-19-patient-also-tests-positive-for-virus-1.4829855", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4777295.1579636445!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-02-27T13:18:00Z", "content": "TORONTO -- \r\nThe husband of the fifth novel coronavirus (COVID-19) patient in Ontario has also tested positive for the virus in Toronto.\r\nThe man, who is in his 60s, remains in self-isolation, Ontario health officials said in a news release issued on Thursday… [+1907 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Zeynep Tufekci", "title": "Preparing for Coronavirus to Strike the U.S.", "description": "Getting ready for the possibility of major disruptions is not only smart; it’s also our civic duty -- Read more on ScientificAmerican.com", "url": "https://blogs.scientificamerican.com/observations/preparing-for-coronavirus-to-strike-the-u-s/", "urlToImage": "https://static.scientificamerican.com/blogs/cache/file/86602FE4-FB0D-4F5E-8FD42A3EB2F0B219.jpg", "publishedAt": "2020-02-27T14:00:00Z", "content": "As the new human coronavirus spreads around the world, individuals and families should prepare—but are we? The Centers for Disease Control has already said that it expects community transmission in the United States, and asked families to be ready for the pos… [+12866 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Clearview client list \"stolen\"", "description": "Clearview, the shady facial-recognition firm with links to law-enforcement and alt-right internet trolls, reports that its entire client list has been stolen. In the notification, which The Daily Beast reviewed, the startup Clearview AI disclosed to its custo…", "url": "https://boingboing.net/2020/02/27/clearview-client-list-stolen.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/01/Screen-Shot-2020-01-23-at-10.12.55-AM.png?fit=718%2C390&ssl=1", "publishedAt": "2020-02-27T13:54:38Z", "content": "Clearview, the shady facial-recognition firm with links to law-enforcement and alt-right internet trolls, reports that its entire client list has been stolen.\r\nIn the notification, which The Daily Beast reviewed, the startup Clearview AI disclosed to its cust… [+2873 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: Wait for these signals to buy coronavirus-battered stocks, says BNY Mellon strategist", "description": "Do you want to know when it is going to finally be time to buy equities? You would first better have a view of where this virus is going, advises BNY Mellon’s chief strategist.", "url": "https://www.marketwatch.com/story/wait-for-these-signals-to-buy-coronavirus-battered-stocks-says-bny-mellon-strategist-2020-02-27-910308", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-02-27T14:00:08Z", "content": "Do you want to know when it is going to finally be time to buy equities? You would first better have a view of where this virus is going, advises BNY Mellons chief strategist. See full story.\r\nStocks keep getting slammed because investors fear a supply shock … [+951 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Jeffry Bartash", "title": "Economic Report: Economy grew a mild 2.1% in 4th quarter, but coronavirus threatens to reduce GDP even further", "description": "The economy expanded at a 2.1% pace at the end of 2019, but the U.S. might struggle to achieve even that modest rate of growth in the months ahead if a new strain of coronavirus isn’t contained.", "url": "https://www.marketwatch.com/story/economy-grew-a-mild-21-in-4th-quarter-but-coronavirus-threatens-to-reduce-gdp-even-further-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HK241_apple__ZG_20190523163509.jpg", "publishedAt": "2020-02-27T13:33:10Z", "content": "The Apple logo is seen on the window at an Apple Store in Beijing, China. Apple is one of a rising number of companies warning of potentially lower sales because of the spread of the coronavirus.\r\nThe numbers: The economy expanded at a 2.1% pace at the end of… [+2957 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "William Watts", "title": "Metals Stocks: Gold up modestly as coronavirus fuels demand for havens", "description": "Gold futures rise, finding support as worries about the spread of COVID-19 outside of China continue to spark selling in global equity markets, spurring demand for traditional havens.", "url": "https://www.marketwatch.com/story/gold-up-modestly-as-coronavirus-fuels-demand-for-havens-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-GX670_goldst_ZG_20181102071937.jpg", "publishedAt": "2020-02-27T14:02:09Z", "content": "Gold futures rose Thursday, finding support as worries about the spread of COVID-19 outside of China continue to spark selling in global equity markets, spurring demand for traditional havens.\r\nGold for April delivery \r\nGCJ20, +0.69%\r\n on Comex rose $8.20, or… [+1326 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Lauren Evans", "title": "Mike Pence, Who Enabled a Massive HIV Outbreak As Governor, Is Handling U.S. Coronavirus Response", "description": "If you’re getting a little bit anxious about the coronavirus coming for all the beards, don’t worry, our government’s got this under control. That’s because Donald Trump has delegated the task of dealing with a rapidly evolving global crisis to a guy who real…", "url": "https://jezebel.com/mike-pence-who-enabled-a-massive-hiv-outbreak-as-gover-1841945134", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ayp7klictzteiwbh6n3c.png", "publishedAt": "2020-02-27T13:40:00Z", "content": "If youre getting a little bit anxious about the coronavirus coming for all the beards, dont worry, our governments got this under control. Thats because Donald Trump has delegated the task of dealing with a rapidly evolving global crisis to a guy who really k… [+1172 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jon Blistein", "title": "Trevor Noah, Colbert Roast Trump’s Unnerving Coronavirus Response", "description": "Late-night hosts examine the administration's extremely not-reassuring response to a possible pandemic", "url": "https://www.rollingstone.com/tv/tv-news/trevor-noah-daily-show-colbert-trump-coronavirus-958940/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-27-at-8.46.39-AM-copy.jpg", "publishedAt": "2020-02-27T13:55:14Z", "content": "Stephen Colbert and Trevor Noah examined the continued spread of coronavirus and President Donald Trump’s less than reassuring response to the pandemic on their respective shows Wednesday.\r\nDuring a press conference yesterday, Trump announced that Vice Presid… [+1591 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Michael Walden", "title": "Equinor has abandoned oil-drilling plans in the Great Australian Bight—so what's next?", "description": "Fears are growing that the new coronavirus will infect the U.S. economy.", "url": "https://phys.org/news/2020-02-equinor-abandoned-oil-drilling-great-australian.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/bight.jpg", "publishedAt": "2020-02-27T14:10:04Z", "content": "Fears are growing that the new coronavirus will infect the U.S. economy.\r\nA major U.S. stock market index posted its biggest two-day drop on record, erasing all the gains from the previous two months; companies including Apple and Walmart have been warning of… [+8100 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "South Korea struggles to contain coronavirus outbreak", "description": "South Korea has confirmed 505 fresh cases of coronavirus infection, meaning it has overtaken China in new daily infection numbers.", "url": "https://www.aljazeera.com/news/2020/02/south-korea-struggles-coronavirus-outbreak-200227133124212.html", "urlToImage": "https://www.aljazeera.com/mritems/images/2020/2/27/image-20200227133126612.jpg", "publishedAt": "2020-02-27T13:31:24Z", "content": "South Korea has confirmed 505 fresh cases of coronavirus infection, meaning it has overtaken China in new daily infection numbers.\r\nThe government has stepped up measures to stop the spread of the virus.\r\nAl Jazeera's Sarah Clark reports."}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Chris Kerr", "title": "Plague Inc. pulled from Chinese App Store over 'illegal' content", "description": "The Cyberspace Administration of China has removed Plague Inc. from the country's App Store over theÂ inclusion of \"illegal\" content....", "url": "https://www.gamasutra.com/view/news/358821/Plague_Inc_pulled_from_Chinese_App_Store_over_illegal_content.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29", "urlToImage": "http://www.gamasutra.com/db_area/images/news/2020/Feb/358821/plague inc.jpg", "publishedAt": "2020-02-27T14:06:00Z", "content": "The Cyberspace Administration of China has removed Plague Inc. from the country's App Store over the inclusion of \"illegal\" content. Developer Ndemic confirmed the news in a blog post, and said the situation has been taken out of its control. \r\nThe decision b… [+1558 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Jovana Stanisljevic", "title": "The growing impact of coronavirus on the global economy", "description": "As of February 2020, the number of people infected with the coronavirus Covid-19 has surpassed 80,000, with nearly 2,700 deaths. Efforts to contain the outbreak have led to full or partial quarantines of several Chinese provinces and cities, as well as other …", "url": "https://phys.org/news/2020-02-impact-coronavirus-global-economy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-china.jpg", "publishedAt": "2020-02-27T13:41:35Z", "content": "As of February 2020, the number of people infected with the coronavirus Covid-19 has surpassed 80,000, with nearly 2,700 deaths. Efforts to contain the outbreak have led to full or partial quarantines of several Chinese provinces and cities, as well as other … [+6205 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Late-night hosts skewer Trump for coronavirus response - Washington Post", "description": "Late-night hosts skewer Trump for coronavirus response Washington Post Trump coronavirus response questioned by Obama-linked WHO official after organization praises China Fox News Trump: Coronavirus Poses 'Very Low' Risk To Americans | NBC News NBC News US br…", "url": "https://www.youtube.com/watch?v=6CilrTFOC7w", "urlToImage": null, "publishedAt": "2020-02-27T13:36:53Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sanjay Gupta fact-checks Trump's coronavirus claims - CNN", "description": "Sanjay Gupta fact-checks Trump's coronavirus claims CNN Trump is reportedly 'furious' that US stocks have tanked on coronavirus fears — and he's accusing the 'fa.. Business Insider Trump downplays fears of coronavirus spread in news conference Washington Post…", "url": "https://www.youtube.com/watch?v=_nVuxx7CPZQ", "urlToImage": "https://i.ytimg.com/vi/_nVuxx7CPZQ/maxresdefault.jpg", "publishedAt": "2020-02-27T13:42:48Z", "content": "CNN's Dr. Sanjay Gupta fact-checks his exchange with President Donald Trump during a coronavirus press conference when Trump claimed the flu had higher death rates than the coronavirus. #CNN#News"}, {"source": {"id": null, "name": "Extremetech.com"}, "author": "Joel Hruska", "title": "Microsoft Warns Coronavirus Will Hit PC Earnings, Surface Sales", "description": "Microsoft is warning on Q3 earnings due to coronavirus' impact on both OS shipments and Surface sales. The post Microsoft Warns Coronavirus Will Hit PC Earnings, Surface Sales appeared first on ExtremeTech.", "url": "https://www.extremetech.com/computing/306660-microsoft-warns-coronavirus-will-hit-pc-earnings-surface-sales", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2017/07/537201-microsoft-windows-10-creators-update-start-screen-e1501252530108.jpg", "publishedAt": "2020-02-27T13:17:15Z", "content": "Microsoft has warned investors that the coronavirus known as Covid-19 will have a significant impact on its third quarter. Microsoft’s fiscal year doesn’t follow the calendar, so the period from January – March is technically Q3 for the company, not Q1.\r\nPrev… [+2928 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Patrick Frater", "title": "Virus Outbreak Forces Postponement of Udine Asian Film Festival", "description": "The Far East Film Festival in Udine, one of the best-regarded specialty festivals on the calendar, is to postpone its upcoming edition. The festival is situated in North Eastern Italy where the coronavirus outbreak has recently struck hard. The festival had b…", "url": "https://variety.com/2020/film/asia/virus-outbreak-postponement-udine-asian-film-festival-1203516817/", "urlToImage": "https://pmcvariety.files.wordpress.com/2015/04/jackie-chan-in-udine-3.jpg?w=700&h=393&crop=1", "publishedAt": "2020-02-27T14:00:53Z", "content": "The Far East Film Festival in Udine, one of the best-regarded specialty festivals on the calendar, is to postpone its upcoming edition. The festival is situated in North Eastern Italy where the coronavirus outbreak has recently struck hard.\r\nThe festival had … [+1298 chars]"}, {"source": {"id": null, "name": "Project-syndicate.org"}, "author": "Simon Johnson", "title": "Coronavirus and the Global Economy", "description": "If developing countries’ health systems come under pressure, the US, Europe, and others should step up quickly with technical assistance and essential supplies. Unfortunately, there has so far been a worrying lack of leadership especially by US President Dona…", "url": "https://www.project-syndicate.org/commentary/coronavirus-global-economy-lack-of-american-leadership-by-simon-johnson-2020-02", "urlToImage": "https://webapi.project-syndicate.org/library/9f2c182cd95b2805c67bdd223f131e4a.2-1-super.1.jpg", "publishedAt": "2020-02-27T13:35:27Z", "content": "If developing countries health systems come under pressure, the US, Europe, and others should step up quickly with technical assistance and essential supplies. Unfortunately, there has so far been a worrying lack of leadership especially by US President Donal… [+5700 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Anna Momigliano", "title": "We live in Milan. Here’s what parenting in the time of coronavirus is like. - The Washington Post", "description": "We live in Milan. Here’s what parenting in the time of coronavirus is like. The Washington Post Coronavirus cases surge to 400 in Italy BBC News Two more people die from coronavirus in Italy: civil protection agency Reuters Boris Get Your Finger Out Now! Sput…", "url": "https://www.washingtonpost.com/lifestyle/2020/02/27/we-live-milan-heres-what-parenting-time-coronavirus-is-like/", "urlToImage": "https://www.washingtonpost.com/resizer/GSYTMTUTjftkbaiV_3dyMwHVBss=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NRSVPBCYXUI6VDX5B6IEXXMAK4.jpg", "publishedAt": "2020-02-27T14:00:00Z", "content": "But now that schools and gyms are closed because of the virus, its family time.\r\nCoronavirus live updates\r\nItaly is experiencing the biggest coronavirus outbreak outside Asia, and authorities in the most affected regions have passed measures to contain its sp… [+4739 chars]"}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "Watches of Switzerland Sees Shift to Home Buyers as Coronavirus Hits", "description": "As Chinese tourist numbers drop, the British retailer is looking to local customers to account for the decline.", "url": "https://www.businessoffashion.com/articles/news-analysis/watches-of-switzerland-sees-shift-to-home-buyers-as-coronavirus-hits", "urlToImage": null, "publishedAt": "2020-02-27T13:49:23Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "Japan to Close All Schools for 1 Month in Attempt to Prevent Coronavirus Spread", "description": "As world leaders take precautions amid the coronavirus outbreak, students in Japan will undergo a shakeup to their regularly scheduled schooling. On Thursday, Prime Minister Shinzo Abe made an announcement urging elementary, middle and high schools to shut do…", "url": "https://people.com/health/japan-to-close-all-schools-for-1-month-in-attempt-to-prevent-coronavirus-spread/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Fjapan-school-1.jpg%3Fcrop%3D0px%2C168px%2C1500px%2C789px%26resize%3D1200%2C630", "publishedAt": "2020-02-27T13:27:15Z", "content": "As world leaders take precautions amid the coronavirus outbreak, students in Japan will undergo a shakeup to their regularly scheduled schooling.\r\nOn Thursday, Prime Minister Shinzo Abe made an announcement urging elementary, middle and high schools to shut d… [+2957 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Isabel Togoh, Forbes Staff, Isabel Togoh, Forbes Staff https://www.forbes.com/sites/isabeltogoh/", "title": "Health Secretary Alex Azar Refuses To Guarantee Coronavirus Vaccine Would Be Affordable For All", "description": "The Trump administration is facing questions over how it plans to fight Covid-19, after initially sending mixed messages.", "url": "https://www.forbes.com/sites/isabeltogoh/2020/02/27/health-secretary-alex-azar-refuses-to-guarantee-coronavirus-vaccine-would-be-affordable-for-all/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208827286%2F960x0.jpg", "publishedAt": "2020-02-27T13:30:17Z", "content": "United States Secretary of Health and Human Services Alex Azar testifies before the House ... [+] Appropriations Committee on February 26, 2020\r\nGetty Images\r\nTopline: Alex Azar, Health and Human Services Secretary, has angered Democrats after suggesting that… [+7785 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Reuters", "title": "Aston Martin CFO departs as stock hits a record low, losses deepen", "description": "Filed under: Earnings/Financials, Aston Martin, Luxury, Performance Aston Martin shares slumped to a record low on Thursday after the British luxury carmaker said its losses ballooned last year and its chief financial officer would leave by the end of April. …", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/02/27/aston-martin-cfo-departs/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/800x450/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2020/02/24064926/aston_martin_dbx_q_by_aston_martin_003.jpg", "publishedAt": "2020-02-27T13:19:00Z", "content": "LONDON Aston Martin shares slumped to a record low on Thursday after the British luxury carmaker said its losses ballooned last year and its chief financial officer would leave by the end of April.\r\nThe firm, famed for being fictional agent James Bond's car o… [+2534 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Dexter Thomas, Michael Learmonth", "title": "The Dark Side of FOMO: Living Through a Coronavirus Outbreak in South Korea", "description": "South Koreans are obsessed with tracking the spread of coronavirus on their phones, in real time.", "url": "https://www.vice.com/en_us/article/7kz7pg/the-dark-side-of-fomo-living-through-a-coronavirus-outbreak-in-south-korea", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e57c283d5e3680096dd5ac2/lede/1582810077896-IMG-20200225-WA0005.jpeg?crop=1xw:0.7493xh;0xw,0.1743xh&resize=1200:*", "publishedAt": "2020-02-27T13:41:57Z", "content": "SEOUL Id expected to see masks in South Korea, but I wasnt prepared for the strange social dance of complimentary hand sanitizer.\r\n Its everywhere now, often in big, Costco-sized pump bottles, offered as an ad-hoc public service. In bathrooms, at the register… [+6566 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "\"Pence is Not a Medical Expert”: Is the Trump Admin Ready to Stop a U.S. Coronavirus Pandemic?", "description": "The coronavirus disease that was first diagnosed in China's Hubei province has now spread to at least 47 countries and every continent except Antarctica. The World Health Organization has declared the outbreak an international health emergency. President Trum…", "url": "https://www.democracynow.org/2020/2/27/coronavirus_covid19_us_response", "urlToImage": "https://www.democracynow.org/images/story/90/51390/full_hd/SEG1-Laurie-CoronaVirus-2.jpg", "publishedAt": "2020-02-27T13:14:11Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nThe coronavirus disease that was first diagnosed in China’s Hubei province has now spread to at least 47 countries and every continent except Antarctica. The World Health Organization has decl… [+953 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Red Painter", "title": "Trump Gives Bananas Press Conference About Coronavirus", "description": "Donald Trump is an idiot and his stupidity is going to infect more than just his MAGA Cult. He had a press conference on Wednesday afternoon to discuss the coronavirus outbreak and possible coming pandemic and spent half the time double-talking (yes, it may b…", "url": "https://crooksandliars.com/2020/02/trump-gives-bananas-press-conference-about", "urlToImage": "https://crooksandliars.com/files/mediaposters/2020/02/44436.jpg", "publishedAt": "2020-02-27T14:00:01Z", "content": "Donald Trump is an idiot and his stupidity is going to infect more than just his MAGA Cult. He had a press conference on Wednesday afternoon to discuss the coronavirus outbreak and possible coming pandemic and spent half the time double-talking (yes, it may b… [+2688 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Reuters", "title": "Spanish Hotel Group Melia Warns of Coronavirus Hit to Chinese Business", "description": "Another hotel chain cautions on the coronavirus impact. While it is mostly hurting Asian operations at the moment, companies are no doubt keeping a close eye on events in Europe. -Patrick Whyte", "url": "https://skift.com/2020/02/27/spanish-hotel-group-melia-warns-of-coronavirus-hit-to-chinese-business/", "urlToImage": "https://skift.com/wp-content/uploads/2020/02/Gran-Melia-Xian-scaled-e1582803663124.jpg", "publishedAt": "2020-02-27T13:30:38Z", "content": "Spain’s Melia Hotels said on Wednesday it expected its business in China to take a hit in the first quarter due to the coronavirus, which has so far had only a moderate impact on results but has clouded its outlook globally for this year.\r\nThe hotel chain sai… [+977 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus traps Scots in Tenerife hotel", "description": "Stephen Diamond and his wife Lynn are among a group of 10 from Scotland who should have come home on Monday.", "url": "https://www.bbc.co.uk/news/uk-scotland-glasgow-west-51662491", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/114FA/production/_111060907_tenerife_frame_3414.jpg", "publishedAt": "2020-02-27T14:09:38Z", "content": "Image caption\r\n Stephen Diamond thought he would be at the hotel for just one night\r\nA group of 10 Scots who should have left Tenerife on Monday have been trapped in a hotel because of coronavirus.\r\nStephen Diamond and his wife Lynn were with a group, which a… [+2590 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus 'highly likely' to hit Northern Ireland", "description": "A virologist says it would be a surprise if the virus did not affect NI, but people should not panic.", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-51661571", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/56D1/production/_111052222_01letter2.jpg", "publishedAt": "2020-02-27T13:25:46Z", "content": "Image caption\r\n People with infectious diseases can be treated at an isolation ward at the Royal Victoria Hospital\r\nCoronavirus is \"highly likely\" to reach Northern Ireland, but people should not panic, a virologist at Queen's University Belfast has said.\r\nFi… [+3097 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marshall Shepherd, Contributor, Marshall Shepherd, Contributor https://www.forbes.com/sites/marshallshepherd/", "title": "Will Spring Temperatures Stop Coronavirus?", "description": "Here's what the CDC says about Coronavirus and warmer weather. It may surprise you.", "url": "https://www.forbes.com/sites/marshallshepherd/2020/02/27/will-spring-temperatures-stop-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208989566%2F960x0.jpg", "publishedAt": "2020-02-27T13:16:37Z", "content": "Like everyone else, I am watching the Coronavirus. It has become a world-wide threat and governments are scrambling for a response. The Chinese Center for Disease Control and Prevention released a summary of its cases this week. Some of the jarring fatality r… [+10629 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": null, "title": "Analysis | The Technology 202: Microsoft's warning to investors shows worsening coronavirus impact on tech - The Washington Post", "description": "Analysis | The Technology 202: Microsoft's warning to investors shows worsening coronavirus impact on tech The Washington Post", "url": "https://www.washingtonpost.com/news/powerpost/paloma/the-technology-202/2020/02/27/the-technology-202-microsoft-s-warning-to-investors-shows-worsening-coronavirus-impact-on-tech/5e570f5f602ff108c8ca366c/", "urlToImage": "https://www.washingtonpost.com/pbox.php?url=https://palomaimages.washingtonpost.com/pr2/492fe8be515893541edad8caa357d8ab-B7IPHGCXZUI6VDX5B6IEXXMAK4-680-452-70-8.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "publishedAt": "2020-02-27T14:06:51Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monica Greep For Mailonline", "title": "This Morning viewers tease Drillminister after claiming balaclava will protect him for Coronavirus", "description": "This Morning viewers teased Drillminister after claiming his famous balaclava will protect him from Coronavirus, and insisting people wearing medical masks 'look weird'.", "url": "https://www.dailymail.co.uk/femail/article-8051221/This-Morning-viewers-tease-Drillminister-claiming-balaclava-protect-Coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/27/12/25270222-0-image-a-43_1582807483613.jpg", "publishedAt": "2020-02-27T13:48:14Z", "content": "This Morning viewers teased UK rapper Drillminister after appeared on the show with his signature balaclava and claimed it will protect him from coronavirus.\r\nThe masked London artist, who is running for London Mayor and never shows his face, appeared on the … [+4358 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Tobias Hoonhout, Tobias Hoonhout", "title": "Japan to Close All Schools until April to Slow Coronavirus", "description": "Prime Minister Shinzo Abe announced Thursday that Japan will close its schools until April in a bid to halt the spread of coronavirus.", "url": "https://www.nationalreview.com/news/japan-to-close-all-schools-until-april-to-slow-coronavirus/", "urlToImage": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2018/12/shinzo-abe-2.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-02-27T13:53:19Z", "content": null}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "How the Climate Crisis Is Making the Spread of Infectious Diseases Like Coronavirus More Common", "description": "Sonia Shah is an investigative science journalist and author of \"Pandemic: Tracking Contagions, from Cholera to Ebola and Beyond.\" Her new book is titled \"The Next Great Migration: The Beauty and Terror of Life on the Move\" and will be published in June. She …", "url": "https://www.democracynow.org/2020/2/27/climate_crisis_coronavirus_infections_disease_outbreaks", "urlToImage": "https://www.democracynow.org/images/story/89/51389/full_hd/SEG2-Sonia-CoronaVirus.jpg", "publishedAt": "2020-02-27T13:36:43Z", "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\nSonia Shah is an investigative science journalist and author of “Pandemic: Tracking Contagions, from Cholera to Ebola and Beyond.” Her new book is titled “The Next Great Migration: The Beauty … [+484 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Demitrios Kalogeropoulos)", "title": "Best Buy Keeps Growing Through the Holiday Season", "description": "The retailer's multichannel selling strategy set it apart during the industry's most competitive period.", "url": "https://www.fool.com/investing/2020/02/27/best-buy-keeps-growing-through-the-holiday-season.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560251/couple-shopping-for-appliances.jpg", "publishedAt": "2020-02-27T14:01:00Z", "content": "It was a bright Christmas season for Best Buy(NYSE:BBY) after all. The consumer electronics retailer on Thursday announced earnings results that allowed it to outgrow many peers during the industry's most competitive period.\r\nImage source: Getty Images.\r\nSale… [+960 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Harsh Chauhan)", "title": "2 Top 5G Stocks to Buy Right Now", "description": "These chipmakers have pulled back, but they can get back on track thanks to a huge end-market opportunity.", "url": "https://www.fool.com/investing/2020/02/27/2-top-5g-stocks-to-buy-right-now.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559934/hand-drawing-chart-stock-return.jpg", "publishedAt": "2020-02-27T13:31:00Z", "content": "Apple(NASDAQ:AAPL) recently sent shockwaves through its supply chain ecosystem when it revealed that its fiscal second-quarter revenue will fall short of expectations in light of the coronavirus outbreak in China. The iPhone maker pointed out that the outbrea… [+4619 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "As the coronavirus outbreak intensifies, here's some of the history of past pandemics to warm your heart before it goes cold [Interesting]", "description": "As the coronavirus outbreak intensifies, here's some of the history of past pandemics to warm your heart before it goes cold", "url": "https://www.fark.com/comments/10725558/As-coronavirus-outbreak-intensifies-heres-some-of-history-of-past-pandemics-to-warm-your-heart-before-it-goes-cold", "urlToImage": "https://img.fark.net/images/2013/site/farkLogo2Big.gif", "publishedAt": "2020-02-27T14:05:07Z", "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links. This is the number of comments. Click here to read them.\r\n… [+117 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Samuel Lovett, Samuel Lovett", "title": "'Stupid, unscientific and simply cruel': Stray dogs and cats being rounded up and killed as coronavirus precaution in Russia", "description": "'No evidence that companion animals/pets such as dogs or cats can be infected with the new coronavirus,' says WHO", "url": "https://www.independent.co.uk/news/health/coronavirus-news-latest-russia-stray-dogs-cats-deaths-a9363051.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/27/12/stray-dogs-russia.jpg", "publishedAt": "2020-02-27T13:11:34Z", "content": "Moscow health authorities have been lambasted as stupid, unscientific and simply cruel after rounding up stray animals and exterminating rats as part of efforts to fight the coronavirus outbreak.\r\nThree Russian citizens are currently receiving treatment after… [+4232 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Iran coronavirus deaths jump to 26", "description": "Ministry spokesman Kianoush Jahanpour also told a press briefing that 106 more cases of the disease had been confirmed", "url": "https://www.thehindu.com/news/international/iran-coronavirus-deaths-jump-to-26/article30933426.ece", "urlToImage": "https://www.thehindu.com/news/international/gi3h9a/article30933425.ece/ALTERNATES/LANDSCAPE_615/IranVirusOutbreak", "publishedAt": "2020-02-27T13:54:06Z", "content": "The COVID-19 epidemic in Iran has cost 26 lives, the health ministry announced Thursday, with seven new deaths reported over 24 hours as the spread appeared to accelerate.\r\nMinistry spokesman Kianoush Jahanpour also told a press briefing that 106 more cases o… [+1832 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: World Health Organization provides update | LIVE - Global News", "description": "The World Health Organization is expected to provide an update on the COVID-19 virus, as China reports the death toll has exceeded 2,700 people. The update a...", "url": "https://www.youtube.com/watch?v=6bKjQ4Q9fFU", "urlToImage": "https://i.ytimg.com/vi/6bKjQ4Q9fFU/maxresdefault_live.jpg", "publishedAt": "2020-02-27T13:41:30Z", "content": "The World Health Organization is expected to provide an update on the COVID-19 virus, as China reports the death toll has exceeded 2,700 people. \r\nThe update also comes after the CDC in the U.S. reported the first case of COVID-19 in California in which the p… [+424 chars]"}, {"source": {"id": null, "name": "Benzinga.com"}, "author": "Tanzeel Akhtar", "title": "Alpha Pro Tech Says Order For $14M Face Masks Will Be Fulfilled - Benzinga", "description": "Alpha Pro Tech, Ltd. (NYSE: APT) shares trading sharply higher after the company said it expects to fulfill the remainder of $14.1 million in ...", "url": "https://www.benzinga.com/news/20/02/15427701/alpha-pro-tech-says-order-for-14m-face-masks-will-be-fulfilled", "urlToImage": "https://cdn2.benzinga.com/files/imagecache/og_image_social_share_1200x630/images/story/2012/1920px-street_photo_in_guangzhou_city_49477439332_1.jpg", "publishedAt": "2020-02-27T13:50:11Z", "content": "Alpha Pro Tech, Ltd. (NYSE: APT) shares trading sharply higher after the company said it expects to fulfill the remainder of $14.1 million in currently-booked orders for face masks as the demand rises due to the COVID-19 virus spreading in the second-quarter.… [+1163 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Alpha Pro Tech Says Order For $14M Face Masks Will Be Fulfilled - Yahoo Finance", "description": "Alpha Pro Tech, Ltd. (NYSE: APT) shares trading sharply higher after the company said it expects to fulfill the remainder of $14.1 million in currently-booked orders for face masks as the demand rises due to the COVID-19 virus spreading in the second-quarter.…", "url": "https://finance.yahoo.com/news/alpha-pro-tech-says-order-135011017.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T13:50:00Z", "content": "Alpha Pro Tech, Ltd. (NYSE: APT) shares trading sharply higher after the company said it expects to fulfill the remainder of $14.1 million in currently-booked orders for face masks as the demand rises due to the COVID-19 virus spreading in the second-quarter.… [+1186 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Saudi Arabia halts pilgrimages over virus; Iran cases spike", "description": "Saudi Arabia banned foreign pilgrims from entering the kingdom to visit Islam's holiest sites over the new coronavirus, potentially disrupting the plans of millions of faithful ahead of the Muslim fasting month of Ramadan and as the annual hajj pilgrimage loo…", "url": "https://www.snopes.com/ap/2020/02/27/saudi-arabia-halts-pilgrimages-over-virus-iran-cases-spike/", "urlToImage": "https://www.snopes.com/tachyon/2020/02/AP-Virus-Outbreak-Mideast.jpg?fit=1200,744", "publishedAt": "2020-02-27T14:05:07Z", "content": "DUBAI, United Arab Emirates (AP) Saudi Arabia banned foreign pilgrims from entering the kingdom to visit Islams holiest sites over the new coronavirus, potentially disrupting the plans of millions of faithful ahead of the Muslim fasting month of Ramadan and a… [+6856 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "World Cup-winner Del Piero prevented from receiving Russian visa over killer coronavirus fears - reports", "description": "A Russian visa is notriously difficult to obtain, so spare a thought for World Cup winner Alessandro Del Piero who was prevented from obtaining a visa in Italy, instead traveling from LA to Armenia due to coronavirus fears. Read Full Article at RT.com", "url": "https://www.rt.com/sport/481814-del-piero-coronavirus-italy-russian-visa/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e57c08f85f5407fb900901e.jpg", "publishedAt": "2020-02-27T13:13:00Z", "content": "For those of you who have ever attempted traveling to Russia, you'll know that ahead of the extreme climate and imposing language barrier, there is one roadblock that stands above all as the most difficult to circumvent: the Russian visa process.\r\nThe painsta… [+1598 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jessica Menton, USA TODAY", "title": "Dow futures plunge nearly 400 points on fears the coronavirus could be spreading to the US", "description": "Stock futures tumbled Thursday as fears mount that the deadly coronavirus could be spreading to the U.S. as the number of world-wide cases top 81,000.", "url": "https://finance.yahoo.com/news/dow-futures-slide-300-points-124903028.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/oSLB8fUCKju0a.0eakox9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/OFMHMwdPjUrlWCk2w.0O8A--~B/aD0zNjM3O3c9NTQ1NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/9f788c9cdfd8c0b5919d6ec5ee3423ab", "publishedAt": "2020-02-27T14:09:30Z", "content": "Stock futures tumbled Thursday as fears mount that the deadly coronavirus could be spreading to the U.S. as the number of worldwide cases top 81,000.\r\nDow futures dropped nearly 400 points while Standard &amp; Poors 500 futures slumped 1.5%.\r\nHeading into Thu… [+2091 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "John Bacon, USA TODAY", "title": "First coronavirus patient with 'unknown origin' in the US wasn't tested for days", "description": "A California coronavirus patient, the first U.S. case from \"community spread,\" was not tested for days because the case didn't fit CDC criteria...", "url": "https://news.yahoo.com/first-coronavirus-patient-unknown-origin-140624902.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kLm2OeJZpDn5Cub.IBZ0jw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MTUuMg--/https://s.yimg.com/uu/api/res/1.2/F9v21_XJfpiwchRNFrr2Iw--~B/aD0zMTc2O3c9NDQ0NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/0b4932b65a82c4f507e7c94598384c33", "publishedAt": "2020-02-27T14:06:24Z", "content": "A California coronavirus patient believed to be the first U.S. case from \"unknown\" exposure was not tested for several days because federal health officials believed he did not meet the criteria, officials say.\r\nThe patient was transferred to UC Davis Medical… [+2467 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Amanda Woods", "title": "California coronavirus patient was hospitalized for days without being tested", "description": "The California coronavirus patient whose case is of “unknown” origin was hospitalized for days without being tested, according to a new report. The Solano County resident was admitted to UC Davis Medical Center last week but wasn’t tested until Sunday — and r…", "url": "https://nypost.com/2020/02/27/california-coronavirus-patient-was-hospitalized-for-days-without-being-tested/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/uc-davis-61.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-27T13:16:01Z", "content": "The California coronavirus patient whose case is of “unknown” origin was hospitalized for days without being tested, according to a new report.\r\nThe Solano County resident was admitted to UC Davis Medical Center last week but wasnt tested until Sunday — and r… [+2569 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Vivian Wang, Vivian Wang", "title": "Coronavirus: How food delivery drivers manage to work in China despite virus outbreak", "description": "Not all superheroes have capes – some deliver food on motorbikes to disease-ridden neighbourhoods where residents might otherwise not eat at all, finds Vivian Wang", "url": "https://www.independent.co.uk/news/world/asia/coronavirus-china-food-delivery-motorbike-outbreak-symptoms-a9355171.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/28/10/rts1e6u2.jpg", "publishedAt": "2020-02-27T13:16:43Z", "content": "The delivery driver did not want to go upstairs. Zhang Sai hovered outside an apartment building in Wuhan, the central Chinese city at the heart of the coronavirus outbreak. He has been ordered not to take food to customers doors to minimise the risk of infec… [+51932 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "At least 8 countries confirm first cases of COVID-19 - CNA", "description": "At least 8 countries confirm first cases of COVID-19 CNA Coronavirus Epidemic at 'Decisive Point': WHO Chief Urges Countries to 'Move Swiftly' to Contain Disease News18 Travel during spread of coronavirus: train, bus, boat, and plane - Business Insider Busine…", "url": "https://www.youtube.com/watch?v=HlBuCoRTzRg", "urlToImage": "https://i.ytimg.com/vi/HlBuCoRTzRg/maxresdefault.jpg", "publishedAt": "2020-02-27T13:42:35Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "President Emmanuel Macron says France facing coronavirus ‘epidemic’ - Hindustan Times", "description": "President Emmanuel Macron says France facing coronavirus ‘epidemic’ Hindustan Times Coronavirus in Europe: epidemic or 'infodemic'? BBC News View Full coverage on Google News", "url": "https://www.hindustantimes.com/world-news/president-emmanuel-macron-says-france-facing-coronavirus-epidemic/story-doJuApvEhvyPIwjSSJiylM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/02/27/Pictures/israel-auschwitz-liberation-anniversary_5a3cef80-5963-11ea-88d7-2ebec7a61521.jpg", "publishedAt": "2020-02-27T14:08:00Z", "content": "President Emmanuel Macron said on Thursday that France was preparing for a jump in the number of coronavirus cases, adding “we are going to have to deal with it as best we can.” “We are facing a crisis, an epidemic that is coming,” Macron said while visiting … [+1395 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "#39;Chicken sales down 50%, prices by 70% in India on coronavirus rumour#39;", "description": "Yadav also mentioned that the government has issued advisories that coronavirus does not spread from chicken and asked state governments to take action against rumour mongers.", "url": "https://www.moneycontrol.com/news/business/chicken-sales-down-50-prices-by-70-in-india-on-coronavirus-rumour-4984171.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/06/Chickens_in_poultry_farm-770x433.jpg", "publishedAt": "2020-02-27T14:10:05Z", "content": "Chicken sales in India have come down over 50 per cent and prices by 70 per cent in the last one month as speculation swirled on social media that chicken causes coronavirus disease, denting both demand and prices, a top Godrej Agrovet official said on Thursd… [+1950 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Virus-hit stocks shed $3 trillion; safe havens thrive", "description": "The number of new coronavirus infections in China - the source of the outbreak - was for the first time overtaken by fresh cases elsewhere on Wednesday, raising pandemic fears.", "url": "https://www.moneycontrol.com/news/business/markets/virus-hit-stocks-shed-3-trillion-safe-havens-thrive-4984031.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/07/Asian-Markets-770x433.jpg", "publishedAt": "2020-02-27T13:30:07Z", "content": "Stocks resumed their plunge, wiping out more than $3 trillion in value this week alone, and US Treasuries yields hit record lows on Thursday as the coronavirus spread faster outside China and investors fled to safe havens.\r\nThe number of new coronavirus infec… [+2931 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "TipRanks", "title": "3 “Strong Buy” Stocks Holding Steady Amid Coronavirus Concerns", "description": "Coronavirus fears have weighed heavily on the market, and investors are seeking refuge. While the situation in China is reportedly improving, health officials warn the spike in new cases throughout the rest of the world underscores the risk of a global pandem…", "url": "https://finance.yahoo.com/news/3-strong-buy-stocks-holding-133012445.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/C35Y5T9ck4WUzAacKNq3jw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD01MDMuOTkyNjQwMjk0Mzg4MjU-/https://s.yimg.com/uu/api/res/1.2/5RoqicYm85tEtn3qTlvBQg--~B/aD00Mjg7dz0xMDg3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/93a4847377087f33fd0dd1e13a52db55", "publishedAt": "2020-02-27T13:30:12Z", "content": "Coronavirus fears have weighed heavily on the market, and investors are seeking refuge. While the situation in China is reportedly improving, health officials warn the spike in new cases throughout the rest of the world underscores the risk of a global pandem… [+8111 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "David Yaffe-Bellany", "title": "1,000 Workers, Go Home: Companies Act to Ward Off Coronavirus", "description": "An oil company and a media group have told hundreds of employees in London to work from home. A television giant is stopping people who have visited certain countries from entering its offices in Europe. A German airline has asked workers to take unpaid leave…", "url": "https://news.yahoo.com/1-000-workers-home-companies-131755385.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/OQ_ALOiCL4APPufyIhPZYg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MTQuMTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/e9wohm7z.hVvXxWYIFuFWQ--~B/aD0yMTk0O3c9MzA3MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/a779db7dbbe8d5580b3d0507888e3dfe", "publishedAt": "2020-02-27T13:17:55Z", "content": "A man sits in the normally crowded Brera area in Milan on Feb. 26, 2020. (Andrea Mantovani/The New York Times)\r\nAn oil company and a media group have told hundreds of employees in London to work from home. A television giant is stopping people who have visite… [+5717 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tobias Hoonhout", "title": "Japan to Close All Schools until April to Slow Coronavirus", "description": "Prime Minister Shinzo Abe announced Thursday that Japan will close its schools until April in a bid to halt the spread of coronavirus.“Efforts have been made to prevent the spread of infection among children in each region, and these one or two weeks will be …", "url": "https://news.yahoo.com/japan-close-schools-until-april-135319242.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1HeLFhI_iPmZVxHABM9GRg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuMjU-/https://s.yimg.com/uu/api/res/1.2/Bxs.ppz1me726s1GcxSXQg--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/f76dc7b51f6f3a43d852ed2f2f67f099", "publishedAt": "2020-02-27T13:53:19Z", "content": "Prime Minister Shinzo Abe announced Thursday that Japan will close its schools until April in a bid to halt the spread of coronavirus.\r\nEfforts have been made to prevent the spread of infection among children in each region, and these one or two weeks will be… [+1679 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "MARTIN CRUTSINGER", "title": "US economy grew at 2.1% rate in Q4 but virus threat looms", "description": "The U.S. economy grew at an annual rate of 2.1% in the final quarter of last year, but damage from the spreading coronavirus is likely depressing growth in the current quarter and for 2020 as a whole.", "url": "https://finance.yahoo.com/news/us-economy-grew-2-1-134110519.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1kDcmFXi1.mkOGmFYqIIBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/1zO1FguMhck3cilmnuYC.w--~B/aD0yOTQyO3c9NDQxMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/dab51ce3392b828fe6f5ab8af9aa683a", "publishedAt": "2020-02-27T13:41:10Z", "content": "WASHINGTON (AP) The U.S. economy grew at an annual rate of 2.1% in the final quarter of last year, but damage from the spreading coronavirus is likely depressing growth in the current quarter and for 2020 as a whole.\r\nThe Commerce Department said Thursday tha… [+3135 chars]"}, {"source": {"id": null, "name": "Krqe.com"}, "author": "Allison Keys", "title": "February 27 Morning Rush: Facial recognition technology leads to arrest at Albuquerque store - KRQE News 13", "description": "1 New facial recognition technology is being used at a northeast heights Albertsons. The high-tech tool known as FaceFirst is already helping police with the arrest of a man accused of shoplifting …", "url": "https://www.krqe.com/news/albuquerque-metro/february-27-morning-rush-facial-recognition-technology-leads-to-arrest-at-albuquerque-store/", "urlToImage": "https://www.krqe.com/wp-content/uploads/sites/12/2020/02/morningrush-17.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-02-27T13:49:00Z", "content": "1 New facial recognition technology is being used at a northeast heights Albertsons. The high-tech tool known as FaceFirst is already helping police with the arrest of a man accused of shoplifting there in the past. The arrest took place on Wednesday night at… [+2304 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sarah Young, Sarah Young", "title": "Coronavirus: Celebrities including Gwyneth Paltrow and Bella Hadid react to outbreak on social media", "description": "As the virus continues to spread, stars are sharing safety advice and scaremongering selfies", "url": "https://www.independent.co.uk/life-style/coronavirus-celebrities-instagram-face-masks-outbreak-gwyneth-paltrow-bella-hadid-a9362981.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/27/13/img-20200227-130843.jpg", "publishedAt": "2020-02-27T13:40:26Z", "content": "Designer suitcases and luxury loungewear are the kind of extravagant items one would expect to see a celebrity take on board as they clock up air miles on arduous long-haul flights. \r\nBut following the outbreak of coronavirus, A-listers have been seen sportin… [+5407 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Face off: Fights break out on streets of Japan amid surgical masks shortage (VIDEOS)", "description": "Japan is currently grappling with multiple coronavirus outbreaks which are threatening the upcoming Olympic Games and now, amid rumours of surgical mask shortages, brawls are breaking out on the streets. Read Full Article at RT.com", "url": "https://www.rt.com/news/481813-street-fights-japan-coronavirus-masks/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e57b99620302716fa31634c.JPG", "publishedAt": "2020-02-27T13:42:36Z", "content": "Demand for masks has skyrocketed across Japan with shops and pharmacies selling out faster than they can replenish stocks, exacerbating an already tense situation. \r\nWhen word gets around about a new shipment on its way, queues form almost immediately, as was… [+1328 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "China reports rise in new coronavirus cases, warns of risk of rebound - Livemint", "description": "China reports rise in new coronavirus cases, warns of risk of rebound Livemint China coronavirus: Death toll climbs to 2,744 amid decline in cases Times of India China investigates release of SARS-Cov-2 infected inmate in Hubei The Hindu Coronavirus death tol…", "url": "https://www.livemint.com/news/world/china-reports-rise-in-new-coronavirus-cases-warns-of-risk-of-rebound-11582808414808.html", "urlToImage": "https://images.livemint.com/img/2020/02/27/600x338/2020-02-27T050416Z_582296008_RC2T8F9KDRKD_RTRMADP_3_CHINA-HEALTH-SHANGHAI-TRAIN-STATION_1582808514515_1582808542960.JPG", "publishedAt": "2020-02-27T13:12:27Z", "content": "Shanghai/Beijing: China reported 433 new cases of coronavirus infections on Feb. 26, the National Health Commission said on Thursday, up from 406 a day earlier, with a cluster of new cases in Beijing raising concerns about the management of employees returnin… [+3921 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Kurt Zindulka, Kurt Zindulka", "title": "UK Schools Close as Two More Coronavirus Cases Confirmed", "description": "Schools across the United Kingdom have closed in response to the growing European outbreak of the coronavirus, as two more people have been confirmed to have contracted the virus in England. In Derbyshire, a primary school was closed following the", "url": "https://www.breitbart.com/europe/2020/02/27/uk-schools-close-as-two-more-coronavirus-cases-confirmed/", "urlToImage": "https://media.breitbart.com/media/2020/02/GettyImages-1208579897-640x335.jpeg", "publishedAt": "2020-02-27T14:10:51Z", "content": "Schools across the United Kingdom have closed in response to the growing European outbreak of the coronavirus, as two more people have been confirmed to have contracted the virus in England.\r\nIn Derbyshire, a primary school was closed following the return of … [+2128 chars]"}, {"source": {"id": null, "name": "Travelupdate.com"}, "author": "TravelUpdate", "title": "Coronavirus Impact: Which countries should you avoid traveling to?", "description": "Most recently, a Korean Air cabin crew worker tested positive for Coronavirus. This set off alarms, posing the question about safety while traveling. The post Coronavirus Impact: Which countries should you avoid traveling to? appeared first on TravelUpdate.", "url": "https://travelupdate.com/coronavirus-countries-avoid-travel/", "urlToImage": "https://travelupdate.com/wp-content/uploads/2020/02/cv-1024x683.jpg", "publishedAt": "2020-02-27T13:30:36Z", "content": "Disclaimer: I'm NOT a licensed medical professional. This article is for information only &amp; doesn't constitute medical advice. Please consult your doctor or licensed medical professional before planning your travel\r\nThe outbreak of the Coronavirus has alr… [+4080 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Indian aviation sector outlook remains ‘negative’ amid coronavirus outbreak: ICRA report", "description": "The outlook for India's aviation industry remains \"negative\" in the wake of coronavirus outbreak, which has resulted in many international passengers cancelling their travel to South East Asian countries, according to rating agency ICRA The post Indian aviati…", "url": "https://www.firstpost.com/business/indian-aviation-sector-outlook-remains-negative-amid-coronavirus-outbreak-icra-report-8093941.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/large_file_plugin/2018/12/1546242374_Aircraft_social.jpg", "publishedAt": "2020-02-27T13:15:01Z", "content": "Mumbai: The outlook for India's aviation industry remains \"negative\" in the wake of coronavirus outbreak, which has resulted in many international passengers cancelling their travel to South East Asian countries, according to rating agency ICRA.\r\nMore than 81… [+4253 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "South Korea struggles to contain coronavirus outbreak - Al Jazeera English", "description": "South Korea has confirmed 505 fresh cases of coronavirus infection, meaning it has overtaken China in new daily infection numbers. The government has stepped...", "url": "https://www.youtube.com/watch?v=Qh3Gvydq4C4", "urlToImage": "https://i.ytimg.com/vi/Qh3Gvydq4C4/maxresdefault.jpg", "publishedAt": "2020-02-27T13:30:51Z", "content": "South Korea has confirmed 505 fresh cases of coronavirus infection, meaning it has overtaken China in new daily infection numbers.The government has stepped up measures to stop the spread of the virus.Al Jazeera's Sarah Clark reports.\r\n- Subscribe to our chan… [+228 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "David Badash, The New Civil Rights Movement", "title": "The California coronavirus patient went untested for days because CDC criteria weren’t met", "description": "The first known case of coronavirus possibly the result of “community spread” in the United States was diagnosed in California, but despite doctors’ requests the patient was not tested for days. The New York Times reports the CDC refused to test because the p…", "url": "https://www.rawstory.com/2020/02/the-california-coronavirus-patient-went-untested-for-days-because-cdc-criteria-werent-met/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Coronavirus-Shutterstock.jpeg", "publishedAt": "2020-02-27T13:52:36Z", "content": "The first known case of coronavirus possibly the result of “community spread” in the United States was diagnosed in California, but despite doctors’ requests the patient was not tested for days. The New York Times reports the CDC refused to test because the p… [+1633 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Eleanor Busby, Eleanor Busby", "title": "Coronavirus: Academy chain closes schools because it has some 'students of Italian origin'", "description": "The trust does not suspect there to be any cases of the virus among pupils", "url": "https://www.independent.co.uk/news/education/education-news/coronavirus-news-italy-schools-closed-khalsa-academies-trust-wolverhampton-london-a9363031.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/27/13/khalsa-academy-wolverhampton.jpg", "publishedAt": "2020-02-27T13:40:54Z", "content": "An academy chain has closed three of its schools over the coronavirus scare because it has some students of Italian origin.\r\nSchools in Wolverhampton, Buckinghamshire and London run by Khalsa Academies Trust will shut for two days for a deep clean as a precau… [+3766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Trump downplays threat of coronavirus in the US", "description": "President Trump appeared to downplay the threat of coronavirus spreading in the US during a White House press conference, but CDC experts warned it will only get worse before it gets better. CNN's Joe Johns has more.", "url": "https://www.cnn.com/videos/politics/2020/02/27/trump-downplays-threat-of-coronavirus-in-us-joe-johns-newday-dnt-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200227073536-trump-downplays-coronavirus-threat-super-tease.jpg", "publishedAt": "2020-02-27T13:17:49Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "PayPal Updates First Quarter 2020 Revenue Outlook Based on Coronavirus Impact", "description": "PayPal Holdings, Inc. (NASDAQ: PYPL) has been carefully assessing the effect of COVID-19 as conditions continue to evolve. We are prioritizing the health and safety of our employees and supporting those in need. Our thoughts continue to be with the communitie…", "url": "https://news.yahoo.com/paypal-updates-first-quarter-2020-133900128.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/YQEGXr1GYngf_njhC4bpPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTE5NA--/https://s.yimg.com/uu/api/res/1.2/cVuSZ0VXmw0HWgBI8.vB5A--~B/aD05Nzt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/872c64f693e766ddbcb30918b1d1dd71", "publishedAt": "2020-02-27T13:39:00Z", "content": "SAN JOSE, Calif., Feb. 27, 2020 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) has been carefully assessing the effect of COVID-19 as conditions continue to evolve. We are prioritizing the health and safety of our employees and supporting those in need.… [+4029 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Q3 GDP growth seen at 4.7%, coronavirus poses risk to nascent recovery: Analysts - Livemint", "description": "Q3 GDP growth seen at 4.7%, coronavirus poses risk to nascent recovery: Analysts Livemint India Q3 GDP Growth Forecasts: Better But Not By Much BloombergQuint GDP tomorrow: Third time lucky in third quarter, or more bad news in store? Fingers crossed Economic…", "url": "https://www.livemint.com/news/india/q3-gdp-growth-seen-at-4-7-coronavirus-poses-risk-to-nascent-recovery-analysts-11582809617785.html", "urlToImage": "https://images.livemint.com/img/2020/02/27/600x338/2020-02-18T094655Z_1_LYNXMPEG1H0O3_RTROPTP_3_INDIA-TAX_1582809987180_1582810017502.JPG", "publishedAt": "2020-02-27T13:28:36Z", "content": "New Delhi: Having suffered its weakest expansion in over six years in the September quarter, India's economy probably fared slightly better in the December quarter, before suffering a relapse due to the impact of the coronavirus globally, analysts said.Gross … [+2871 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Rappler.com", "title": "COVID-19 spreads to Europe via Italy | Evening wRap", "description": "Today on Rappler: Scramble to contain coronavirus as infections spread in Europe The coronavirus outbreak spreads to Europe from Italy, as Greece, Croatia, Austria, Switzerland and Algeria all report cases related to Italy. Cayetano says Velasco is behind ous…", "url": "https://www.rappler.com/video/newscast/252882-thewrap-february-27-2020-evening-edition", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/0688A1AE6ABE484CBB0BEB040376753D/wrap.jpg", "publishedAt": "2020-02-27T13:40:32Z", "content": null}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "NEW SOCIALIST “IT GIRL” CONTINUES TO PAY DIVIDENDS: AOC Has Warning For Migrants Caravans: Mike…", "description": "NEW SOCIALIST “IT GIRL” CONTINUES TO PAY DIVIDENDS: AOC Has Warning For Migrants Caravans: Mike Pence literally does not believe in science.It is utterly irresponsible to put him in charge of US coronavirus response as the world sits on the cusp of a pandemic…", "url": "https://pjmedia.com/instapundit/359680/", "urlToImage": null, "publishedAt": "2020-02-27T13:45:32Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Themorningnews.org"}, "author": "The Morning News LLC; www.themorningnews.org", "title": "Thursday headlines: Laughter, anger, donuts, robots.", "description": "US health authorities say they&rsquo;ve identified the first case of coronavirus that doesn&rsquo;t have known ties to an existing outbreak. Saudi Arabia halts travel to the holiest sites in Islam&#8230;", "url": "https://themorningnews.org/post/thursday-headlines-laughter-anger-donuts-robots", "urlToImage": "https://themorningnews.org/images/tmn-logo-share.png", "publishedAt": "2020-02-27T14:00:00Z", "content": "US health authorities say they’ve identified the first case of coronavirus that doesn’t have known ties to an existing outbreak.\r\nSaudi Arabia halts travel to the holiest sites in Islam over coronavirus fears just months ahead of the annual Hajj pilgrimage.\r\n… [+2039 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Hayley Richardson For Mailonline", "title": "BBC Breakfast viewers blast GP for 'contaminating' hand sanitiser", "description": "British GP Dr Rosemary Leonard joined presenters Charlie Stayt and Rachel Burden on BBC Breakfast this morning and performed a handwashing demonstration - but she attracted criticism.", "url": "https://www.dailymail.co.uk/femail/article-8051251/BBC-Breakfast-viewers-blast-GP-contaminating-hand-sanitiser.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/27/13/25271244-0-image-a-63_1582809275743.jpg", "publishedAt": "2020-02-27T13:29:48Z", "content": "BBC Breakfast viewers blasted a doctor for coughing into her hands before reaching for hand sanitiser during a segment today about keeping the spread of viruses at bay with good hygiene.\r\nDr Rosemary Leonard joined presenters Charlie Stayt and Rachel Burden a… [+5205 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: WHO hold news conference on Covid-19 outbreak – watch live - Guardian News", "description": "Coronavirus: WHO hold news conference on Covid-19 outbreak – watch live Guardian News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=LTqG3AlBuFE", "urlToImage": "https://i.ytimg.com/vi/LTqG3AlBuFE/maxresdefault_live.jpg", "publishedAt": "2020-02-27T13:38:45Z", "content": null}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "WHO official calls Trump comments on coronavirus response 'incoherent' (Justin Wise/The Hill)", "description": "Justin Wise / The Hill : WHO official calls Trump comments on coronavirus response ‘incoherent’ — Dr. Ezekiel Emanuel, special advisor to the director general of the World Health Organization (WHO), said Wednesday that he found President Trump's press confere…", "url": "https://www.memeorandum.com/200227/p17", "urlToImage": "https://thehill.com/sites/default/files/newsletter-cms_022720getty.jpg", "publishedAt": "2020-02-27T13:35:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Shtfplan.com"}, "author": "Contributing Author", "title": "The Global Economy Was Sinking Long Before The Coronavirus Appeared", "description": "In order to determine if a geopolitical or economic threat is legitimate, I find it helps to watch how the mainstream propaganda narrative flows and changes.", "url": "https://www.shtfplan.com/headline-news/the-global-economy-was-sinking-long-before-the-coronavirus-appeared_02272020", "urlToImage": "https://www.shtfplan.com/wp-content/uploads/2018/05/economy-sinking-ship.jpg", "publishedAt": "2020-02-27T13:30:17Z", "content": "This article was originally published by Brandon Smith at Alt-Market. \r\nIn order to determine if a geopolitical or economic threat is legitimate, I find it helps to watch how the mainstream propaganda narrative flows and changes.\r\nFor example, for the past ye… [+9993 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Israel turns back travellers from Italy over virus fears", "description": "Israel denied entry to dozens of foreign nationals who landed on flights from Italy on Thursday, as the Jewish state discouraged travel as part of efforts to contain the spread of the new coronavirus. The interior ministry had announced travellers from Italy …", "url": "https://news.yahoo.com/israel-turns-back-travellers-italy-over-virus-fears-133133798.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/V2t2Z49qVfajdFYQWH_vbw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjYuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/FDzycm9y37lPMVVSW3KeAQ--~B/aD01MjA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/791843584564013b1b77be1e77745e83c97c104f.jpg", "publishedAt": "2020-02-27T13:31:33Z", "content": "Tel Aviv (AFP) - Israel denied entry to dozens of foreign nationals who landed on flights from Italy on Thursday, as the Jewish state discouraged travel as part of efforts to contain the spread of the new coronavirus.\r\nThe interior ministry had announced trav… [+984 chars]"}, {"source": {"id": null, "name": "Unity3d.com"}, "author": "John Riccitiello", "title": "An update on our GDC 2020 plans", "description": "GDC is always our favorite time of year at Unity. It’s a chance for us to connect with creators, customers, players, and partners from around the world. Unfortunately, this year, after much thought and deliberation, we have made the difficult decision to pull…", "url": "https://blogs.unity3d.com/2020/02/27/an-update-on-our-gdc-2020-plans/", "urlToImage": "https://blogs.unity3d.com/wp-content/uploads/2020/02/Unity-GDC2020-BlogHeader-01.png", "publishedAt": "2020-02-27T13:59:36Z", "content": "GDC is always our favorite time of year at Unity. Its a chance for us to connect with creators, customers, players, and partners from around the world. \r\nUnfortunately, this year, after much thought and deliberation, we have made the difficult decision to pul… [+703 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "‘Just not factual’: CNN’s Camerota corners GOP lawmaker about Trump spreading coronavirus misinformation", "description": "CNN’s Alisyn Camerota on Thursday grilled Rep. Will Hurd (R-TX) about President Donald Trump’s widely panned response to the coronavirus epidemic. During an interview with Hurd, Camerota asked whether he really had confidence in Vice President Mike Pence’s ab…", "url": "https://www.rawstory.com/2020/02/just-not-factual-cnns-camerota-corners-gop-lawmaker-about-trump-spreading-coronavirus-misinformation/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2018/05/camerota.jpg", "publishedAt": "2020-02-27T13:26:23Z", "content": "CNN’s Alisyn Camerota on Thursday grilled Rep. Will Hurd (R-TX) about President Donald Trump’s widely panned response to the coronavirus epidemic.\r\nDuring an interview with Hurd, Camerota asked whether he really had confidence in Vice President Mike Pence’s a… [+862 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "John Follain and Ania Nussbaum", "title": "Macron, Conte Seek to Map New Course After Paris-Rome Spat", "description": "(Bloomberg) -- French President Emmanuel Macron and Italian Prime Minister Giuseppe Conte staged a show of friendship with a summit designed to turn the page...", "url": "https://news.yahoo.com/macron-conte-seek-map-course-140438523.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-27T14:04:38Z", "content": "(Bloomberg) -- French President Emmanuel Macron and Italian Prime Minister Giuseppe Conte staged a show of friendship with a summit designed to turn the page on a postwar low in bilateral relations, even as coronavirus concerns overshadowed the meetings agend… [+3401 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "Is it safe to travel to Italy, Japan (or anywhere else) amid coronavirus outbreak?", "description": "As more coronavirus (COVID-19) cases spread around the globe, travelers going to Italy or on a cruise may be concerned what it means for their plans. Here, health and insurance experts weigh in about whether or not you should cancel a trip, plus share the bes…", "url": "https://www.cnbc.com/2020/02/27/should-you-cancel-a-trip-to-italy-or-japan-amid-coronavirus-outbreak.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106411237-1582734844596young-millennial-woman-checking-social-media-at-the-airport-nominated-on-jun-14-using-mobile-using_t20_xvgkwm.jpg?v=1582734885", "publishedAt": "2020-02-27T13:48:32Z", "content": "As many people gear up for spring break vacations, concerns about coronavirus continue to grow among travelers.\r\nCoronavirus, which was renamed COVID-19, has infected more than 80,000 people around the globe and killed more than 2,700 people. The World Health… [+7208 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Upcoming Doraemon and Shimajiro Anime Film Delayed Due to Coronavirus Measures", "description": "Schools around Japan will be closed until the end of MarchUpcoming Doraemon and Shimajiro Anime Film Delayed Due to Coronavirus Measures Over the next week, two new children's anime film was set to be released in Japanese cinemas, but both Doraemon: Nobita's …", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/RaEqc1gvz94/upcoming-doraemon-and-shimajiro-anime-film-delayed-due-to-coronavirus-measures", "urlToImage": null, "publishedAt": "2020-02-27T14:01:02Z", "content": null}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "MARTIN CRUTSINGER", "title": "US economy grew at 2.1% rate in Q4 but virus threat looms", "description": "WASHINGTON (AP) — The U.S. economy grew at an annual rate of 2.1% in the final quarter of last year, but damage from the spreading coronavirus is likely depressing growth in the current quarter and for 2020 as a whole. The Commerce Department said Thursday th…", "url": "https://www.seattletimes.com/business/us-economy-grew-at-2-1-rate-in-q4-but-virus-threat-looms/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-e1352e2df64c4ff1ad18c3f0b392e4d0Economy_GDP_05286-1200x630.jpg", "publishedAt": "2020-02-27T13:41:13Z", "content": "WASHINGTON (AP) The U.S. economy grew at an annual rate of 2.1% in the final quarter of last year, but damage from the spreading coronavirus is likely depressing growth in the current quarter and for 2020 as a whole.\r\nThe Commerce Department said Thursday tha… [+4152 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "‘Set up for failure’: CNN’s Camerota speculates Pence is about to become Trump’s coronavirus fall guy", "description": "President Donald Trump on Wednesday appointed Vice President Mike Pence to oversee the federal government’s response to the coronavirus outbreak — but CNN’s Alisyn Camerota said that the president may have given the VP an impossible task. Reacting to the news…", "url": "https://www.rawstory.com/2020/02/set-up-for-failure-cnns-camerota-speculates-pence-is-about-to-become-trumps-coronavirus-fall-guy/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2016/12/abc_tw_pence_161204a-1000x563.jpg", "publishedAt": "2020-02-27T13:47:55Z", "content": "President Donald Trump on Wednesday appointed Vice President Mike Pence to oversee the federal government’s response to the coronavirus outbreak — but CNN’s Alisyn Camerota said that the president may have given the VP an impossible task.\r\nReacting to the new… [+1063 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Matthew Chapman", "title": "NYT reporter reveals the stunning reason Trump believed coronavirus would disappear next month", "description": "On CNN Thursday, New York Times reporter Maggie Haberman revealed that President Donald Trump is angry about his administration’s coronavirus response — in part because he misunderstood what the experts told him about the disease and thought they meant it was…", "url": "https://www.rawstory.com/2020/02/nyt-reporter-reveals-the-stunning-reason-trump-believed-coronavirus-would-disappear-next-month/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/01/trump-afp-2.jpg", "publishedAt": "2020-02-27T13:52:28Z", "content": "On CNN Thursday, New York Times reporter Maggie Haberman revealed that President Donald Trump is angry about his administration’s coronavirus response in part because he misunderstood what the experts told him about the disease and thought they meant it was g… [+1002 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "Japan: Woman tests positive for Coronavirus twice", "description": "Expert warns Coronavirus may lie dormant in patients believed to have recovered from the disease after woman tests positive after recovering", "url": "http://www.israelnationalnews.com/News/News.aspx/276561", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/941/941125.jpg", "publishedAt": "2020-02-27T13:40:35Z", "content": "A Japanese woman has tested positive for the Coronavirus a second time after being previously believed to have recovered from the disease,Reuters reported.\r\nThe woman, a tour bus guide in her 40s, was first diagnosed in late January. She was released from the… [+1030 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Pablo Piovano", "title": "WTI plummets to fresh 1-year low near $47.00", "description": "Crude oil prices remain well under heavy pressure on Thursday, dropping to the vicinity of the $47.00 mark per barrel on rising coronavirus fears, WTI", "url": "https://www.fxstreet.com/news/wti-plummets-to-fresh-1-year-low-near-4700-202002271329", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Commodities/Energy/Oil/petrol-filling-station-gm516732777-48350640_Large.jpg", "publishedAt": "2020-02-27T13:29:06Z", "content": "<ul><li>Prices of the WTI extends the sell-off to the boundaries of $47.00.</li><li>The barrel of WTI trades in levels last seen in January 2019.</li><li>Coronavirus panic continues to rise among oil traders.</li></ul>Crude oil prices remain well under heavy … [+1329 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Will Run For Miles", "title": "Amidst Growing Coronavirus Concerns, JetBlue Suspends Change and Cancellation Fees", "description": "By suspending change and cancellation fees, JetBlue seeks to encourage travelers to book flights during this time of uncertainty The post Amidst Growing Coronavirus Concerns, JetBlue Suspends Change and Cancellation Fees appeared first on Will Run For Miles.", "url": "https://willrunformiles.boardingarea.com/amidst-growing-coronavirus-concerns-jetblue-suspends-change-and-cancellation-fees/", "urlToImage": "https://willrunformiles.boardingarea.com/wp-content/uploads/2020/02/Photo-Feb-19-12-01-32.jpg", "publishedAt": "2020-02-27T13:23:44Z", "content": "This page may contain affiliate links from our advertising partners for which we many receive compensation. This may impact how and where products appear on this site. This site does not review or include all companies or all available products. We are thankf… [+2602 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Jack Power, Vivienne Clarke", "title": "Decision to restrict St Patrick’s Day parade ‘premature’, says tourism body", "description": "WHO official warns coronavirus will not ‘fade away’", "url": "https://www.irishtimes.com/news/ireland/irish-news/decision-to-restrict-st-patrick-s-day-parade-premature-says-tourism-body-1.4186798", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4186797&origw=1200", "publishedAt": "2020-02-27T13:14:58Z", "content": "Any decision to restrict or cancel the St Patricks Day parade over coronavirus fears would be premature, the body representing the domestic tourism industry has said.\r\nEoghan OMara-Walsh, chief executive of the Irish Tourism Industry Confederation (ITIC), sai… [+3671 chars]"}, {"source": {"id": null, "name": "Abcstlouis.com"}, "author": "ELAINE KURTENBACH AP Business Writer", "title": "World stocks slide on signs virus outbreak is spreading - ABC St. Louis", "description": "Global stock markets fell Thursday on concerns that the coronavirus was spreading to more countries, putting further strain on businesses and supply chains across the world. In Europe, where new cases were being reported, Germany's DAX lost 2. 2% to 12,496 an…", "url": "http://abcstlouis.com/news/nation-world/world-stocks-slide-on-signs-virus-outbreak-is-spreading", "urlToImage": "http://static-15.sinclairstoryline.com/resources/media/63e22e19-fa03-40f7-b788-95d0fb0e8ea1-large16x9_AP20058131588543.jpg?1582809729645", "publishedAt": "2020-02-27T13:22:00Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "CDC says Americans need to prepare for coronavirus now — here's what you can do", "description": "The Centers for Disease Control said Tuesday that Americans should prepare for the coronavirus to spread to the U.S. \"Now is the time for businesses, hospitals, communities, schools and everyday people to begin preparing,\" she said. Here, experts explain what…", "url": "https://www.cnbc.com/2020/02/27/how-to-help-prevent-coronavirus-in-us-what-to-buy-and-prepare.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106411477-1582742963127washing-hands_t20_lw3jwb.jpg?v=1582742997", "publishedAt": "2020-02-27T14:00:49Z", "content": "In the United States, there are currently 60 confirmed cases of coronavirus, aka COVID-19, in six states. The Centers for Disease Control confirmed the first possible community spread, or a case of unknown origin, in California on Wednesday.\r\nThe virus that f… [+4544 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Coronavirus woes: Epidemic affects domestic auto, forging industry, says AIFI; vehicle demand likely to decline by 8.3% this fiscal", "description": "Forging industry primarily caters to the $57 billion automotive industry. The association represents around 400 forging units with a cumulative annual production of 3 million tonne. The post Coronavirus woes: Epidemic affects domestic auto, forging industry, …", "url": "https://www.firstpost.com/business/coronavirus-woes-epidemic-affects-domestic-auto-forging-industry-says-aifi-vehicle-demand-likely-to-decline-by-8-3-this-fiscal-8094291.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2017/08/Automobile-factory-social_Reuters.jpg", "publishedAt": "2020-02-27T13:34:43Z", "content": "Mumbai: Disruption in supplies due to the coronavirus outbreak in China has hit domestic forging industry along with automobile and auto component manufacturing sectors, the Association of Indian Forging Industry (AIFI) said on Thursday.\r\nThe domestic automob… [+2899 chars]"}, {"source": {"id": null, "name": "Euractiv.com"}, "author": "Alexandra Brzozowski", "title": "Global Europe Brief: Pandemic Fears", "description": "Welcome to EURACTIV’s Global Europe Brief, your weekly update on the EU in the global perspective from our foreign affairs news team: Georgi Gotev and Alexandra Brzozowski.", "url": "http://www.euractiv.com/section/global-europe/news/global-europe-brief-pandemic-fears/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2020/02/GLOBALEU-BRIEF-1024x512-1-800x450.png", "publishedAt": "2020-02-27T13:52:56Z", "content": "Fears are growing that the coronavirus outbreak in China could grow into a pandemic with disruptive and deadly consequences for countries around the world. The World Health Organisation has said countries around the planet should prepare for a potential pande… [+2042 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Adam Lashinsky", "title": "In the time of coronavirus, Amazon needs to ‘take this crap down’", "description": "The online bookseller is peddling dangerous misinformation in a time of coronavirus, says Peter Jay Hotez, dean of Baylor University's National School of Tropical Medicine.", "url": "https://fortune.com/2020/02/27/coronavirus-amazon-anti-vaxxer/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/02/GettyImages-1203647628-e1582808551736.jpg?resize=1200,600", "publishedAt": "2020-02-27T13:57:09Z", "content": null}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Colby Hall", "title": "Maggie Haberman Hits Coronavirus Presser: ‘Sheer Volume’ of Untruths Said By Trump ‘Does Not Inspire Credibility’", "description": "NY Times White House reporter Maggie Haberman offered a completely reasonably yet cynical reaction to President Donald Trump's shifting rhetoric on the federal response to looming coronavirus pandemic following the White House press conference held early Wedn…", "url": "https://www.mediaite.com/tv/maggie-haberman-hits-coronavirus-presser-sheer-volume-of-untruths-said-by-trump-does-not-inspire-credibility/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-27-at-8.20.15-AM-1200x698.jpg", "publishedAt": "2020-02-27T13:35:57Z", "content": "NY Times White House reporter Maggie Haberman offered a completely reasonably yet cynical reaction to President Donald Trump’s shifting rhetoric on the federal response to looming coronavirus pandemic following the White House press conference held early Wedn… [+1396 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Noah Higgins-Dunn", "title": "Watch live: Florida Gov. Ron DeSantis holds press conference on the coronavirus outbreak", "description": "The number of daily new COVID-19 cases outside China exceeded those inside the country for the first time, the WHO announced Wednesday.", "url": "https://www.cnbc.com/2020/02/27/watch-live-florida-gov-desantis-holds-press-conference-on-the-coronavirus.html", "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/09/104094806-GettyImages-170812341.1910x1000.jpg", "publishedAt": "2020-02-27T13:35:17Z", "content": "[The stream is slated to start at 10 a.m. ET. Please refresh the page if you do not see a player above at that time.]\r\ndiv &gt; div.group &gt; p:first-child\"&gt;\r\nFlorida government officials are holding a press conference Thursday to update the public on the… [+2706 chars]"}]