[{"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Masks may actually increase your risk, surgeon general warns", "description": "US Surgeon General Dr. Jerome Adams not only wants people to stop buying facemasks to prevent the novel coronavirus, but warns that you actually might increase your risk of infection if facemasks are not worn properly.", "url": "https://www.cnn.com/2020/03/02/health/surgeon-general-coronavirus-masks-risk-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228132230-01-coronavirus-masks-super-tease.jpg", "publishedAt": "2020-03-02T12:38:22Z", "content": "Seriously people- STOP BUYING MASKS! \r\nThey are NOT effective in preventing general public from catching #Coronavirus, but if healthcare providers can't get them to care for sick patients, it puts them and our communities at risk! https://t.co/UxZRwxxKL9\r\n— U… [+55 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Covid-19 be another global pandemic? WION News | World News - WION", "description": "Will Covid-19 be another global pandemic? WION News | World News The death toll from the global coronavirus outbreak has surged to over 3000 across the world...", "url": "https://www.youtube.com/watch?v=7ISs0mvNOqY", "urlToImage": "https://i.ytimg.com/vi/7ISs0mvNOqY/maxresdefault.jpg", "publishedAt": "2020-03-02T12:12:35Z", "content": "Will Covid-19 be another global pandemic? WION News | World News\r\nThe death toll from the global coronavirus outbreak has surged to over 3000 across the world and at the moment close to 88,000 people are infected globally\r\n#Covid19#CoronavirusNews#IndiaCorona… [+1121 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "10 things you need to know before the opening bell", "description": "Here's what you need to know before the markets open. 1. 'There's nothing really to be relieved about': Stocks tumble as coronavirus fears outweigh stimulus hopes. Promises of support from central bankers failed to outweigh worries of a pandemic hitting globa…", "url": "https://www.businessinsider.com/opening-bell-march-02-2020-3", "urlToImage": "https://i.insider.com/5e5d040efee23d675f4f3e56?width=1200&format=jpeg", "publishedAt": "2020-03-02T13:05:52Z", "content": "Here's what you need to know before the markets open.\r\n1. 'There's nothing really to be relieved about': Stocks tumble as coronavirus fears outweigh stimulus hopes. Promises of support from central bankers failed to outweigh worries of a pandemic hitting glob… [+1940 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Payne", "title": "French people have been told to stop kissing each other on the cheek to stop coronavirus spreading", "description": "The French government orders its citizens to stop kissing each other on the cheek as the coronavirus rapidly spreads across Europe. The traditional French \"bise\" kiss is an integral part of the country's culture. President Emmanuel Macron's government also or…", "url": "https://www.businessinsider.com/coronavirus-france-tells-citizens-stop-kissing-each-other-cheek-bise-2020-3", "urlToImage": "https://i.insider.com/5e5cec21fee23d68300333e2?width=1200&format=jpeg", "publishedAt": "2020-03-02T12:50:00Z", "content": "France has told its citizens to stop kissing each other on the cheek in a bid to halt the rapid spread of the coronavirus across the country.\r\nThe country's health minister Olivier Veran warned French people over the weekend to stop participating in the tradi… [+1752 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Footage of empty Beijing mall", "description": "A man in Beijing, where everyone is told to stay home due to the coronavirus, visited a mall and took a video camera. It's all but deserted: you can get served, but you're not allowed to hang around. Jump a third of the way in for the \"action\". P.S. This is b…", "url": "https://boingboing.net/2020/03/02/footage-of-empty-beijing-mall.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/mall.jpg?fit=1200%2C640&ssl=1", "publishedAt": "2020-03-02T13:02:41Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Keane", "title": "iPhone production won't ramp up until the second quarter of 2020, analyst predicts - CNET", "description": "The coronavirus crisis will stop some Apple supplier production until May, according to Ming-Chi Kuo.", "url": "https://www.cnet.com/news/iphone-production-wont-ramp-up-until-the-second-quarter-of-2020-analyst-predicts/", "urlToImage": "https://cnet2.cbsistatic.com/img/BPAVFVP6Jue7D58bkmBYpqg_h0U=/756x567/2020/02/28/1a5d8fbc-69c9-4dfb-98ff-9b2fe83634d2/apple-11-9958.jpg", "publishedAt": "2020-03-02T12:53:39Z", "content": "Apple may not have enough iPhone camera lens to keep major production going, Ming-Chi Kuo said.\r\nAngela Lang/CNET\r\nApple's iPhone production won't improve significantly until the second quarter of the year, analyst Ming-Chi Kuo predicted, as previously report… [+259 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Ju-min Park", "title": "Wristwatch overshadows South Korea sect leader's coronavirus apology", "description": "When the elderly leader of a South Korean religious sect knelt before the nation on Monday, he had hoped to defuse public anger over his church's role in spreading the coronavirus. The gold-colored watch, visible on his left wrist, was apparently given by dis…", "url": "https://news.yahoo.com/wristwatch-overshadows-south-korea-sect-124321967.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/boPxJ6YcddyXtb4qhi_X_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04OTY-/https://s.yimg.com/uu/api/res/1.2/gmI9BbZf6nhsmSnvLa3ikA--~B/aD01NjA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/ff83c28e97458e05227d4a2f352b49f6", "publishedAt": "2020-03-02T12:43:21Z", "content": "By Ju-min Park\r\nGAPYEONG, South Korea (Reuters) - When the elderly leader of a South Korean religious sect knelt before the nation on Monday, he had hoped to defuse public anger over his church's role in spreading the coronavirus.\r\nYet Lee Man-hee's apology f… [+2074 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Stanford", "title": "Is America ready for a possible COVID-19 pandemic?", "description": "With coronavirus dominating the news, how ready is the United States for a possible COVID-19 pandemic? An expert explains what you need to know.", "url": "https://www.futurity.org/coronavirus-covid-19-us-preparation-2294022/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2020/02/coronavirus-covid-19_1600.jpg", "publishedAt": "2020-03-02T12:55:26Z", "content": "I see two. First, the Wuhan quarantine dramatically illustrated the challenges of maintaining a mass quarantine over an extended period of time. What the government did there is highly unusual; typically, isolation and quarantine orders are far narrower and b… [+1568 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Sharp to use TV factory to make surgical masks", "description": "The Japanese electronics giant repurposes its high-end clean rooms for coronavirus supplies.", "url": "https://www.bbc.co.uk/news/technology-51706629", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0DCA/production/_111103530_hi060320162.jpg", "publishedAt": "2020-03-02T13:11:15Z", "content": "Image copyrightReutersImage caption\r\n Japan, where face masks were already popular, has been struggling with shortages\r\nJapanese electronics giant Sharp is to use a TV factory to make surgical masks amid the coronavirus outbreak.\r\nIts parent company Foxconn h… [+2391 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "Jessica Hamzelou", "title": "Coronavirus: What are the worst symptoms and how deadly is covid-19?", "description": "We are starting to understand how the covid-19 virus may affect people in different ways, depending on their age and underlying health conditions", "url": "https://www.newscientist.com/article/2235847-coronavirus-what-are-the-worst-symptoms-and-how-deadly-is-covid-19/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2020/03/02123501/pa-50868952.jpg", "publishedAt": "2020-03-02T12:46:20Z", "content": "By Jessica Hamzelou\r\nUse a tissue to blow your nose, and put it in the bin\r\nYui Mok/PA Wire/PA Images\r\nIt has been two months since Chinas health officials described a mysterious virus spreading in Hubei. As of 2 March, the new coronavirus has infected nearly… [+4679 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": "Ellen Gutoskey", "title": "See If Your Hometown Made the List of America’s Top 20 Healthiest (or Unhealthiest) Cities", "description": "Access to healthy foods is important, but it’s not the only factor in determining a city’s overall health score.", "url": "https://www.mentalfloss.com/article/618929/americas-healthiest-and-unhealthiest-cities", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2122,x_211,y_0/v1582853021/shape/mentalfloss/618929-gettyimages-1071929434.jpg?itok=BRWlJXn7", "publishedAt": "2020-03-02T13:00:00Z", "content": "On Tuesday, February 25, the Centers for Disease Control and Prevention gave an update on the status of COVID-19, the disease caused by the new coronavirus, in the U.S. Though there have been about 60 cases of the disease in the country so far, and only one f… [+6513 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: EU raises virus risk level as world cases grow - BBC News - BBC News", "description": "Coronavirus: EU raises virus risk level as world cases grow - BBC News BBC News South Koreans told to stay home as coronavirus infections surpass 3,100 Reuters Coronavirus spreads to more countries as markets take historic tumble CNN Oregon coronavirus infect…", "url": "https://www.youtube.com/watch?v=CMUQIlvv1to", "urlToImage": "https://i.ytimg.com/vi/CMUQIlvv1to/maxresdefault.jpg", "publishedAt": "2020-03-02T12:49:12Z", "content": "Number of deaths worldwide now more than 3,000More than 90% are in Hubei, China, but there have been deaths in 10 other countriesEuropean Union disease prevention agency raises risk level to \"moderate to high\"South Korea reports 476 new cases, total 4,212, an… [+350 chars]"}, {"source": {"id": null, "name": "Buffalonews.com"}, "author": null, "title": "Cuomo urges calm as New York confronts arrival of coronavirus - Buffalo News", "description": "Cuomo urges calm as New York confronts arrival of coronavirus Buffalo News New York Governor Cuomo: Insurers must waive costs for coronavirus test - Business Insider Business Insider Coronavirus is here in New York: Keep calm and wash those hands! New York Po…", "url": "https://buffalonews.com/2020/03/02/new-york-woman-infected-with-coronavirus-is-health-care-worker-who-took-precautions/", "urlToImage": "https://s3.amazonaws.com/bncore/wp-content/uploads/2020/03/VIRUS-MASKS-e1583153870400.jpg", "publishedAt": "2020-03-02T12:56:20Z", "content": "ALBANY One day after the first confirmed case of coronavirus in New York, Gov. Andrew Cuomo had a piece of advice for the state:\r\nIts deep breath time,\" he said.\r\nTwelve hours later, both houses of the state Legislature agreed to pass a bill Monday night that… [+4733 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "Coronavirus in Florida: 2 people test ‘presumptively positive’ for COVID-19; public health emergency declared - AL.com", "description": "Coronavirus in Florida: 2 people test ‘presumptively positive’ for COVID-19; public health emergency declared AL.com Florida sees 2 coronavirus cases, DeSantis calls for public health emergency Fox News Florida’s first coronavirus cases found in Hillsborough …", "url": "https://www.al.com/news/2020/03/coronavirus-in-florida-2-people-test-presumptively-positive-for-covid-19-public-health-emergency-declared.html", "urlToImage": "https://www.al.com/resizer/PoxhmM45EGwtqnFP2C8gZjhZlsQ=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/G2LJFUVQDRBPZHIZ7HAYEUET3Q.jpg", "publishedAt": "2020-03-02T12:55:00Z", "content": "Two people in Florida have presumptive positive tests for coronavirus, health officials announced.\r\nBoth of the cases are in adults: one in Hillsborough County and the other in Manatee County, both in the southwestern part of the state. Both individuals are i… [+1322 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus: The Long, Slow Process to Finding a Vaccine", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-02/coronavirus-the-long-slow-process-to-finding-a-vaccine-video", "urlToImage": null, "publishedAt": "2020-03-02T12:39:08Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Dasl Yoon, Andrew Jeong", "title": "Leader of Secretive Church at Center of South Korea’s Virus Epidemic Apologizes - Wall Street Journal", "description": "Leader of Secretive Church at Center of South Korea’s Virus Epidemic Apologizes Wall Street Journal Coronavirus-linked South Korea sect leader apologizes for virus spread amid murder probe Fox News Coronavirus: South Korea church leader apologises for infecti…", "url": "https://www.wsj.com/articles/leader-of-secretive-church-at-center-of-south-koreas-virus-epidemic-apologizes-11583151284", "urlToImage": "https://images.wsj.net/im-159394/social", "publishedAt": "2020-03-02T12:30:00Z", "content": "GAPYEONG, South KoreaWith a nation demanding answers as infection cases rise, the 88-year-old founder of a secretive church central to South Koreas coronavirus epidemic issued an apology.\r\nI am not sure what words of mine will do, said Lee Man-hee, head of th… [+183 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Donna Fuscaldo)", "title": "Why Investors Shouldn't Panic Over Microsoft's Coronavirus Warning", "description": "The stock has been under pressure since the tech giant issued a COVID-19-related warning last week. But the pain should be short-lived.", "url": "https://www.fool.com/investing/2020/03/02/why-investors-not-panic-microsoft-coronavirus.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560619/investors-panic-mf.jpg", "publishedAt": "2020-03-02T13:00:00Z", "content": "Following in Apple's (NASDAQ:AAPL) footsteps, Microsoft(NASDAQ:MSFT) lowered its revenue target for the current quarter as a result of concerns over adverse effects from the novel coronavirus outbreak. \r\nThe software giant warned it doesn't expect to meet its… [+4291 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Danny Vena)", "title": "These 3 Stocks Might Just Be Immune to Coronavirus", "description": "Even if things worsen, these companies with a common thread could weather the COVID-19 outbreak better than most.", "url": "https://www.fool.com/investing/2020/03/02/these-3-stocks-might-just-be-immune-to-coronavirus.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560752/sick-woman-laying-on-sofa-holding-a-television-remote-with-tissues-strewn-about.jpg", "publishedAt": "2020-03-02T12:30:00Z", "content": "As the novel coronavirus outbreak enters its third month, Wall Street has finally succumbed to fears that the disease may continue to spread.\r\nFor investors looking at the major stock market indices last week, it was like watching a slow-motion train wreck. I… [+6445 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "ET Special Podcast: Delhi's first case of coronavirus", "description": "ET Special Podcast: Delhi's first case of coronavirusIn light of the fresh cases in Delhi and Telangana, the Health Ministry has raised security and screening at all entrances to the country, and has asked people not to panic. We've listed all the myths we've…", "url": "https://economictimes.indiatimes.com/news/podcasts/et-special-podcast-delhis-first-case-of-coronavirus-and-all-the-myths-weve-heard/articleshow/74442601.cms", "urlToImage": null, "publishedAt": "2020-03-02T12:23:20Z", "content": null}, {"source": {"id": null, "name": "Blogspot.com"}, "author": "Ewa Jodlowska", "title": "PyCon: March 2 Update on COVID-19", "description": "The coronavirus (also known as COVID-19)  is a new virus that causes respiratory illness in people and can spread from person-to-person. Sin...", "url": "https://pycon.blogspot.com/2020/03/march-2-update-on-covid-19.html", "urlToImage": null, "publishedAt": "2020-03-02T12:56:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus fears grow after two deaths in Washington state - CBS This Morning", "description": "Coronavirus fears grow after two deaths in Washington state CBS This Morning Coronavirus May Have Spread in U.S. for Weeks, Gene Sequencing Suggests The New York Times A second person in U.S. — and King County — dies of novel coronavirus; more cases likely Se…", "url": "https://www.youtube.com/watch?v=Eizlv1JiHMw", "urlToImage": "https://i.ytimg.com/vi/Eizlv1JiHMw/maxresdefault.jpg", "publishedAt": "2020-03-02T12:25:18Z", "content": "The coronavirus has killed two people in Washington state, and the number of states with confirmed cases has more than doubled to 12. At least 89 people have now been sickened in the U.S. Jonathan Vigliotti reports from Kirkland, Washington, where dozens of p… [+1358 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "William Wan", "title": "How is the coronavirus outbreak going to end? Here’s how similar epidemics played out. - The Washington Post", "description": "How is the coronavirus outbreak going to end? Here’s how similar epidemics played out. The Washington Post CDC: Coronavirus has been around since the mid-1960s, but has different types WCTV How long can coronavirus survive on surfaces? | The Japan Miracle The…", "url": "https://www.washingtonpost.com/health/2020/03/02/how-is-coronavirus-outbreak-going-end-heres-how-similar-epidemics-played-out/", "urlToImage": "https://www.washingtonpost.com/resizer/Q22dohwokUtI_JXd3y-quLORlQQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZDULORSZN4I6VDX5B6IEXXMAK4.jpg", "publishedAt": "2020-03-02T13:00:00Z", "content": "Health officials get control of the coronavirus through strict public health measures.\r\nWhen severe acute respiratory syndrome (SARS) first hit Asia in 2002, it was pretty scary with a fatality rate of about 10 percent and no drugs shown to be effective again… [+5983 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Virus fears cast doubt on start of Japan's season", "description": "Fear of the coronavirus outbreak has put the start of the Japanese baseball season in doubt.", "url": "https://www.espn.com/mlb/story/_/id/28820535/coronavirus-fears-cast-doubt-start-japanese-baseball-season", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0302%2Fr673844_1296x729_16%2D9.jpg", "publishedAt": "2020-03-02T13:05:05Z", "content": "TOKYO -- The opening of the Japanese baseball season is in doubt because of the outbreak of the coronavirus, officials said Monday, as the nation's baseball and soccer leagues tapped three medical experts as advisers.\r\nBaseball commissioner Atsushi Saito said… [+1946 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Jonathan Garber", "title": "Coronavirus hoarding to boost these food companies - Fox Business", "description": "The Kellogg Company, Mondalez International, The Campbell Soup Company, Post Holdings, B&G Foods, Hormel Foods, Tyson Foods and General Mills are companies that could see sales boosted by 3 percent to 7 percent.", "url": "https://www.foxbusiness.com/markets/coronavirus-hoarding-boost-these-companies", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/AP20061041230028-e1583088290683.jpg?ve=1&tl=1", "publishedAt": "2020-03-02T12:11:57Z", "content": "Coronavirus fears are set to boost sales for a number of U.S. packaged food companies, according to one Wall Street analyst.\r\nStore shelves in Oregon, California and other states were cleaned out in recent days as consumers stockpiled goods just in case the c… [+1760 chars]"}, {"source": {"id": null, "name": "Project-syndicate.org"}, "author": "Peter Singer", "title": "The Two Dark Sides of COVID-19", "description": "Historically, tragedies such as the ongoing COVID-19 epidemic have sometimes led to important changes. The probable source of the new coronavirus – so-called wet markets, at which live animals are sold and slaughtered before customers' eyes – should be banned…", "url": "https://www.project-syndicate.org/commentary/wet-markets-breeding-ground-for-new-coronavirus-by-peter-singer-and-paola-cavalieri-2020-03", "urlToImage": "https://webapi.project-syndicate.org/library/e9627ba886493c8c77b1e88bbbe9ae56.2-1-super.1.jpg", "publishedAt": "2020-03-02T12:22:27Z", "content": "Historically, tragedies such as the ongoing COVID-19 epidemic have sometimes led to important changes. The probable source of the new coronavirus so-called wet markets, at which live animals are sold and slaughtered before customers' eyes should be banned not… [+5848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what it's like at a drive-through testing centre in Korea", "description": "CNN's Ivan Watson reports from Goyang, South Korea, where authorities are trying out a new method to test for the novel coronavirus - drive-throughs. South Korea has over 4,200 cases, with 26 deaths.", "url": "https://www.cnn.com/videos/world/2020/03/02/coronavirus-outbreak-drive-through-testing-south-korea-watson-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302123350-coronavirus-outbreak-drive-through-testing-south-korea-watson-intl-ldn-vpx-00003917-super-tease.jpg", "publishedAt": "2020-03-02T12:42:42Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/madison-dibble", "title": "North Korea fires two apparent ballistic missiles in first weapons test of 2020 - Washington Examiner", "description": "North Korea fires two apparent ballistic missiles in first weapons test of 2020 Washington Examiner North Korea launches unknown projectile, Seoul says Fox News North Korea fires two unidentified projectiles, South Korea says CNN North Korea 'fires two missil…", "url": "https://www.washingtonexaminer.com/news/north-korea-fires-two-apparent-ballistic-missiles-in-first-weapons-test-of-2020", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/e067690/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F63%2Fb2%2F6b7eada541438cb2e0da9f25375c%2Fap20060010326199.jpg", "publishedAt": "2020-03-02T12:45:00Z", "content": "North Korea fired what are believed to be two short-range ballistic missiles\r\n in the country's first weapons test of the year.\r\nSouth Korean officials reported the projectiles were fired from the coastal town of Wonsan on Monday. They soared 149 miles northe… [+1794 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Robert Glatter, MD, Contributor, Robert Glatter, MD, Contributor https://www.forbes.com/sites/robertglatter/", "title": "What Does It Mean If You Are Asked To ‘Self-Quarantine’ For The Coronavirus?", "description": "As more testing for COVID-19 commences throughout the U.S., we expect that there will be an increase in the number of persons testing positive. So, what exactly does \"self-quarantine\" or \"self-isolation entail?", "url": "https://www.forbes.com/sites/robertglatter/2020/03/02/what-does-it-mean-if-you-are-asked-to-self-quarantine-for-the-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208846037%2F960x0.jpg", "publishedAt": "2020-03-02T12:47:18Z", "content": "TURIN, ITALY - FEBRUARY 26: A health personnel tests a woman's temperature in the triage area at the ... [+] Molinette hospital as they try to prevent further coronavirus cases on February 26, 2020 in Turin, Italy. Communities across northern Italy have seen … [+9218 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Travel restrictions because of coronavirus", "description": "With more than 89,000 coronavirus cases confirmed in 66 countries and more than 3,000 deaths reported, several airlines are restricting travel to certain countries. An email from United Airlines CEO Oscar Munoz said in addition to suspending flights to China …", "url": "https://www.cbsnews.com/video/travel-restrictions-because-of-coronavirus/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/02/8ca4c510-7ed7-4060-b6b2-ee5d6b9090dd/thumbnail/1200x630/5154be08658bc06775d211394e7b6967/0302-ctm-coronatravel-vancleave-2039319-640x360.jpg", "publishedAt": "2020-03-02T12:29:01Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "australian-financial-review", "name": "Australian Financial Review"}, "author": "Yolanda Redrup", "title": "Recovery shows why tech can beat market's virus jitters - The Australian Financial Review", "description": "If WiseTech's share price performance on Monday is anything to go by, the coronavirus-induced sell-off will be temporary - at least for tech.", "url": "https://www.afr.com/technology/recovery-shows-why-tech-can-beat-market-s-virus-jitters-20200228-p545fk", "urlToImage": "https://static.ffx.io/images/$zoom_0.2615%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_117%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7ba093fb8f60e506d7210b8a2c176e5ca11c61a5", "publishedAt": "2020-03-02T13:00:00Z", "content": "Altium too closed up 3.9 per cent.\r\nThe price rises were on the promise of a likely rate cut by the Reserve Bank on Tuesday - with Sportsbet's odds coming in from $1.75 for no change on Monday morning to $1.10 in favour of a 25 basis point rate cut by 4.50pm.… [+2966 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus fears rise after two deaths in Washington state", "description": "Health officials announced new coronavirus cases in Washington, Oregon, California, Illinois, New York, Florida and Rhode Island.", "url": "https://www.cbsnews.com/news/coronavirus-washington-state-death-nursing-home-fears-rise/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/02/a64ea0d3-ad5f-43bb-a90b-e005c2fab05d/thumbnail/1200x630/1003cadc18905f6935c40587b37a0b81/coronavirus-washington.jpg", "publishedAt": "2020-03-02T12:29:07Z", "content": "Two people in Washington state died from coronavirus, according to the state's Department of Health. At least 89 people have been sickened with the disease across 12 states.\r\nAt a nursing home in Kirkland, Washington, outside Seattle, two people have tested p… [+1965 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Spread of virus in UK 'likely' says Boris Johnson", "description": "A plan to tackle the virus has been agreed and people should carry on as usual, the PM says.", "url": "https://www.bbc.co.uk/news/uk-51708550", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/CBF2/production/_111101225_pawire.jpg", "publishedAt": "2020-03-02T13:05:17Z", "content": "Image copyrightPA Media\r\nThe spread of coronavirus in the UK is \"likely\", the prime minister has said, but a plan has been agreed to tackle it. \r\nAt the moment Boris Johnson said people \"should go about business as usual\". \r\nHe said the UK was \"very well prep… [+1119 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Mike Rothschild", "title": "The QAnon guide to coronavirus", "description": "The coronavirus pandemic is the top story in the world right now. So naturally believers in the QAnon conspiracy theory need to weigh in.", "url": "https://www.dailydot.com/layer8/qanon-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/02/q-mask-1024x512.jpg", "publishedAt": "2020-03-02T12:30:00Z", "content": "Its no surprise that some of the biggest sources and spreaders of COVID-19 conspiracy theories have been believers in the QAnon conspiracy theory. A worldwide outbreak of disease with a possibly murky origin that worldwide governments and medical experts have… [+8626 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " 18 Punny Jokes That Have No Right To Be As Hilarious As They Are via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_1236ffa02ba6cbd832540b87f0293f18", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-02T12:40:06Z", "content": "Rhode Island, Coronavirus\r\nPROVIDENCE, R.I. (AP) Rhode Island has its first confirmed case of the new COVID-19 virus, state public health officials announced Sunday,..."}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Hazel Plush", "title": "Louvre remains closed in Paris amid coronavirus fears – are Britain's museums next?", "description": null, "url": "https://www.telegraph.co.uk/travel/destinations/europe/france/paris/articles/paris-louvre-museum-still-closed-coronavirus-covid-19/", "urlToImage": "https://www.telegraph.co.uk/content/dam/Travel/2020/March/CROPGettyImages-1209711743-xlarge.jpg?imwidth=1200", "publishedAt": "2020-03-02T12:14:56Z", "content": "Which other museums have closed across Europe, and will Britain follow suit?\r\nAfter closing its doors to visitors over the weekend, the Louvre Museum will remain shut for a second day and officials are staying tight-lipped about its re-opening.\r\nAmid concerns… [+3978 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Stefan Preston", "title": "Kim and Kourtney Kardashian Both Believe in Limiting Screen Time for Their Kids - Showbiz Cheat Sheet", "description": "Kim and Kourtney Kardashian Both Believe in Limiting Screen Time for Their Kids Showbiz Cheat Sheet Kim Kardashian wears latex to Kanye West's Sunday Service in Paris Page Six Is This Proof That Most Kardashian 'Photoshop Fails' Are Intentional? Showbiz Cheat…", "url": "https://www.cheatsheet.com/entertainment/kim-and-kourtney-kardashian-both-believe-in-limiting-screen-time-for-their-kids.html/", "urlToImage": "https://www.cheatsheet.com/wp-content/uploads/2020/02/Kim-Kardashian-West-6-1024x683.jpg", "publishedAt": "2020-03-02T12:15:03Z", "content": "Kim Kardashian and her older sister, Kourtney Kardashian, both rose to fame on Keeping Up with the Kardashians. Both sisters share a fondness of posting pictures of themselves on Instagram. \r\nThe two are also both parents. Kim Kardashian has four children wit… [+3458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Two dozen new cases of coronavirus were reported in the US over the weekend", "description": null, "url": "https://www.cnn.com/collections/virus-into-0302/", "urlToImage": null, "publishedAt": "2020-03-02T12:47:48Z", "content": null}, {"source": {"id": null, "name": "Kron4.com"}, "author": "Alexa Mae Asperin", "title": "‘Seriously people – STOP BUYING MASKS!’: Surgeon General says they won’t protect from coronavirus - KRON4", "description": "‘Seriously people – STOP BUYING MASKS!’: Surgeon General says they won’t protect from coronavirus KRON4 How to protect against the coronavirus ABC News US Surgeon General: 'Seriously people - STOP BUYING MASKS' SF Gate ‘STOP BUYING MASKS’: Health officials be…", "url": "https://www.kron4.com/health/coronavirus/seriously-people-stop-buying-masks-surgeon-general-says-they-wont-protect-from-coronavirus/", "urlToImage": "https://www.kron4.com/wp-content/uploads/sites/11/2020/03/gettyimages-1204646771-594x594-1.jpg?w=594&h=396&crop=1&resize=1280,720", "publishedAt": "2020-03-02T12:44:00Z", "content": "SAN FRANCISCO (KRON/CNN) – The Surgeon General has a simple request for Americans who are concerned about the spread of the coronavirus. \r\n“Seriously people – STOP BUYING MASKS!” US Surgeon General Dr. Jerome Adams tweeted on Saturday in response to face mask… [+1389 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Simon Chandler", "title": "Florida’s Coronavirus Health Emergency Widens U.S. Infection Spread", "description": "Florida coronavirus outbreak means all four corners of the continental US has been infected, threatening to sink the country into recession. The post Florida’s Coronavirus Health Emergency Widens U.S. Infection Spread appeared first on CCN.com", "url": "https://www.ccn.com/floridas-coronavirus-health-emergency-widens-u-s-infection-spread/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/Coronavirus-Beach-NTB.jpg", "publishedAt": "2020-03-02T12:47:30Z", "content": "<ul><li>Florida has declared its first two cases of the coronavirus.</li><li>The coronavirus has now spread to all four corners of the continental US.</li><li>Further spread threatens to sink an already turbulent global economy into recession.</li></ul>The co… [+3926 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Joe Lockhart, CNN", "title": "Trump Failing the Leadership Test on Coronavirus", "description": "There are several steps Trump should take immediately that will both help address the spread of coronavirus and boost his political standing, writes Joe Lockhart", "url": "https://www.realclearpolitics.com/2020/03/02/trump_failing_the_leadership_test_on_coronavirus_503143.html", "urlToImage": null, "publishedAt": "2020-03-02T12:20:56Z", "content": "There are several steps Trump should take immediately that will both help address the spread of coronavirus and boost his political standing, writes Joe Lockhart\r\nRead Full Article »"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Miranda Devine, NY Post", "title": "Criticisms of Trump's Coronavirus Response Are Sickening", "description": "Who better to have as president during the coronavirus epidemic but a renowned germaphobe, the build-the-wall guy who refuses to kowtow to China? It's a unique set of characteristics showing that...", "url": "https://www.realclearpolitics.com/2020/03/02/criticisms_of_trumps_coronavirus_response_are_sickening_503140.html", "urlToImage": null, "publishedAt": "2020-03-02T12:21:00Z", "content": "Who better to have as president during the coronavirus epidemic but a renowned germaphobe, the build-the-wall guy who refuses to kowtow to China? It's a unique set of characteristics showing that…\r\nRead Full Article »"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "EU says 2,100 cases of coronavirus confirmed in 18 states", "description": "Health commissioner Stella Kyriakides said 2,100 cases of coronavirus were confirmed in 18 of the 27 EU states, and 38 EU citizens had died because of the disease, Reuters reported on Monday.", "url": "https://www.rt.com/newsline/482113-eu-coronavirus-confirmed-states/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5d080b85f54008752dc648.JPG", "publishedAt": "2020-03-02T12:54:00Z", "content": "Health Commissioner Stella Kyriakides said 2,100 cases of coronavirus have been confirmed across 18 of the 27 EU countries, and 38 EU citizens have died because of the disease.\r\nPresident of the European Commission Ursula von der Leyen said the EU’s disease p… [+531 chars]"}, {"source": {"id": null, "name": "Pennlive.com"}, "author": "Ben Axelson | baxelson@syracuse.com", "title": "Coronavirus supplies: How to make hand sanitizer with ingredients you have at home - PennLive", "description": "Coronavirus supplies: How to make hand sanitizer with ingredients you have at home PennLive Where’s the Hand Sanitizer? Coronavirus Fears Empty Store Shelves, Disrupt Plans The Wall Street Journal Coronavirus prevention: How to make hand sanitizer at home Ore…", "url": "https://www.pennlive.com/nation-world/2020/03/coronavirus-supplies-how-to-make-hand-sanitizer-with-ingredients-you-have-at-home.html", "urlToImage": "https://www.pennlive.com/resizer/gcIM9DzTdMvDeKJk6ts0S13_4N4=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/3ZFXL7BBHNEMJAIXVABTLRYJV4.jpg", "publishedAt": "2020-03-02T13:08:00Z", "content": "News broke over the weekend about New Yorks first coronavirus case, and a growing number of people are concerned about preparing for possible quarantines for the novel coronavirus, or COVID-19.\r\nIf stores near you are selling out of hand sanitizer, its easy t… [+3442 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Trending Desk", "title": "WHO Joins TikTok to Provide Reliable Information on Coronavirus - News18", "description": "WHO Joins TikTok to Provide Reliable Information on Coronavirus News18 WHO Opens TikTok Account To Provide Reliable Advice On Coronavirus Inc42 Media WHO Creates TikTok Account to Fight Spread of Coronavirus Misinformation Interesting Engineering WHO joins Ti…", "url": "https://www.news18.com/news/india/who-joins-tiktok-to-provide-reliable-information-on-coronavirus-2522549.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Chinese-Workers-Fighting-Against-Deadly-Coronavirus-16.jpg", "publishedAt": "2020-03-02T12:25:33Z", "content": "In a bid to provide reliable information on Coronavirus, the World Health Organization (WHO) has joined the video-sharing social networking service TikTok.\r\nThe effort of the WHO is aimed at preventing misinformation online. The account has, so far, posted tw… [+1639 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: Global COVID-19 toll above 3,000 with fresh cases in China mainland. Second …", "description": "CORONAVIRUS UPDATE: Global COVID-19 toll above 3,000 with fresh cases in China mainland. Second Man Dies in Washington as Global Toll Crosses 3,000. Coronavirus in Florida: 2 people test ‘presumptively positive’ for COVID-19; public health emergency declared.…", "url": "https://pjmedia.com/instapundit/360072/", "urlToImage": null, "publishedAt": "2020-03-02T13:04:17Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Eye Opener: Two U.S. deaths linked to coronavirus", "description": "Two coronavirus patients die in Washington state, and New York City reports its first case. Also, the race for the Democratic nomination shifts with Pete Buttigieg dropping out after Joe Biden's dominant win in South Carolina. All that and all that matters in…", "url": "https://www.cbsnews.com/video/eye-opener-two-us-deaths-linked-to-coronavirus/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/02/2279f1af-aea3-44a6-bae6-b3e1ad21033c/thumbnail/1200x630/c13a398f98abdc6ccc26eed73ee7e0ba/0302-ctm-eyeopenerat7-2039302-640x360.jpg", "publishedAt": "2020-03-02T12:16:55Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus fears grow after two deaths in Washington state", "description": "The coronavirus has killed two people in Washington state, and the number of states with confirmed cases has more than doubled to 12. At least 89 people have now been sickened in the U.S. Jonathan Vigliotti reports from Kirkland, Washington, where dozens of p…", "url": "https://www.cbsnews.com/video/coronavirus-fears-grow-after-two-deaths-in-washington-state/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/02/f4b3c2b2-635e-4791-9544-483e33734a38/thumbnail/1200x630/7282ee40e004e80be11b8e68e0c8f983/0302-ctm-coronavirusspread-vigliotti-2039311-640x360.jpg", "publishedAt": "2020-03-02T12:23:45Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Tom Jones", "title": "It’s Mike Pence vs. Chuck Todd on Meet the Press » Bloomberg apologizes on 60 Minutes » Axios on HBO is back on the air", "description": "The Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, click here. No gaslighting on the air, please A frequent argument often raised about interview news shows — particularly the Sunday morning shows — is that gue…", "url": "https://www.poynter.org/newsletters/2020/its-mike-pence-vs-chuck-todd-on-meet-the-press-bloomberg-apologizes-on-60-minutes-axios-on-hbo-is-back-on-the-air/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/Pence_MTP.jpg", "publishedAt": "2020-03-02T12:30:50Z", "content": "The Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, click here.\r\nNo gaslighting on the air, please\r\nA frequent argument often raised about interview news shows particularly the Sunday morning shows is that guest… [+8667 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "EU readies measures to help economy as coronavirus hits", "description": "The European Union's economics commissioner said on Monday the bloc was ready to deploy all possible measures to tackle the impact of the coronavirus outbreak on the European economy, as health risks in Europe were raised to high. Paolo Gentiloni said there s…", "url": "https://finance.yahoo.com/news/eu-readies-measures-help-economy-122558981.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/46OIPmdRVDgIv2zUH.KWYw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/lEWe9rn7lGvuUVVFh6m_0g--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/30c7a0839f4f455bb1ab1efcdf7f28b8", "publishedAt": "2020-03-02T12:25:58Z", "content": "BRUSSELS (Reuters) - The European Union's economics commissioner said on Monday the bloc was ready to deploy all possible measures to tackle the impact of the coronavirus outbreak on the European economy, as health risks in Europe were raised to high.\r\nPaolo … [+1088 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo News Video", "title": "Adviser to Iran's supreme leader dies from coronavirus", "description": "A member of a council that advises Iran’s supreme leader died Monday after falling ill due to the new coronavirus, state radio reported, becoming the first top official to succumb to the disease that is affecting members of the Islamic Republic's leadership.", "url": "https://news.yahoo.com/adviser-irans-supreme-leader-dies-122431208.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/86yV4qLXCXBQkcSxjdiKsg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/qsIqTrJyFygdPRdspVw8yQ--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/02/5e5cfb062273410d23ce64cd/5e5cfb062273410d23ce64ce_o_U_v2.jpg", "publishedAt": "2020-03-02T12:24:31Z", "content": "A member of a council that advises Irans supreme leader died Monday after falling ill due to the new coronavirus, state radio reported, becoming the first top official to succumb to the disease that is affecting members of the Islamic Republic's leadership."}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "INSIGHTS DAILY CURRENT AFFAIRS + PIB SUMMARY- 2 March 2020", "description": "Table of Contents: GS Paper 2: 1. National Sports Development Fund. 2. Rare Disease Day. 3. Agreement for Bringing Peace to Afghanistan. GS Paper 3: 1. RaIDer-X. 2. Inner Line Permit. Facts for Prelims: 1. Scotland’s proposed law to make sanitary products fre…", "url": "https://www.insightsonindia.com/2020/03/02/insights-daily-current-affairs-pib-summary-2-march-2020/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2020/03/Saudi.png", "publishedAt": "2020-03-02T12:46:43Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Two new Covid-19 cases spook markets in India, govt steps up screening - Hindustan Times", "description": "Two new Covid-19 cases spook markets in India, govt steps up screening Hindustan Times Contact tracing to begin after two new cases of coronavirus in India: Health Minister The News Minute What India is doing to contain spread of coronavirus Times of India Co…", "url": "https://www.hindustantimes.com/india-news/two-new-covid-19-cases-spook-markets-in-india-india-steps-up-screening/story-gRPMUmg0lLvJIY1W95E1IN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/02/Pictures/government-infected-specialised-protective-clothing-coronavirus-receiving_47eee18a-5c7e-11ea-bcc0-e4d0c7a68e9a.jpg", "publishedAt": "2020-03-02T12:12:00Z", "content": "Union Health Minister Harsh Vardhan on Monday said that India has increased screening and advised people to avoid non-essential travel to countries under the grip of coronavirus as two more cases were reported in India.\r\n“The screening of passengers is being … [+2355 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "blogenfreude", "title": "Mike's Blog Round Up", "description": "Bark Bark Woof Woof - what Katherine Johnson means; First Draft - we may just have to get over ourselves; Just Above Sunset - expect a miracle; Mock Paper Scissors - Scientific American talks coronavirus; No More Mr. Nice Blog - what turnout problem? Steve in…", "url": "https://crooksandliars.com/2020/03/mikes-blog-round", "urlToImage": "https://crooksandliars.com/files/primary_image/18/06/monday_short_coffee_strong.jpg", "publishedAt": "2020-03-02T13:01:01Z", "content": "Bark Bark Woof Woof - what Katherine Johnson means;\r\nFirst Draft - we may just have to get over ourselves;\r\nJust Above Sunset - expect a miracle;\r\nMock Paper Scissors - Scientific American talks coronavirus;\r\nNo More Mr. Nice Blog - what turnout problem?\r\nSte… [+216 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "Workers disinfect South Korea department store as COVID-19 spreads", "description": "With the number of confirmed COVID-19 cases spiking over 4,000, a South Korean department store continued its disinfection efforts on Monday.", "url": "https://www.euronews.com/2020/03/02/workers-disinfect-south-korea-department-store-as-covid-19-spreads", "urlToImage": "https://static.euronews.com/articles/stories/04/53/85/92/1000x563_cmsv2_fd89ed1e-8182-5367-87bc-32e99283ba54-4538592.jpg", "publishedAt": "2020-03-02T12:11:52Z", "content": "With the number of confirmed COVID-19 cases spiking over 4,000, a South Korean department store continued its disinfection efforts on Monday.\r\nEmployees cleaned the shop, in the western part of Seoul, as customers lined up outside to be first in the queue to … [+284 chars]"}, {"source": {"id": null, "name": "Motorauthority.com"}, "author": "feedback@highgearmedia.com (Viknesh Vijayenthiran), Viknesh Vijayenthiran", "title": "2020 Beijing auto show postponed due to coronavirus", "description": "Organizers of the Beijing auto show, officially Auto China, announced on Monday that this year's show won't run as scheduled in order to protect the health of exhibitors and visitors in light of the ongoing Covid-19 coronavirus outbreak. The announcement come…", "url": "https://www.motorauthority.com/news/1127307_2020-beijing-auto-show-postponed-due-to-coronavirus", "urlToImage": "https://images.hgmsites.net/hug/beijing-auto-show_100738393_h.jpg", "publishedAt": "2020-03-02T13:00:00Z", "content": "Organizers of the Beijing auto show, officially Auto China, announced on Monday that this year's show won't run as scheduled in order to protect the health of exhibitors and visitors in light of the ongoing Covid-19 coronavirus outbreak.\r\nThe announcement com… [+1218 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "EU raises coronavirus risk level to #39;high#39;", "description": "#39;The ECDC has announced today that the risk level has risen from moderate to high for people in the European Union. In other words, the virus continues to spread,#39; Leyen said.", "url": "https://www.moneycontrol.com/news/world/eu-raises-coronavirus-risk-level-to-high-4993301.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-Reuters-1-770x435.jpg", "publishedAt": "2020-03-02T12:13:05Z", "content": "The European Union's disease control agency has increased its risk level for the novel coronavirus COVID-19 from moderate to high, EU Commission president Ursula von der Leyen said on Monday.\r\n\"The ECDC has announced today that the risk level has risen from m… [+240 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "David Hookstead", "title": "National College Players Association Wants March Madness Games Played In Empty Stadiums Because Of The Coronavirus", "description": "The National College Players Association wants March Madness games to be played in empty stadiums because of the coronavirus.", "url": "https://dailycaller.com/2020/03/02/national-college-players-association-march-madness-coronavirus/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2019/05/March_Madness_Logo-e1559044459698.jpg", "publishedAt": "2020-03-02T12:29:16Z", "content": "The National College Players Association wants March Madness games to be played in empty stadiums because of the coronavirus.\r\nIn a statement tweeted out by Ross Dellenger, the NCPA requested that the NCAA take a serious look at playing March Madness games wi… [+1152 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Rupee slumps 50 paise to 72.74 against US dollar after fresh coronavirus cases emerge in India", "description": "The rupee pared all its initial gains and settled 50 paise down at 72.74 (provisional) against the US dollar on Monday after two fresh cases of coronavirus detected in India The post Rupee slumps 50 paise to 72.74 against US dollar after fresh coronavirus cas…", "url": "https://www.firstpost.com/business/rupee-slumps-50-paise-to-72-74-against-us-dollar-after-fresh-coronavirus-cases-emerge-in-india-8109041.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/09/rupee-dollar_social1.jpg", "publishedAt": "2020-03-02T12:25:32Z", "content": "Mumbai: The rupee pared all its initial gains and settled 50 paise down at 72.74 (provisional) against the US dollar on Monday after two fresh cases of coronavirus detected in India.\r\nForex traders said the Indian rupee which started the day on a positive not… [+1520 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Running with Miles", "title": "The Coronavirus Impact on Air Travel: El Al Warns of Collapse, Cathay Pacific Parks 50% of Aircraft, Amazon Halting Non-Essential Travel, and More", "description": "With the Coronavirus spreading in various countries around the world, the impact of Coronavirus on air travel is also spreading. Here is some of the latest news. The post The Coronavirus Impact on Air Travel: El Al Warns of Collapse, Cathay Pacific Parks 50% …", "url": "https://runningwithmiles.boardingarea.com/the-coronavirus-impact-on-air-travel-el-al-warns-of-collapse-cathay-pacific-parks-50-of-aircraft-amazon-halting-non-essential-travel-and-more/", "urlToImage": "https://runningwithmiles.boardingarea.com/wp-content/uploads/2020/02/AdobeStock_276005576-1024x576.jpeg", "publishedAt": "2020-03-02T12:49:42Z", "content": "With the Coronavirus spreading in various countries around the world, the impact of Coronavirus on air travel is also spreading. Here is some of the latest news.The Coronavirus, COVID-19, still does not have as many cases or deaths as the flu as in influenza … [+3290 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Non-subsidised cooking gas price cut by Rs 53; jet fuel slashed by 10%", "description": "The rates of non-subsidised cooking gas (LPG) were cut by Rs 53, wiping away a third of the record Rs 144.50 per cylinder price hike effected last month, according to a price notification issued by state-owned oil firms.", "url": "https://indianexpress.com/article/business/commodities/non-subsidised-cooking-gas-price-cut-by-rs-53-jet-fuel-slashed-by-10-per-cent-6295796/", "urlToImage": "https://images.indianexpress.com/2020/02/indane-lpg-gas-cylinder-759.jpg?w=759", "publishedAt": "2020-03-02T12:43:35Z", "content": "By: PTI | New Delhi | \r\nUpdated: March 2, 2020 6:15:26 pm\r\nThe rate of non-subsidised cooking gas (LPG) was also reduced to Rs 805.50 per 14.2-kg cylinder from Rs 858.50 previously. (Express photo by Amarjeet Singh)Jet fuel (ATF) prices were on Monday slashed… [+1477 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "How can you tell if you have a cold, the flu, or coronavirus? Local experts weigh in", "description": "If you're showing signs of illness — say a cough, runny nose and fever — how do you know whether you have a cold, the flu or COVID-19, the new coronavirus that originated in China and is spreading around globe.", "url": "https://www.sfgate.com/bayarea/article/how-can-you-tell-if-you-have-coronavirus-flu-cold-15093687.php", "urlToImage": "https://s.hdnux.com/photos/01/10/72/12/19112618/3/rawImage.jpg", "publishedAt": "2020-03-02T12:25:26Z", "content": "<ul><li>Click or swipe ahead to see 10 things you need to know about the new coronavirus.\r\nClick or swipe ahead to see 10 things you need to know about the new coronavirus.\r\n Photo: Guido Mieth/Getty Images\r\n</li></ul>\r\nClick or swipe ahead to see 10 things y… [+5215 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "New York scaling up coronavirus tests after first reported case, Cuomo says", "description": "New York City reported its first coronavirus patient, a health care worker returning from Iran. New York Governor Andrew Cuomo said the state has been preparing for the virus and is scaling up its testing. He joins “CBS This Morning” to discuss the patient’s …", "url": "https://www.cbsnews.com/video/new-york-scaling-up-coronavirus-tests-after-first-reported-case-cuomo-says/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/02/db2bcd83-27ee-44f4-9e34-a8a17d1aac3d/thumbnail/1200x630/4517a1b7fb1690f9edc5bb7e5e6ce7fb/0302-ctm-cuomoon-2039327-640x360.jpg", "publishedAt": "2020-03-02T12:29:16Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Steve Watson", "title": "‘You Need To Shut Up’: Dr Drew Slams Media Over Coronavirus Doom-mongering", "description": "It's \"overblown press created hysteria\"", "url": "https://www.infowars.com/you-need-to-shut-up-dr-drew-slams-media-over-coronavirus-doom-mongering/", "urlToImage": "https://assets.infowars.com/2020/03/GettyImages-1209129523.jpg", "publishedAt": "2020-03-02T12:56:07Z", "content": "David Drew Pinsky, otherwise known as ‘Dr Drew’, has slammed the media for over-hyping the coronavirus, leading people the world over to panic buy provisions and medical supplies.\r\nSpeaking with Daily Blast Live, Dr Drew said “Let me frame it this way: we hav… [+1880 chars]"}, {"source": {"id": null, "name": "Apracticalwedding.com"}, "author": "A Practical Wedding", "title": "How Do I Plan My Wedding During The Coronavirus Outbreak?", "description": "Q: My fiancx is from Sydney and I am from San Francisco, so we’re planning a wedding in Hawaii. We’re a few weeks from locking in our venue and date and sending invitations for late October. We haven’t put down any deposits or planned any travel. The idea of …", "url": "https://apracticalwedding.com/how-do-i-plan-my-wedding-during-the-coronavirus-outbreak/", "urlToImage": "https://apracticalwedding.com/wp-content/uploads/2018/05/Two_Cents_900-e1532988118426.jpg", "publishedAt": "2020-03-02T12:30:04Z", "content": "Q: My fiancx is from Sydney and I am from San Francisco, so we’re planning a wedding in Hawaii. We’re a few weeks from locking in our venue and date and sending invitations for late October. We haven’t put down any deposits or planned any travel.\r\nThe idea of… [+1700 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Press Trust of India", "title": "Coronavirus effect: Asian squash tournaments in Malaysia, China postponed, fresh dates later", "description": "Two squash events -- the Asian Team Championships in Malaysia and the Asian Junior Individual Championships in China -- have been postponed due to coronavirus outbreak. The post Coronavirus effect: Asian squash tournaments in Malaysia, China postponed, fresh …", "url": "https://www.firstpost.com/sports/coronavirus-effect-asian-squash-tournaments-in-malaysia-china-postponed-fresh-dates-later-8109171.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/07/Squash-representative-AFP-social.jpg", "publishedAt": "2020-03-02T12:40:19Z", "content": "Chennai: Two squash events -- the Asian Team Championships in Malaysia and the Asian Junior Individual Championships in China -- have been postponed due to coronavirus outbreak.\r\nRepresentative image. AFP\r\nThe Asian Team Championships was scheduled to be held… [+1816 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Paul J. Davies", "title": "Long-Term U.S. Treasury Yields Hit Record Lows - The Wall Street Journal", "description": "Long-Term U.S. Treasury Yields Hit Record Lows The Wall Street Journal Goldman now sees the Federal Reserve getting even more aggressive in the face of coronavirus scare CNBC What Would It Take for the Fed to Cut Rates to Zero? Bloomberg Markets and Finance A…", "url": "https://www.wsj.com/articles/long-term-u-s-treasury-yields-hit-record-lows-11583151460", "urlToImage": "https://images.wsj.net/im-159397/social", "publishedAt": "2020-03-02T12:17:00Z", "content": "Investors pushed down the yields on long-term U.S. Treasurys to fresh records early Monday, signaling a flight to the safety of government debt.\r\nYields fell across Europe and in Japan on the growing prospect for central bank action to battle the economic eff… [+161 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "BOOX Research", "title": "NASDAQ-100 Is Still Up Since December, Has Not Yet Priced In A Potential Recession", "description": "In one of the worst weeks for stocks since the financial crisis, the NASDAQ-100 Index is still up ~1% from early December, less than 3-months ago.The ongoing coronavirus 'COVID-19' outbreak has intensified representing a major risk for global growth dynamics …", "url": "https://seekingalpha.com/article/4328594-nasdaqminus-100-is-still-up-since-december-not-yet-priced-in-potential-recession", "urlToImage": "https://static1.seekingalpha.com/uploads/2020/2/28/49782598-15829245754522014.png", "publishedAt": "2020-03-02T12:30:00Z", "content": "The novel coronavirus 'COVID-19' outbreak is already a historic global event just over one month since first making headlines. The situation has resulted in significant confusion among investors attempting to make sense of the seriousness of the issues. On on… [+8279 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, David Oliver, Sara M Moniuszko, Dawn Gilbertson, Hannah Yasharoff, Curtis Tate and Morgan Hines, USA TODAY", "title": "Making travel plans? How coronavirus fear is spreading and putting trips in limbo", "description": "What are people doing in the face of unprecedented coronavirus travel anxiety? Some are canceling or modifying trips, and others are forging ahead.", "url": "https://www.usatoday.com/story/travel/news/2020/03/02/coronavirus-travel-italy-japan-asia-trip-plans-in-limbo/4891579002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/28/USAT/6700718e-06c5-4670-94d3-27cb3e06eef4-AP_Japan_Daily_Life.JPG?crop=4999,2812,x0,y250&width=3200&height=1801&format=pjpg&auto=webp", "publishedAt": "2020-03-02T12:55:13Z", "content": "The only thing spreading faster than the new coronavirus itself is the travel anxiety associated with it. Thousands of cases have popped up around the world, and while they are primarily in China, everyone is on high alert from South Korea to Italy to the Uni… [+16613 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Best Western® Hotels & Resorts To Maintain Elite Status Of All Best Western Rewards® Members Globally In Light Of The Coronavirus", "description": "Best Western Hotels & Resorts (BWHR) is helping its loyalty members retain their elite status with Best Western Rewards (BWR®) as the Coronavirus continues to impact global travel plans. Effective immediately, all BWR members globally will maintain their curr…", "url": "https://news.yahoo.com/best-western-hotels-resorts-maintain-130000467.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Ja05a2Eho0T.f9aeQVhhKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTQxOA--/https://s.yimg.com/uu/api/res/1.2/w_.XB4LyGNWz_TZgwOFHIw--~B/aD0yMDk7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/b1e64953e01eb51b1b4835e723b96397", "publishedAt": "2020-03-02T13:00:00Z", "content": "Best Western Rewards Members Around the World Will Maintain Elite Status Through January 31, 2022\r\nPHOENIX, March 2, 2020 /PRNewswire/ -- Best Western Hotels &amp; Resorts (BWHR) is helping its loyalty members retain their elite status with Best Western Rewar… [+3822 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Coronavirus Calls Overwhelm Contact Centers: Easy On Hold Offers Tips and New Technology for Helping Worried Inbound Callers Get Answers Fast", "description": "KALAMAZOO, Mich.--(BUSINESS WIRE)-- #contactcenter--Coronavirus scare causes contact centers to be overwhelmed by worried callers. Easy On Hold provides tips and tech for corporate communications teams.", "url": "https://www.businesswire.com/news/home/20200302005205/en/Coronavirus-Calls-Overwhelm-Contact-Centers-Easy-Hold", "urlToImage": "https://mms.businesswire.com/media/20200302005205/en/776733/23/Easy_On_Hold_Logo.jpg", "publishedAt": "2020-03-02T13:11:24Z", "content": "KALAMAZOO, Mich.--(BUSINESS WIRE)--Easy On Hold, provider of telephone greetings and on hold marketing messages, says the telephone remains one of the fastest, most effective tools when it comes to communicating with customers during a crisis like the coronav… [+2773 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Olivia Petter, Olivia Petter", "title": "Coronavirus: Lush invites people into its shops to wash their hands to prevent spread", "description": "'There will be no requirement to purchase anything,' says cosmetics chain", "url": "https://www.independent.co.uk/life-style/health-and-families/coronavirus-news-lush-hand-washing-free-spread-uk-a9369101.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/11/istock-625800740.jpg", "publishedAt": "2020-03-02T12:11:45Z", "content": "Lush is inviting people into its shops to wash their hands for free to help prevent the spread of coronavirus in the UK.\r\nThe natural cosmetics company started promoting the service on Friday via its shop windows.\r\nLush, which has shops all over the UK, has c… [+2127 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jay L. Zagorsky, Senior Lecturer, Questrom School of Business, Boston University", "title": "Coronavirus: A simple way to keep workers – and the economy – from getting sick", "description": "The COVID-19 outbreak appears headed for the U.S., and the Centers for Disease Control and Prevention are urging Americans to prepare now, such as by stocking up on food and prescription drugs. But since the U.S. economy and its workforce are also at risk of …", "url": "https://news.yahoo.com/coronavirus-simple-way-keep-workers-122022445.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BaL0j7s2JPumq0krH73PxQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MzcuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/O6Pa_WZBlrj9SjVmiRdKOw--~B/aD04Mjk7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_conversation_us_articles_815/1dd98033870f31350ede9e7736daeb87", "publishedAt": "2020-03-02T12:20:22Z", "content": "Wearing a mask may not be enough.AP Photo/Lee Jin-man\r\nThe COVID-19 outbreak appears headed for the U.S., and the Centers for Disease Control and Prevention are urging Americans to prepare now, such as by stocking up on food and prescription drugs.\r\nBut since… [+5196 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "Agence France-Presse", "title": "OECD Warns of Severe Economic Hit From Virus Outbreak", "description": "The coronavirus outbreak will have a major impact on economic growth worldwide this year, the OECD warned Monday as it lowered its global GDP forecast by half a percentage point to 2.4 percent, the lowest rate since the 2008-09 financial crisis.\n\nThat forecas…", "url": "https://www.voanews.com/economy-business/oecd-warns-severe-economic-hit-virus-outbreak", "urlToImage": "https://media.voltron.voanews.com/Drupal/01live-166/2020-02/ap_mex-cor.jpg", "publishedAt": "2020-03-02T12:26:40Z", "content": "PARIS - The coronavirus outbreak will have a major impact on economic growth worldwide this year, the OECD warned Monday as it lowered its global GDP forecast by half a percentage point to 2.4 percent, the lowest rate since the 2008-09 financial crisis.\r\nThat… [+4110 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Surajit Dasgupta", "title": "Rupee falls to 1-year low against US dollar as coronavirus case emerges in Delhi - Livemint", "description": "Rupee falls to 1-year low against US dollar as coronavirus case emerges in Delhi Livemint Rupee slumps 50 paise to 72.74 against US dollar after fresh coronavirus cases emerge Moneycontrol View: Rupee outlook bearish; SBI Card IPO-related inflows to offer som…", "url": "https://www.livemint.com/market/stock-market-news/inr-usd-exchange-rate-today-rupee-falls-against-us-dollar-as-coronavirus-emerges-in-delhi-11583152517618.html", "urlToImage": "https://images.livemint.com/img/2020/03/02/600x338/336005629_0-16_1561550657001_1583153828929.jpg", "publishedAt": "2020-03-02T12:58:51Z", "content": "The Indian rupee fell sharply the US dollar today after two fresh cases of coronavirus detected in India. Domestic equity markets also extended losses to the seventh day today. Rupee, which started the day on a positive note, witnessed heavy volatility and fi… [+2086 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "China gets 'mixed report card' in its coronavirus response. How will the US do? - Livescience.com", "description": "China gets 'mixed report card' in its coronavirus response. How will the US do? Livescience.com Roughly 87000 people around the world infected with COVID-19 and nearly 3000 dead ARIRANG NEWS Why Italy should learn from China in fighting COVID-19 CGTN How Asia…", "url": "https://www.livescience.com/us-china-coronavirus-response.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Bgga7nRtrngdWcRAgvYiXd-1200-80.jpg", "publishedAt": "2020-03-02T12:25:00Z", "content": "Now that the new coronavirus is expected to spread\r\n across the United States, many people are wondering whether the country is up for the challenge.\r\nThe first U.S. death linked to the coronavirus\r\n was reported in Washington state over the weekend, where of… [+7215 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Chloe Taylor", "title": "The coronavirus outbreak could mean no summer vacations this year", "description": null, "url": "https://www.cnbc.com/2020/03/02/the-coronavirus-outbreak-could-mean-no-summer-vacations-this-year.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106416662-1582925147100gettyimages-1203910856.jpeg?v=1583155347", "publishedAt": "2020-03-02T12:23:04Z", "content": "Summer vacations could be off the table this year as tourists put off traveling to avoid catching the new coronavirus, experts told CNBC.\r\nDemand for international travel has taken a downward turn amid the outbreak, which has seen the virus spread to almost 6… [+5182 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "D-Street Talk podcast | Coronavirus scare! The fall was unexpected, 11000 likely to lend support", "description": "Going forward, in case if slides further, then the last ray of hope would be the lower end of multi-year â\u0080\u0098Upward Sloping Channelâ\u0080\u0099 placed at 11000.", "url": "https://www.moneycontrol.com/news/business/markets/d-street-talk-coronavirus-scare-the-fall-was-unexpected-11000-likely-to-lend-support-4993191.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/01/BSE_Sensex_Budget_2017_trader1-770x433.jpg", "publishedAt": "2020-03-02T12:44:26Z", "content": "The fall which wiped out Rs 5 lakh crore of investors wealth in Fridays trading session was unexpected, and all eyes will be on global markets which are likely to dictate the trend for Indian markets as well, Sameet Chavan, chief analyst-technical &amp; deriv… [+1091 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": null, "title": "The Morning After: Previewing 'Final Fantasy VII Remake'", "description": "I've waited decades for the Final Fantasy VII remake. I was here for the PS3 (!) tech demo, the breathless launch announcement at E3 years ago, and now we've reached the final stretch -- the game comes out next month. Last week, I got to play several early ch…", "url": "https://www.engadget.com/2020-03-02-the-morning-after-previewing-final-fantasy-vii-remake.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QLYHpWPE1e1eUk86bVhBNQ--~B/aD0xMDAwO3c9MTc3ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://o.aolcdn.com/images/dims?resize=2000%2C2000%2Cshrink&image_uri=https://s.yimg.com/os/creatr-uploaded-images/2020-02/35fb2010-5a5d-11ea-b43f-944235fb2eca&client=a1acac3e1b3290917d92&signature=c322fac5eb033272b75c5d27bdf7c259a2833722", "publishedAt": "2020-03-02T12:31:00Z", "content": "I've waited decades for the Final Fantasy VII remake. I was here for the PS3 (!) tech demo, the breathless launch announcement at E3 years ago, and now we've reached the final stretch -- the game comes out next month.\r\nLast week, I got to play several early c… [+2905 chars]"}, {"source": {"id": null, "name": "Bittersweetblog.com"}, "author": "Hannah (BitterSweet)", "title": "Emergency Rations", "description": "Warranted or not, panic wrought by the coronavirus has spread to pandemic levels, faster than the illness itself. Food scarcity is a concern that most city dwellers have the luxury of ignoring, but suddenly doomsday preppers are wiping grocery shelves clear o…", "url": "https://bittersweetblog.com/2020/03/02/easiest-chocolate-cookie-recipe/", "urlToImage": "https://live.staticflickr.com/65535/49602017018_6865809736_o_d.jpg", "publishedAt": "2020-03-02T12:20:09Z", "content": "Warranted or not, panic wrought by the coronavirus has spread to pandemic levels, faster than the illness itself. Food scarcity is a concern that most city dwellers have the luxury of ignoring, but suddenly doomsday preppers are wiping grocery shelves clear o… [+3855 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tobias Hoonhout", "title": "North Korea Conducts First Missile Test of 2020, Officials Say", "description": "North Korea launched two projectiles on Sunday in its first missile test since November, just days after South Korea announced it was postponing annual joint military exercises with the U.S. amid concern over the coronavirus.South Korea's Joint Chiefs of Staf…", "url": "https://news.yahoo.com/north-korea-conducts-first-missile-125648877.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HVNdlDayBSwidl.vyLlKcg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuMjU-/https://s.yimg.com/uu/api/res/1.2/v6foP5TBf8gDxPDdvtcycg--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/e8349ade110c8f470401d5abf2c358ef", "publishedAt": "2020-03-02T12:56:48Z", "content": "North Korea launched two projectiles on Sunday in its first missile test since November, just days after South Korea announced it was postponing annual joint military exercises with the U.S. amid concern over the coronavirus.\r\nSouth Koreas Joint Chiefs of Sta… [+1523 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Sensex witnesses flash crash on 2 new coronavirus cases in India; over 340 stocks hit 52-week low", "description": "All major sectoral indices also caught in bear trap with BSE Metal and Oil & Gas being the prominent losers with 2 percent loss.", "url": "https://www.moneycontrol.com/news/business/markets/sensex-witnesses-flash-crash-on-2-new-coronavirus-cases-in-india-over-340-stocks-hit-52-week-low-4993351.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Sensex_BSE_NSE_Stock-market_bull_bear_Gold-3-770x433.png", "publishedAt": "2020-03-02T12:40:18Z", "content": "After a week of pain, bulls made a comeback on the D-Street on March 1 but were once again ushered out by the bulls after two new cases of coronavirus emerged in India. Benchmark indices witnessed a flash sell-off in the last hour of trading to end the sessio… [+1805 chars]"}, {"source": {"id": null, "name": "Crossingwallstreet.com"}, "author": "Eddy Elfenbein", "title": "Morning News: March 2, 2020", "description": "China Inc Thinks Outside the Box as Coronavirus Keeps Consumers at Home Virus Pushes Global Economy Toward First Contraction Since 2009 Coronavirus Expected to Hurt […]", "url": "http://www.crossingwallstreet.com/archives/2020/03/morning-news-march-2-2020.html", "urlToImage": null, "publishedAt": "2020-03-02T12:12:26Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Central banks aren't the answer to coronavirus fears", "description": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "url": "https://www.cnn.com/2020/03/02/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302120007-01-bank-of-japan-0302-super-tease.jpg", "publishedAt": "2020-03-02T12:38:36Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Yun Li", "title": "Stock market live updates: Dow futures down 200, traders search for the bottom", "description": "A discussion of the latest market-moving news, including the coronavirus.", "url": "https://www.cnbc.com/2020/03/02/stock-market-today-live.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106415563-1582891539139dow.jpg?v=1582891623", "publishedAt": "2020-03-02T12:28:00Z", "content": "Traders work during the opening bell at the New York Stock Exchange on February 27, 2020.\r\nThe futures market already had a volatile overnight session. Stocks are set to open lower. Check here for live updates.\r\n7:35 am: Another record low on the 10-year Trea… [+2103 chars]"}, {"source": {"id": null, "name": "Thecodinglove.com"}, "author": "The Coding Love", "title": "When I hear someone sneezing during the coronavirus outbreak", "description": "The Coding Love - Programmer humor: gifs, memes", "url": "https://thecodinglove.com/when-i-hear-someone-sneezing-during-the-coronavirus-outbreak", "urlToImage": "https://thecodinglove.com/wp-content/uploads/2020/03/Sans-titre-2.jpg", "publishedAt": "2020-03-02T13:00:48Z", "content": null}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "AYA BATRAWY", "title": "New virus hits Mideast airlines with $100M loss, group says", "description": "ABU DHABI, United Arab Emirates (AP) — Major travel disruptions due to the new coronavirus have already caused the equivalent of a roughly $100 million loss to airlines in the Middle East, which serves as a connection hub for east-west travel, the industry’s …", "url": "https://www.seattletimes.com/business/new-virus-hits-mideast-airlines-with-100m-loss-group-says/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/03/urn-publicid-ap-org-912ded78da0253eb29d01db3ee3cc706Virus_Outbreak_Mideast_Airline_Losses_01300-1200x630.jpg", "publishedAt": "2020-03-02T12:38:27Z", "content": "ABU DHABI, United Arab Emirates (AP) Major travel disruptions due to the new coronavirus have already caused the equivalent of a roughly $100 million loss to airlines in the Middle East, which serves as a connection hub for east-west travel, the industry’s ma… [+2325 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Travis Gettys", "title": "‘Nobody believes you’: Trump ripped for ‘spreading false hope’ about coronavirus ‘cure’", "description": "President Donald Trump sounded a chipper note Monday morning on his administration’s response to the coronavirus outbreak. The president with meet with drugmakers at the White House to discuss a potential vaccine, which experts have said is far off from being…", "url": "https://www.rawstory.com/2020/03/nobody-believes-you-trump-ripped-for-spreading-false-hope-about-coronavirus-cure/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/11/Screen-Shot-2019-11-21-at-6.58.25-AM.png", "publishedAt": "2020-03-02T13:05:42Z", "content": "President Donald Trump sounded a chipper note Monday morning on his administration’s response to the coronavirus outbreak.\r\nThe president will meet with drugmakers at the White House to discuss a potential vaccine, which experts have said is far off from bein… [+2323 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Stocks will plunge, Trump will lose the election, and coronavirus could 'shock' the world, 'Dr Doom' economist predicts", "description": "Nouriel Roubini told Der Spiegel that he expects global stocks to drop by 30% to 40% this year. The 'Dr Doom' economist also predicted President Trump won't be reelected, and warned that investors may be underestimating the potential fallout from coronavirus.…", "url": "https://www.businessinsider.com/dr-doom-nouriel-roubini-stocks-plunge-trump-lose-election-coronavirus-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5e5cf800fee23d6c4f7b2056-2400/rtxz411.jpg", "publishedAt": "2020-03-02T12:59:25Z", "content": "REUTERS/Gus Ruelas\r\n<ul><li>Nouriel Roubini told Der Spiegel that he expects global stocks to drop by 30% to 40% this year.</li><li>The 'Dr Doom' economist also predicted President Trump won't be reelected, and warned that investors may be underestimating the… [+2256 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "How a South Korean Church Helped Spread the Coronavirus", "description": "The leader of an enigmatic church, accused by South Korean officials of spreading the coronavirus epidemic, apologized to the public. WSJ’s Dasl Yoon explains how the church’s secretive practices may have jeopardized containment efforts. Photo: Lee Moo Ryul/N…", "url": "https://finance.yahoo.com/video/south-korean-church-helped-spread-122310391.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Glzm2zVDVklZnuk0qD_aVA--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/02/5e5cfbfa02816b023781556a/5e5cfd3ada8e834b4bf4ab95_o_U_v3.jpg", "publishedAt": "2020-03-02T12:23:10Z", "content": "The leader of an enigmatic church, accused by South Korean officials of spreading the coronavirus epidemic, apologized to the public. WSJs Dasl Yoon explains how the churchs secretive practices may have jeopardized containment efforts. Photo: Lee Moo Ryul/New… [+9 chars]"}, {"source": {"id": null, "name": "Madshrimps.be"}, "author": "Stefan Mileschin", "title": "WHO joins TikTok to fight coronavirus misinformation", "description": "The World Health Organization clearly has an interest in putting a stop to coronavirus misinformation, and that's leading it to online destinations it wouldn't have considered before. The WHO has joined TikTok, and its first videos are, unsurprising......", "url": "http://www.madshrimps.be/news/item/194282?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+madshrimps+%28Madshrimps+News+RSS+Feed%29", "urlToImage": null, "publishedAt": "2020-03-02T12:22:33Z", "content": "Copyright © 2001-2011 Madshrimps, All rights reserved.Graphic Design by Dennis Kestelle, Programming by Maarten Menten,\r\nOverall Site design by John Meys\r\nAll information and graphics contained in Madshrimps are sole property of the Madshrimps crew and\r\nmay n… [+75 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Eren Sengezer", "title": "UK PM Johnson: Coronavirus is a problem that is likely to become significant", "description": "Regarding the coronavirus outbreak, \"this is a problem that is likely to become more significant for this country in the course of the next days and w", "url": "https://www.fxstreet.com/news/uk-pm-johnson-coronavirus-is-a-problem-that-is-likely-to-become-significant-202003021232", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Europe/UnitedKingdom/Boris_Johnson1_Large.jpg", "publishedAt": "2020-03-02T12:32:55Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Luxurylaunches.com"}, "author": "Neha Tandon Sharma", "title": "A Chinese designer has created a Batman like Coronavirus body shield to protect against outbreaks", "description": "The chaos of coronavirus is far from over and the perils of mankind are as real as ever.... The post A Chinese designer has created a Batman like Coronavirus body shield to protect against outbreaks appeared first on Luxurylaunches.", "url": "https://luxurylaunches.com/fashion/a-chinese-designer-has-created-a-batman-like-coronavirus-body-shield-to-protect-against-outbreaks.php", "urlToImage": "https://luxurylaunches.com/wp-content/uploads/2020/03/Chinese-Designer-Shield.jpg", "publishedAt": "2020-03-02T12:39:42Z", "content": "The chaos of coronavirus is far from over and the perils of mankind are as real as ever. We need in such times a superhero of sorts to save us from this threat. How about becoming your own superman or in the words of Chinese designer Sun Dayong, Be a Bat Man.… [+755 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Clary Estes, Contributor, Clary Estes, Contributor https://www.forbes.com/sites/claryestes/", "title": "Flu Cases Are On The Decline For The Second Week In A Row - Get Vaccinated Anyway", "description": "There is a bit of good news coming out of the Center for Disease Control (CDC), but that shouldn't deter you from getting you flu shot.", "url": "https://www.forbes.com/sites/claryestes/2020/03/02/flu-cases-are-on-the-decline-for-the-second-week-in-a-rowget-vaccinated-anyway/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1032153984%2F960x0.jpg", "publishedAt": "2020-03-02T12:29:41Z", "content": "ANAHEIM, CA - OCTOBER 23: Daisy Jimenez reacts as she gets FluMist Influenza Virus Vaccine at ... [+] Lincoln Elementary School in Anaheim on Friday. Kaiser Permanente is teaming up with the Orange County Health Care Agency and the county Department of Educat… [+5538 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Will Healy)", "title": "Why Investors Should Ignore Lowe's Fourth-Quarter Revenue Miss", "description": "The home improvement retailer remains on track for double-digit earnings growth.", "url": "https://www.fool.com/investing/2020/03/02/why-investors-should-ignore-lowes-q4-revenue-miss.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560257/gettyimages-536867324.jpg", "publishedAt": "2020-03-02T12:40:00Z", "content": "Home-improvement giant Lowe's (NYSE:LOW) sold off following the company's fourth-quarter earnings announcement. The home-improvement chain beat on earnings but missed on revenue. This sent Lowe's stock down 4.5% in the trading session following the news.\r\nSti… [+3516 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Anil Varma", "title": "Biggest Bund Rally Since 2016 Looks Like Unfinished Business - Bloomberg", "description": "The biggest German bond rally in four years may have further to go, according to derivatives pricing.", "url": "https://www.bloomberg.com/news/articles/2020-03-02/biggest-bund-rally-since-2016-looks-like-unfinished-business", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ikPJ3fpJADP0/v0/1200x675.png", "publishedAt": "2020-03-02T12:37:00Z", "content": "The biggest German bond rally in four years may have further to go, according to derivatives pricing.\r\nDemand for options betting on bund gains continued to outpace the equivalent bearish positions Monday, extending a trend that gained momentum throughout las… [+1365 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Virus covered by universal health care", "description": "Coronavirus will be officially covered under the universal healthcare programme while authorities are rushing to ease protective mask shortages as Thailand takes action to contain a possible spread of the disease.", "url": "https://www.bangkokpost.com/thailand/general/1869889/virus-covered-by-universal-health-care", "urlToImage": "https://static.bangkokpost.com/media/content/20200302/c1_1869889_200302193858_700.jpg", "publishedAt": "2020-03-02T12:39:00Z", "content": "Coronavirus will be officially covered under the universal healthcare programme while authorities are rushing to ease protective mask shortages as Thailand takes action to contain a possible spread of the disease.\r\nPublic Health Minister Anutin Charnvirakul s… [+3607 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Transport, tourism sectors in Japan hit hard by virus outbreak", "description": "TOKYO: A coronavirus outbreak has weighed on the transport and tourism sectors in Japan, including bullet trains, with fears about infection making people reluctant to venture outdoors or share confined spaces with others for long hours.", "url": "https://www.bangkokpost.com/business/1869909/transport-tourism-sectors-in-japan-hit-hard-by-virus-outbreak", "urlToImage": "https://static.bangkokpost.com/media/content/20200302/c1_1869909_700.jpg", "publishedAt": "2020-03-02T12:44:00Z", "content": "TOKYO: A coronavirus outbreak has weighed on the transport and tourism sectors in Japan, including bullet trains, with fears about infection making people reluctant to venture outdoors or share confined spaces with others for long hours.\r\nThe number of passen… [+3904 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Bollywood's Deepika Padukone Scraps Paris Fashion Week Trip Amid Coronavirus Outbreak", "description": "New Delhi (Sputnik): Bollywood actress Deepika Padukone has not only made her name in the industry with movies like “Padmaavat”, “Bajirao Mastani”, “Yeh Jawaani Hai Deewani” and “Chhapaak” but also proved her mettle internationally by becoming the first India…", "url": "https://sputniknews.com/india/202003021078450912-bollywoods-deepika-padukone-scraps-paris-fashion-week-trip-amid-coronavirus-outbreak/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107845/10/1078451089.jpg", "publishedAt": "2020-03-02T12:31:47Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Michael Bloom", "title": "Oppenheimer upgrades Apple amid the coronavirus sell-off: Buy the 'recurring revenue machine'", "description": "Oppenheimer upgraded Apple to outperform and said the company's products and strong balance sheet should help it withstand any economic uncertainty due to the coronavirus.", "url": "https://www.cnbc.com/2020/03/02/oppenheimer-upgrades-apple-to-outperform.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106211153-1572383521658gettyimages-1178685494.jpeg?v=1583113269", "publishedAt": "2020-03-02T12:20:00Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Myupchar", "title": "Health ministry confirms two new cases of Novel Coronavirus infection in India: one each in Delhi and Telangana", "description": "A health ministry release stated that both patients are stable and being monitored closely. This brings the total count of cases in India to 5. The post Health ministry confirms two new cases of Novel Coronavirus infection in India: one each in Delhi and Tela…", "url": "https://www.firstpost.com/health/health-ministry-confirms-two-new-cases-of-novel-coronavirus-infection-in-india-one-each-in-delhi-and-telangana-8108971.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/02/GettyImages-1198472587-1.jpg", "publishedAt": "2020-03-02T12:25:42Z", "content": null}]