[{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Matthew Panzarino", "title": "TechCrunch Events and coronavirus", "description": "We here at TechCrunch are watching the novel coronavirus situation closely, as most of you likely are. In addition to our editorial coverage of the effects of the novel coronavirus on the business of entrepreneurship — and the ways that technology can help — …", "url": "http://techcrunch.com/2020/03/09/techcrunch-events-and-coronavirus/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/48832680657_7e9be05eea_k.jpg?w=600", "publishedAt": "2020-03-09T21:56:05Z", "content": "We here at TechCrunch are watching the novel coronavirus situation closely, as most of you likely are. \r\nIn addition to our editorialcoverage of the effects of the novel coronavirus on the business of entrepreneurship and the ways that technology can help we … [+1767 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "You Should Probably Cancel That Thing", "description": "Judging from my inbox and the daily requests for advice I’m now getting from co-workers and friends, it’s safe to say that many people are wondering about how the coronavirus should affect their immediate plans—and the somber truth is that it should affect th…", "url": "https://gizmodo.com/you-should-probably-cancel-that-thing-1842220918", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/kd29nokpgbwhcrahd3zi.jpg", "publishedAt": "2020-03-09T21:30:00Z", "content": "Judging from my inbox and the daily requests for advice Im now getting from co-workers and friends, its safe to say that many people are wondering about how the coronavirus should affect their immediate plansand the somber truth is that it should affect them … [+3935 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: U.S. task force to provide update on virus - Global News", "description": "Coronavirus outbreak: U.S. task force to provide update on virus Global News Coronavirus live updates: Cruise ship heads for Oakland, NYC mayor urges staying home CNBC Live Updates: These Charts Track The Spread Of The Coronavirus In The US BuzzFeed News Hopk…", "url": "https://www.youtube.com/watch?v=Du15BUuoBa4", "urlToImage": "https://i.ytimg.com/vi/Du15BUuoBa4/maxresdefault_live.jpg", "publishedAt": "2020-03-09T21:35:47Z", "content": "The U.S. coronavirus task force is expected to provide an update on efforts to stop the spread of COVID-19 in the U.S. at 5:30 p.m. on Monday, March 9.\r\nFor more info, please go to http://www.globalnews.caSubscribe to Global News Channel HERE: http://bit.ly/2… [+238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Should Trump be worried about contracting virus?", "description": "Two congressmen announced they would self-quarantine after coming in contact with a person diagnosed with the novel coronavirus. These include Rep. Matt Gaetz (R-FL) who recently rode on Air Force One and Rep. Doug Collins who shook President Trump's hand on …", "url": "https://www.cnn.com/videos/politics/2020/03/09/trump-coronavirus-matt-gaetz-doug-collins-sanjay-gupta-tsr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306094807-01-trump-air-force-one-0306-super-tease.jpg", "publishedAt": "2020-03-09T22:08:56Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Abadi and Havovi Cooper", "title": "How the coronavirus compares to SARS, swine flu, Zika, and other epidemics", "description": "The coronavirus outbreak may seem reminiscent of past global epidemics like SARS, MERS, swine flu, and the Zika virus. We looked at the data to see how those epidemics compare to the new coronavirus. While some of those examples were deadlier than the coronav…", "url": "https://www.businessinsider.com/coronavirus-compared-to-sars-swine-flu-mers-zika-2020-3", "urlToImage": "https://i.insider.com/5e66bd0c84159f286d30a8c4?width=1200&format=jpeg", "publishedAt": "2020-03-09T22:05:00Z", "content": "The novel coronavirus outbreak has raised concerns across the globe, with more than 113,000 confirmed cases worldwide.\r\nBut to some, the coronavirus outbreak is reminiscent of epidemics that have caused a panic in recent memory, including SARS, MERS, the Zika… [+2195 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Cadillac cancels debut of all-electric Lyriq over COVID-19 concerns", "description": "Cadillac has cancelled the upcoming debut of the Lyriq, an all-electric mid-sized SUV designed to be an entry point into luxury brand’s new EV lineup, over concerns about the COVID-19 outbreak. GM’s luxury brand had planned to reveal the Lyriq on April 2 at a…", "url": "http://techcrunch.com/2020/03/09/cadillac-cancels-debut-of-all-electric-lyriq-over-covid-19-concerns/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-07-at-10.40.16-AM.jpg?w=764", "publishedAt": "2020-03-09T21:11:34Z", "content": "Cadillac has cancelled the upcoming debut of the Lyriq, an all-electric mid-sized SUV designed to be an entry point into luxury brand’s new EV lineup, over concerns about the COVID-19 outbreak.\r\nGM’s luxury brand had planned to reveal the Lyriq on April 2 at … [+2284 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Markets Crumble on Oil Shock, Virus Fears - Bloomberg Markets and Finance", "description": "Markets Crumble on Oil Shock, Virus Fears Bloomberg Markets and Finance Oil and stock markets stabilise after historic rout Financial Times Stocks plummet amid coronavirus fears and oil-price crash KPRC 2 Click2Houston Asia stocks plunge on virus fears, oil p…", "url": "https://www.youtube.com/watch?v=_MVzmnzDc3I", "urlToImage": null, "publishedAt": "2020-03-09T21:58:40Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Passengers sue over coronavirus-hit Grand Princess cruise ship", "description": "A Florida couple who were passengers on the Grand Princess ocean liner linked to the coronavirus outbreak have sued the ship's owner for more than $1 million for putting the couple's health at risk, according to a lawsuit filed on Monday.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/FWRexVldsJ0/passengers-sue-over-coronavirus-hit-grand-princess-cruise-ship-idUSKBN20W30T", "urlToImage": null, "publishedAt": "2020-03-09T21:58:07Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joey Hadden", "title": "Here are all the major US colleges and universities who have switched to remote classes to prevent the spread of the coronavirus", "description": "Classes are being held online across the US to prevent the spread of the novel coronavirus. The new coronavirus originated in Wuhan, China, and has killed about 3,900 people and infected more than 111,000 as of Monday. Some universities, like Rice, are shifti…", "url": "https://www.businessinsider.com/major-colleges-and-universities-going-remote-over-coronavirus-fears", "urlToImage": "https://i.insider.com/5e66b4fd54f25c1f23793919?width=1200&format=jpeg", "publishedAt": "2020-03-09T22:05:00Z", "content": null}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Seattle's Patient Zero Spread Coronavirus Despite Ebola-Style Lockdown", "description": "First known U.S. case offers lessons in how and how not to fight the outbreak. From a report: The man who would become Patient Zero for the new coronavirus outbreak in the U.S. appeared to do everything right. He arrived Jan. 19 at an urgent-care clinic in a …", "url": "https://science.slashdot.org/story/20/03/09/1955225/seattles-patient-zero-spread-coronavirus-despite-ebola-style-lockdown", "urlToImage": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now", "publishedAt": "2020-03-09T22:11:00Z", "content": "The man who would become Patient Zero for the new coronavirus outbreak in the U.S. appeared to do everything right. He arrived Jan. 19 at an urgent-care clinic in a suburb north of Seattle with a slightly elevated temperature and a cough he'd developed soon a… [+1437 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gabby Landsverk", "title": "Pets probably won't spread the coronavirus to humans, experts say", "description": "A dog in China was quarantined last week after testing a \"weak positive\" for the coronavirus, prompting many to worry whether their pets can become infected, get sick and/or spread the disease. However, experts say there's no currently no evidence that dogs o…", "url": "https://www.businessinsider.com/can-pets-get-or-spread-coronavirus-experts-say-no-2020-3", "urlToImage": "https://i.insider.com/5e66b39284159f1d65611bd4?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:17:00Z", "content": "If you're working from home or trying to de-stress from coronavirus fears, your favorite furry friend may seem like a perfect companion. The good news is: despite reports that one dog tested \"weak positive\" for coronavirus, most experts agree you needn't worr… [+4547 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: Italy shuts entire country down, 3 more US deaths confirmed - CNET", "description": "The latest developments in the COVID-19 outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-italy-shuts-entire-country-down-3-more-us-deaths-confirmed/", "urlToImage": "https://cnet3.cbsistatic.com/img/HVJXYNBvtQh-3T-4WTDE0fqE1H8=/756x567/2020/03/09/8ef1deeb-c72b-4895-97be-7ad2c1cf3487/gettyimages-1204352391.jpg", "publishedAt": "2020-03-09T21:39:00Z", "content": "In three months, coronavirus has spread across every continent, except Antarctica, leaving some cities empty.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a newly identified coronavirus first detected in China in December, has rapidly spread … [+36233 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Canela López", "title": "How to carry on with your life during the coronavirus epidemic — from workout tips to quarantine-friendly recipes", "description": "The novel coronavirus, COVID-19, has infected more than 100,000 people and killed 3,460 people worldwide since the first case was reported in December 2019. People across the globe are quarantining out of concern for the virus and, in some cases, due to gover…", "url": "https://www.businessinsider.com/how-to-live-your-life-through-the-coronavirus-epidemic-2020-3", "urlToImage": "https://i.insider.com/5e66a4a654f25c0b5c3f62c2?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:44:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Tunisia suspends Italy flights", "description": "Tunisia will suspend all flights and shipping to Italy except to Rome and bring forward a scheduled school holiday to Thursday from next Monday, the health minister said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-tunisia-idUSKBN20W2Z8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T21:26:01Z", "content": "TUNIS (Reuters) - Tunisia will suspend all flights and shipping to Italy except to Rome and bring forward a scheduled school holiday to Thursday from next Monday, the health minister said on Monday. \r\nTunisia announced earlier on Monday that it had confirmed … [+206 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Libby Cathey", "title": "GOP Reps. Collins and Gaetz to self-quarantine, interacted with Trump over weekend", "description": "Georgia Rep. Doug Collins said Monday he will self-quarantine after being informed there's a photo of him with the CPAC attendee who tested positive for coronavirus.", "url": "https://abcnews.go.com/Politics/gop-reps-collins-gatez-quarantine-interacted-trump-weekend/story?id=69490854", "urlToImage": "https://s.abcnews.com/images/Politics/collins-trump-ap-ps-200309_hpMain_16x9_992.jpg", "publishedAt": "2020-03-09T22:09:12Z", "content": "Two GOP members of Congress who interacted with President Donald Trump over the weekend announced Monday they will voluntarily self-quarantine after discovering they both interacted with the Conservative Political Action Conference attendee who tested positiv… [+4500 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger and Sonam Sheth", "title": "GOP Rep. Matt Gaetz self-quarantines during Air Force One flight with Trump, days after making light of coronavirus with a gas mask", "description": "GOP Rep. Matt Gaetz went into self-quarantine on Monday after leaning he'd interacted with an individual at the the Conservative Political Action Conference (CPAC) last month who's been infected with coronavirus. This came just days after Gaetz was accused of…", "url": "https://www.businessinsider.com/matt-gaetz-self-quarantined-after-mocking-coronavirus-panic-gas-mask-2020-3", "urlToImage": "https://i.insider.com/5e66b1f4e4f9fe1aeb5300aa?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:27:51Z", "content": "GOP Rep. Matt Gaetz on Monday announced he's self-quarantined, just days after Democrats accused him of making light of coronavirus by wearing a gas mask on the House floor as he and other lawmakers voted to approve $8.3 billion to help combat the outbreak. \r… [+4155 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Clio Chang, Maxwell Strachan", "title": "Trump Should Have Corona-Bumped", "description": "The president shook hands with multiple people who were at CPAC and exposed to the coronavirus. Whoops.", "url": "https://www.vice.com/en_us/article/epgq94/trump-cpac-coronavirus", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e66b241e23c0c012408b8cd/lede/1583788904130-AP_20066815574270.jpeg?crop=1xw:0.8427xh;0xw,0.1187xh&resize=1200:*", "publishedAt": "2020-03-09T21:39:10Z", "content": "Donald Trump, notorious germaphobe, has been betrayed by his own. \r\nOver the weekend it was reported that an attendee of the annual Conservative Political Action Conference (CPAC) had tested positive for COVID-19, more commonly known as coronavirus. The group… [+1936 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rhea Mahbubani", "title": "At least 50 inmates have escaped from Italian prisons as the coronavirus brings the country's criminal justice system to a halt", "description": "Italy on Sunday put the northern region of Lombardy and 14 neighboring provinces at the epicenter of the coronavirus outbreak on lockdown. The restrictions impacted prisoners because it limited or suspended their ability to have family visits. Tension over th…", "url": "https://www.businessinsider.com/inmates-riot-escape-from-italian-prisons-amid-coronavirus-restrictions-2020-3", "urlToImage": "https://i.insider.com/5e66bb7d84159f2726490cd3?width=1200&format=jpeg", "publishedAt": "2020-03-09T22:01:44Z", "content": "At least 50 inmates escaped from an Italian prison between Sunday and Monday as tension over sweeping coronavirus restrictions triggered riots in 27 jails across the country.\r\nDuring the commotion, another six inmates also died of a methadone overdose, the As… [+3351 chars]"}, {"source": {"id": null, "name": "Informationisbeautiful.net"}, "author": "David McCandless", "title": "COVID-19 Coronavirus Infographic Data Pack", "description": "We made an infographic of the best COVID-19 / Coronavirus charts floating around, plus some of our own – all with the latest data We’ll plan to keep it updated every few days. » See the graphic » Explore the Data: bit.ly/COVID19-DATA related » Look at all inf…", "url": "https://informationisbeautiful.net/2020/covid-19-coronavirus-infographic-data-pack/", "urlToImage": "https://infobeautiful4.s3.amazonaws.com/2020/03/blog-corona-virus-infographic-960x274.png", "publishedAt": "2020-03-09T21:15:11Z", "content": "We made an infographic of the best COVID-19 / Coronavirus charts floating around, plus some of our own – all with the latest data\r\nWell plan to keep it updated every few days.\r\n» See the graphic» Explore the Data: bit.ly/COVID19-DATA\r\nrelated» Look at all inf… [+201 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Megan Reynolds", "title": "Coronavirus Porn Is Almost Appealing", "description": "In the worst-case scenarios played out by the ceaseless, sputtering filmstrip of an anxiety-addled brain, the first freedom to disappear under a global pandemic will be bodily autonomy. Self-isolation will strand millions of people in their own homes, eating …", "url": "https://jezebel.com/coronavirus-porn-is-almost-appealing-1842218984", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a1jhbcuixmbpmpczxhwx.png", "publishedAt": "2020-03-09T21:15:00Z", "content": "In the worst-case scenarios played out by the ceaseless, sputtering filmstrip of an anxiety-addled brain, the first freedom to disappear under a global pandemic will be bodily autonomy. Self-isolation will strand millions of people in their own homes, eating … [+3782 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Josh Levin, Joel Anderson, and Stefan Fatsis", "title": "How NBA Jam Helped Stephen Curry Change the NBA", "description": "A video game, a hot hand, and a brand new sport.", "url": "https://slate.com/podcasts/hang-up-and-listen/2020/03/the-coronavirus-the-science-of-streaks-and-a-chaotic-week-in-new-york-basketball-on-hang-up-and-listen", "urlToImage": "https://compote.slate.com/images/98352922-2f92-4060-a8ee-40832dc1f4a0.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2020-03-09T22:03:51Z", "content": "In this weeks episode of Slates sports podcast Hang Up and Listen, Joel Anderson, Stefan Fatsis, and Josh Levin are joined by the Wall Street Journals Ben Cohen to talk about the latest on the coronavirus and sports. They also interview Cohen about his book T… [+1281 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "AAPL loses $100 billion in value, ends day down nearly 8% amid broader market slump", "description": "Amid a tumultuous day for U.S. stocks, AAPL ended down 7.9%, but it wasn’t the only big tech company to sink. As detailed by CNBC, big tech companies lost over $320 billion in value today, coinciding with the worst day for broader market since 2008. more… The…", "url": "https://9to5mac.com/2020/03/09/aapl-stock-down-market-slump/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2017/09/macbook-pro-inset-apple-logo.jpg?quality=82&strip=all", "publishedAt": "2020-03-09T21:50:03Z", "content": "Amid a tumultuous day for U.S. stocks, AAPL ended down 7.9%, but it wasnt the only big tech company to sink. As detailed by CNBC, big tech companies lost over $320 billion in value today, coinciding with the worst day for broader market since 2008.\r\nAAPL ende… [+1670 chars]"}, {"source": {"id": null, "name": "Diyphotography.net"}, "author": "Dunja Djudjic", "title": "Adobe cancels NAB 2020 attendance due to coronavirus concerns", "description": "After switching its annual Summit conference to an online event, Adobe is now also pulling out of NAB 2020. The reason is the same and it was probably expected: the coronavirus outbreak. According to Pro Video Coalition, Adobe has started notifying partners a…", "url": "https://www.diyphotography.net/adobe-cancels-nab-2020-attendance-due-to-coronavirus-concerns/", "urlToImage": "https://s23527.pcdn.co/wp-content/uploads/2020/03/adobe-nab-2020-canceled.jpg.optimal.jpg", "publishedAt": "2020-03-09T21:50:18Z", "content": "After switching its annual Summit conference to an online event, Adobe is now also pulling out of NAB 2020. The reason is the same and it was probably expected: the coronavirus outbreak.\r\nAccording to Pro Video Coalition, Adobe has started notifying partners … [+1249 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Apple giving retail and hourly workers unlimited sick leave for coronavirus-like symptoms", "description": "In addition to offering many of its employees the ability to work from home this week, Apple is also taking steps to ensure the well-being of its retail workers. 9to5Mac has learned that Apple hourly employees, including retail workers, are getting unlimited …", "url": "https://9to5mac.com/2020/03/09/apple-retail-workers-coronavirus/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/08/apple_logo_store.jpg?resize=1024,576", "publishedAt": "2020-03-09T22:02:26Z", "content": "In addition to offering many of its employees the ability to work from home this week, Apple is also taking steps to ensure the well-being of its retail workers. 9to5Mac has learned that Apple hourly employees, including retail workers, are getting unlimited … [+1284 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Esther Wang on The Slot, shared by Esther Wang to Jezebel", "title": "Let's All Thank the CPAC Attendee Who Has Now Forced Matt Gaetz Into Self-Quarantine", "description": "Days after appearing on the floor of Congress in a gas mask to make whatever stupid point he was trying to make about coronavirus, the big ole turd known as Representative Matt Gaetz has now suffered the fate of his Republican colleagues Ted Cruz, Paul Gosar,…", "url": "https://theslot.jezebel.com/lets-all-thank-the-cpac-attendee-who-has-now-forced-mat-1842217764", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cpy624gzsuqgja6cyxae.jpg", "publishedAt": "2020-03-09T22:00:00Z", "content": "Barf BagWelcome to Barf Bag, a daily politics roundup to help you sort through the chaotic Trumpian news cycle.\r\nDays after appearing on the floor of Congress in a gas mask to make whatever stupid point he was trying to make about coronavirus, the big ole tur… [+1935 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Alex Norcia, Maxwell Strachan", "title": "How Coronavirus Could Tank the Economy, According to a Top Health Expert", "description": "The president of the American Society of Health Economics explains the ins and outs of COVID-19's potential effect on the U.S. economy.", "url": "https://www.vice.com/en_us/article/4agb89/why-coronavirus-could-tank-the-economy-according-to-a-top-health-expert", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e66ac40366c4a00e8261872/lede/1583787297634-A-coronavirus-economy-interview-for-dummies_LK.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-03-09T21:27:29Z", "content": "As fears of coronavirus, or COVID-19, spread throughout the world, economic panic is setting in. The Dow Jones Industrial Average plummeted 2,000 points on Monday, marking the single-largest one-day drop in its history. The drop was propelled by collapsing oi… [+6862 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Alex Isenstadt", "title": "Melania Trump cancels California fundraiser", "description": "The move comes amid mounting concern about the coronavirus.", "url": "https://www.politico.com/news/2020/03/09/melania-trump-cancels-california-fundraiser-124742", "urlToImage": "https://static.politico.com/29/ad/c6375e774fb9b70dcae2c08031dd/200309-melania-trump-getty-773.jpg", "publishedAt": "2020-03-09T22:02:57Z", "content": "Several members of Congress, including Texas Sen. Ted Cruz and Arizona Rep. Paul Gosar, announced over the weekend they were self-quarantining after coming into contact with a person who tested positive for coronavirus at last months Conservative Political Ac… [+382 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Matthew Panzarino", "title": "TechCrunch Events and coronavirus", "description": "In addition to our editorial coverage of the effects of the novel coronavirus on the business of entrepreneurship — and the ways that technology can help — we have a number of events planned for 2020 including TC Early Stage in April in San Francisco and our …", "url": "https://finance.yahoo.com/news/techcrunch-events-coronavirus-215605393.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/yLU3J130OZy5dYg3U_KWZg--~B/aD0xMzY1O3c9MjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/3eb18a356d923b6aed7e6758ac6287ec", "publishedAt": "2020-03-09T21:56:05Z", "content": "We here at TechCrunch are watching the novel coronavirus situation closely, as most of you likely are. \r\nIn addition to our editorialcoverage of the effects of the novel coronavirus on the business of entrepreneurship and the ways that technology can help we … [+1768 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Katherine Fan", "title": "Will you need a clean bill of health for your next international trip? Here’s how to get a medical certificate last minute", "description": "As the coronavirus pandemic continues to spread worldwide, nations are tightening their entry regulations. On March 9, Israel announced a mandatory 14-day quarantine for all travelers entering the country from abroad, while travelers from restricted countries…", "url": "http://thepointsguy.com/news/clean-bill-of-health-proof/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2020/01/GettyImages-1197407066.jpg?fit=1024%2C709px&ssl=1", "publishedAt": "2020-03-09T21:30:11Z", "content": "As the coronavirus pandemic continues to spread worldwide, nations are tightening their entry regulations. On March 9, Israel announced a mandatory 14-day quarantine for all travelers entering the country from abroad, while travelers from restricted countries… [+6538 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Buncombe", "title": "'It is likely that people you know will die': Coronavirus could be like 1918 flu pandemic, warns ex-CDC expert", "description": "The coronavirus crisis could be as serious and deadly as the 1918 flu pandemic which killed up to 50m people around the world, a former CDC infectious disease specialist has warned.As health experts from Milan to Wuhan scrambled to try and stop the spread of …", "url": "https://news.yahoo.com/likely-people-know-die-coronavirus-212524242.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/WlD7LOv9kA1FD4HnW8gWkA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MDI-/https://s.yimg.com/uu/api/res/1.2/zo5bswdU.1rt2_57jgZUYw--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/b72f5758c4f5951e18d28d1b743c8478", "publishedAt": "2020-03-09T21:25:24Z", "content": "Disease has already killed 3,800 people around the world: Getty\r\nThe coronavirus crisis could be as serious and deadly as the 1918 flu pandemic which killed up to 50m people around the world, a former CDC infectious disease specialist has warned.\r\nAs health e… [+3789 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Dan Diamond", "title": "Health secretary pushes cruise ship shutdown amid coronavirus crisis", "description": "Officials have debated whether to effectively ban such travel for the duration of the outbreak.", "url": "https://www.politico.com/news/2020/03/09/azar-cruise-ship-shutdown-coronavirus-124645", "urlToImage": "https://static.politico.com/88/eb/597480de457c9cc5eab37bd84e0e/20200309-azar-ap-773.jpg", "publishedAt": "2020-03-09T21:11:54Z", "content": "HHS referred questions to the White House. \"As the secretary and public health officials have said all along, the response to the Covid-19 outbreak will adapt as the outbreak evolves,\" a spokesperson said, adding that the administration had planned for a \"ful… [+1167 chars]"}, {"source": {"id": null, "name": "Technologyreview.com"}, "author": "James Temple", "title": "Why the coronavirus outbreak is terrible news for climate change", "description": "It’ll sap funding and political will – but actually, it should.", "url": "https://www.technologyreview.com/s/615338/coronavirus-emissions-climate-change/", "urlToImage": "https://cdn.technologyreview.com/i/images/sa-641079250-web.jpg?cx=0&cy=0&cw=2999&ch=1687&sw1200", "publishedAt": "2020-03-09T21:49:50Z", "content": "It appears increasingly likely that the global coronavirus outbreak will cut greenhouse gas emissions this year, as deepening public health concerns ground planes and squeeze international trade.\r\nBut it would be a mistake to assume that the rapidly spreading… [+4244 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Slovakia v Republic of Ireland: Euro 2020 play-off in doubt after Government ban", "description": "A 14-day ban on all sporting events in Slovakia because of coronavirus puts in doubt the Euro 2020 play-off with the Republic of Ireland.", "url": "https://www.bbc.co.uk/sport/football/51804902", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/17FE7/production/_111197289_christiehamsik.jpg", "publishedAt": "2020-03-09T21:21:19Z", "content": "The Republic are due to face Slovakia in the Euro 2020 play-off semi-final in Bratislava on 26 March\r\nA 14-day ban on all sporting events in Slovakia because of coronavirus has put in doubt the Euro 2020 play-off with the Republic of Ireland on 26 March.\r\nSlo… [+1600 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Anne Burdakin)", "title": "Why Shares of GlaxoSmithKline Dropped 12.4% in February", "description": "February was a wild month as coronavirus fears drove the pharma's stock price up and down.", "url": "https://www.fool.com/investing/2020/03/09/glaxo-smith-kline-10.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562143/gettyimages-1138293825.jpg", "publishedAt": "2020-03-09T21:25:00Z", "content": "What happened\r\nShares of Britain-based drug company GlaxoSmithKline(NYSE:GSK) dropped 12.4% in February, according to data provided by S&amp;P Global Market Intelligence. Coronavirus fears were responsible for some of the drop, but not all. The company also r… [+1833 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "Coronavirus is forcing New York state to make its own hand sanitizer", "description": "The state of New York will be making its own hand sanitizer in the wake of shortages and price gouging due to the coronavirus outbreak. New York Governor Andrew Cuomo says the product is highly effective thanks to its 75% alcohol content. The hand sanitizer w…", "url": "https://bgr.com/2020/03/09/hand-sanitizer-new-york-state/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/03/esruo6_wkaareoa.jpeg?quality=98&strip=all", "publishedAt": "2020-03-09T21:20:32Z", "content": "<ul><li>The state of New York will be making its own hand sanitizer in the wake of shortages and price gouging due to the coronavirus outbreak. </li><li>New York Governor Andrew Cuomo says the product is highly effective thanks to its 75% alcohol content. </l… [+3045 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Laura Hancock, cleveland.com", "title": "Ohio is under a state of emergency because of the coronavirus. What does that mean? - cleveland.com", "description": "Ohio is under a state of emergency because of the coronavirus. What does that mean? cleveland.com Could Ohio shut down travel for coronavirus quarantine? cleveland.com Number of people being tested for coronavirus in Ohio surges to eight cleveland.com Three O…", "url": "https://www.cleveland.com/coronavirus/2020/03/ohio-is-under-a-state-of-emergency-because-of-the-coronavirus-what-does-that-mean.html", "urlToImage": "https://www.cleveland.com/resizer/FM3TaHI0bPTL_51bise-WzCTyR8=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/732HVA5TNNGL7NPNYCRQZFU46Q.jpeg", "publishedAt": "2020-03-09T22:04:00Z", "content": "COLUMBUS, Ohio - During the Monday afternoon news conference in which Gov. Mike DeWine announced three confirmed coronavirus cases out of Cuyahoga County, he said he was going to sign a document to put Ohio under a state of emergency.\r\nWhat does that mean?\r\nL… [+2041 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "All of Italy is now on lockdown due to coronavirus - CNN", "description": "All of Italy is now on lockdown due to coronavirus CNN Italy extends coronavirus lockdown to entire country, imposing restrictions on 60 million people The Washington Post The Entire Country Of Italy Is On Lockdown Because Of The Coronavirus Forbes Italy Limi…", "url": "https://www.youtube.com/watch?v=lm7Xi3cw6dY", "urlToImage": "https://i.ytimg.com/vi/lm7Xi3cw6dY/maxresdefault.jpg", "publishedAt": "2020-03-09T21:31:39Z", "content": "The whole country of Italy is now on lockdown, Italy's Prime Minister Giuseppe Conte announced at a news conference. Conte said the measure was taken in order to protect citizens, especially the most fragile individuals. #CNN#News"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Horace Mann School Closes After Testing Student for Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/horace-mann-school-closes-after-testing-student-for-coronavirus", "urlToImage": null, "publishedAt": "2020-03-09T21:12:50Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Nick Wadhams, Jennifer Jacobs, Saleha Mohsin", "title": "Pence Plans to Discuss Coronavirus With U.S. Health Insurers", "description": "Vice President Mike Pence invited top executives from the largest U.S. health insurers to discuss the response to the coronavirus outbreak on Tuesday, as the White House sought to signal a more muscular effort to stem the outbreak and stock markets again stum…", "url": "https://www.bloomberg.com/news/articles/2020-03-09/pence-plans-to-discuss-coronavirus-with-u-s-health-insurers", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iZS4QvfX_rOo/v1/1200x800.jpg", "publishedAt": "2020-03-09T21:25:55Z", "content": "Vice President Mike Pence \r\nVice President Mike Pence invited top executives from the largest U.S. health insurers to discuss the response to the coronavirus outbreak on Tuesday, as the White House sought to signal a more muscular effort to stem the outbreak … [+1879 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Nasdaq closes down 7.29% and S&P 500 down 7.6% extending last week's selloff, amid fears over the spread of the coronavirus and a new oil price war (Ari Levy/CNBC)", "description": "Ari Levy / CNBC : Nasdaq closes down 7.29% and S&P 500 down 7.6% extending last week's selloff, amid fears over the spread of the coronavirus and a new oil price war — - Apple lost $100 billion in value on Monday, while Microsoft's market cap plunged by $83.6…", "url": "https://www.techmeme.com/200309/p27", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106413403-1582810412308apple.jpg?v=1582810474", "publishedAt": "2020-03-09T22:10:05Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Jason Scott", "title": "Australia Says Virus Hit Could Be Greater Than Financial Crisis", "description": "Prime Minister Scott Morrison said the impact of the coronavirus outbreak on Australia’s economy could be greater than the damage inflicted by the global financial crisis more than a decade ago.", "url": "https://www.bloomberg.com/news/articles/2020-03-09/australia-says-virus-hit-could-be-greater-than-financial-crisis", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/inoNp5mHpbPY/v0/1200x800.jpg", "publishedAt": "2020-03-09T21:48:32Z", "content": "Prime Minister Scott Morrison said the impact of the coronavirus outbreak on Australia’s economy could be greater than the damage inflicted by the global financial crisis more than a decade ago.\r\n“The epicenter of this crisis is much closer to home,” Morrison… [+1005 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Bloomberg", "title": "Profits Are Going to Take a Big Hit, Says Jonathan Golub", "description": "Credit Suisse Group AG’s Jonathan Golub says company earnings are going to take a hit because of the coronavirus. He talks about the call on \"What'd You Miss?\" (Source: Bloomberg)", "url": "https://www.bloomberg.com/news/videos/2020-03-09/profits-are-going-to-take-a-big-hit-says-jonathan-golub-video", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iV1at_rchfQA/v5/-1x-1.jpg", "publishedAt": "2020-03-09T22:02:09Z", "content": null}, {"source": {"id": null, "name": "Nj.com"}, "author": "Chris Sheldon | NJ Advance Media for NJ.com", "title": "N.J. school district closing for 2 days after staffer had contact with coronavirus patient - NJ.com", "description": "N.J. school district closing for 2 days after staffer had contact with coronavirus patient NJ.com Is it really a good idea to close schools to fight coronavirus? The Washington Post Most Bay Area schools remain open until further notice from state as coronavi…", "url": "https://www.nj.com/coronavirus/2020/03/nj-school-district-closing-for-2-days-after-staffer-had-contact-with-coronavirus-patient.html", "urlToImage": "https://www.nj.com/resizer/FtZGXoJiJ_AR46q_ATfvoUmf0Ck=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/6KGUCDPD2JBRDMTDWK3MIRPVQI.jpg", "publishedAt": "2020-03-09T21:56:43Z", "content": "Roselle Public Schools will be closed on Tuesday and Wednesday after district officials learned that a staff member made contact with someone who was recently diagnosed with coronavirus.\r\nTo be clear, there are no reported cases of coronavirus in our school d… [+1230 chars]"}, {"source": {"id": null, "name": "Poconorecord.com"}, "author": "Brian Myszkowski", "title": "Pa. DOH: COVID-19 case in Monroe County - Pocono Record", "description": "Pa. DOH: COVID-19 case in Monroe County Pocono Record Several Schools Closed After Children’s Hospital Of Philadelphia Doctor At King Of Prussia Site Tests Positive For Coronavirus CBS Philly Pa. has 10 presumed cases of coronavirus, including 1 in Monroe, of…", "url": "https://www.poconorecord.com/article/20200309/NEWS/200309801", "urlToImage": "https://www.poconorecord.com/storyimage/PR/20200309/NEWS/200309801/AR/0/AR-200309801.jpg", "publishedAt": "2020-03-09T21:15:00Z", "content": "Pennsylvania’s Department of Health has announced that there are now 10 presumptive cases of the novel coronavirus in the commonwealth, including at least one in Monroe County.\r\nThe Department of Health updated the PA COVID-19 page on its website to show that… [+2190 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Sensex sees worst 1-day loss, sheds 1,942 pts", "description": "Already anxious about the coronavirus impact and sliding oil prices, Dalal Street caved in under fears of financial instability in India due to the crisis at Yes Bank, the country's fourth largest private sector lender. Reliance Industries closed an unprecede…", "url": "https://timesofindia.indiatimes.com/business/india-business/1942-a-horror-story-sensex-suffers-worst-1-day-loss-ever/articleshow/74559115.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74559122,width-1070,height-580,imgsize-74977,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-09T21:24:14Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Study highlights ease of spread of COVID-19 viruses - CIDRAP", "description": "Study highlights ease of spread of COVID-19 viruses CIDRAP Coronavirus map: Track COVID-19′s spread in your state, around the world in real-time syracuse.com More Learning Needed on Virus Mortality Rates, Johns Hopkins' Sauer Says Bloomberg Markets and Financ…", "url": "http://www.cidrap.umn.edu/news-perspective/2020/03/study-highlights-ease-spread-covid-19-viruses", "urlToImage": "http://www.cidrap.umn.edu/sites/default/files/public/styles/thumbnail/public/images/news/sneeze_particles.jpg?itok=wyp-02CP", "publishedAt": "2020-03-09T21:47:44Z", "content": "COVID-19 can be spread before it causes symptoms, when it produces symptoms like those of the common cold, and as many as 12 days after recovery, according to a virologic analysis of nine infected patients published today on the preprint server medRxiv.\r\nAlso… [+4464 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Travel Companies Pull Forecasts; Italy Extends Ban: Virus Update", "description": "Italian Prime Minister Giuseppe Conte said he’ll move to extend restrictive measures on travel -- currently in force in the north -- throughout the rest of the country in a bid to limit the spread of the coronavirus after the number of cases soared by 25%. Ca…", "url": "https://www.bloomberg.com/news/articles/2020-03-09/travel-companies-pull-forecasts-italy-extends-ban-virus-update", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iQgqxAh9cuWE/v0/1200x800.jpg", "publishedAt": "2020-03-09T21:52:06Z", "content": "Italian Prime Minister Giuseppe Conte said he’ll move to extend restrictive measures on travel -- currently in force in the north -- throughout the rest of the country in a bid to limit the spread of the coronavirus after the number of cases soared by 25%. Ca… [+7543 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Leo Barraclough", "title": "Korean Box Office: ‘Invisible Man’ Tops Virus-Hit Weekend, ‘1917’ Remains in Second", "description": "The Korean box office hit rock bottom this weekend due to coronavirus that is fast spreading in the country. According to KOBIS, the box-office tracking service operated by the Korean Film Council, the country’s box office managed some 230,803 ticket sales be…", "url": "https://variety.com/2020/film/box-office/korean-box-office-invisible-man-tops-virus-hit-weekend-1917-remains-in-second-1203528063/", "urlToImage": "https://pmcvariety.files.wordpress.com/2020/03/invisible-3.jpg?w=700&h=393&crop=1", "publishedAt": "2020-03-09T21:21:15Z", "content": "The Korean box office hit rock bottom this weekend due to coronavirus that is fast spreading in the country. According to KOBIS, the box-office tracking service operated by the Korean Film Council, the country’s box office managed some 230,803 ticket sales be… [+2015 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Abantika Ghosh", "title": "Which strain of coronavirus has come to India?", "description": "The researchers inferred that of the two subtypes, 70% of were of type L; the remaining were of type S.", "url": "https://indianexpress.com/article/explained/which-strain-of-coronavirus-has-come-to-india-6307355/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus-25.jpg?w=759", "publishedAt": "2020-03-09T22:10:46Z", "content": "Written by Abantika Ghosh\r\n | New Delhi | \r\nPublished: March 10, 2020 3:40:46 am\r\nChecking for fever in Delhi on Monday. (Express photo by Tashi Tobgyal)A study from China has claimed that the novel coronavirus has two strains L and S. The research looked at … [+1902 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Chahat Rana", "title": "Chandigarh: After AYUSH advisory, demand for Arsenicum Album 30 increases", "description": "Apart from general preventive measures of taking a balanced diet and inculcating hygienic practices, the advisory recommends one dose of Arsenic Album 30 for three days in a row on an empty stomach as a prophylactic medicine against coronavirus infections.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-after-ayush-advisory-demand-for-arsenicum-album-30-increases-6307481/", "urlToImage": "https://images.indianexpress.com/2020/03/maha-drug.jpg?w=759", "publishedAt": "2020-03-09T21:51:56Z", "content": "Written by Chahat Rana\r\n | Chandigarh | \r\nPublished: March 10, 2020 3:21:56 am\r\nFollowing the advisory, Telanganas AYUSH department drew flak for distributing 11,500 doses of this medicine to 3,500 people in the state. (Representational/Thinkstock Image)Even … [+3271 chars]"}, {"source": {"id": null, "name": "Blackwhitereadallover.com"}, "author": "Danny Penza", "title": "OFFICIALLY OFFICIAL: Serie A play suspended due to coronavirus - Black & White & Read All Over", "description": "OFFICIALLY OFFICIAL: Serie A play suspended due to coronavirus Black & White & Read All Over View Full Coverage on Google News", "url": "https://www.blackwhitereadallover.com/2020/3/9/21172244/official-serie-a-play-has-been-suspended-juventus-2020-serie-a-coronavirus", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Qm5T-nCPMxm4JwLc53sAE6Sz_K4=/0x178:3000x1749/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19780325/1206107451.jpg.jpg", "publishedAt": "2020-03-09T21:46:57Z", "content": "For all of the good vibes that came out of Juventus playing well against Inter Milan on Sunday night, there was the overlying thought hanging over the match about what was next for both the club and Serie A as a whole. The coronavirus outbreak has forced the … [+2558 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nathan Allen", "title": "Schools shut in Madrid region and Basque capital over coronavirus", "description": "Kindergartens, schools and universities in the Madrid region will close for two weeks from Wednesday as a precaution against coronavirus, officials said on Monday, as the disease spread further around Spain.", "url": "https://www.reuters.com/article/us-health-coronavirus-spain-idUSKBN20W1ON", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500980066&w=1200&r=LYNXMPEG281HG", "publishedAt": "2020-03-09T22:07:03Z", "content": "MADRID (Reuters) - Kindergartens, schools and universities in the Madrid region will close for two weeks from Wednesday as a precaution against coronavirus, officials said on Monday, as the disease spread further around Spain. \r\nMedia including Cadena Ser rad… [+1863 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Brad Moon, Contributor, Brad Moon, Contributor https://www.forbes.com/sites/bradmoon/", "title": "In Response To Coronavirus, Apple Updates iPhone Cleaning Guidelines", "description": "Worried that your iPhone is a coronavirus transmission vector? Apple now says you can clean it with isopropyl alcohol wipes or Clorox disinfecting wipes.", "url": "https://www.forbes.com/sites/bradmoon/2020/03/09/in-response-to-coronavirus-apple-updates-iphone-cleaning-guidelines/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e66b662e1e6170007593833%2F0x0.jpg", "publishedAt": "2020-03-09T21:38:19Z", "content": "Apple has always cautioned customers to use care when cleaning its products. A soft, slightly damp microfiber cloth (with a little soap and water for extreme cases) has been the recommended approach for years. With the iPhone and iPad, especially, the company… [+2264 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Dean Bennett", "title": "Oil prices plunge: Alberta Opposition leader urges premier to resubmit budget - CTV News", "description": "Alberta Premier Jason Kenney says his government will do whatever it takes to rescue the province from an oil price collapse and he wants the federal government to step up as well.", "url": "https://www.ctvnews.ca/business/alberta-premier-says-all-options-on-table-to-fight-oil-price-collapse-1.4844449", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4846081.1583812738!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-09T21:33:14Z", "content": "Alberta Premier Jason Kenney says his government will do whatever it takes to rescue the province from an oil price collapse and he wants the federal government to step up as well.\r\n\"This is not just about Alberta. As Alberta goes, so goes the national econom… [+4200 chars]"}, {"source": {"id": null, "name": "Post-gazette.com"}, "author": null, "title": "Italy imposes nationwide lockdown in attempt to contain coronavirus - Pittsburgh Post-Gazette", "description": "Italy imposes nationwide lockdown in attempt to contain coronavirus Pittsburgh Post-Gazette View Full Coverage on Google News", "url": "https://www.post-gazette.com/news/corona2020/2020/03/09/Italy-lockdown-coronavirus-restrictions-covid-19-virus-Milan/stories/202003090122", "urlToImage": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Italy-Virus-Outbreak-3-1583790508.jpg", "publishedAt": "2020-03-09T21:48:15Z", "content": "MENU"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "French minister catches after parliament visit...", "description": "French minister catches after parliament visit... (Top headline, 32nd story, link ) Related stories: New York Prison Labor Prepares to Dig Graves... Now making hand sanitizer... CA restaurant takes temperatures before serving customers... Top Virus Doctor Say…", "url": "https://news.trust.org/item/20200309205743-rvt4v", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/4c185f5d-11dc-4a11-a69f-f59ffa3a3ef4/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2020-03-09T22:10:36Z", "content": "(Adds details)\r\nPARIS, March 9 (Reuters) - France's culture minister has become the latest politician to contract the coronavirus, a government colleague said on Monday, after several lawmakers came down with the COVID-19 illness.\r\nFranck Riester is doing wel… [+1143 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Madrid region suspends classes in all schools, universities", "description": "Spain's Health Minister Salvador Illa confirmed on Monday that the region of Madrid would suspend all school and university activity for two weeks from Wednesday as the authorities raised the level of coronavirus transmission risk.", "url": "https://www.reuters.com/article/us-health-coronavirus-spain-minister-idUSKBN20W2SO", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T22:07:03Z", "content": "MADRID (Reuters) - Spain’s Health Minister Salvador Illa confirmed on Monday that the region of Madrid would suspend all school and university activity for two weeks from Wednesday as the authorities raised the level of coronavirus transmission risk. \r\nReport… [+62 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "The Associated Press", "title": "Italy expands travel restrictions to entire country to contain coronavirus - USA TODAY", "description": "Italian Premier Giuseppe Conte says he is extending restrictions on travel from the north to entire country to try to stop the spread of coronavirus.", "url": "https://www.usatoday.com/story/travel/destinations/2020/03/09/italy-imposes-nationwide-restrictions-contain-coronavirus/5004545002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/09/USAT/74a49816-b2d1-483e-971b-78f35f7b95fe-GTY_1206167159.JPG?crop=6719,3780,x0,y341&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-09T21:56:33Z", "content": "The rapid spread of the coronavirus has frozen the travel industry, leaving many famous locations nearly empty.\r\nWochit\r\nMILAN  Italian Premier Giuseppe Conte put his entire country on lockdown Monday to combat the coronavirus, banning all but the most import… [+7402 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Nellie Andreeva", "title": "Pilot Season 2020: The Overachievers List", "description": "It’s been a subdued broadcast pilot season, one overshadowed by the slew of high-profile launches of new streaming services, shrouded in uncertainty over a potential writers strike, and hit by fears related to the growing coronavirus outbreak. Amid the somewh…", "url": "https://deadline.com/2020/03/tv-pilot-season-2020-overachievers-list-1202865393/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/greg-berlanti-aaron-kaplan-john-davisdavid-e.-kelley.jpg?w=1000", "publishedAt": "2020-03-09T21:25:58Z", "content": "It’s been a subdued broadcast pilot season, one overshadowed by the slew of high-profile launches of new streaming services, shrouded in uncertainty over a potential writers strike, and hit by fears related to the growing coronavirus outbreak. Amid the somewh… [+4351 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "4 members of Congress, including lawmaker who shook Trump's hand, to self-quarantine after CPAC - CNN", "description": "4 members of Congress, including lawmaker who shook Trump's hand, to self-quarantine after CPAC CNN Trump had contact with congressmen Collins and Gaetz before they self-quarantined over coronavirus concerns CNBC Trump shook Rep. Doug Collins' hand before con…", "url": "https://www.youtube.com/watch?v=81rUeGytSpc", "urlToImage": null, "publishedAt": "2020-03-09T22:06:47Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "AMC Networks Cancels Upfront Event On Coronavirus Fears: Will Have Conversations With Individual Advertisers", "description": "AMC Networks is the latest to change its upfront plans, canceling its live event due to concerns over the coronavirus and opting to talk with advertisers separately. “In light of current events, we have decided to cancel our live upfront presentation schedule…", "url": "https://deadline.com/2020/03/amc-networks-cancels-upfront-1202877867/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2018/11/amc-networks-logo-featured.jpg?w=621", "publishedAt": "2020-03-09T21:21:51Z", "content": "AMC Networks is the latest to change its upfront plans, canceling its live event due to concerns over the coronavirus and opting to talk with advertisers separately.\r\n“In light of current events, we have decided to cancel our live upfront presentation schedul… [+1134 chars]"}, {"source": {"id": null, "name": "Inquirer.com"}, "author": "Sarah Gantz, Tom Avril", "title": "Coronavirus sends CHOP-King of Prussia cardiologist to Philadelphia hospital - The Philadelphia Inquirer", "description": "Coronavirus sends CHOP-King of Prussia cardiologist to Philadelphia hospital The Philadelphia Inquirer Coronavirus outbreaking forcing schools closures across Delaware Valley 6abc.com New coronavirus patient in Montco hospitalized in critical condition, offic…", "url": "https://www.inquirer.com/health/coronavirus/coronavirus-covid19-chop-king-of-prussia-cardiologist-philadelphia-hup-20200309.html", "urlToImage": "https://www.inquirer.com/resizer/1CUKZ9SNpTiubye-jSTE8z_CKfg=/1200x0/center/middle/www.inquirer.com/resizer/fOKKUZVcH9AF6q8suVoOtGw5yEU=/1200x0/center/middle/arc-anglerfish-arc2-prod-pmn.s3.amazonaws.com/public/XGBUCDZJUFEF7FGPROY5DJ64ZI.jpg", "publishedAt": "2020-03-09T21:53:11Z", "content": "A cardiologist at Childrens Hospital of Philadelphias campus in King of Prussia has tested positive for the new coronavirus and was in critical condition at the Hospital of the University of Pennsylvania, health officials said Monday.\r\nThe doctor, who recentl… [+4570 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What passengers of the Grand Princess are seeing at the Port of Oakland - Sacramento Bee", "description": "What passengers of the Grand Princess are seeing at the Port of Oakland Sacramento Bee For coronavirus-stricken cruise passengers, dread over second quarantine ahead The Mercury News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=Eta1jAQaRuE", "urlToImage": null, "publishedAt": "2020-03-09T22:06:35Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Ben Yakas", "title": "Extra Extra: Should You Pause Your Open Marriage Because Of Coronavirus?", "description": "Because you'd rather leave it open, check out today's end-of-day links: Daniel Craig profile, sexy baby voice phenom, handwashing meme, Smurfs gathering, Trump freaked out, dog trainer and more. [ more › ]", "url": "https://gothamist.com/news/extra-extra-dog-trainer", "urlToImage": "https://cms.prod.nypr.digital/images/301876/fill-1200x650/", "publishedAt": "2020-03-09T21:38:36Z", "content": "Gothamist is a website about New York City news, arts and events, and food, brought to you by New York Public Radio.\r\nSupport for Gothamist is provided by Craig Newmark Philanthropies and Josh Reznick. Additional support provided by the Wyncote Foundation and… [+35 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Santander moves 60 staff to different location in Madrid due to coronavirus", "description": "Spain's Santander has moved around 60 employees from its trading floor at its group headquarters on the outskirts of Madrid to a different location in the capital as part of its contingency plans against a potential spread of the coronavirus, a source with kn…", "url": "https://www.reuters.com/article/us-health-coronavirus-banks-santander-idUSKBN20W30Z", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500980057&w=1200&r=LYNXMPEG281YX", "publishedAt": "2020-03-09T22:07:03Z", "content": "MADRID (Reuters) - Spain’s Santander has moved around 60 employees from its trading floor at its group headquarters on the outskirts of Madrid to a different location in the capital as part of its contingency plans against a potential spread of the coronaviru… [+688 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Amanda Arnold, Bridget Read", "title": "Reckless Smurfs Gather in Defiance", "description": "One day before the French government banned mass gatherings to prevent the spread of the coronavirus.", "url": "http://www.thecut.com/2020/03/smurfs-gather-in-france-break-world-record-amid-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/09/9-smurfs-1.w1200.h630.jpg", "publishedAt": "2020-03-09T21:57:23Z", "content": "I dont know about you, but if I had plans to attend the worlds largest gathering of Smurfs last weekend, I probably wouldve reconsidered. Instead, I think wouldve put on my blue body paint and my white hat and done my Smurf cosplay in the comforts of my home,… [+1931 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": null, "title": "New Coronavirus Hurting World's Economies", "description": "VOA Learning English presents news, features, audio, video and multimedia about the U.S. and the world in American English. Stories are written at the intermediate and upper-beginner level. Words are spoken one-third slower for ESL learners.", "url": "https://learningenglish.voanews.com/a/5321780.html", "urlToImage": "https://gdb.voanews.com/6AD44B97-4251-4D10-B871-C134BBFB39FA_w1200_r1_s.jpg", "publishedAt": "2020-03-09T21:24:00Z", "content": "No media source currently available"}, {"source": {"id": null, "name": "Wowt.com"}, "author": "John Chapman", "title": "Metro travel agents see coronavirus impacts on business - WOWT", "description": "With the entire world on guard against the coronavirus, some travel agents here in the metro area dealing with delays and cancellations as travelers work to figure out how to avoid the virus.", "url": "https://www.wowt.com/content/news/Metro-travel-agents-see-coronavirus-impacts-on-business-568637981.html", "urlToImage": "https://media.graytvinc.com/images/coronavirus+mgn+with+credits.jpg", "publishedAt": "2020-03-09T22:07:22Z", "content": "OMAHA, Neb. (WOWT) -- With the entire world on guard against the coronavirus, some travel agents here in the metro area dealing with delays and cancellations as travelers work to figure out how to avoid the virus.\r\nAAA Nebraska officials tell us right now tra… [+1432 chars]"}, {"source": {"id": null, "name": "Kake.com"}, "author": "Bri Smith", "title": "Local businesses worry about impact of coronavirus - KAKE", "description": "One person in Kansas tested positive for the virus in Johnson County. Local coffee shops and retail stores are preparing for the potential spread to Wichita.", "url": "http://www.kake.com/story/41872580/local-businesses-worry-about-impact-of-coronavirus", "urlToImage": "https://KAKE.images.worldnow.com/images/19247607_G.jpg?lastEditedDate=20200309181118", "publishedAt": "2020-03-09T21:40:00Z", "content": "WICHITA, Kan. (KAKE) -\r\n For decades, Jack Kellogg has relied on walk-in business at his hat shop, Hatman Jacks. With the fast-spreading coronavirus, he's trying to help his customers feel safe enough to keep coming in. \r\n\"We'll take every measure that is rec… [+1337 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Italy Imposes Nationwide Restrictions to Contain New Virus", "description": "Italian Premier Giuseppe Conte says travel restrictions are being imposed nationwide to try to stop the spread of the spread of the new coronavirus.", "url": "https://www.snopes.com/ap/2020/03/09/italy-imposes-nationwide-restrictions-to-contain-new-virus/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/ap_italy.jpg?fit=800,560", "publishedAt": "2020-03-09T21:15:48Z", "content": "MILAN (AP) Italian Premier Giuseppe Conte says travel restrictions are being imposed nationwide to try to stop the spread of the spread of the new coronavirus.\r\nConte said Monday night that a new government decree will require all people in Italy to demonstra… [+920 chars]"}, {"source": {"id": null, "name": "Barrons.com"}, "author": "Eric J. Savitz", "title": "Coronavirus Selloff Has Pushed Tech Stocks Into Bear Market Territory - Barron's", "description": "Coronavirus Selloff Has Pushed Tech Stocks Into Bear Market Territory Barron's", "url": "https://www.barrons.com/articles/coronavirus-selloff-has-pushed-tech-stocks-into-bear-market-territory-51583790641", "urlToImage": "https://images.barrons.com/im-162264/social", "publishedAt": "2020-03-09T21:54:16Z", "content": "Technology stocks led the markets rally to record heights, but the largest tech names have been swept up by the recent selling wave. Most of the leading tech companies now at or near bear market declines, down roughly 20% from their mid-February highs.The\r\n S… [+2421 chars]"}, {"source": {"id": null, "name": "Wsls.com"}, "author": "Colter Anstaett", "title": "Virginia Tech: How to properly wash your hands - WSLS 10", "description": "Health officials continue to emphasize hand washing is the best way to prevent against the coronavirus.", "url": "https://www.wsls.com/news/local/2020/03/09/virginia-tech-how-to-properly-wash-your-hands/", "urlToImage": "https://www.wsls.com/resizer/EsrNCgPnsMP012ToQEV8Gy2LUjo=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/ULABUDO2HBG35JYA3267FYFZBM.jpg", "publishedAt": "2020-03-09T22:03:29Z", "content": "BLACKSBURG, Va. Health officials continue emphasizing that hand washing is the best way to prevent against the coronavirus.\r\nWashing your hands is something youve done countless times, but, you may not be getting your hands as clean as they could be.\r\nThe fir… [+1113 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "FedEx CFO to Retire Before Year's End", "description": "The long-time chief financial officer will stay on to help his successor transition into the role.", "url": "https://www.fool.com/investing/2020/03/09/fedex-cfo-to-retire-before-years-end.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562371/fdx-fedex-777-source-fedex.jpg", "publishedAt": "2020-03-09T21:18:00Z", "content": "FedEx(NYSE:FDX) said Monday night that long-serving chief financial officer Alan Graf would retire later this year, leaving it to his successor to complete a massive overhaul of the business designed to help it to better-compete with a new generation of trans… [+1339 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Kelen McBreen", "title": "More Coronavirus Censorship: Social Media Companies Partner With WHO To Censor Info", "description": "Effort meant to spread veritable information on the novel coronavirus.", "url": "https://www.infowars.com/more-coronavirus-censorship-social-media-companies-partner-with-who-to-censor-info/", "urlToImage": "https://assets.infowars.com/2020/03/3-9-20-who-social.jpg", "publishedAt": "2020-03-09T21:29:34Z", "content": "Social media companies have made the decision to partner with “health authorities” (government officials like those who work for the CDC) to combat “misinformation” about the coronavirus. \r\nWe all know what this means. Under the mainstream media’s seemingly i… [+2430 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rachel Sandler, Forbes Staff, Rachel Sandler, Forbes Staff https://www.forbes.com/sites/rachelsandler/", "title": "The Entire Country Of Italy Is On Lockdown Because Of The Coronavirus", "description": "Italian officials extended the country’s travel restrictions to 60 million people.", "url": "https://www.forbes.com/sites/rachelsandler/2020/03/09/the-entire-country-of-italy-is-on-lockdown-because-of-the-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206167201%2F0x0.jpg", "publishedAt": "2020-03-09T22:04:46Z", "content": "People wear face masks wait at the Termini Central Station during the Coronavirus emergency, on ... [+] March 9, 2020 in Rome, Italy.\r\nPhoto by Antonio Masiello/Getty Images\r\nTopline: Italy has put the entire country on lockdownthe most aggressive step taken … [+1666 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Khristopher J. Brooks", "title": "Coronavirus swamping U.S. cruise lines", "description": "U.S. cruise lines say they're losing hundreds of millions by canceling trips and taking steps to fight the coronavirus.", "url": "https://www.cbsnews.com/news/coronavirus-costs-cruise-line-companies-tens-of-millions/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/12/20/2fa9d6a1-7dbe-4b0a-88b8-d6535fe3080e/thumbnail/1200x630/24be1abb181b8a4ea0af9c1faf5b51ef/cbsn-fusion-two-carnival-cruise-ships-collide-in-mexico-thumbnail-430173-640x360.jpg", "publishedAt": "2020-03-09T21:36:21Z", "content": "The coronavirus outbreak has cost U.S. cruise lines nearly $750 million since January, according to company financial reports. A State Department travel warning to Americans this past weekend could further rock their boats.\r\nShares of Carnival, Norwegian and … [+3603 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Matthew Panzarino", "title": "TechCrunch Events and coronavirus", "description": "In addition to our editorial coverage of the effects of the novel coronavirus on the business of entrepreneurship — and the ways that technology can help — we have a number of events planned for 2020 including TC Early Stage in April in San Francisco and our …", "url": "https://techcrunch.com/2020/03/09/techcrunch-events-and-coronavirus/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/o4Xi6YZMCZijvBuMejndtA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/yLU3J130OZy5dYg3U_KWZg--~B/aD0xMzY1O3c9MjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/3eb18a356d923b6aed7e6758ac6287ec", "publishedAt": "2020-03-09T21:56:05Z", "content": "We here at TechCrunch are watching the novel coronavirus situation closely, as most of you likely are. \r\nIn addition to our editorialcoverage of the effects of the novel coronavirus on the business of entrepreneurship and the ways that technology can help we … [+1768 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Bess Levin", "title": "Rep. Matt Gaetz “Quarantined Himself” While Riding Air Force One With Trump", "description": "And he’s not the only congressman to touch the president after exposure to the coronavirus.", "url": "https://www.vanityfair.com/news/2020/03/matt-gaetz-donald-trump-coronavirus", "urlToImage": "https://media.vanityfair.com/photos/5df2c1ce5ccfc00008d8bee9/16:9/w_1280,c_limit/mattgaetzjoebiden.jpg", "publishedAt": "2020-03-09T21:55:02Z", "content": "Representative Doug Collins, Republican of Georgia, who toured the Centers for Disease Control and Prevention in Atlanta with Mr. Trump on Friday, likewise went into isolation on MondayWhile I am not experiencing any symptoms, I have decided to self-quarantin… [+1233 chars]"}, {"source": {"id": null, "name": "Bradford-delong.com"}, "author": "J. Bradford DeLong", "title": null, "description": "**Max Roser and Hannah Ritchie**: _Coronavirus Disease (COVID-19)_ : \"What we want to know is the total number of COVID-19 cases.... What we do know: the doubling time of known cases. The WHO is publishing daily Situation Reports (here) which list the number …", "url": "https://www.bradford-delong.com/2020/03/max-roser-and-hannah-ritchie-_coronavirus-disease-covid-19_-what-we-want-to-know-is-the-total-number-of-covid-19-ca.html", "urlToImage": null, "publishedAt": "2020-03-09T21:36:25Z", "content": "Max Roser and Hannah Ritchie: Coronavirus Disease (COVID-19)https://ourworldindata.org/coronavirus#what-do-we-know-about-the-mortality-risk-of-covid-19: \"What we want to know is the total number of COVID-19 cases.... What we do know: the doubling time of know… [+283 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Passengers sue over coronavirus-hit Grand Princess cruise ship", "description": "A Florida couple who were passengers on the Grand Princess ocean liner linked to the coronavirus outbreak have sued the ship's owner for more than $1 million for putting the couple's health at risk, according to a lawsuit filed on Monday.  Ronald and Eva Weis…", "url": "https://finance.yahoo.com/news/passengers-sue-over-coronavirus-hit-215411908.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-09T21:54:11Z", "content": "March 9 (Reuters) - A Florida couple who were passengers on the Grand Princess ocean liner linked to the coronavirus outbreak have sued the ship's owner for more than $1 million for putting the couple's health at risk, according to a lawsuit filed on Monday.\r… [+642 chars]"}, {"source": {"id": null, "name": "Complex.com"}, "author": "Joe Price", "title": "Trump Allegedly Told Aides He's Afraid of Journalists Purposefully Giving Him Coronavirus", "description": "Concerns over the COVID-19 coronavirus have reportedly gotten the best of Donald Trump.", "url": "https://www.complex.com/life/2020/03/donald-trump-allegedly-scared-of-journalists-giving-him-coronavirus", "urlToImage": "https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1/pb0eswa884phspxt6jsu/trump-pointing-at-a-toy-he-wants", "publishedAt": "2020-03-09T21:26:22Z", "content": "Concerns over the COVID-19 coronavirus have reportedly gotten the best of Donald Trump, and the president apparently told his aides he's afraid of a journalist giving him the Wuhan-originated virus on purpose. A former West Wing official told Vanity Fair Trum… [+2805 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Tamar Lapin", "title": "Italy’s coronavirus lockdown extended to entire country", "description": "Italy’s prime minister on Monday extended the coronavirus lockdown to the entire country in an effort to curb the spread of the outbreak. All people in Italy will now only be allowed to travel outside the areas where they live if they demonstrate a need tied …", "url": "https://nypost.com/2020/03/09/italys-coronavirus-lockdown-extended-to-entire-country/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/italycoronavirus-quarantine17.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-09T21:41:04Z", "content": "Italys prime minister on Monday extended the coronavirus lockdown to the entire country in an effort to curb the spread of the outbreak.\r\nAll people in Italy will now only be allowed to travel outside the areas where they live if they demonstrate a need tied … [+213 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "christina capatides", "title": "Rumors on social media say cocaine and bleach can cure coronavirus – they can't", "description": "Millions of tweets and Facebook posts are peddling fake coronavirus cures. Don't believe them.", "url": "https://www.cbsnews.com/news/coronavirus-drinking-bleach-cocaine-false-rumors-social-media/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/09/cd63d324-9126-4a66-aaeb-923d66c0d8fa/thumbnail/1200x630/86045edff9f92c5aa6a17a8aab688e9b/gettyimages-137954859.jpg", "publishedAt": "2020-03-09T21:27:00Z", "content": "In the wake of Russia's meddling in the 2016 election, Facebook and Twitter have been forced to respond to the proliferation of fake news on their platforms. And while many probably assume the bulk of that misinformation is political in focus, trolls and bots… [+6209 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "4,300 coronavirus tests conducted nationwide", "description": "After a shortage of testing kits, the administration has rolled out 1.4 million coronavirus tests. Robinson Meyer, staff writer for The Atlantic, on the shortage of tests and the state of testing across the country.", "url": "https://www.msnbc.com/mtp-daily/watch/4-300-coronavirus-tests-conducted-nationwide-80360517665", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_meyerontest_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-09T21:52:12Z", "content": null}, {"source": {"id": null, "name": "Fox40.com"}, "author": "Associated Press", "title": "Amid virus crisis, officials announce health care tech rules - FOX40", "description": "WASHINGTON (AP) — With coronavirus topping Americans’ concerns, senior Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering o…", "url": "https://fox40.com/news/business/amid-virus-crisis-officials-announce-health-care-tech-rules/", "urlToImage": "https://fox40.com/wp-content/uploads/sites/13/2020/03/AP20069566427099.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-03-09T21:51:00Z", "content": "WASHINGTON (AP) With coronavirus topping Americans’ concerns, senior Trump administration officials tried to switch subjects Monday by announcing final rules aimed at delivering on the unfulfilled promise of electronic health records.\r\nIt did not go smoothly … [+4492 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Saudi Arabia detects another five cases of new coronavirus: state TV", "description": "Saudi Arabia's health ministry said on Monday it has detected five new cases of the new coronavirus, state TV reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-saudi-cases-idUSKBN20W2Z1", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500966628&w=1200&r=LYNXMPEG281XW", "publishedAt": "2020-03-09T21:27:02Z", "content": "CAIRO (Reuters) - Saudi Arabia’s health ministry said on Monday it has detected five new cases of the new coronavirus, state TV reported. \r\nFour Saudi citizens were diagnosed with the disease, three of whom had arrived from Iran and Iraq. The fifth case is of… [+206 chars]"}, {"source": {"id": null, "name": "Spin.com"}, "author": "SPIN Staff", "title": "KISS Temporarily Cancel Meet-and-Greets Due to Coronavirus", "description": "KISS have always been one of the most accessible bands (for a price, of course) when it comes to meeting their fans. However, the coronavirus has changed that. The band has indefinitely canceled all upcoming meet-and-greets with fans on account of the fast-sp…", "url": "https://www.spin.com/2020/03/kiss-cancel-meet-and-greets-due-to-coronavirus/", "urlToImage": "https://s3-us-west-1.amazonaws.com/static-spin-com/files/2017/08/GettyImages-147831651-1501612340-compressed.jpg", "publishedAt": "2020-03-09T21:26:41Z", "content": "KISS have always been one of the most accessible bands (for a price, of course) when it comes to meeting their fans. However, the coronavirus has changed that.\r\nThe band has indefinitely canceled all upcoming meet-and-greets with fans on account of the fast-s… [+911 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Experts would like to remind you that garlic, drinkable silver, magic Youtube minerals, hot water, and vodak are not effective Coronavirus cures [PSA]", "description": "Experts would like to remind you that garlic, drinkable silver, magic Youtube minerals, hot water, and vodak are not effective Coronavirus cures", "url": "https://www.fark.com/comments/10737908/Experts-would-like-to-remind-you-that-garlic-drinkable-silver-magic-Youtube-minerals-hot-water-vodak-are-not-effective-Coronavirus-cures", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/b/bX/fark_bXRfA_hHGMKD1oTmEqCea_b_0ZA.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1584331200&Signature=p7oC5ksxBnW%2F0MrRqhGu6jUGGpo%3D", "publishedAt": "2020-03-09T21:17:04Z", "content": "revrendjim:You can make your own hand sanitizer with vodka. 2 parts vodka to 1 part aloe gel. I bought a bottle of vodka for $7. It's probably not fit for human consumption, but I will not run out of hand sanitizer.\r\nFrom TFA: \"Professor Sally Bloomfield, at … [+225 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Allison Crist", "title": "How Audrina Patridge, Tess Holliday & Other Celebrity Moms Are Handling the Coronavirus Outbreak", "description": "Audrina Patridge, Tess Holliday, Bekah Martinez, and Tobie Gonzalez stopped by Daily Pop on Monday to dish on different parenting topics with Heather Dubrow--one of which is certainly weighing on...", "url": "https://www.eonline.com/shows/daily_pop/news/1129475/how-audrina-patridge-tess-holliday-other-celebrity-moms-are-handling-the-coronavirus-outbreak", "urlToImage": "https://akns-images.eonline.com/eol_images/Entire_Site/202029/rs_600x600-200309150225-audrina.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90", "publishedAt": "2020-03-09T22:07:51Z", "content": "Audrina Patridge, Tess Holliday, Bekah Martinez, and Tobie Gonzalez stopped by Daily Pop on Monday to dish on different parenting topics with Heather Dubrow—one of which is certainly weighing on the minds of many moms and dads: coronavirus.\r\nIn a segment call… [+562 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Pelosi: 'No,' Capitol should not be closed due to coronavirus", "description": "Speaker Nancy Pelosi says that the Capitol should not be closed due to the coronavirus.", "url": "https://www.msnbc.com/mtp-daily/watch/pelosi-no-capitol-should-not-be-closed-due-to-coronavirus-80358981755", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_mtpd_clip_coronaviruscongress_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-09T21:25:06Z", "content": null}, {"source": {"id": null, "name": "Dailysignal.com"}, "author": "Fred Lucas", "title": "Trump Administration Aims to Calm Coronavirus Fears on Economic, Health Fronts", "description": "The Trump administration is tackling coronavirus on both the public health and economic fronts, Health and Human Services Secretary Alex Azar says. “President Trump has... Read More The post Trump Administration Aims to Calm Coronavirus Fears on Economic, Hea…", "url": "https://www.dailysignal.com/2020/03/09/trump-administration-aims-to-calm-coronavirus-fears-on-economic-health-fronts/", "urlToImage": "https://www.dailysignal.com/wp-content/uploads/Mask-CV.jpg", "publishedAt": "2020-03-09T21:54:19Z", "content": "The Trump administration is tackling coronavirus on both the public health and economic fronts, Health and Human Services Secretary Alex Azar says. \r\nPresident Trump has delivered a historically strong economy, Azar told reporters Monday at the White House. T… [+2457 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tanzeel Akhtar", "title": "Elon Musk Says Market Was Too High, Due For A Correction", "description": "Tesla Inc. (NASDAQ: TSLA) CEO Elon Musk thinks the stock market was a bit too high.Earlier, trading was halted right after Monday's opening bell on U.S. exchanges with the S&P falling 7%, triggering the automatic circuit breaker stoppage. The Dow Jones Indust…", "url": "https://finance.yahoo.com/news/elon-musk-says-market-too-213248577.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-09T21:32:48Z", "content": "Tesla Inc. (NASDAQ: TSLA) CEO Elon Musk thinks the stock market was a bit too high.\r\nEarlier, trading was halted right after Monday's opening bell on U.S. exchanges with the S&amp;P falling 7%, triggering the automatic circuit breaker stoppage. The Dow Jones … [+1175 chars]"}, {"source": {"id": null, "name": "Gurufocus.com"}, "author": null, "title": "4 High-Quality Tech Companies as Coronavirus Fears Smash Markets Worldwide - GuruFocus.com", "description": "4 High-Quality Tech Companies as Coronavirus Fears Smash Markets Worldwide, Stocks: INTC,AAPL,BRK.A,BRK.B,TPE:2428,ROCO:3611,TSE:3848, Warren Buffett, Ken Fisher, PRIMECAP Management, release date:Mar 09, 2020", "url": "https://www.gurufocus.com/news/1068628/4-highquality-tech-companies-as-coronavirus-fears-smash-markets-worldwide", "urlToImage": "https://gurufocus.s3.amazonaws.com/photos/gurus/guru_logo_square.jpg", "publishedAt": "2020-03-09T22:08:24Z", "content": "As coronavirus fears continue rattling markets worldwide, four high-qualitytechnology companies from the U.S. and Asian markets that are trading below the Peter Lynch earnings line are Intel Corp. (NASDAQ:INTC), Thinking Electronic Industrial Co. Ltd. (TPE:24… [+4748 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: Iran Has Far More Coronavirus Cases Than It Is Letting On: The surprising numb…", "description": "CORONAVIRUS UPDATE: Iran Has Far More Coronavirus Cases Than It Is Letting On: The surprising number of Iranian government officials succumbing to COVID-19 offers a hint that the disease is far more widespread than the official statistics indicate. That’s pro…", "url": "https://pjmedia.com/instapundit/360854/", "urlToImage": null, "publishedAt": "2020-03-09T21:59:17Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo Sports", "title": "NBA and MLB join NHL in closing locker rooms to media amid coronavirus fears", "description": "The effects of the coronavirus have been felt across the sports world.", "url": "https://sports.yahoo.com/nba-coronavirus-locker-rooms-media-nhl-220447727.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/WTpZuIfQTi1m79IZCyu0mA--~B/aD0zNDU2O3c9NTIyNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/cdd62d20-6251-11ea-9efd-70361b51e6c2", "publishedAt": "2020-03-09T22:04:47Z", "content": "The National Basketball Association and Major League Baseball are making a major change in response to fears of the recent coronavirus outbreak.\r\nThe NBA plans to close off locker room access to all but players and essential team personnel, according to ESPNs… [+2159 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "21st CENTURY RELATIONSHIPS: Should I Pause My Open Marriage Because of the Coronavirus?…", "description": "21st CENTURY RELATIONSHIPS: Should I Pause My Open Marriage Because of the Coronavirus?", "url": "https://pjmedia.com/instapundit/360858/", "urlToImage": null, "publishedAt": "2020-03-09T21:52:59Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Hyperallergic.com"}, "author": "Valentina Di Liscia", "title": "A Daily Report on How COVID-19 Is Affecting the Art World", "description": "As international governments take increased precautions to limit the spread of the coronavirus, museums, fairs, and festivals are facing closures and delays.", "url": "http://hyperallergic.com/546913/coronavirus-daily-report/", "urlToImage": "https://hyperallergic.com/wp-content/uploads/2020/03/Raphael-Mask-1000.jpg", "publishedAt": "2020-03-09T21:52:41Z", "content": "Raphael dons a face mask (edit by Jasmine Weber for Hyperallergic)\r\nFrom museums and galleries to theaters and concert venues, it’s an unavoidable fact that some of the most moving experiences of art often involve being in crowded spaces. The novel coronaviru… [+4104 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Passengers sue over coronavirus-hit Grand Princess cruise ship", "description": "A Florida couple who were passengers on the Grand Princess ocean liner linked to the coronavirus outbreak have sued the ship's owner for more than $1 million for putting the couple's health at risk, according to a lawsuit filed on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-cruiseship-law-idUSKBN20W30T", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500976872&w=1200&r=LYNXMPEG281YL", "publishedAt": "2020-03-09T21:58:07Z", "content": "(Reuters) - A Florida couple who were passengers on the Grand Princess ocean liner linked to the coronavirus outbreak have sued the ship’s owner for more than $1 million for putting the couple’s health at risk, according to a lawsuit filed on Monday. \r\nRonald… [+646 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kate Gibson", "title": "Televangelist Jim Bakker warned about phony coronavirus cures", "description": "TV preacher called out by federal agencies for pitching products with unfounded antiviral claims.", "url": "https://www.cbsnews.com/news/televangelist-jim-bakker-among-those-warned-on-phony-coronavirus-cures/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/09/c45f2e8f-e723-4e01-8d44-4f837afdda51/thumbnail/1200x630/4ad36a1ec637b81fc71987e7aecc8726/ap-18061681803595.jpg", "publishedAt": "2020-03-09T21:13:13Z", "content": "Televangelist Jim Bakker is among those getting told to put a lid on claims his silver potions can cure the coronavirus. The Jim Bakker Show is among seven companies sent warning letters for selling unapproved products and treatments, the U.S. Federal Trade C… [+3288 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Coronavirus crisis could cost world up to $2 trillion: UN - Times of India", "description": "Coronavirus crisis could cost world up to $2 trillion: UN Times of India Coronavirus outbreak could cost global economy up to $2 trillion: UNCTAD Moneycontrol.com Coronavirus outbreak could cost global economy up to $2 trillion, says UNCTAD The Financial Expr…", "url": "https://timesofindia.indiatimes.com/business/international-business/coronavirus-crisis-could-cost-world-up-to-2-trillion-un/articleshow/74557574.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74557560,width-1070,height-580,imgsize-348958,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-09T21:34:48Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}]