[{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "He tested positive for the coronavirus. Hear how he feels now", "description": "CNN's Anderson Cooper and Dr. Sanjay Gupta speak with a man that tested positive for the novel coronavirus about his symptoms during a CNN townhall.", "url": "https://www.cnn.com/videos/health/2020/03/06/cooper-speaks-with-coronavirus-patient-town-hall-gupta-sot-ac360-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305233751-coronavirus-patient-anderson-cooper-super-tease.jpg", "publishedAt": "2020-03-06T04:41:52Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joshua Berlinger, CNN", "title": "WHO warns governments 'this is not a drill' as coronavirus infections near 100,000 worldwide", "description": "The director-general of the World Health Organization has warned governments that the continued international spread of the novel coronavirus is \"not a drill\" and will require significant action if public health authorities are to contain the deadly outbreak.", "url": "https://www.cnn.com/2020/03/06/asia/coronavirus-covid-19-update-who-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305234339-tedros-adhanom-ghebreyesus-0302-super-tease.jpg", "publishedAt": "2020-03-06T05:00:22Z", "content": "Hong Kong (CNN)The director-general of the World Health Organization has warned governments that the continued international spread of the novel coronavirus is \"not a drill\" and will require significant action if public health authorities are to contain the d… [+6675 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Amanda Yeo", "title": "'The President of the United States is undermining public health': Seth Meyers slams Trump's coronavirus response", "description": "Late Night host Seth Meyers highlighted the lacklustre U.S. response to the coronavirus outbreak on Thursday, noting that while the CDC has tested just over 1,500 people, South Korea has tested over 90 times more. The country is also using a new drive-through…", "url": "https://mashable.com/video/seth-meyers-trump-coronavirus-response-south-korea-drive-through-testing/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252F60%252F09495ec1e0f6493fb2f9f40d771482f0.17e22.png%252F1200x630.png?signature=A1R2vhXMyKS5rU5Sa9MKEpidDb0=", "publishedAt": "2020-03-06T04:18:16Z", "content": "Late Night host Seth Meyers highlighted the lacklustre U.S. response to the coronavirus outbreak on Thursday, noting that while the CDC has tested just over 1,500 people, South Korea has tested over 90 times more. The country is also using a new drive-through… [+881 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sarah Al-Arshani", "title": "Mike Pence and Jay Inslee were photographed using a handshake alternative where you bump elbows, amidst the coronavirus outbreak", "description": "Vice President Mike Pence used an alternative form of greeting in an effort to reduce the risk of catching the new coronavirus. Instead of shaking hands, Pence bumped elbows with Washington Governor Jay Inslee. Former Secretary of State Hillary Clinton dubbed…", "url": "https://www.businessinsider.com/pence-inslee-demonstrate-handshake-alternative-to-limit-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e61aba1fee23d2a977a8332?width=1200&format=jpeg", "publishedAt": "2020-03-06T05:02:03Z", "content": "Vice President Mike Pence greeted Washington Governor Jay Inslee by bumping elbows instead of a more common handshake.\r\nThe greeting is an alternative to handshaking, which could spread germs including the novel coronavirus from one person to the next. Some c… [+1276 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS New York", "title": "Coronavirus Update: 22 Confirmed Cases In New York State, Gov. Andrew Cuomo Says - CBS New York", "description": "Coronavirus Update: 22 Confirmed Cases In New York State, Gov. Andrew Cuomo Says CBS New York Cuomo: New York Coronavirus Cases Rise To 22, Will Continue To Go Up | NBC News NBC News Governor Cuomo gives briefing on Coronavirus; 11 new cases since last update…", "url": "https://newyork.cbslocal.com/2020/03/05/2-more-coronavirus-cases-confirmed-in-nyc/", "urlToImage": "https://newyork.cbslocal.com/wp-content/uploads/sites/14578484/2020/02/coronavirus.jpg?w=1024", "publishedAt": "2020-03-06T04:59:00Z", "content": "NEW YORK (CBSNewYork) — The number of confirmed coronavirus cases in New York continues to grow.There are now 22 statewide, according to Gov. Andrew Cuomo. That includes eight new cases in Westchester, each with mild or no symptoms; Two in New York City that … [+8358 chars]"}, {"source": {"id": null, "name": "Digiday.com"}, "author": "Tim Peterson", "title": "Broadcasters turn to streaming services for added coronavirus coverage", "description": "News outlets’ streaming services and digital shows enable them to cover coronavirus news as it breaks and delve deeper into issues related to the outbreak. The post Broadcasters turn to streaming services for added coronavirus coverage appeared first on Digid…", "url": "https://digiday.com/media/broadcasters-turn-streaming-services-added-coronavirus-coverage/", "urlToImage": "https://digiday.com/wp-content/uploads/2020/02/corona3.jpg", "publishedAt": "2020-03-06T05:01:44Z", "content": "As coronavirus has spread around the world, news media companies have turned to their digital video outlets, including their streaming services, as they race to keep audiences informed on the outbreak that is threatening to become a pandemic.Around 3 p.m. ET … [+5510 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": null, "title": "Family members of Kirkland nursing home residents decry response to coronavirus outbreak - Seattle Times", "description": "Family members of Kirkland nursing home residents decry response to coronavirus outbreak Seattle Times ‘It’s Pure Panic’: A Wrenching Wait at Nursing Home Where Coronavirus Took Hold The New York Times Families of Kirkland nursing home residents in quarantine…", "url": "https://www.seattletimes.com/seattle-news/times-watchdog/family-members-of-residents-at-life-care-center-of-kirkland-nursing-home-decry-response-to-coronavirus/", "urlToImage": null, "publishedAt": "2020-03-06T05:02:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Not every fever is coronavirus: Trace back your steps if you have got flu", "description": "This is the time of the year when seasonal influenza is at its peak and swine flu is also reported widely. The coming of Covid-19 — the disease caused by novel coronavirus that exhibits symptoms similar to influenza and swine flu — has made the situation more…", "url": "https://timesofindia.indiatimes.com/city/delhi/coronavirus-in-india-trace-back-your-steps-if-you-have-got-flu-symptoms/articleshow/74501771.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74502746,width-1070,height-580,imgsize-191874,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-06T05:02:16Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Adam Clark | NJ Advance Media for NJ.com", "title": "N.J. tells public schools to plan for closures, teleschooling if coronavirus outbreak worsens - NJ.com", "description": "N.J. tells public schools to plan for closures, teleschooling if coronavirus outbreak worsens NJ.com The global impact of coronavirus on education ABC News Denying children school choice endangers their safety Washington Examiner View Full Coverage on Google …", "url": "https://www.nj.com/coronavirus/2020/03/nj-approves-remote-school-days-if-coronavirus-forces-closures.html", "urlToImage": "https://www.nj.com/resizer/E-9nTBfblZS0NV6Xd2NSubNrRAI=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/DQ4C34QBC5AN5PYU5SGOU7N6IU.jpg", "publishedAt": "2020-03-06T05:05:00Z", "content": "UPDATE: N.J. private high school closes after fears students were exposed to coronavirus at N.Y. event\r\nNew Jersey advised all public schools to plan for building closures during a potential coronavirus outbreak and announced the state will count home instruc… [+2760 chars]"}, {"source": {"id": null, "name": "Digiday.com"}, "author": "Kristina Monllos", "title": "‘A big drop in demand’: Confessions of a media buyer on managing coronavirus fallout", "description": "With the long-term effects of coronavirus unknown, marketers are aiming to manage how much their brands spend on marketing. In the latest Confessions, a DTC media buyer share how he is reeling in the company's spending. The post ‘A big drop in demand’: Confes…", "url": "https://digiday.com/marketing/big-drop-demand-confessions-media-buyer-managing-coronavirus-fallout/", "urlToImage": "https://digiday.com/wp-content/uploads/2019/04/confessions_guy3.jpg", "publishedAt": "2020-03-06T05:01:33Z", "content": "The global spread of coronavirus has caused marketers to rethink how they are allocating their budgets. In the latest edition of our Confessions series, in which we trade anonymity for candor, we speak to a buyer for a direct to consumer brand (who asked for … [+6517 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "South Korea vows 'reciprocal' countermeasures to Japan's coronavirus travel limits", "description": "South Korea said on Friday it will consider countermeasures to Japan's \"unjust, unacceptable\" travel restrictions barring visitors from areas which have been hard hit by the coronavirus epidemic.", "url": "https://www.reuters.com/article/us-health-coronavirus-southkorea-japan-idUSKBN20T0F1", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T04:11:54Z", "content": "SEOUL (Reuters) - South Korea said on Friday it will consider countermeasures to Japan’s “unjust, unacceptable” travel restrictions barring visitors from areas which have been hard hit by the coronavirus epidemic. \r\nThe presidential National Security Council … [+437 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Leslie Barrie, Skift", "title": "Wellness Travel in the Time of Coronavirus", "description": "While certain wellness travel trends are on the rise, like sound therapy, they won't drive more bookings as long as the coronavirus is a threat. Wellness travel, along with the rest of the industry, will need to hold tight and hope the outbreak gets under con…", "url": "https://skift.com/2020/03/06/wellness-travel-in-the-time-of-coronavirus/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/6A5A6675-scaled-e1583332486972.jpg", "publishedAt": "2020-03-06T05:05:51Z", "content": "Right now for good reason the coronavirus is all anyone can talk about. Just walking around my neighborhood in Munich, Germany, I can feel the nervous energy, as people stockpile cans of beans and loaves of bread, and stores run out of hand soap and paper tow… [+3621 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Saahil Desai, Christian Paz", "title": "The Atlantic Politics Daily: The Strongest Evidence Yet That America Is Botching Coronavirus Testing", "description": "Just how few Americans have actually been tested for the coronavirus, despite administration promises? Plus: The moment that marked the rise of an extensive jihadist network in the United States.", "url": "https://www.theatlantic.com/politics/archive/2020/03/americans-arent-being-tested-coronavirus-scale-promised-politics-daily/607654/", "urlToImage": "https://cdn.theatlantic.com/assets/static/a/theatlantic/img/lacroix-default-thumbnail.png", "publishedAt": "2020-03-06T05:00:00Z", "content": "It’s Friday, March 6. In today’s newsletter: Our science and technology reporters confirm just how few Americans have actually been tested for the coronavirus, despite administration promises. Plus: The moment that marked the rise of an extensive jihadist net… [+4562 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Sensex crashes over 1,400 points in opening deals as coronavirus spooks investor sentiment", "description": "The S&P BSE Sensex fell as much as 1,459.52 points (3.79 per cent) to 37,011.09, while the broader Nifty 50 crashed 441.60 points (3.92 per cent) to 10,827.40 during the early deals on Friday.", "url": "https://indianexpress.com/article/business/market/sensex-crashes-over-1400-points-in-opening-deals-as-coronavirus-spooks-investor-sentiment-6301900/", "urlToImage": "https://images.indianexpress.com/2020/02/AP-indian-stock-market-bse-759.jpg?w=759", "publishedAt": "2020-03-06T04:12:41Z", "content": "People walk in front of the BSE in Mumbai, India. (Source: AP Photo)The benchmark equity indices on the BSE and National Stock Exchange (NSE) opened at their lowest levels since September 2019 on Friday tracking a sell-off in the global markets as fresh fear … [+784 chars]"}, {"source": {"id": null, "name": "Ksat.com"}, "author": null, "title": "Asian business sees customers rush in for rice amid COVID-19 outbreak - KSAT San Antonio", "description": "Some stores have placed limits on disinfecting products amid the COVID-19 coronavirus outbreak. However, one local Asian business is experiencing customers rushing in for rice.", "url": "https://www.ksat.com/news/local/2020/03/06/asian-business-sees-customers-rush-in-for-rice-amid-covid-19-outbreak/", "urlToImage": "https://www.ksat.com/resizer/lJ9Q210JlxZRO3a4erFgPPh_BoM=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/d1vhqlrjc8h82r.cloudfront.net/03-06-2020/t_4b54001db1ae477da03797881f0f3235_name_image.jpg", "publishedAt": "2020-03-06T04:23:05Z", "content": "SAN ANTONIO Some stores have placed limits on disinfecting products amid the COVID-19 coronavirus outbreak. However, one local Asian business is experiencing customers rushing in for rice.\r\nSari Sari on Wurzbach Road has seen its supply of rice leave store sh… [+709 chars]"}, {"source": {"id": null, "name": "Wbtv.com"}, "author": "Alex Giles", "title": "Businesses with ties to Charlotte implement travel restrictions amid coronavirus outbreak - WBTV", "description": "Multiple businesses with ties to the Charlotte area are implementing travel restrictions in response to the coronavirus outbreak across the world.", "url": "https://www.wbtv.com/2020/03/06/businesses-with-ties-charlotte-implement-travel-restrictions-amid-coronavirus-outbreak/", "urlToImage": "https://www.wbtv.com/resizer/mqN6H3D5tA5_Her4LblmP5ubkLc=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/SNAQW3N6MZDJ7OL45ITT3NPYII.bmp", "publishedAt": "2020-03-06T04:50:00Z", "content": "CHARLOTTE, N.C. (WBTV) - Multiple businesses with ties to the Charlotte area are implementing travel restrictions in response to the coronavirus outbreak across the world.\r\nBoth Lowes and Wells Fargo have put limitations on travel for employees. Each company … [+3785 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How China's only Costco stays safe amid coronavirus fears", "description": "As China reels from the novel coronavirus outbreak, CNN's David Culver visits China's only Costco location in Shanghai, China, and has a taste of the sterile shopping experience.", "url": "https://www.cnn.com/videos/business/2020/03/06/china-coronavirus-covid-19-shanghai-costco-shopping-culver-pkg-intl-hnk-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306115256-culver-pkg-costco-super-tease.jpg", "publishedAt": "2020-03-06T04:19:45Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Lucia Mutikani", "title": "U.S. employment report expected to show strength before coronavirus spread", "description": "U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rate cut from the Federal …", "url": "https://www.reuters.com/article/us-usa-economy-idUSKBN20T0H2", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499399396&w=1200&r=LYNXMPEG250AR", "publishedAt": "2020-03-06T05:03:14Z", "content": "WASHINGTON (Reuters) - U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rat… [+5555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Testing crunch exposes White House to fierce backlash", "description": "A political storm has erupted over confusion and shortfalls in federal coronavirus testing that are thwarting a true accounting of the disease's advance and exposing President Donald Trump's misleading claims of seamless White House crisis management.", "url": "https://www.cnn.com/2020/03/06/politics/coronavirus-mike-pence-donald-trump-politics-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305213827-03-pence-inslee-presser-super-tease.jpg", "publishedAt": "2020-03-06T05:04:05Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kelly Tyko, USA TODAY", "title": "These cleaners kill coronavirus: Lysol, Clorox, Purell products make EPA's disinfectants list", "description": "Killing coronavirus: U.S. Environmental Protection Agency has released a list of disinfectants and wipes to protect against spread of the coronavirus.", "url": "https://finance.yahoo.com/news/cleaners-kill-coronavirus-lysol-clorox-043059041.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/eWs.TTDqsNP2U5Nv3XKFbQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/rK18HXtz.XSwojJJ6SQwmw--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/88120a7a78cf68bb69b82f3462c59bd1", "publishedAt": "2020-03-06T04:30:59Z", "content": "The U.S. Environmental Protection Agency has released a list of disinfectants to protect against the spread of the coronavirus.\r\nAccording to the EPA, products on the list have \"qualified for use against COVID-19\" through the agency's Emerging Viral Pathogen … [+2593 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "National Guard delivers coronavirus test kits to cruise ship - ABC News", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=BpZ5uh-inKM", "urlToImage": null, "publishedAt": "2020-03-06T04:34:49Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bhavya Dilipkumar and Rakhi Mazumdar", "title": "Domestic steel may come under pricing pressure", "description": "ICRA has revised its estimate of domestic steel consumption growth to 4-5 per cent in 2020-21.", "url": "https://economictimes.indiatimes.com/markets/commodities/news/domestic-steel-producers-may-come-under-pricing-pressure/articleshow/74504573.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74504567,width-1070,height-580,imgsize-374766,overlay-etmarkets/photo.jpg", "publishedAt": "2020-03-06T04:28:16Z", "content": "Mumbai | Kolkata: The novel coronavirus outbreak is likely to put pressure on domestic steel prices in the near term and increase downside risks for the sector due to a drastic supply-demand imbalance causing an inventory pileup, two reports released on Thurs… [+3145 chars]"}, {"source": {"id": null, "name": "Ma.tt"}, "author": "Matt", "title": "Coronavirus and the Remote Work Experiment No One Asked For", "description": "“We’ll never probably be the same. People who were reticent to work remotely will find that they really thrive that way. Managers who didn’t think they could manage teams that were remote will have a different perspective. I do think we won’t go back.” Jennif…", "url": "https://ma.tt/2020/03/coronavirus-remote-work/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-03-06T04:35:49Z", "content": "Well never probably be the same. People who were reticent to work remotely will find that they really thrive that way. Managers who didnt think they could manage teams that were remote will have a different perspective. I do think we wont go back.\r\nJennifer C… [+3748 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Here's a list of disinfectants you can use against coronavirus via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_a0f70bba7c50385a3ddb58bedeaf3927", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T05:10:12Z", "content": "Golden State Warriors, Stephen Curry, Toronto Raptors, NBA\r\nCurry was looking to facilitate early on, then got his shot going in his second stint of playing time."}, {"source": {"id": null, "name": "Askamanager.org"}, "author": "Ask a Manager", "title": "addressing feedback from an anonymous survey, coronavirus shaming, and more", "description": "It’s five answers to five questions. Here we go… 1. Can employers reject candidates because clients might be biased against them? With Senator Warren dropping out of the Democratic primary, I’ve been having some debates about the “electability” issue, and whe…", "url": "https://www.askamanager.org/2020/03/addressing-feedback-from-an-anonymous-survey-coronavirus-shaming-and-more.html", "urlToImage": "https://www.askamanager.org/wp-content/uploads/2014/04/bannersmfb.png", "publishedAt": "2020-03-06T05:03:36Z", "content": "Its five answers to five questions. Here we go\r\n1. Can employers reject candidates because clients might be biased against them?\r\nWith Senator Warren dropping out of the Democratic primary, I’ve been having some debates about the “electability” issue, and whe… [+9029 chars]"}, {"source": {"id": null, "name": "Adexchanger.com"}, "author": "AdExchanger", "title": "Coronavirus Dents Travel Advertising; Olympics In The Balance", "description": "Here’s today’s AdExchanger.com news round-up… Want it by email? Sign up here. Hang On St. Christopher Google’s travel advertising business (along with the travel marketing vertical in general) could be severely disrupted by the impacts of COVID-19, the diseas…", "url": "http://www.adexchanger.com/ad-exchange-news/friday-06032020/", "urlToImage": null, "publishedAt": "2020-03-06T05:03:22Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Debasis Saha", "title": "Hedge Funds Started Selling Global Payments Inc (GPN) Even Before Coronavirus", "description": "Coronavirus is probably the 1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). In…", "url": "https://finance.yahoo.com/news/hedge-funds-started-selling-global-041355900.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rOKMi8gQGY32esCtT0twiw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuMjEzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eywElp6fcvOcureCeu3EFA--~B/aD00MjI7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/insidermonkey.com/39b6c722038df9eb5cafa1eb0a91bffd", "publishedAt": "2020-03-06T04:13:55Z", "content": "Coronavirus is probably the #1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). I… [+6383 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Debasis Saha", "title": "Hedge Funds Started Selling Danaher Corporation (DHR) Even Before Coronavirus", "description": "Coronavirus is probably the 1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). In…", "url": "https://finance.yahoo.com/news/hedge-funds-started-selling-danaher-041846584.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rOKMi8gQGY32esCtT0twiw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuMjEzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eywElp6fcvOcureCeu3EFA--~B/aD00MjI7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/insidermonkey.com/39b6c722038df9eb5cafa1eb0a91bffd", "publishedAt": "2020-03-06T04:18:46Z", "content": "Coronavirus is probably the #1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). I… [+6096 chars]"}, {"source": {"id": null, "name": "Houstonchronicle.com"}, "author": "Todd Ackerman, Julian Gill", "title": "Officials confirm four cases of coronavirus in Harris County - Houston Chronicle", "description": "Officials confirm four cases of coronavirus in Harris County Houston Chronicle Coronavirus arrives in Harris County: First 2 cases confirmed montgomerycountypolicereporter.com WATCH LIVE KHOU 11 2 new presumptive positive coronavirus cases confirmed in Housto…", "url": "https://www.houstonchronicle.com/news/houston-texas/houston/article/Officials-confirm-four-cases-of-coronavirus-in-15109743.php", "urlToImage": "https://s.hdnux.com/photos/01/10/77/53/19135197/3/rawImage.jpg", "publishedAt": "2020-03-06T04:30:00Z", "content": "Local health officials Thursday confirmed four more cases of the new coronavirus, all in Harris County, as the feared disease began taking hold in the Houston area.\r\nThe new cases involved four people in their 60s who were exposed to the virus during a trip t… [+7245 chars]"}, {"source": {"id": null, "name": "Click2houston.com"}, "author": "Tulsi Kamath", "title": "TIMELINE: Here’s how the coronavirus made it to the Houston area - KPRC Click2Houston", "description": "TIMELINE: Here’s how the coronavirus made it to the Houston area KPRC Click2Houston 2 new presumptive positive coronavirus cases confirmed in Houston area, bringing total to 5 KPRC Click2Houston Coronavirus arrives in Harris County: First 2 cases confirmed mo…", "url": "https://www.click2houston.com/health/2020/03/06/timeline-heres-how-the-coronavirus-made-it-to-the-houston-area/", "urlToImage": "https://www.click2houston.com/resizer/E6N6SSqSM_kU7kKFZ8xpOSW2jUY=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/HFLYYFXSX5FYXC7JILYSPS2E3A.jpg", "publishedAt": "2020-03-06T04:25:09Z", "content": "HOUSTON In the last couple of days, multiple people were announced to have coronavirus in the greater Houston area: \r\n<ul><li>Two cases in Harris County were confirmed Thursday by Harris County officials</li><li>Three presumptive positive cases were announced… [+1733 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Gareth Hutchens And Nassim Khadem", "title": "What can the Government do to try and head off a coronavirus recession?", "description": "As coronavirus continues to spread globally, the form of the Morrison Government's economic stimulus package is beginning to take shape.", "url": "https://www.abc.net.au/news/2020-03-06/stimulus-australia-government-coronavirus-recession-tourism-cash/12032944", "urlToImage": "https://www.abc.net.au/news/image/11893820-16x9-700x394.jpg", "publishedAt": "2020-03-06T05:11:30Z", "content": "Posted \r\nMarch 06, 2020 16:11:30\r\nAs coronavirus continues to spread globally, the form of the Morrison Government's economic stimulus package is beginning to take shape.\r\nKey points:\r\n<ul><li>Economists say some individuals, particularly pensioners and the u… [+8433 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Family members of Kirkland nursing home residents decry response to coronavirus outbreak - Seattle Times", "description": "Family members of Kirkland nursing home residents decry response to coronavirus outbreak Seattle Times ‘It’s Pure Panic’: A Wrenching Wait at Nursing Home Where Coronavirus Took Hold The New York Times 'The disease is running rampant': Families at center of v…", "url": "https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL3NlYXR0bGUtbmV3cy90aW1lcy13YXRjaGRvZy9mYW1pbHktbWVtYmVycy1vZi1yZXNpZGVudHMtYXQtbGlmZS1jYXJlLWNlbnRlci1vZi1raXJrbGFuZC1udXJzaW5nLWhvbWUtZGVjcnktcmVzcG9uc2UtdG8tY29yb25hdmlydXMv0gGmAWh0dHBzOi8vd3d3LnNlYXR0bGV0aW1lcy5jb20vc2VhdHRsZS1uZXdzL3RpbWVzLXdhdGNoZG9nL2ZhbWlseS1tZW1iZXJzLW9mLXJlc2lkZW50cy1hdC1saWZlLWNhcmUtY2VudGVyLW9mLWtpcmtsYW5kLW51cnNpbmctaG9tZS1kZWNyeS1yZXNwb25zZS10by1jb3JvbmF2aXJ1cy8_YW1wPTE?oc=5", "urlToImage": null, "publishedAt": "2020-03-06T05:02:00Z", "content": null}, {"source": {"id": null, "name": "Arnnet.com.au"}, "author": null, "title": "The major tech events affected by the spread of coronavirus - ARNnet", "description": "COVID-19, otherwise known as novel coronavirus, has affected many technology events around the world, causing cancellation, rescheduling and virtualisation. Here’s a list of all the events that have been impacted so far this year.", "url": "https://www.arnnet.com.au/article/671613/major-tech-events-affected-by-spread-coronavirus/", "urlToImage": "https://d2bs8hqp6qvsw6.cloudfront.net/article/images/800x800/dimg/dreamstime_s_171081916.jpg", "publishedAt": "2020-03-06T04:24:00Z", "content": "COVID-19, otherwise known as novel coronavirus, has affected many technology events around the world, causing cancellation, rescheduling and virtualisation. Heres a list of all the events that have been impacted so far this year\r\nCOVID-19 concerns push Ingram… [+2699 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "WLS – Chicago", "title": "Coronavirus update: RUSH University Medical Center treating 5th COVID-19 case confirmed in Illinois; Cook County man in isolation", "description": "Illinois health officials have announced Thursday that a fifth resident has tested positive for the novel coronavirus.", "url": "https://news.yahoo.com/prepare-coronavirus-outbreak-183440291.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5rIApFSjXqZLWMvPzkxP0w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/GK.z08a6LiHqQoBGbE3CmQ--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e6147299947850cd2ed889c/5e61da8102816b02378163ed_o_U_v6.jpg", "publishedAt": "2020-03-06T04:57:43Z", "content": "Illinois health officials have announced Thursday that a fifth resident has tested positive for the novel coronavirus."}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "Coronavirus: Bhutan confirms first case, 8 Indian tourists with suspected symptoms admitted in hospital - Livemint", "description": "Coronavirus: Bhutan confirms first case, 8 Indian tourists with suspected symptoms admitted in hospital Livemint Bhutan confirms first coronavirus case Hindustan Times Bhutan Reports First Case Of Coronavirus NDTV News Bhutan Reports First Coronavirus Case – …", "url": "https://www.livemint.com/news/india/coronavirus-bhutan-confirms-first-case-8-indian-tourists-with-suspected-symptoms-admitted-in-hospital-11583467157679.html", "urlToImage": "https://images.livemint.com/img/2020/03/06/600x338/AFP_1OM9E9_1583468037475_1583468049967.jpg", "publishedAt": "2020-03-06T04:17:36Z", "content": "Thimphu: Bhutan on Friday confirmed the first case of coronavirus in the country.The patient is a 76-year-old from the United States who have a travel history to India. He had come to Bhutan on March 2 from Guwahati, Prime Minister Lotay Tshering office confi… [+1543 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "Ed Hardy", "title": "WWDC at risk as California authorities call for cancellation of events", "description": "The Public Health Department of Santa Clara County, where Apple’s headquarters is located, today recommended postponing or canceling mass gatherings to prevent the further spread of the new coronavirus. That calls into question whether Apple will hold its Wor…", "url": "https://www.cultofmac.com/689967/wwdc-california-authorities-cancellation-events-coronavirus/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2020/03/C27C888F-D044-4BB6-B113-6B684E0E2B60.jpeg", "publishedAt": "2020-03-06T05:09:51Z", "content": "The Public Health Department of Santa Clara County, where Apples headquarters is located, today recommended postponing or canceling mass gatherings to prevent the further spread of the new coronavirus. That calls into question whether Apple will hold its Worl… [+1758 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "US announces $8.3bn in coronavirus funding as cases surge - Hindustan Times", "description": "US announces $8.3bn in coronavirus funding as cases surge Hindustan Times Coronavirus: White House concedes US lacks enough test kits BBC News \"Haven't Touched My Face In Weeks\": Trump On Coronavirus Precautions NDTV News Confused about the Trump administrati…", "url": "https://www.hindustantimes.com/world-news/us-announces-8-3bn-in-coronavirus-funding-as-cases-surge/story-3ap6amFLVDeVsdbkDOeFNL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/06/Pictures/facility-confirmed-ambulance-transfer-coronavirus-kirkland-kirkland_92f3a5c8-5f65-11ea-be04-6cf974e2d9f7.jpg", "publishedAt": "2020-03-06T04:50:13Z", "content": "US lawmakers passed an emergency USD 8.3 billion spending bill to combat the coronavirus on Thursday as the number of cases surged in the country’s northwest and deaths reached 12.\r\nThe Senate gave sweeping bipartisan support to the funding one day after the … [+4084 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nathan Bomey, USA TODAY", "title": "Coronavirus spurs fears of drug shortages as outbreak disrupts the medicine supply chain", "description": "The coronavirus outbreak is sparking fears of drug shortages in the U.S. due to the impact it’s having on the pharmaceutical supply chain.", "url": "https://finance.yahoo.com/news/coronavirus-spurs-fears-drug-shortages-050102207.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/S7OtwUkPQYSTQtH_hjTyFQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/9MpZ430pw78.OUP3f.7_8A--~B/aD0zMzg0O3c9NTA3NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/cdfb14a3d7b6187df33e41b0ef4dd8a9", "publishedAt": "2020-03-06T05:01:02Z", "content": "The coronavirus outbreak is sparking fears of drug shortages in the U.S., largely due to its disruption of pharmaceutical supplies from China and India. \r\nThe Food and Drug Administration has warned of shortages in one drug due to the coronavirus, while penic… [+4414 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Tegan Taylor", "title": "Two strains of coronavirus emerge — and you can get both at once, study suggests", "description": "The new coronavirus has two distinct strains — and it is possible to be infected with both at the same time, according to a new research paper.", "url": "https://www.abc.net.au/news/health/2020-03-06/coronavirus-two-strains-infection-study/12023822", "urlToImage": "https://www.abc.net.au/cm/rimage/12018760-16x9-large.jpg?v=2", "publishedAt": "2020-03-06T05:09:05Z", "content": "The new coronavirus has two distinct strains and it is possible to be infected with both at the same time, a new research paper says.\r\nThe study by 12 researchers in China, which has been accepted by the National Science Review, looked at 103 genomes of SARS-… [+2129 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Hyonhee Shin", "title": "South Korea protests Japanese travel curbs as coronavirus ignites diplomatic row", "description": "South Korea issued a strongly worded protest on Friday against Japan's decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations.", "url": "https://www.reuters.com/article/us-health-coronavirus-southkorea-idUSKBN20T03O", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499385700&w=1200&r=LYNXMPEG2509G", "publishedAt": "2020-03-06T04:15:27Z", "content": "SEOUL (Reuters) - South Korea issued a strongly worded protest on Friday against Japan’s decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations. \r\nJapan joined t… [+2718 chars]"}, {"source": {"id": null, "name": "Lesswrong.com"}, "author": "Elizabeth", "title": "How did the Coronavirus Justified Practical Advice Thread Change Your Behavior, if at All?", "description": "The point of the CJPA thread\n[https://www.lesswrong.com/posts/LwcKYR8bykM6vDHyo/coronavirus-justified-practical-advice-thread] \nwas for people to get information that changed their behavior in positive ways.\nIt's a little soon to measure the infection rate an…", "url": "https://www.lesswrong.com/posts/B6e2reZPPY7Wbktty/how-did-the-coronavirus-justified-practical-advice-thread", "urlToImage": "https://res.cloudinary.com/lesswrong-2-0/image/upload/v1503704344/sequencesgrid/h6vrwdypijqgsop7xwa0.jpg", "publishedAt": "2020-03-06T04:15:26Z", "content": "The point of the CJPA thread was for people to get information that changed their behavior in positive ways. It's a little soon to measure the infection rate and we'll never get an RCT of people who read the thread vs. didn't, but I'd at least like to find ou… [+336 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "TN Sports Desk", "title": "IPL 2020 'on' with necessary precautions against coronavirus: BCCI president Sourav Ganguly - Times Now", "description": "IPL 2020 'on' with necessary precautions against coronavirus: BCCI president Sourav Ganguly Times Now Coronavirus outbreak live updates: Delhi resident tests positive; total cases in India rise to 31 Times of India IPL 2020 is On, BCCI to Take All Protection …", "url": "https://www.timesnownews.com/sports/cricket/article/ipl-2020-on-with-necessary-precautions-against-coronavirus-bcci-president-sourav-ganguly/561623", "urlToImage": "https://imgk.timesnownews.com/story/Ganguly-Dhoni-Kohli-Insta-AP.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-03-06T04:18:38Z", "content": "<ul><li>Several sporting events across the globe have been postoponed/canelled due to coronavirus outbreak</li><li>Doubts over the IPL 2020 have also been raised by there have been no talks of a postponement or cancellation of the event</li><li>BCCI president… [+3182 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "The 7 strains of coronavirus and unknowns of Covid-19 - Hindustan Times", "description": "The 7 strains of coronavirus and unknowns of Covid-19 Hindustan Times What doctors treating Covid-19 in Wuhan say about coronavirus Times of India China Reports 30 More Coronavirus Deaths, Rise In New Infections NDTV News China’s high-tech battle against COVI…", "url": "https://www.hindustantimes.com/india-news/the-7-strains-of-coronavirus-and-unknowns-of-covid-19/story-mmlppmKUOFgFzSr7Yl9wDP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/06/Pictures/against-solution-coronavirus-sanitize-equipment-service-seattle_2709a48c-5f67-11ea-ab89-cb4d4e6220f6.jpg", "publishedAt": "2020-03-06T05:04:53Z", "content": "Though the number of coronavirus cases around the world has closed in on the 100,000 mark, and total deaths have crossed 3,300, the behaviour of the Sars-CoV2 virus that causes the Covid-19 disease is yet to be revealed.\r\nScientists have identified seven stra… [+1791 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Lawrence White, Pamela Barbaglia and Karin Strohecker", "title": "HSBC sends home 100 London staff, confirms China coronavirus case", "description": "LONDON/MILAN/HONG KONG (Reuters) - HSBC Holdings PLC has sent home more than 100 staff in London after a worker tested positive for the coronavirus, the first known case at a major company in Europe's main financial hub. The bank also has an employee in China…", "url": "https://finance.yahoo.com/news/hsbc-sends-home-100-london-042655209.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/p6tTDWlwa9GqvEPcwfZI2A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/djafT1zonb1xSOAj6LEJdQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/7cc4138311b1d3d209bb5a82af3cb6b4", "publishedAt": "2020-03-06T04:26:55Z", "content": "By Lawrence White, Pamela Barbaglia and Karin Strohecker\r\nLONDON/MILAN/HONG KONG (Reuters) - HSBC Holdings PLC has sent home more than 100 staff in London after a worker tested positive for the coronavirus, the first known case at a major company in Europe's … [+4315 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Daniel Leussink", "title": "Japan's households tighten wallets as coronavirus empties streets", "description": "Japanese homes extended their frugal spell for a fourth straight month in January as an earlier sales tax hike and a warmer winter kept wallets shut, adding to headaches for firms as they struggle with the growing hit to business from the coronavirus. Househo…", "url": "https://finance.yahoo.com/news/japans-households-tighten-wallets-coronavirus-042603841.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/I0M3cvsez8jtd5YIusI5_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzguNA--/https://s.yimg.com/uu/api/res/1.2/wugSCprE3KbPy6G7YaCXxg--~B/aD01MjQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/00f95c2c6f28329f8551fb322e5c0346", "publishedAt": "2020-03-06T04:26:03Z", "content": "By Daniel Leussink\r\nTOKYO (Reuters) - Japanese homes extended their frugal spell for a fourth straight month in January as an earlier sales tax hike and a warmer winter kept wallets shut, adding to headaches for firms as they struggle with the growing hit to … [+3677 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Daniel Leussink and Makiko Yamazaki", "title": "Coronavirus crisis threatens to silence Japan's tourist boom", "description": "The restaurants at the Exitmelsa shopping centre in Tokyo's upscale Ginza district are usually packed with Chinese tourists. For Japanese who have grown dependent on Chinese tourists for business, like waiter Kiyotake Watanabe, it marks a disconcerting trend.…", "url": "https://news.yahoo.com/coronavirus-crisis-threatens-silence-japans-042620855.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/OZaBlc6tbB1YvLXkifEIQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDIuNA--/https://s.yimg.com/uu/api/res/1.2/MxpKUKw.g0WMR3eI8l.YuQ--~B/aD01NjQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/8d1e8d725c5398aaabc6acef4087fe18", "publishedAt": "2020-03-06T04:26:20Z", "content": "By Daniel Leussink and Makiko Yamazaki\r\nTOKYO (Reuters) - The restaurants at the Exitmelsa shopping centre in Tokyo's upscale Ginza district are usually packed with Chinese tourists. But on a recent weekday, many lunchtime tables were empty, a sign of the tol… [+4846 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Lucia Mutikani", "title": "U.S. employment report expected to show strength before coronavirus spread", "description": "U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rate cut from the Federal …", "url": "https://news.yahoo.com/u-employment-report-expected-show-050314291.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MbiWNdzTqZv.hbcrGmZrwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/ZgDrlG8nuEhdkzJI28L9MQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/b7c072426127bd362bde3fd2b291070d", "publishedAt": "2020-03-06T05:03:14Z", "content": "By Lucia Mutikani\r\nWASHINGTON (Reuters) - U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an eme… [+5559 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Lucia Mutikani", "title": "U.S. employment report expected to show strength before coronavirus spread", "description": "U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rate cut from the Federal …", "url": "https://finance.yahoo.com/news/u-employment-report-expected-show-050314808.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ai_f0KJpcx66BxOhGpvNQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/gT8tpCVqffawmxEnzN4LsA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/d2e305319e8370bd95368e325ec10549", "publishedAt": "2020-03-06T05:03:14Z", "content": "By Lucia Mutikani\r\nWASHINGTON (Reuters) - U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an eme… [+5559 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Coronavirus fears are tanking markets. That has Trump worried.", "description": "The economy and numbers on Wall Street have been the backbone of Trump's re-election argument. But coronavirus fears are talking markets worldwide, and that reportedly has Trump concerned.", "url": "https://www.msnbc.com/11th-hour/watch/coronavirus-fears-are-tanking-markets-that-has-trump-worried-80119365615", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_bwms_mkts_200305_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T04:50:29Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "HSBC sends home 100 London staff, confirms China coronavirus case", "description": "The bank also has an employee in China with the virus who is in a stable condition, interim Chief Executive Noel Quinn said in an internal memo.", "url": "https://www.moneycontrol.com/news/world/hsbc-sends-home-100-london-staff-confirms-china-coronavirus-case-5008791.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/HSBC-770x433.jpg", "publishedAt": "2020-03-06T04:55:02Z", "content": "HSBC Holdings PLC has sent home more than 100 staff in London after a worker tested positive for the coronavirus, the first known case at a major company in Europe's main financial hub.\r\nThe bank also has an employee in China with the virus who is in a stable… [+4036 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus could cut global growth by 0.1% to 0.4%: ADB", "description": "More than 3,200 people worldwide have died from the respiratory illness that can lead to pneumonia, hurting financial markets and damaging economies.", "url": "https://www.moneycontrol.com/news/world-news/coronavirus-could-cut-global-growth-by-01-to-04-adb_13557421.html", "urlToImage": null, "publishedAt": "2020-03-06T04:12:02Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump only engaged on coronavirus when it became a political crisis", "description": "Trump only really engaged on the coronavirus response - not when it became a public health crisis - but when it became a political crisis. We discuss with Ashley Parker and Jonathan Lemire.", "url": "https://www.msnbc.com/11th-hour/watch/trump-only-engaged-on-coronavirus-when-it-became-a-political-crisis-80116805920", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_bwms_trump_200305_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T04:20:07Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "China#39;s coronavirus death toll touches 3,042; confirmed cases rise to 80,552", "description": "China#39;s National Health Commission (NHC) said that it received reports of 143 new confirmed cases of coronavirus infection and 30 deaths on March 5 on the Chinese mainland.", "url": "https://www.moneycontrol.com/news/world/chinas-coronavirus-death-toll-touches-3042-confirmed-cases-rise-to-80552-5008681.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-770x433.png", "publishedAt": "2020-03-06T04:30:06Z", "content": "The death toll in China's novel coronavirus outbreak has touched 3,042 with 30 new fatalities while the confirmed cases have risen to 80,552 amid signs that the dreaded COVID-19 was stabilising, including in the epicentre Hubei province.\r\nChina's National Hea… [+3578 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Silvia Amaro", "title": "European stocks set to open lower amid coronavirus volatility", "description": "European stocks are set to open lower Friday morning as the coronavirus keeps impacting businesses worldwide.", "url": "https://www.cnbc.com/2020/03/06/european-stocks-amid-coronavirus-volatility.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105653017-1546262325172gettyimages-1075377262.jpeg?v=1546262339", "publishedAt": "2020-03-06T04:58:07Z", "content": "European stocks are set to open lower Friday morning as the coronavirus outbreak keeps impacting businesses worldwide.\r\nThe FTSE 100 is seen down by 130 points at 6,575; the DAX 30 is set to start lower by 282 points at 11,662 and the CAC 40 is seen off by 13… [+1111 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Irish goodbye? Indian police hunt for RUNAWAY coronavirus suspect as confirmed cases across country hit 30", "description": "An Irishman believed to have contracted the coronavirus has escaped from medical isolation at a hospital in India, prompting local authorities to lodge a case with police, who are now searching for the escapee. Read Full Article at RT.com", "url": "https://www.rt.com/news/482456-india-irishman-escape-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e61cd0585f5401f502c684b.jpg", "publishedAt": "2020-03-06T04:13:00Z", "content": "The man was admitted to the SCB Medical College and Hospital in Cuttack after landing at the nearby Bhubaneswar International Airport with a fever, according to local media. Placed into quarantine at the medical facility, he escaped from its isolation ward la… [+762 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19: Pets not assessed to be \"serious vector of transmission\", says Singapore authorities - CNA", "description": "COVID-19: Pets not assessed to be \"serious vector of transmission\", says Singapore authorities CNA First human-to-animal infection: Pet dog infected with COVID-19 in Hong Kong Times of India It's positive: Pets can't pass on coronavirus SHINE Dog tests 'weak …", "url": "https://www.youtube.com/watch?v=Lh2mxCXRfkA", "urlToImage": "https://i.ytimg.com/vi/Lh2mxCXRfkA/maxresdefault.jpg", "publishedAt": "2020-03-06T05:11:18Z", "content": null}, {"source": {"id": null, "name": "Kidsactivitiesblog.com"}, "author": "Brittanie", "title": "The Coronavirus Has Infected Very Few Babies and Children. Here’s One Theory Why", "description": "All you’ve probably read lately is a lot of scary things regarding the Coronavirus (don’t worry, I have too) and my biggest concern has been the well-being of my children. If you are in the same boat, this actually might help put your mind to ease (even just …", "url": "https://kidsactivitiesblog.com/135236/the-coronavirus-has-infected-very-few-babies-and-children/", "urlToImage": "https://kidsactivitiesblog.com/wp-content/uploads/2020/03/bigstock-Boy-And-Girl-A-Children-In-A-347568736.jpg", "publishedAt": "2020-03-06T04:11:55Z", "content": "March 5, 2020 by BrittanieLeave a Comment\r\nAll you’ve probably read lately is a lot of scary things regarding the Coronavirus (don’t worry, I have too) and my biggest concern has been the well-being of my children. If you are in the same boat, this actually m… [+2467 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Nintendo, Microsoft And Multiple Third-Party Publishers Commit To This Year's Gamescom", "description": "The first exhibitors have signed up. As more video game developers and publishers cancel their convention appearances worldwide due to the coronavirus outbreak, Gamescom – the annual European video game trade fair held in Germany – has decided to share a list…", "url": "http://www.nintendolife.com/news/2020/03/nintendo_microsoft_and_multiple_third-party_publishers_commit_to_this_years_gamescom", "urlToImage": "http://images.nintendolife.com/8d561204db5ca/1280x720.jpg", "publishedAt": "2020-03-06T04:55:00Z", "content": "As more video game developers and publishers cancel their convention appearances worldwide due to the coronavirus outbreak, Gamescom the annual European video game trade fair held in Germany has decided to share a list of the first exhibitors who have signed … [+1055 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Jeremy C. Fox", "title": "Legislators press Baker to waive co-pays on coronavirus testing", "description": "More than 60 Massachusetts lawmakers signed onto a letter Thursday urging Governor Charlie Baker to require Massachusetts health insurers to waive co-pays for coronavirus testing.", "url": "https://www.bostonglobe.com/2020/03/06/metro/legislators-press-baker-waive-co-pays-coronavirus-testing/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/u8kSvqwfobYe7CpALACA-qcoD5M=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/AVQB2RC5TUI6PLD2DRXELBKBJQ.jpg", "publishedAt": "2020-03-06T04:26:21Z", "content": "More than 60 Massachusetts lawmakers signed onto a letter Thursday urging Governor Charlie Baker to require Massachusetts health insurers to waive co-pays for coronavirus testing.\r\nThe 62 legislators, led by state senators Eric P. Lesser and Joanne M. Comerfo… [+1634 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Claudia Poposki For Daily Mail Australia", "title": "Coronavirus: Toilet roll sells for $1,610 after panic buyers stripped supermarket shelves", "description": "A real estate agent has forked out $1,610 for a single roll of triple ply toilet paper.", "url": "https://www.dailymail.co.uk/news/article-8081323/Coronavirus-Toilet-roll-sells-1-610-panic-buyers-stripped-supermarket-shelves.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/06/03/25608706-0-image-a-40_1583465234295.jpg", "publishedAt": "2020-03-06T04:12:26Z", "content": "NEW SOUTH WALES: 28\r\nJanuary 25 \r\nThree men aged 43, 53, and 35 who had recently travelled to China contracted the disease.\r\nTwo flew in from Wuhan while the other arrived in Sydney from Shenzhen, south China.\r\nThey were treated in isolation at Westmead Hospi… [+7576 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Aron A.", "title": "Coronavirus Researches Identify Two Strains, One \"More Aggressive\" Than Other", "description": "New reports suggest that a new strain of coronavirus that's more aggressive than the parent form. https://www.hotnewhiphop.com/coronavirus-researches-identify-two-strains-one-more-aggressive-than-other-news.105525.html", "url": "https://www.hotnewhiphop.com/coronavirus-researches-identify-two-strains-one-more-aggressive-than-other-news.105525.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1583437612_7d512a5ef33f9f4e30e6d62ed85c8d34.jpg/8c03a90373548af53073a4dddd22b153/1583437612_630a470c8ab3d1548ed5cb8613261292.jpg", "publishedAt": "2020-03-06T04:36:04Z", "content": "Things are getting progressively worse with the Coronavirus outbreak as more and more researchers are trying to find a solution. As they've tried to figure out a cure, or at the very least, some sort of vaccination, researchers from Peking University's School… [+1232 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Disis, CNN Business", "title": "Asian stocks fall as the coronavirus outbreak threatens global growth", "description": "Stocks in Asia declined on Friday, tracking heavy losses on Wall Street as the novel coronavirus outbreak continues to fray investors' nerves.", "url": "https://www.cnn.com/2020/03/05/investing/asian-market-latest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305225808-japan-stock-market-0306-super-tease.jpg", "publishedAt": "2020-03-06T04:14:17Z", "content": null}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "Stuff", "title": "Coronavirus: Countdown experiences online shopping surge", "description": "Countdown tells customers to expect delays in orders, but there's \"plenty of food, toilet paper and other essentials in NZ\".", "url": "https://www.stuff.co.nz/life-style/food-wine/food-news/120083504/coronavirus-countdown-experiences-online-shopping-surge", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/h/p/r/i/image.related.StuffLandscapeSixteenByNine.1420x800.1zht0w.png/1583469454834.jpg", "publishedAt": "2020-03-06T04:37:34Z", "content": "Countdown has warned customers to expect delays in delivering orders as the result of an online shopping surge.\r\n While the supermarket didn't directly refer to coronavirus, food manufacturers and suppliers have been urging calm after reports of panic buying … [+2206 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "California orders insurers to waive out-of-pocket costs for coronavirus testing (Kathleen Pender/San Francisco Chronicle)", "description": "Kathleen Pender / San Francisco Chronicle : California orders insurers to waive out-of-pocket costs for coronavirus testing — California on Thursday became the latest state to order insurance companies to waive out-of-pocket costs for coronavirus testing. — T…", "url": "https://www.memeorandum.com/200305/p170", "urlToImage": "https://s.hdnux.com/photos/01/10/77/45/19134791/5/rawImage.jpg", "publishedAt": "2020-03-06T04:55:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "EVAN HARDING", "title": "Coronavirus impact felt in the south", "description": "Southland's live seafood industry is doing it tough and the farming and tourism industries face uncertainty due to the coronavirus outbreak in China.", "url": "https://www.stuff.co.nz/business/120071595/coronavirus-impact-felt-in-the-south", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/h/u/r/3/image.related.StuffLandscapeSixteenByNine.1420x800.1zhju3.png/1583468337490.jpg", "publishedAt": "2020-03-06T04:18:55Z", "content": "Southland's live seafood industry is doing it tough and the farming and tourism industries face uncertainty due to the coronavirus outbreak in China.\r\n However, businesses can learn from what's happened and become more resilient, a leading accountant says.\r\n … [+3871 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Looking to buy into coronavirus fear? These 9 sectors to do well if things go south", "description": "India has been getting queries from the EU and the US for textiles, homeware, ceramic tiles, engineering goods, furniture, etc, seeking to replace China as a supplier.", "url": "https://www.moneycontrol.com/news/business/markets/looking-to-buy-into-coronavirus-fear-these-9-sectors-to-do-well-if-things-go-south-5008041.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/An-employee-from-a-disinfection-service-company-sanitizesa-KTX-train-at-Seoul-Railway-Station-in-Seoul-South-Korea-March-4-2020-Reuters-770x433.jpg", "publishedAt": "2020-03-06T04:58:26Z", "content": "Coronavirus has spooked the Dalal Street but experts say some sectors are likely to do well as supply chains get disrupted and global crude prices tumble, with the virus spreading to more than 80 countries, including India.\r\nThere are opportunities for a coun… [+5218 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Coronavirus: White House concedes US lacks enough test kits (BBC)", "description": "BBC : Coronavirus: White House concedes US lacks enough test kits — The White House has acknowledged the nation does not have enough coronavirus test kits as cases of the disease ticked upwards on both US coasts. — Vice-President Mike Pence said the Trump adm…", "url": "https://www.memeorandum.com/200306/p1", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/17BE7/production/_111155279_gettyimages-1205321212-1.jpg", "publishedAt": "2020-03-06T05:00:51Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Hyonhee Shin", "title": "South Korea protests Japanese travel curbs as coronavirus ignites diplomatic row", "description": "South Korea issued a strongly worded protest on Friday against Japan's decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations.", "url": "https://www.reuters.com/article/us-health-coronavirus-southkorea-idUSKBN20T03O", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499385700&w=1200&r=LYNXMPEG2509G", "publishedAt": "2020-03-06T04:15:27Z", "content": "SEOUL (Reuters) - South Korea issued a strongly worded protest on Friday against Japan’s decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations. \r\nJapan joined t… [+2718 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Asian markets plunge as coronavirus epidemic wreaks havoc on international business", "description": "Asian equities tumbled Friday as analysts warned the volatility that has characterised markets during the coronavirus crisis is likely to continue for some time. While governments and central banks have unleashed or prepare to roll out stimulus measures, the …", "url": "https://www.rawstory.com/2020/03/asian-markets-plunge-as-coronavirus-epidemic-wreaks-havoc-on-international-business/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/South-Korean-soldiers-wearing-protective-gear-against-coronavirus.jpeg", "publishedAt": "2020-03-06T04:35:36Z", "content": "Asian equities tumbled Friday as analysts warned the volatility that has characterised markets during the coronavirus crisis is likely to continue for some time.\r\nWhile governments and central banks have unleashed or prepare to roll out stimulus measures, the… [+3582 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Common Dreams", "title": "Markets plunge as critics say Trump’s desperate efforts to calm the panic have backfired", "description": "by Eoin Higgins The stock market plunged 970 points Thursday, or 3.58%, as fears of the economic impact of the global coronavirus outbreak—and President Donald Trump’s mishandling of the crisis—continued to roil the world’s financial markets after last week’s…", "url": "https://www.rawstory.com/2020/03/markets-plunge-as-critics-say-trumps-desperate-efforts-to-calm-the-panic-have-backfired/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2017/07/trump-isnta.jpg", "publishedAt": "2020-03-06T04:27:37Z", "content": "by Eoin Higgins\r\nThe stock market plunged 970 points Thursday, or 3.58%, as fears of the economic impact of the global coronavirus outbreakand President Donald Trumps mishandling of the crisiscontinued to roil the worlds financial markets after last weeks pan… [+2871 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Alberta woman home after cruise first presumptive case of new coronavirus - Canada News - Castanet.net", "description": "Alberta woman home after cruise first presumptive case of new coronavirus - Canada News Castanet.net Alberta has 1st presumptive case of coronavirus Global News Alberta's first presumptive case of COVID-19 is in the Calgary Zone CTV News Calgary-area woman li…", "url": "https://www.castanet.net/news/Canada/278773/Alberta-woman-home-after-cruise-first-presumptive-case-of-new-coronavirus", "urlToImage": "https://www.castanet.net/content/2020/3/CPT14550290_p3443111.jpg", "publishedAt": "2020-03-06T04:19:00Z", "content": "EDMONTON - Alberta's first presumptive case of the novel coronavirus involves a woman from the southern part of the province who was on a cruise ship that is being held for testing off the coast of California.\r\nDr. Deena Hinshaw, Alberta's chief medical offic… [+2604 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Agence France-Presse", "title": "‘This is not a drill’: World Health Organization urges countries to take coronavirus more seriously", "description": "World health officials have warned that countries are not taking the coronavirus crisis seriously enough, as outbreaks surged across Europe and in the United States where medical workers sounded warnings over a “disturbing” lack of hospital preparedness. Glob…", "url": "https://www.rawstory.com/2020/03/this-is-not-a-drill-world-health-organization-urges-countries-to-take-coronavirus-more-seriously/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2017/03/Doctors-in-surgery-Shutterstock.jpg", "publishedAt": "2020-03-06T05:02:52Z", "content": "World health officials have warned that countries are not taking the coronavirus crisis seriously enough, as outbreaks surged across Europe and in the United States where medical workers sounded warnings over a “disturbing” lack of hospital preparedness.\r\nGlo… [+4489 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Kelly Tyko, USA TODAY", "title": "These cleaners kill coronavirus: Lysol, Clorox, Purell products make EPA's disinfectants list", "description": "Killing coronavirus: U.S. Environmental Protection Agency has released a list of disinfectants and wipes to protect against spread of the coronavirus.", "url": "https://www.usatoday.com/story/money/2020/03/05/prepare-for-coronavirus-epa-disinfectants-list-covid-19/4966691002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/05/USAT/bd8bc573-d707-40b1-be95-960b219cad23-Clorox_wipes.jpg?crop=4031,2268,x0,y302&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-06T04:30:59Z", "content": "The U.S. Environmental Protection Agency has released a list of disinfectants to protect against the spread of the coronavirus.\r\nAccording to the EPA, products on the list have \"qualified for use against COVID-19\" through the agency's Emerging Viral Pathogen … [+2623 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Ina Fried", "title": "Tech giants promise to pay hourly workers while employees telecommute - Axios", "description": "Tech giants promise to pay hourly workers while employees telecommute Axios", "url": "https://www.axios.com/tech-giants-promise-to-pay-hourly-workers-while-employees-telecommute-7c1dce8b-8522-4ada-90f2-fb7c30c74288.html", "urlToImage": "https://images.axios.com/nbWzTIF-ik0eT5vSMgNCHOSTO54=/2020/03/06/1583468445265.jpg", "publishedAt": "2020-03-06T04:36:29Z", "content": "Microsoft, Google, Facebook and Twitter all told Axios on Thursday night that they plan to pay their hourly workers regular wages even as they encourage many of their staff to work from home, reducing their on-site support staffing needs.\r\nWhy it matters: Whi… [+2196 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "IEA plans to revise down oil demand forecasts due to coronavirus – Bloomberg", "description": "Amid the coronavirus carnage that is weighing on the riskier assets, Bloomberg came out with the news that the International Energy Agency (IEA) plans", "url": "https://www.fxstreet.com/news/iea-plans-to-revise-down-oil-demand-forecasts-due-to-coronavirus-bloomberg-202003060443", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Events/Coronavirus/coronavirus2_Large.jpg", "publishedAt": "2020-03-06T04:43:05Z", "content": "Amid the coronavirus carnage that is weighing on the riskier assets, Bloomberg came out with the news that the International Energy Agency (IEA) plans to revise down its oil-demand forecasts next week.‘I am going to announce it Monday morning in Paris,’ IEA c… [+1332 chars]"}, {"source": {"id": null, "name": "Antiwar.com"}, "author": "Ramzy Baroud", "title": "A Terrifying Scenario: Coronavirus in ‘Quarantined’ Gaza", "description": "What if the Coronavirus reaches the besieged Gaza Strip? While the question carries great urgency for all Palestinians living under Israel’s military occupation, the Gaza situation is particularly complex and extremely worrying. Nearly 50 countries have alrea…", "url": "https://original.antiwar.com/ramzy-baroud/2020/03/05/a-terrifying-scenario-coronavirus-in-quarantined-gaza/", "urlToImage": "https://original.antiwar.com/wp-content/uploads/2019/10/awc_logo_for-circle-profile_600sq-01.png", "publishedAt": "2020-03-06T05:00:12Z", "content": "What if the Coronavirus reaches the besieged Gaza Strip? \r\nWhile the question carries great urgency for all Palestinians living under \r\n Israels military occupation, the Gaza situation is particularly complex and \r\n extremely worrying. \r\nNearly 50 countries h… [+7126 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Agence France-Presse", "title": "Premier League drops pre-match handshake over coronavirus concern", "description": "LONDON, UK – Premier League players and officials will not take part in the traditional pre-match handshake from this weekend over fears about the spread of the coronavirus. Teams have been told by Premier League chiefs that they will still line up as usual b…", "url": "https://www.rappler.com/sports/by-sport/football/253585-premiere-league-drops-pre-match-handshake-over-coronavirus-concerns", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/CAC61FB360D34FED8C44FEBF0B8AB4D6/liverpool.jpg", "publishedAt": "2020-03-06T04:30:56Z", "content": null}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "US employment report expected to show strength before coronavirus spread", "description": "U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rate cut from the Federal …", "url": "https://www.channelnewsasia.com/news/business/us-employment-report-expected-to-show-strength-before-coronavirus-spread-12508962", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12508960/16x9/991/557/509baf7572404d6212ebd75b5e73c4d3/hp/file-photo--x-model-suvs-being-built-on-the-assembly-line-at-the-bmw-manufacturing-facility-in-greer-1.jpg", "publishedAt": "2020-03-06T05:05:16Z", "content": "WASHINGTON: U.S. job growth likely slowed in February, but the pace probably remained consistent with a healthy labor market despite the coronavirus outbreak, which stoked financial market fears of a recession and prompted an emergency interest rate cut from … [+5632 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Scott McDonald", "title": "XFL Concessions Vendor Tests Positive For Coronavirus, Worked Game in Seattle Last Month", "description": "More than 22,000 fans attended the Dallas-Seattle XFL game on Feb. 22 at CenturyLink Field where a concessions vendor has since tested positive for coronavirus.", "url": "https://www.newsweek.com/xfl-concessions-vendor-tests-positive-coronavirus-worked-game-seattle-last-month-1490845", "urlToImage": "https://d.newsweek.com/en/full/1571824/xfl-coronavirus.jpg", "publishedAt": "2020-03-06T04:41:01Z", "content": "The sports world has dealt with the outbreak of the coronavirus and how it could affect each sport, the players and its fans. From the NBA to March Madness, and countries outside of the U.S. taking preliminary precautions, another wrinkle has surfaced.\r\nA con… [+2984 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "EUR/USD hits 7-month high on coronavirus pandemic fears", "description": "The buying interest around the single currency remains strong on Friday with investors selling risk in favor of safe havens on reports stating the cor", "url": "https://www.fxstreet.com/news/eur-usd-hits-7-month-high-on-coronavirus-pandemic-fears-202003060416", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/EURUSD/photo-of-the-american-and-euro-banknotes-57153806_Large.jpg", "publishedAt": "2020-03-06T04:16:32Z", "content": "<ul><li>EUR/USD hit seven-month highs in Asia as stocks tanked on virus fears. </li><li>Euro has become a haven currency due to ECB's negative rates and Eurozone's current account surplus.</li></ul>The buying interest around the single currency remains strong… [+1097 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Brian Labus, The Conversation", "title": "What Really Works to Keep The Coronavirus Away?", "description": "The World Health Organization has declared that COVID-19, the disease caused by the new coronavirus, has a higher fatality rate than the flu. As of March 4, 2020, nine deaths have been reported in the US.", "url": "https://www.sciencealert.com/what-really-works-to-keep-the-coronavirus-away", "urlToImage": "https://www.sciencealert.com/images/2020-03/processed/processed/surgical_mask_on_the_ground_covid-19_1024.jpg", "publishedAt": "2020-03-06T04:53:22Z", "content": "The World Health Organization has declared that COVID-19, the disease caused by the new coronavirus, has a higher fatality rate than the flu. As of March 4, 2020, nine deaths have been reported in the US.\r\nBrian Labus, a professor of public health, provides e… [+5872 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bobby Ghosh", "title": "Europe Has Run Out of Excuses for Not Sanctioning Iran", "description": "(Bloomberg Opinion) -- For the past two weeks, the Iranian regime’s catastrophic mishandling of the coronavirus crisis and the immediate danger this poses to...", "url": "https://news.yahoo.com/europe-run-excuses-not-sanctioning-045921396.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-06T04:59:21Z", "content": "(Bloomberg Opinion) -- For the past two weeks, the Iranian regimes catastrophic mishandling of the coronavirus crisis and the immediate danger this poses to neighboring countries have distracted attention from the more traditional ways in which the Islamic Re… [+4084 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bobby Ghosh", "title": "Europe Has Run Out of Excuses for Not Sanctioning Iran", "description": "(Bloomberg Opinion) -- For the past two weeks, the Iranian regime’s catastrophic mishandling of the coronavirus crisis and the immediate danger this poses to...", "url": "https://finance.yahoo.com/news/europe-run-excuses-not-sanctioning-045921150.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-06T04:59:21Z", "content": "(Bloomberg Opinion) -- For the past two weeks, the Iranian regimes catastrophic mishandling of the coronavirus crisis and the immediate danger this poses to neighboring countries have distracted attention from the more traditional ways in which the Islamic Re… [+4084 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Katy Perry, Orlando Bloom Postpone Japan Wedding Amid Coronavirus Scare - News18", "description": "Katy Perry, Orlando Bloom Postpone Japan Wedding Amid Coronavirus Scare News18 Katy Perry - Never Worn White (Official) KatyPerryVEVO Katy Perry Announces She's Expecting A Baby With Orlando Bloom In New Music Video NDTV News Katy Perry's Wedding Dress When S…", "url": "https://www.news18.com/news/movies/katy-perry-orlando-bloom-postpone-japan-wedding-amid-coronavirus-scare-2527689.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/11/Katy-Perry-Orlando-Bloom.jpg", "publishedAt": "2020-03-06T04:46:25Z", "content": "Katy Perry and Orlando Bloom have postponed their wedding in Japan due to the spread of coronavirus. The couple has recently revealed that they are soon going to be parents to their first child.\r\nAs per a report published in the Evening Standard, the couple w… [+1134 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Alan Friedman", "title": "Developers say that Apple has rejected their coronavirus app submissions", "description": ", Apple has rejected submissions from developers trying to publish apps that give information about the coronavirus. In order to prevent the dissemination of misleading information about the rapidly spreading disease, the tech giant will not approve any new a…", "url": "https://www.phonearena.com/news/apple-rejects-coronavirus-apps-for-the-app-store_id122758", "urlToImage": "https://i-cdn.phonearena.com/images/article/122758-two/Developers-say-that-Apple-has-rejected-their-coronavirus-app-submissions.jpg", "publishedAt": "2020-03-06T04:57:00Z", "content": "A discussion is a place, where people can voice their opinion, no matter if it is positive, neutral or negative. However, when posting, one must stay true to the topic, and not just share some random thoughts, which are not directly related to the matter.\r\nTh… [+691 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Paul Davidson, USA TODAY", "title": "'I'm just worried': Coronavirus prompts companies to pull back on hiring as uncertainty grows", "description": "The coronavirus is prompting many businesses to pull back on hiring and investment as sales decline and uncertainty grows.", "url": "https://www.usatoday.com/story/money/2020/03/06/coronavirus-outbreak-leads-many-companies-reduce-hiring/4968858002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/778b526f532029c1b4f2ea4d3cfa53805bb4534b/c=56-0-2310-1268/local/-/media/2020/03/03/USATODAY/usatsports/trade-show-crowd-getty.jpg?width=1600&height=800&fit=crop", "publishedAt": "2020-03-06T05:01:02Z", "content": "Many trade events, including a housewares show in Chicago, are being canceled worldwide as the spread of the coronavirus continues. (March 3)\r\nAP Domestic\r\nHiring freezes, delayed equipment purchases, jittery business owners  the coronavirus is starting to ha… [+5339 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Aaron Perine", "title": "Cinderella Musical Postponed Due to Coronavirus Fears", "description": "Andrew Lloyd Webber's Cinderella has postponed it's opening in London due to Coronavirus concerns. Webber released a statement from the production company about the \"current global circumstances.\" The production was supposed to debut at the Gillian Lynne Thea…", "url": "https://comicbook.com/irl/2020/03/06/cinderella-musical-postponed-coronavirus-fears/", "urlToImage": "https://media.comicbook.com/2016/05/cinderella-183193-640x320.jpg", "publishedAt": "2020-03-06T04:50:00Z", "content": "Andrew Lloyd Webber’s Cinderella has postponed it’s opening in London due to Coronavirus concerns. Webber released a statement from the production company about the “current global circumstances.” The production was supposed to debut at the Gillian Lynne Thea… [+2747 chars]"}, {"source": {"id": null, "name": "Ehackingnews.com"}, "author": "E Hacking News", "title": "Group-IB spottted new fake messages about the coronavirus during the day", "description": "Latest Information Security and hacker news site.Know about cyber crime and law. Cyber Security updates to improve your network security", "url": "https://www.ehackingnews.com/2020/03/group-ib-spottted-new-fake-messages.html", "urlToImage": "https://1.bp.blogspot.com/-Ok1476KTyuw/XmDaC6uliQI/AAAAAAAABqI/gmZWWUZRXAoML9gLN5SeOGvEBxBD86o-wCLcBGAsYHQ/w1200-h630-p-k-no-nu/infected.jpg", "publishedAt": "2020-03-06T04:30:00Z", "content": "Group-IB, a company that specializes in preventing cyberattacks has revealed new fake messages about the spread of coronavirus over the past day. Company Group-IB reported that information about accounts spreading fakes about the coronavirus was transmitted t… [+1937 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "S Korea protests over Japan's virus travel restrictions", "description": "South Korea issued a strongly worded protest on Friday against Japan's decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations. Japan joined the list of almost 10…", "url": "https://japantoday.com/category/national/S-Korea-protests-over-Japan%27s-virus-travel-restrictions", "urlToImage": null, "publishedAt": "2020-03-06T04:17:53Z", "content": "South Korea issued a strongly worded protest on Friday against Japan's decision to quarantine South Korean visitors for two weeks, as coronavirus containment measures ignited a fresh diplomatic row between the Asian nations.\r\nJapan joined the list of almost 1… [+4706 chars]"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Marc Stiles", "title": "Home prices surge 18 percent in Kitsap with big gains in other outlying counties", "description": "Realtors report the Seattle metro market has seen little impact so far from coronavirus.", "url": "https://www.bizjournals.com/seattle/news/2020/03/05/home-prices-surge-18-percent-in-kitsap-with-big.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_seattle+%28Seattle+-+Puget+Sound+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-03-06T04:12:21Z", "content": null}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Ainslee Asokan", "title": "Elderly US traveller is Bhutan's first COVID-19 case, prompting travel restrictions", "description": "THIMPHU: Bhutan announced its first positive case of the novel coronavirus on Friday (Mar 6), prompting school closures and travel restrictions, according to a Facebook post from the Prime Minister’s Office (PMO). The 76-year-old patient from the US was confi…", "url": "https://www.channelnewsasia.com/news/asia/covid19-elderly-us-traveller-bhutan-first-coronavirus-case-12508556", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12508584/16x9/991/557/60f9dabc114e4e034a7a4d29be79cb27/Jy/bhutan-s-national-council-will-vote-on-monday-to-pass-the-bill-following-the-move-by-the-lower-house-of-parliament-to-decriminalise-homosexuality-1560000011911-2.jpg", "publishedAt": "2020-03-06T04:50:37Z", "content": "THIMPHU: Bhutan announced its first positive case of the novel coronavirus on Friday (Mar 6), prompting school closures and travel restrictions, according to a Facebook post from the Prime Ministers Office (PMO).\r\nThe 76-year-old patient from the US was confi… [+4519 chars]"}, {"source": {"id": null, "name": "Protothema.gr"}, "author": "Πρώτο Θέμα", "title": "Lufthansa grounds 150 aircraft due to coronavirus", "description": "<div class=\"entry-excerpt-in\">\r\n<p>The German airline said the decision concerned 125 short-haul and 25 long-haul aircraft</p>\r\n</div>\r\n<div class=\"entry-content\"></div>", "url": "https://www.protothema.gr/english-news/article/981549/lufthansa-grounds-150-aircraft-due-to-coronavirus/", "urlToImage": "https://i1.prth.gr/images/640x360share/files/2020-03-05/luft44.jpg", "publishedAt": "2020-03-06T04:45:00Z", "content": "The German airline said the decision concerned 125 short-haul and 25 long-haul aircraft"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Nathan Bomey, USA TODAY", "title": "Coronavirus spurs fears of drug shortages as outbreak disrupts the medicine supply chain", "description": "The coronavirus outbreak is sparking fears of drug shortages in the U.S. due to the impact it's having on the pharmaceutical supply chain.", "url": "https://www.usatoday.com/story/money/2020/03/06/coronavirus-drug-shortages-antibiotics-penicillin-china-india-us-fda/4939115002/", "urlToImage": "https://www.gannett-cdn.com/presto/2019/11/05/USAT/90ea92b5-2414-478a-95d8-297f205c7b1e-AP_Teen_Vaping_Flavors.JPG?crop=5075,2855,x0,y503&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-06T05:01:02Z", "content": "USA Today answers a question you may be wondering: Is coronavirus worse than the flu?\r\nUSA TODAY\r\nThe coronavirus outbreak is sparking fears of drug shortages in the U.S., largely due to its disruption of pharmaceutical supplies from China and India. \r\nThe Fo… [+4582 chars]"}, {"source": {"id": null, "name": "Brobible.com"}, "author": "Jorge Alonso", "title": "XFL’s Seattle Dragons Concessions Vendor Tests Positive for Coronavirus", "description": "A part-time employee who worked during the Seattle Dragons’ home…", "url": "https://brobible.com/sports/article/xfls-seattle-dragons-concessions-coronavirus/", "urlToImage": "https://brobible.files.wordpress.com/2020/03/gettyimages-1208427993.jpg?quality=90&w=650", "publishedAt": "2020-03-06T04:15:41Z", "content": "Getty Image\r\nA part-time employee who worked during the Seattle Dragons’ home game against the Dallas Renegades at Seattle’s CenturyLink Field on Feb. 22 has tested positive for the coronavirus, according to King County (Wash.) officials. \r\nBREAKING A part-ti… [+1595 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "[People Talk] Coronavirus: How prepared are Nigerians? (3)", "description": "By Bose Adelaja, Olayinka Latona & Rose Chukwu “I’ll say we are 75% prepared because nobody wants to die, that’s why most Nigerians can do anything to avoid being infected even though some of the recommendations are not real. “However, on the part of governme…", "url": "https://www.vanguardngr.com/2020/03/people-talk-coronavirus-how-prepared-are-nigerians-3/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/Coronavirus.jpeg?fit=1250%2C833&ssl=1", "publishedAt": "2020-03-06T04:30:06Z", "content": "By Bose Adelaja, Olayinka Latona &amp; Rose Chukwu\r\n“Ill say we are 75% prepared because nobody wants to die, thats why most Nigerians can do anything to avoid being infected even though some of the recommendations are not real.\r\n“However, on the part of gove… [+2331 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Haresh Menghani", "title": "AUD/USD holds steady near 0.6600 mark, bearish USD helped offset coronavirus-led selloff", "description": "The AUD/USD pair traded with a mild negative bias for the second consecutive session on Friday, albeit the downtick lacked any strong follow-through s", "url": "https://www.fxstreet.com/news/aud-usd-holds-steady-near-06600-mark-bearish-usd-helped-offset-coronavirus-led-selloff-202003060504", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/AUDUSD/australian-money-2249329_Large.jpg", "publishedAt": "2020-03-06T05:04:53Z", "content": "<ul><li>A fresh wave of the global risk-aversion trade exerted some pressure on the aussie.</li><li>The downside remains limited amid a strong bearish sentiment surrounding the USD.</li><li>Collapsing US bond yields continued weighing on the greenback ahead o… [+1311 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Marc Deschamps", "title": "Bungie Encouraging Employees to Work From Home Due to Coronavirus", "description": "With Coronavirus concerns becoming widespread, the video game industry is making preparations to protect employees. The virus has resulted in the indefinite delay of this year's Game Developers Conference, and the Entertainment Software Association is keeping…", "url": "https://comicbook.com/gaming/2020/03/06/bungie-encouraging-employees-work-from-home-coronavirus/", "urlToImage": "https://media.comicbook.com/2017/09/destiny-2-loot-gaming-1022415-640x320.jpg", "publishedAt": "2020-03-06T04:30:00Z", "content": "With Coronavirus concerns becoming widespread, the video game industry is making preparations to protect employees. The virus has resulted in the indefinite delay of this year's Game Developers Conference, and the Entertainment Software Association is keeping… [+2571 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Associated Press", "title": "Yeshiva U team: Hotel cancels reservation over virus fears", "description": "A hotel in a Baltimore suburb on Thursday canceled the reservation of the Yeshiva University men's basketball team over fears of novel coronavirus, the coach of the Maccabees told The Associated Press. Later Thursday, Johns Hopkins University in Baltimore sai…", "url": "https://ca.sports.yahoo.com/news/yeshiva-u-team-hotel-cancels-reservation-over-virus-215950699--ncaab.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-06T04:55:16Z", "content": "A hotel in a Baltimore suburb on Thursday canceled the reservation of the Yeshiva University men's basketball team over fears of novel coronavirus, the coach of the Maccabees told The Associated Press.\r\nLater Thursday, Johns Hopkins University in Baltimore sa… [+2786 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Peter Weber", "title": "Trump tells town hall he plans to cut entitlements, hopes to replace ObamaCare with 'something great'", "description": "The federal deficit has shot up under President Trump, due largely to a $1.5 trillion tax cut and bipartisan spending increases — Trump has insisted on hiking military spending, Democrats pushed to raise domestic programs. And so at a Fox News town hall in Sc…", "url": "https://news.yahoo.com/trump-tells-town-hall-plans-051104952.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/soEH5yIMDKR_LUln4vVcHg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/gCUosqutncm7rsnR0uAX2w--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/5e8dfaaa30c400eec10fc15fe5ddee90", "publishedAt": "2020-03-06T05:11:04Z", "content": "The federal deficit has shot up under President Trump, due largely to a $1.5 trillion tax cut and bipartisan spending increases Trump has insisted on hiking military spending, Democrats pushed to raise domestic programs. And so at a Fox News town hall in Scra… [+1504 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Jenni Lada", "title": "iam8bit Has Backed Out of E3 2020", "description": "iam8bit is no longer involved with E3 2020 as a \"tastemaker.\" The post iam8bit Has Backed Out of E3 2020 appeared first on Siliconera.", "url": "https://www.siliconera.com/iam8bit-has-backed-out-of-e3-2020/", "urlToImage": "https://www.siliconera.com/wp-content/uploads/2020/03/iam8bit-e3-2020.jpg", "publishedAt": "2020-03-06T04:40:10Z", "content": "iam8bit, the company poised to assist with E3 2020 as a tastemaker who would reinvigorate the show, has pulled out of the event. Its team will no longer be acting as creative directors. No explanation was offered for the decision, which was announced on Twitt… [+1513 chars]"}]