[{"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "CVS warns there could be a hand sanitizer shortage", "description": "US drug stores, retailers and suppliers are racing to keep up with surging interest for cleaning products as fears over coronavirus intensify.", "url": "https://www.cnn.com/2020/02/28/business/hand-sanitizers-wipes-cvs-walgreens-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228095745-walgreens-hand-sanitizer-file-restricted-super-tease.jpg", "publishedAt": "2020-02-28T15:42:33Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Federal Reserve must quickly stop coronavirus stock market crash: trader - Yahoo Canada Finance", "description": "Federal Reserve must quickly stop coronavirus stock market crash: trader Yahoo Canada Finance How the coronavirus has thrown interest rate plans out the window CBC.ca Trump calls for lower rates amid coronavirus fallout: 'Fed should start being a leader' CNBC…", "url": "https://ca.finance.yahoo.com/news/federal-reserve-must-quickly-stop-coronavirus-stock-market-crash-trader-160622186.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/IE6BmLFXv0xGWLt_nyLqBA--~A/YXBwaWQ9aGlnaGxhbmRlcjt3PTU1MTE7aD0zNjc0O3NtPTE7aWw9cGxhbmU-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/f8d9b4e0-5a42-11ea-a5df-c6ac03f3ae52.cf.jpg", "publishedAt": "2020-02-28T16:06:00Z", "content": "The debate on whether the Federal Reserve must hold an emergency meeting this weekend and cut interest rates to arrest the coronavirus stock market crash is one of the hottest debates on Wall Street right now.\r\nTraders and strategists are mixed on whether the… [+2781 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Bahrain reports two new cases of coronavirus, one a Saudi national", "description": "Bahrain reported two new cases of coronavirus on Friday, one of them a Saudi Arabian national, taking the total there to 38.", "url": "https://www.reuters.com/article/us-health-bahrain-idUSKCN20M2E6", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496556250&w=1200&r=LYNXNPEG1R1I3", "publishedAt": "2020-02-28T15:52:27Z", "content": "CAIRO (Reuters) - Bahrain reported two new cases of coronavirus on Friday, one of them a Saudi Arabian national, taking the total there to 38. \r\nThe health ministry said the other reported case was a Bahraini national, and that both new cases had come from Ir… [+86 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Coronavirus risk at very high global level, says WHO's Tedros", "description": "The risk of spread and impact of the coronavirus is now very high at a \"global level\", World Health Organization chief Tedros Adhanom Ghebreyesus told reporters in Geneva on Friday.", "url": "https://www.reuters.com/article/us-china-health-who-idUSKCN20M2EP", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496557313&w=1200&r=LYNXNPEG1R1IH", "publishedAt": "2020-02-28T15:53:36Z", "content": "GENEVA (Reuters) - The risk of spread and impact of the coronavirus is now very high at a “global level”, World Health Organization chief Tedros Adhanom Ghebreyesus told reporters in Geneva on Friday. \r\nChina’s 329 reported cases in the past 24 hours was howe… [+135 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Stock market live updates: Stock extend historic selloff; coronavirus fears persist - Yahoo Canada Finance", "description": "Stock market live updates: Stock extend historic selloff; coronavirus fears persist Yahoo Canada Finance View Full coverage on Google News", "url": "https://ca.finance.yahoo.com/news/stock-market-news-live-updates-february-28-2020-234447699.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MD9MwqhtK7oaVBwJAk5Pcw--~A/YXBwaWQ9aGlnaGxhbmRlcjt3PTgyNDY7aD01NDk3O3NtPTE7aWw9cGxhbmU-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/25e76ed0-5a27-11ea-bf7a-5e7deaf366c0.cf.jpg", "publishedAt": "2020-02-28T15:23:00Z", "content": "Markets have now completed a brutal seven-day losing streak the worst since the 2008 financial crisis, with major benchmarks plummeting in panic selling related to the escalating coronavirus outbreak.The illness continues its spread across multiple countries,… [+14566 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "German newspaper cites Health Ministry as saying ITB travel fair should be canceled", "description": "Germany's Bild newspaper on Friday cited the Health Ministry as saying that its new coronavirus criteria, according to which organizers must assess the safety of their events, meant Berlin's ITB international travel fair should be canceled.", "url": "https://www.reuters.com/article/us-china-health-itb-idUSKCN20M297", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496540791&w=1200&r=LYNXNPEG1R1G6", "publishedAt": "2020-02-28T15:12:00Z", "content": "BERLIN (Reuters) - Germany’s Bild newspaper on Friday cited the Health Ministry as saying that its new coronavirus criteria, according to which organizers must assess the safety of their events, meant Berlin’s ITB international travel fair should be canceled.… [+261 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "WHO: global community not ready to take same measures as China to contain coronavirus", "description": "The World Health Organization (WHO) said in a report issued on Friday that much of the global community is not yet ready to implement the types of measures that have contained the fast-moving coronavirus outbreak in China.", "url": "https://www.reuters.com/article/us-china-health-who-report-idUSKCN20M2FO", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T16:00:31Z", "content": "NEW YORK (Reuters) - The World Health Organization (WHO) said in a report issued on Friday that much of the global community is not yet ready to implement the types of measures that have contained the fast-moving coronavirus outbreak in China. \r\n“These are th… [+467 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "White House adviser: More U.S. coronavirus cases likely but won't necessarily 'skyrocket'", "description": "The number of additional coronavirus cases in the United States is likely to increase but that does not mean they will \"skyrocket\" in North America, White House economic adviser Larry Kudlow said on Friday.", "url": "https://www.reuters.com/article/us-china-health-usa-kudlow-idUSKCN20M2FV", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496561206&w=1200&r=LYNXNPEG1R1J4", "publishedAt": "2020-02-28T16:03:00Z", "content": "WASHINGTON (Reuters) - The number of additional coronavirus cases in the United States is likely to increase but that does not mean they will “skyrocket” in North America, White House economic adviser Larry Kudlow said on Friday. \r\nKudlow, in an interview wit… [+204 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Alex Wilhelm", "title": "Public markets fall yet again as venture deal counts appear to slip", "description": "Let's take a look at how elevated stock prices remain and what that means for tech multiples, and then look at the January and February VC markets in U.S., China and Europe.", "url": "http://techcrunch.com/2020/02/28/public-markets-fall-yet-again-as-venture-deal-counts-appear-to-slip/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/04/gettyimages-929738446.jpg?w=600", "publishedAt": "2020-02-28T15:27:10Z", "content": "Hello and welcome back to our regular morning look at private companies, public markets and the gray space in between.\r\nAll around, this has been a tough week. The coronavirus is spreading and worry is running high as infections mount. In economic terms, glob… [+1446 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Dean Takahashi", "title": "The DeanBeat: The coronavirus knocks down the dominoes of the GDC", "description": "The dominoes tipped over for the GDC, as fears of the coronavirus (COVID-19) prompted more big game companies to drop out of the conference.", "url": "https://venturebeat.com/2020/02/28/the-deanbeat-the-coronavirus-knocks-down-the-dominoes-of-the-gdc/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2020/02/plague-inc.jpg?w=1200&strip=all", "publishedAt": "2020-02-28T16:00:30Z", "content": "The dominoes tipped over for the Game Developers Conference in the past week, as fears of the coronavirus (COVID-19) prompted more big game companies to drop out of the conference.\r\nUnity, Microsoft, and Epic Games bailed out in quick succession on Thursday. … [+7856 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "38% of Americans won't buy Corona beer because of coronavirus", "description": "\"Just to ba abundantly clear,\" CNN reassures us, \"There is no link between the virus and the beer.\" 5W Public Relations said that 38% of Americans wouldn't buy Corona \"under any circumstances\" because of the outbreak, and another 14% said they wouldn't order …", "url": "https://boingboing.net/2020/02/28/38-americans-say-they-wont.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/02/10-mexico.jpg?fit=1200%2C906&ssl=1", "publishedAt": "2020-02-28T15:56:49Z", "content": "\"Just to ba abundantly clear,\" CNN reassures us, \"There is no link between the virus and the beer.\"\r\n5W Public Relations said that 38% of Americans wouldn't buy Corona \"under any circumstances\" because of the outbreak, and another 14% said they wouldn't order… [+2096 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gwen Everett", "title": "'Risk of a credit event surging' BofA says as coronavirus-fearing investors race out of the market's riskiest bonds", "description": "The risk of a credit event is surging, according to Bank of America, with high-yield debt seeing billions in outflows. New issuances have come to a standstill, Societe Generale said. It's one of a slew of risk markets pummeled by this week's coronavirus sell-…", "url": "https://markets.businessinsider.com/news/stocks/risk-credit-event-surging-high-yield-bonds-coronavirus-selloff-bofa-2020-2-1028950338", "urlToImage": "https://images.markets.businessinsider.com/image/5ade21a619ee861f008b469c-1200/rtx1tmwe.jpg", "publishedAt": "2020-02-28T15:52:06Z", "content": "REUTERS/Lucas Jackson\r\n<ul><li>The risk of a credit event is surging, according to Bank of America, with high-yield debt seeing billions in outflows.</li><li>New issuances have come to a standstill, Societe Generale said.</li><li>It's one of a slew of risk ma… [+2279 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO upgrades global risk of virus spread to 'very high' | AFP - AFP News Agency", "description": "WHO upgrades global risk of virus spread to 'very high' | AFP AFP News Agency WHO raises global virus risk to maximum level The Standard Coronavirus risk upgraded to 'very high' by WHO as first Brit dies of disease Birmingham Live COVID-19 | WHO upgrades glob…", "url": "https://www.youtube.com/watch?v=o_5tfO89Ooo", "urlToImage": null, "publishedAt": "2020-02-28T15:56:49Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Wall Street is certain the Fed will slash interest rates next month. But a key official says that will only happen if the coronavirus becomes a pandemic.", "description": "St. Louis Federal Reserve President James Bullard said Friday that interest rates would be cut only if the coronavirus worsened. The comments were the latest sign the central bank would maintain a wait-and-see approach to the outbreak. But Wall Street expecta…", "url": "https://markets.businessinsider.com/news/stocks/wall-street-certain-rate-cuts-coming-fed-says-possible-pandemic-2020-2-1028950309", "urlToImage": "https://images.markets.businessinsider.com/image/5d28a9d2a17d6c743f1720f2-2400/2019-06-19t185226z2000987639rc1fbae46d00rtrmadp3usa-fed.jpg", "publishedAt": "2020-02-28T15:35:35Z", "content": "REUTERS/Lucas Jackson\r\n<ul><li>St. Louis Federal Reserve President James Bullard said Friday that interest rates would be cut only if the coronavirus worsened.</li><li>The comments were the latest sign the central bank would maintain a wait-and-see approach t… [+1605 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Joe Skrebels", "title": "Half-Life: Alyx: How Coronavirus Is Affecting Compatible VR Headsets", "description": "Coronavirus has caused problems for VR headset manufacturers - we checked with Valve, Oculus and HTC about which headsets might be available on Half-Life: Alyx release day.", "url": "https://www.ign.com/articles/half-life-alyx-vr-headsets-coronavirus-index-oculus-vive", "urlToImage": "https://assets1.ignimgs.com/2020/02/28/half-life-coronavirus-vr-1582905975437.jpg?width=1280", "publishedAt": "2020-02-28T16:00:20Z", "content": "When it's released on March 23, Half-Life: Alyx will be a notable moment in the timeline of VR gaming perhaps the medium's first true blockbuster. It's led to a rush of first-time VR buyers, eager to play the first full Half-Life game in 16 years. However, th… [+3888 chars]"}, {"source": {"id": null, "name": "Popsci.com"}, "author": "Kate Baggaley", "title": "Everything to know about coronavirus testing", "description": "For the first time, a person in the United States has tested positive for the novel coronavirus that causes COVID-19 and officials aren’t sure how they caught the disease, the Centers for Disease Control confirmed on February 26. Here’s what you need to know …", "url": "https://www.popsci.com/story/health/coronavirus-covid-19-testing/", "urlToImage": "https://www.popsci.com/resizer/zper6yQ-bhEPqJ-60B6s7kjdEb4=/1200x628/smart/arc-anglerfish-arc2-prod-bonnier.s3.amazonaws.com/public/B4R6HZRA7JAUJGDMNHY5YMJRPM.jpg", "publishedAt": "2020-02-28T16:00:50Z", "content": "If youre worried you might have been exposed to the coronavirus, you should first call your doctor. If your doctor evaluates you and suspects you have COVID-19, they will consult with state public health authorities, who in turn will contact the CDC, says Pau… [+101 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nathan Crooks / Bloomberg", "title": "$ZOOM Shares Double Amid Coronavirus Concerns. But Investors Mistakenly Bet on the Wrong Company", "description": "The surge of Zoom Technologies comes as investors mistaking bet on the now-defunct company rather than $ZM, the video-conferencing platform.", "url": "https://time.com/5792310/zoom-zm-stocks-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/zoom-zm-stocks-coronavirus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-02-28T15:28:06Z", "content": "Shares of Zoom Technologies Inc., a Beijing-based maker of mobile phone components with a market value of just $18 million, have more than doubled this week as investors bet on companies that could benefit if coronavirus fears push people to stay at home.\r\nTh… [+482 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Bulent Usta and Ali Kucukgocmen", "title": "'Europe is nicer': migrants head west after Turkey opens border", "description": "Hundreds of migrants in Turkey started arriving on the borders with Greece and Bulgaria on Friday after a senior Turkish official said Ankara would no longer abide by a 2016 EU deal and stop refugees from reaching Europe. The migrants, some carrying small chi…", "url": "https://news.yahoo.com/migrants-turkey-head-eu-borders-055912922.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Q1TxElEgD_J3SraWeKw_2A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/OzsS2dBgy8QJbUxk5Mk2xQ--~B/aD01MzQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/77a9211112e6dc9d1eec7fb21816fce1", "publishedAt": "2020-02-28T15:58:09Z", "content": "By Bulent Usta and Ali Kucukgocmen\r\nISTANBUL (Reuters) - Hundreds of migrants in Turkey started arriving on the borders with Greece and Bulgaria on Friday after a senior Turkish official said Ankara would no longer abide by a 2016 EU deal and stop refugees fr… [+3155 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Joe Pinsker", "title": "The Psychology of Steep Drops in the Stock Market", "description": "No one knows exactly how much damage coronavirus will do to the global economy, but investors have to guess.", "url": "https://www.theatlantic.com/business/archive/2020/02/coronavirus-stock-market/607216/", "urlToImage": "https://cdn.theatlantic.com/thumbor/jiXJ-My4-GrZqTTHSWCptHn-1Ek=/0x0:2000x1042/960x500/media/img/mt/2020/02/CoronaAndStocks/original.jpg", "publishedAt": "2020-02-28T16:00:09Z", "content": "Over the past week, stock markets around the world plunged as distressing news about the spread of the novel coronavirus continued to accumulate. In the United States, the three major stock indexes—the Dow Jones Industrial Average, the Nasdaq Composite, and t… [+5293 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "Adam Vaughan", "title": "Coronavirus pandemic threatens to knock $1 trillion off global economy", "description": "Financial markets around the world have suffered their worst week since the 2008 financial crash, as the economic impact of the coronavirus edging towards a pandemic becomes clearer", "url": "https://www.newscientist.com/article/2235697-coronavirus-pandemic-threatens-to-knock-1-trillion-off-global-economy/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2020/02/28121706/gettyimages-1208536317.jpg", "publishedAt": "2020-02-28T15:43:59Z", "content": "By Adam Vaughan\r\nMarkets are falling around the world\r\nTomohiro Ohsumi/Getty Images\r\nFinancial markets around the world have suffered their worst week since the 2008 financial crash, as the economic impact of the covid-19coronavirus edging towards a pandemic … [+4758 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": "C. Scott Brown", "title": "Samsung Galaxy S20 sales down by 50% in Korea as compared to the S10 family", "description": "Industry sources blame the coronavirus, but it's far more likely that the high pricing is more to blame.", "url": "https://www.androidauthority.com/samsung-galaxy-s20-sales-1088261/", "urlToImage": "https://cdn57.androidauthority.net/wp-content/uploads/2020/02/Samsung-Galaxy-S20-Plus-in-Blue-920x470.jpg", "publishedAt": "2020-02-28T16:00:09Z", "content": "According to a new report from The Korea Herald, Samsung Galaxy S20 sales are not doing so hot in the company’s home turf of South Korea.\r\nCiting “industry sources,” the report says that Samsung has only sold 70,800 units of the Galaxy S20 series in South Kor… [+1426 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jayme Deerwester and David Oliver, USA TODAY", "title": "Fifth Diamond Princess passenger dies in Japan; MSC ship gets 'clean bill of health'", "description": "A male British passenger from the Diamond Princess has died, making him the fifth passenger from the quarantined Princess ship to succumb to COVID-19.", "url": "https://news.yahoo.com/fifth-diamond-princess-passenger-dies-141120764.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j7obCebciSe80_JITPJP.A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/XnxdjSOLZW6MfneHZs02Bg--~B/aD0zNzEyO3c9NTU2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_travel_320/36ea72720259f04e836a197267429bab", "publishedAt": "2020-02-28T16:08:05Z", "content": "A British man has become the fifth person to die after spending time quarantined on Princess Cruises' Diamond Princess, the Foreign and Commonwealth Office confirmed in an emailed statement to USA TODAY.\r\nWhile he is the fifth person to die from after being q… [+4903 chars]"}, {"source": {"id": null, "name": "Psfk.com"}, "author": "PSFK", "title": "China’s Clubbing Scene Goes Virtual As Quarantine Continues", "description": "The coronavirus closings keep on coming, particularly in China. However, amongst the lockdowns, postponements and cancellations is a wave of entertainers and their followers who are refusing to stop, instead transferring their parties and performances to the …", "url": "https://www.psfk.com/2020/02/virtual-clubbing-coronavirus-quarantine.html", "urlToImage": "https://cdn1.psfk.com/wp-content/uploads/2020/02/virtual_club_psfk.png", "publishedAt": "2020-02-28T16:02:15Z", "content": "The coronavirus closings keep on coming, particularly in China. However, amongst the lockdowns, postponements and cancellations is a wave of entertainers and their followers who are refusing to stop, instead transferring their parties and performances to the … [+1193 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Kristen Lee", "title": "Aston Martin Is Praying For End Of Coronavirus", "description": "I drag Aston Martin for a stupid thing its boss said, Japan wants Carlos Ghosn to return and answer for his alleged crimes, and Honda’s CR-V Hybrid comes out swinging for the RAV4 Hybrid. All that and more in The Morning Shift for Friday, Feb. 28, 2020. Read …", "url": "https://jalopnik.com/aston-martin-is-praying-for-end-of-coronavirus-1841969858", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/xne8jdmhv4yumisbvfki.jpg", "publishedAt": "2020-02-28T15:14:00Z", "content": "I drag Aston Martin for a stupid thing its boss said, Japan wants Carlos Ghosn to return and answer for his alleged crimes, and Hondas CR-V Hybrid comes out swinging for the RAV4 Hybrid. All that and more in The Morning Shift for Friday, Feb. 28, 2020.\r\n1st G… [+6522 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Adam Cancryn and David Lim", "title": "Republicans storm out of coronavirus briefing after Democrat rips Trump's response", "description": "Rep. Rosa DeLauro’s comments were indicative of the growing political tensions around the Trump administration’s handling of the coronavirus response.", "url": "https://www.politico.com/news/2020/02/28/house-coronavirus-trump-response-118121", "urlToImage": "https://static.politico.com/24/b0/9c97d0d64dbd8692bdeeb42f4e42/200228-rosa-delauro-getty-773.jpg", "publishedAt": "2020-02-28T15:23:42Z", "content": "DeLauros comments were indicative of the growing political tensions around the Trump administrations handling of the coronavirus response. President Donald Trump, who has publicly tried to downplay the virus through misleading claims, just after midnight took… [+2130 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "It’s time to prepare for a US coronavirus pandemic", "description": "The coronavirus outbreak has the entire world on edge. Countries like China and its neighbors have been particularly hard-hit, but the illness COVID-19 has popped up all over the globe. The United States has been particularly lucky over the past two months, w…", "url": "https://bgr.com/2020/02/28/coronavirus-preparing-pandemic-outbreak-united-states/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/02/10568941g-e1582821519680.jpg?quality=98&strip=all", "publishedAt": "2020-02-28T15:30:57Z", "content": "The coronavirus outbreak has the entire world on edge. Countries like China and its neighbors have been particularly hard-hit, but the illness COVID-19 has popped up all over the globe. The United States has been particularly lucky over the past two months, w… [+2812 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Alec Banks", "title": "How Coronavirus Is Handicapping the Global Fashion Industry", "description": "After an initial outbreak in China’s Hubei province, the coronavirus (known technically as SARS-CoV-2) is now a worldwide issue. At the time of writing, there have been at least 2,069 confirmed cases across 29 countries outside of China. Italy saw its coronav…", "url": "https://www.highsnobiety.com/p/corona-virus-fashion-industry/", "urlToImage": "https://static.highsnobiety.com/thumbor/Opto1qy1yrWwzBN0sMCvnb1OMwg=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2020/02/26161035/coronavirus-fashion-industry-feat.jpg", "publishedAt": "2020-02-28T15:47:40Z", "content": "After an initial outbreak in China’s Hubei province, the coronavirus (known technically as SARS-CoV-2) is now a worldwide issue.\r\nAt the time of writing, there have been at least 2,069 confirmed cases across 29 countries outside of China. Italy saw its corona… [+5764 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Australian Driver Escapes Death By Literal Inches", "description": "The driver in Wembley, Australia, had to be cut from the car after it was crushed by a tree, but was otherwise okay.", "url": "https://digg.com/video/tree-falls-on-car", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/02/28150219/Screen-Shot-2020-02-28-at-10.01.53-AM.jpg", "publishedAt": "2020-02-28T15:27:10Z", "content": "With the news that the coronavirus is spreading, it's only a matter of time before people start to think—wait, do I have the coronavirus? At this point it's still extremely rare, and your cough is far more likely to be a cold or flu. Still, here's what you sh… [+7 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Guy Shoots Aerosol Can With AK-47, Instantly Regrets It", "description": "Shooting something highly-pressurized from close range? What could have possibly gone wrong?", "url": "https://digg.com/video/shooting-aerosol-can", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/02/28150920/Screen-Shot-2020-02-28-at-10.09.05-AM.jpg", "publishedAt": "2020-02-28T15:27:10Z", "content": "With the news that the coronavirus is spreading, it's only a matter of time before people start to think—wait, do I have the coronavirus? At this point it's still extremely rare, and your cough is far more likely to be a cold or flu. Still, here's what you sh… [+7 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "First look at 8K HDR sport streaming coming to the UK this summer", "description": "BT Sport and Samsung are testing 8K HDR streaming of Premier League and Champions League football matches in the UK. Consumers with 8K QLED TVs will be able to start seeing the streams as early as August.", "url": "https://www.theverge.com/2020/2/28/21157452/bt-sport-8k-hdr-stream-samsung-qled-tv-hands-on-preview-release-date-premier-league", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XaNcXsOxSKwtf9qLWvuSKqxQ75c=/0x164:2347x1393/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19753611/twarren_btsport8khdr_17.jpg", "publishedAt": "2020-02-28T15:16:24Z", "content": "BT Sport and Samsung get ready to host 8K HDR Premier League games While Arsenal were busy producing what can only be described as a 360p performance on the pitch against Olympiakos last night, a production crew was huddled together bringing the football (soc… [+8748 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "First British coronavirus death reported in Japan", "description": "The man, as yet unidentified, had been on board the Diamond Princess cruise ship.", "url": "https://www.aljazeera.com/news/2020/02/british-coronavirus-death-reported-japan-200228135725908.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/24/61a0a2e240094847899742c3aff03820_18.jpg", "publishedAt": "2020-02-28T15:26:21Z", "content": "A British tourist who had been on board the Diamond Princess cruise ship has died from coronavirus.\r\nThe Japanese Ministry of Health said the man was the sixth person - and the first non-Japanese citizen - from the ship to have died. \r\nMore:\r\nThe tourist, the… [+1717 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "United Airlines Pulls Asia Service Because of Sparse Demand", "description": "Coronavirus continues to impact international operations.", "url": "https://www.fool.com/investing/2020/02/28/united-airlines-pulls-asia-service-because-of-spar.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560663/ual-737-taxing-source-ual.jpg", "publishedAt": "2020-02-28T15:33:27Z", "content": "United Airlines Holdings(NASDAQ:UAL) is pulling down capacity to all of Asia, the latest sign of the deepening impact the coronavirus is having on global travel.\r\nU.S. airlines, including United, in January suspended service to China due to the coronavirus, b… [+1241 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Boeing Shares Are Down Today", "description": "Could a coronavirus-related travel slowdown eat into airplane demand?", "url": "https://www.fool.com/investing/2020/02/28/why-boeing-shares-are-down-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560666/boeing-dreamliner-787-10-source-ba.jpg", "publishedAt": "2020-02-28T15:42:00Z", "content": "What happened\r\nShares of Boeing(NYSE:BA) traded down more than 5% on Friday morning, joining the broader coronavirus-fueled market sell-off. Airline stocks have been clobbered particularly hard this week, and a prolonged downturn for airlines could eat into d… [+1663 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Telegraph reporters", "title": "London law firm shuts office and sends home 1,000 staff in coronavirus scare", "description": "A law firm has shut its central London office and sent home more than 1,000 staff after a possible coronavirus case was detected.", "url": "https://www.telegraph.co.uk/news/2020/02/28/london-law-firm-shuts-office-sends-home-1000-staff-coronavirus/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/02/28/TELEMMGLPICT000223669903-xlarge_trans_NvBQzQNjv4BqYh_8IBLdAWMRn6BKLOqynFrbtOsmeJbShQ2ofFEISQo.jpeg?imwidth=1200", "publishedAt": "2020-02-28T15:29:40Z", "content": "A law firm has shut its central London office and sent home more than 1,000 staff after a possible coronavirus case was detected.\r\nBaker McKenzie, which is based near Blackfriars station, took the measure as a precaution, a spokesman said.\r\nThe spokesman adde… [+1129 chars]"}, {"source": {"id": null, "name": "Fivethirtyeight.com"}, "author": "Maggie Koerth, Maggie Koerth https://fivethirtyeight.com/contributors/maggie-koerth/ maggie.koerth-baker@fivethirtyeight.com", "title": "Quarantines Won’t Save Us From Coronavirus", "description": "Coronavirus is coming. Maybe not for you, but certainly for the U.S. The country’s first case of unexplained origin has been identified in California, and Americans need to prepare, according to the Centers for Disease Control and Prevention. That it has arri…", "url": "https://fivethirtyeight.com/features/quarantines-wont-save-us-from-coronavirus/", "urlToImage": "https://fivethirtyeight.com/wp-content/uploads/2020/02/QUARANTINE-16x9-1.png?w=575", "publishedAt": "2020-02-28T15:13:47Z", "content": "Coronavirus is coming. Maybe not for you, but certainly for the U.S. The countrys first case of unexplained origin has been identified in California, and Americans need to prepare, according to the Centers for Disease Control and Prevention.\r\nThat it has arri… [+6484 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Spread in China Mostly Among Families, WHO Says", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-28/coronavirus-spread-in-china-mostly-among-families-report-says", "urlToImage": null, "publishedAt": "2020-02-28T15:45:34Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Scotiabank Halts All Non-Essential Travel as Coronavirus Spreads", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-28/scotiabank-halts-all-non-essential-travel-as-coronavirus-spreads", "urlToImage": null, "publishedAt": "2020-02-28T15:41:21Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Could Shut U.S. Schools, Disrupt Transportation, Says Mulvaney", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-02-28/coronavirus-could-shut-u-s-schools-disrupt-transportation-says-mulvaney-video", "urlToImage": null, "publishedAt": "2020-02-28T15:50:07Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus vs. Seasonal Flu: Impact on Patients, Health Services", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-02-28/coronavirus-vs-seasonal-flu-impact-on-patients-health-services-video", "urlToImage": null, "publishedAt": "2020-02-28T15:35:06Z", "content": null}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Zach Honig", "title": "Asia flight cancellations continue, impacting Japan, Singapore and more", "description": "More bad news for anyone planning to visit a handful of top destinations in Asia in March and April. A number of additional flights have been added to the chopping block, impacting travel throughout the region following growing coronavirus fears, which recent…", "url": "http://thepointsguy.com/news/asia-coronavirus-cancellations/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/04/20190424_Jewel-Changi-Airport-Singapore_ESteinberg-23.jpg?fit=1600%2C1200px&ssl=1", "publishedAt": "2020-02-28T16:00:14Z", "content": "More bad news for anyone planning to visit a handful of top destinations in Asia in March and April. A number of additional flights have been added to the chopping block, impacting travel throughout the region following growing coronavirus fears, which recent… [+1684 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "FAUCI TELLS LAWMAKERS THERE WILL BE MANY MORE CASES IN USA...", "description": "FAUCI TELLS LAWMAKERS THERE WILL BE MANY MORE CASES IN USA... (Top headline, 1st story, link ) Related stories: California patient with UNKNOWN ORIGIN in serious condition... NOT TESTED FOR DAYS... Residents Near Mystery Case Worry and Wonder... How many expo…", "url": "https://news.trust.org/item/20200228151300-j38vl", "urlToImage": "https://d2sh4fq2xsdeg9.cloudfront.net/contentAsset/image/9453664e-affb-4cdc-adcb-a297ec7e3d70/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2020-02-28T16:07:36Z", "content": "WASHINGTON, Feb 28 (Reuters) - A senior U.S. health official told lawmakers that the coronavirus that is spreading globally is unlikely to disappear next year and that many more cases should be expected in the United States, according to a source who attended… [+365 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Steph Willems", "title": "Swiss Government Puts Kibosh on Geneva Motor Show", "description": "The Swiss city of Geneva will not see crowds of international visitors descend on the continent’s premier auto show next week. Instead, ticket holders will stay home, waiting for a refund, while automakers swallow their losses. Blame lies on the country’s gov…", "url": "https://www.thetruthaboutcars.com/2020/02/swiss-government-puts-kibosh-on-geneva-motor-show/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2019/03/2019-GIMS-Geneva-floor.jpg", "publishedAt": "2020-02-28T16:00:06Z", "content": "The Swiss city of Geneva will not see crowds of international visitors descend on the continent’s premier auto show next week. Instead, ticket holders will stay home, waiting for a refund, while automakers swallow their losses.\r\nBlame lies on the country’s go… [+2201 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Michael Cieply", "title": "With Coronavirus Comes A Shot At Media Redemption", "description": "If any good is to come of the coronavirus outbreak, and just now it is hard to see even a glimmer of good, we might consider this: The media will have a shot at redemption. Japan is closing its schools. Saudi Arabia has put Umrah on hold. Cruise ships are dea…", "url": "https://deadline.com/2020/02/with-coronavirus-comes-shot-at-media-redemption-1202870184/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/coronavirus-2.jpg?w=1024", "publishedAt": "2020-02-28T16:00:25Z", "content": "If any good is to come of the coronavirus outbreak, and just now it is hard to see even a glimmer of good, we might consider this: The media will have a shot at redemption.\r\nJapan is closing its schools. Saudi Arabia has put Umrah on hold. Cruise ships are de… [+2723 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Max Grobe", "title": "The Best, Worst & Most WTF Fits of the Week", "description": "This week in the world of fashion, Bottega Veneta showcased its crazy new footwear and accessories at a coronavirus-disrupted Milan Fashion Week, Virgil Abloh put Hadid matriarch Yolanda back on the runway with daughters Bella and Gigi at the Off-White™ Fall/…", "url": "https://www.highsnobiety.com/p/best-worst-wtf-fits-week-feb/", "urlToImage": "https://static.highsnobiety.com/thumbor/dIEMYN3im7ogNEsT24f7DgQH2qw=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2020/02/28150713/ashton_sanders_best_fits_week_feature.jpg", "publishedAt": "2020-02-28T15:39:22Z", "content": "This week in the world of fashion, Bottega Veneta showcased its crazy new footwear and accessories at a coronavirus-disrupted Milan Fashion Week, Virgil Abloh put Hadid matriarch Yolanda back on the runway with daughters Bella and Gigi at the Off-White Fall/W… [+1837 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "3 Stocks That Beat the Coronavirus Sell-Off and Gained This Week", "description": "Even in a disastrous week for the market, there are still a handful of winners out there.", "url": "https://www.fool.com/investing/2020/02/28/3-stocks-that-beat-coronavirus-sell-off-gained.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560527/bad-down-stock-chart.jpg", "publishedAt": "2020-02-28T15:48:05Z", "content": "All of a sudden, the coronavirus pandemic has put the market into panic mode. The S&amp;P 500 and other major indexes have all fallen more than 10% in just four days this week through Thursday, marking the fastest correction, a sell-off of 10% or more from a … [+5557 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andrew Dunn", "title": "Dispensed: Coronavirus spreads, drugmakers scramble to respond, and the latest magic mushroom startups", "description": "Hello, Welcome to Dispensed, Business Insider's weekly healthcare newsletter. With Lydia Ramsey skiing the Colorado slopes, this week's edition is being written — for the very first time — by her colleague, Andrew Dunn. Are you new to the newsletter ? You can…", "url": "https://www.businessinsider.com/dispensed-business-insider-weekly-healthcare-newsletter-february-28-2020-2", "urlToImage": "https://i.insider.com/5c2f7f05bd77305daf6487b5?width=1200&format=jpeg", "publishedAt": "2020-02-28T15:54:00Z", "content": "Hello,\r\nWelcome to Dispensed, Business Insider's weekly healthcare newsletter. With Lydia Ramsey skiing the Colorado slopes, this week's edition is being written — for the very first time — by her colleague, Andrew Dunn.\r\nAre you new to the newsletter? You ca… [+4084 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Bob Brigham", "title": "Psychiatrist sounds the alarm about \"sociopath\" President Trump: \"He’s getting worse\"", "description": "\"He has already severely damaged the country by being a psychopath or sociopath,” Dr. Lance Dodes says", "url": "https://www.salon.com/2020/02/28/psychiatrist-sounds-the-alarm-about-sociopath-president-trump-hes-getting-worse_partner/", "urlToImage": "https://media.salon.com/2020/01/donal-trump-on-acid-010320.jpg", "publishedAt": "2020-02-28T16:01:50Z", "content": "President Donald Trump's psychological problems are getting worse and could be consequential as America faces a potential COVID-19 coronavirus pandemic.\r\nMSNBC's Lawrence O'Donnell on Thursday interviewed Dr. Lance Dodes, a former assistant clinical professor… [+771 chars]"}, {"source": {"id": null, "name": "Gearpatrol.com"}, "author": "Zen Love", "title": "Baselworld Canceled. Switzerland Calls Off Its Major Watch Industry Trade Shows for 2020", "description": "Following the cancelation of other major and minor watch industry trade shows, the largest of them all, Baselworld, is the latest victim of the coronavirus.", "url": "https://gearpatrol.com/2020/02/28/baselworld-2020-watch-trade-show-cancelation-covid-19-coronavirus/", "urlToImage": "https://gearpatrol.com/wp-content/uploads/2020/02/Baselworld-News-gear-patrol-feature.jpg", "publishedAt": "2020-02-28T15:25:07Z", "content": "The last domino has fallen. Announced today, the watch industry’s largest annual trade show Baselworld is the latest victim of the Covid-19 coronavirus outbreak. It follows closely the cancelation of the other major trade show. \r\nNo sooner had SIHH reinvented… [+1507 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Laurie Werner, Contributor, Laurie Werner, Contributor https://www.forbes.com/sites/lauriewerner/", "title": "How French Polynesia Is Protecting Against Covid-19", "description": "As countries internationally grapple with the spread of the coronavirus Covid-19, French Polynesia has instituted regulations that could be copied in other destinations. So far, the islands have no incidence of the virus.", "url": "https://www.forbes.com/sites/lauriewerner/2020/02/28/how-french-polynesia-is-protecting-against-covid-19/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F182570412%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D3000%26cropY1%3D109%26cropY2%3D1796", "publishedAt": "2020-02-28T15:43:27Z", "content": "A typical scene in Bora Bora, one of the main islands in French Polynesia. \r\nFIFA via Getty Images\r\nAs the coronavirus Covid-19 spreads around the world, with travelers worrying about their safety and countries immigration departments tightening restrictions … [+5651 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Whistleblower: HHS handled coronavirus patients without necessary training - Fox News", "description": "A government whistleblower alleges evacuated Americans arriving at California's Travis Air Force Base were not properly handled by federal workers; Jonathan ...", "url": "https://www.youtube.com/watch?v=sBUZCMpKYBk", "urlToImage": "https://i.ytimg.com/vi/sBUZCMpKYBk/maxresdefault.jpg", "publishedAt": "2020-02-28T15:12:35Z", "content": "A government whistleblower alleges evacuated Americans arriving at California's Travis Air Force Base were not properly handled by federal workers; Jonathan Hunt reports from Los Angeles.\r\nFOX News operates the FOX News Channel (FNC), FOX Business Network (FB… [+1689 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Why coronavirus could have slipped into U.S. long before screenings, travel restrictions - Sacramento Bee", "description": "Why coronavirus could have slipped into U.S. long before screenings, travel restrictions Sacramento Bee View Full Coverage on Google News", "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA1MzI4NDEuaHRtbNIBS2h0dHBzOi8vYW1wLnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA1MzI4NDEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-02-28T15:31:00Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Jake Kanter", "title": "Mip TV, Series Mania, Canneseries & Cannes Film Festival Remain Undeterred By Coronavirus", "description": "A series of major TV and film events in France over the coming months are remaining stoic in the face of the growing threat of coronavirus, which has forced organizers of other major business events to abandon their plans. The Geneva Motor Show was one of the…", "url": "https://deadline.com/2020/02/mip-tv-series-mania-canneseries-cannes-film-festival-coronavirus-1202870573/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/pjimage-3-5.jpg?w=1000", "publishedAt": "2020-02-28T15:52:03Z", "content": "A series of major TV and film events in France over the coming months are remaining stoic in the face of the growing threat of coronavirus, which has forced organizers of other major business events to abandon their plans.\r\nThe Geneva Motor Show was one of th… [+3163 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "Stock Market Heads For Worst Week Since 2008 Financial Crisis On Coronavirus Panic", "description": "U.S. stocks continued an historic rout Friday with the Down Jones Industrial Average down 800 points late morning on a growing global panic over the economic impact of the spreading coronavirus. The rate of new infection is falling in China but growing everyw…", "url": "https://deadline.com/2020/02/stock-market-heads-worst-week-2008-coronavirus-1202870602/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2016/06/stock-market-brexit.jpg?w=1024", "publishedAt": "2020-02-28T16:04:44Z", "content": "U.S. stocks continued an historic rout Friday with the Down Jones Industrial Average down 800 points late morning on a growing global panic over the economic impact of the spreading coronavirus.\r\nThe rate of new infection is falling in China but growing every… [+2418 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Bullard: Fed already insured against shocks like coronavirus", "description": "The Federal Reserve has already insured against shocks like the coronavirus, St. Louis Federal Reserve bank president James Bullard said on Friday.", "url": "https://www.reuters.com/article/us-usa-fed-bullard-rates-idUSKCN20M2BC", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-28T15:24:37Z", "content": "FORT SMITH, Ark (Reuters) - The Federal Reserve has already insured against shocks like the coronavirus, St. Louis Federal Reserve bank president James Bullard said on Friday. \r\n“We already lowered rates last year and that was billed as insurance against poss… [+273 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "Luke Dormehl", "title": "Coronavirus fears erase 20% of Apple’s market cap", "description": "Coronavirus has hit Apple shares hard. Despite initially shrugging off the disruption of the outbreak, Apple is currently trading down more than 20% from its record record high. That makes it one of the hardest hit stocks on the Dow Jones Industrial Average t…", "url": "https://www.cultofmac.com/688205/coronavirus-fears-erase-20-of-apples-market-cap/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2016/04/iMac-Chin-Apple-Logo.jpg", "publishedAt": "2020-02-28T15:52:52Z", "content": "Coronavirus has hit Apple shares hard. Despite initially shrugging off the disruption of the outbreak, Apple is currently trading down more than 20% from its record record high.\r\nThat makes it one of the hardest hit stocks on the Dow Jones Industrial Average … [+1815 chars]"}, {"source": {"id": null, "name": "Beckershospitalreview.com"}, "author": "Alia Paavola", "title": "UPMC bans business travel to China, Italy amid coronavirus outbreak - Becker's Hospital Review", "description": "UPMC International is temporarily banning business travel to China and Italy as the coronavirus outbreak continues to spread, according to the Philadelphia Business Journal.", "url": "https://www.beckershospitalreview.com/strategy/upmc-bans-business-travel-to-china-italy-amid-coronavirus-outbreak.html", "urlToImage": null, "publishedAt": "2020-02-28T15:14:00Z", "content": "Alia Paavola - Friday, February 28th, 2020\" onclick=\"window.open(this.href,'win2','status=no,toolbar=no,scrollbars=yes,titlebar=no,menubar=no,resizable=yes,width=640,height=480,directories=no,location=no'); return false;\" rel=\"nofollow\"&gt;\r\nPrint | Email\r\nUP… [+1626 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "IDC: Smartphone market expected to decline by 10.6% in H1 2020", "description": "The detrimental effects of the Coronavirus on the smartphone market will be felt throughout the year and as per the latest IDC projections could lead to a 10.6% decline in shipments for the first half of 2020. On a more long-term basis, the epidemic is expect…", "url": "https://www.gsmarena.com/idc_smartphone_market_expected_to_decline_by_106_in_h1_2020_-news-41757.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/20/02/idc-2020-coronavirus-global-shipments-estimates/-476x249w4/gsmarena_003.jpg", "publishedAt": "2020-02-28T15:32:02Z", "content": "The detrimental effects of the Coronavirus on the smartphone market will be felt throughout the year and as per the latest IDC projections could lead to a 10.6% decline in shipments for the first half of 2020. On a more long-term basis, the epidemic is expect… [+1301 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Abhinav Ramnarayan", "title": "As coronavirus fears grow, private equity eyes distressed investments", "description": "Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, executives told an industry meeting this week.", "url": "https://www.reuters.com/article/us-global-privateequity-distressed-idUSKCN20M2CT", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496550644&w=1200&r=LYNXNPEG1R1HL", "publishedAt": "2020-02-28T15:38:13Z", "content": "BERLIN (Reuters) - Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, executives told an industry meeting this week.… [+3817 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Grater", "title": "Iranian Director Criticizes Authorities Over Travel Ban; ‘Hope’ Wins Berlin Europa Cinemas Award; Venice Plans Classics Season – Global Briefs", "description": "Iranian filmmaker Mohammad Rasoulof, whose latest feature There Is No Evil premieres in the Berlinale’s competition today, has issued a statement criticising his government for continuing to impose a travel ban upon him. “I am sorry that I will not be able to…", "url": "https://deadline.com/2020/02/iranian-director-criticizes-authorities-travel-ban-hope-wins-berlin-europa-cinemas-award-venice-classics-season-1202870645/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/mohammad-rasoulof.jpg?w=782", "publishedAt": "2020-02-28T16:10:06Z", "content": "Iranian filmmaker Mohammad Rasoulof, whose latest feature There Is No Evil premieres in the Berlinale’s competition today, has issued a statement criticising his government for continuing to impose a travel ban upon him. “I am sorry that I will not be able to… [+2320 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Zachary Evans, Zachary Evans", "title": "Stock Markets Continue to Nose Dive as Worst Week Since 2008 Financial Crisis Closes", "description": "Panic over a Wuhan coronavirus pandemic sent stocks tumbling again on Friday morning.", "url": "https://www.nationalreview.com/news/stock-markets-continue-to-nose-dive-as-worst-week-since-2008-financial-crisis-closes/", "urlToImage": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/05/wall-street-faces-6.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-02-28T15:59:52Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "John McCrank", "title": "Explainer: How U.S. markets will function if coronavirus breaks out in NYC", "description": "If an outbreak of coronavirus hits New York, it could cause more sharp selling of stocks, but markets would likely continue to function even if the floor of the New York Stock Exchange had to close.", "url": "https://www.reuters.com/article/us-china-health-exchanges-explainer-idUSKCN20M2BO", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496550752&w=1200&r=LYNXNPEG1R1H9", "publishedAt": "2020-02-28T15:38:12Z", "content": "NEW YORK (Reuters) - If an outbreak of coronavirus hits New York, it could cause more sharp selling of stocks, but markets would likely continue to function even if the floor of the New York Stock Exchange had to close. \r\nNo case has been confirmed in the sta… [+4220 chars]"}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Eric Kohn", "title": "Berlin 2020: Why This Year’s Festival Was Good For ‘Pinocchio’ and Christian Petzold — IndieWire’s Movie Podcast", "description": "Screen Talk, episode 281: The first big European festival of the year launched several promising films. Here are some of the major takeaways from this year's Berlinale.", "url": "https://www.indiewire.com/2020/02/screen-talk-281-berlinale-2020-pinocchio-petzold-1202214297/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2020/02/8326210a.jpg", "publishedAt": "2020-02-28T15:30:46Z", "content": "For journalists and industry people buried in Oscar season, the Berlin Film Festival — aka the Berlinale — is usually a tough proposition. The annual gathering has typically taken place before the Academy Awards and immediately after Sundance, making it diffi… [+1309 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Amanda Mull", "title": "The American Workplace Isn’t Ready for an Epidemic", "description": "Lax labor laws and little sick leave put all kinds of workers at unnecessary risk of coronavirus.", "url": "https://www.theatlantic.com/health/archive/2020/02/coronavirus-could-hit-american-workers-especially-hard/607213/", "urlToImage": "https://cdn.theatlantic.com/thumbor/cJZO0d2Cgnx3qTO_uZDu6as3QXw=/11x572:7124x4276/960x500/media/img/mt/2020/02/GettyImages_1203626910/original.jpg", "publishedAt": "2020-02-28T15:35:32Z", "content": "As the coronavirus that has sickened tens of thousands in China spreads worldwide, it now seems like a virtual inevitability that millions of Americans are going to be infected with the flu-like illness known as COVID-19. Public health officials in the United… [+5967 chars]"}, {"source": {"id": null, "name": "Talkingpointsmemo.com"}, "author": "Nicole Lafond", "title": "Where Things Stand: Trump Makes A Pandemic Political", "description": "And why wouldn't he? As stock markets plummet -- the Dow Jones has plunged the most since the 2008 recession in recent days -- and lawmakers on both sides of the aisle criticize President Trump's handling of the spread of the coronavirus, the President is loo…", "url": "https://talkingpointsmemo.com/edblog/where-things-stand-feb-28-2020-trump-pandemic-coronavirus-political", "urlToImage": "https://cdn.talkingpointsmemo.com/wp-content/uploads/2020/02/GettyImages-1209136716-804x536.jpg", "publishedAt": "2020-02-28T15:52:14Z", "content": "And why wouldn’t he?\r\nAs stock markets plummet — the Dow Jones has plunged the most since the 2008 recession in recent days — and lawmakers on both sides of the aisle criticize President Trump’s handling of the spread of the coronavirus, the President is look… [+208 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "PURA Sales and Production Not Impacted by Coronavirus - COVID-19", "description": "Puration, Inc. (USOTC: PURA) today announced the Coronavirus is not impacting PURA sales or production. In light of the public market performance reportedly in reaction to Coronavirus concerns, PURA management believed it worthwhile to emphasize that the Coro…", "url": "https://news.yahoo.com/pura-sales-production-not-impacted-154700775.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Nm1BWbT19snK.L4Nac5I6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTMyO2g9MzI-/https://s.yimg.com/uu/api/res/1.2/4Vwcf02YG0twnlMkGy3VHg--~B/aD0xNjt3PTE2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/prnewswire.com/eb97ba6d02d45bb500a6085b74ec9f97", "publishedAt": "2020-02-28T15:47:00Z", "content": "DALLAS, Feb. 28, 2020 /PRNewswire/ -- Puration, Inc. (USOTC: PURA) today announced the Coronavirus is not impacting PURA sales or production. In light of the public market performance reportedly in reaction to Coronavirus concerns, PURA management believed it… [+2597 chars]"}, {"source": {"id": null, "name": "King5.com"}, "author": null, "title": "DocuSign cancels in-person conference over coronavirus concerns - KING5.com", "description": "A large, one-day event featuring tech industry leaders and consumers is going 'virtual' following concerns of the spreading coronavirus.", "url": "https://www.king5.com/article/news/health/coronavirus/docusign-chooses-to-livestream-tech-event-due-to-coronavirus-concerns/281-9c082179-c7dd-4e03-8863-365eecd23f8c", "urlToImage": "https://media.king5.com/assets/KING/images/40439bf1-678c-45db-a705-9e36f0faa263/40439bf1-678c-45db-a705-9e36f0faa263_1140x641.jpg", "publishedAt": "2020-02-28T16:00:00Z", "content": "SAN FRANCISCO DocuSign's one-day conference Momentum in San Francisco will occur as livestream events only due to growing concerns over the spreading coronavirus (COVID-19).\r\nOn the event page's FAQ, a statement from DocuSign explains the company has \"been cl… [+1482 chars]"}, {"source": {"id": null, "name": "Zacks.com"}, "author": "Zacks Investment Research", "title": "Tech Daily: Coronavirus, Google Win & More - Zacks.com", "description": "The coronavirus scare is really hitting the market and tech stocks will likely hurt more than others.", "url": "https://www.zacks.com/stock/news/788622/tech-daily-coronavirus-google-win-amp-more", "urlToImage": "https://staticx-tuner.zacks.com/images/articles/main/bf/827.jpg", "publishedAt": "2020-02-28T15:26:18Z", "content": "The coronavirus is impacting more than just human beings, as the world feels for the first time the problem with making one country its manufacturing capital. Chinese authorities are struggling to control the spread of the disease, cutting off transportation,… [+8542 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Dividend Stocks Are Screaming-Hot Buys Once Coronavirus Fears Fade", "description": "You don't grab a falling knife. But you don't want to pass up a bargain. The coronavirus from China has revealed a host of potential bargains in the market's minefield. Let things settle. Wait for a nothing day with the market closing slightly higher, and som…", "url": "https://finance.yahoo.com/news/dividend-stocks-screaming-hot-buys-160926112.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wkdvCmeG98_8G1wz6i8SYA--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/560884cbc555bc03391ca066b0ad8f12", "publishedAt": "2020-02-28T16:09:26Z", "content": "You dont grab a falling knife. But you dont want to pass up a bargain. The coronavirus from China has revealed a host of potential bargains in the markets minefield. Let things settle. Wait for a nothing day with the market closing slightly higher, and some (… [+4160 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Paul A. Eisenstein", "title": "Geneva Motor Show canceled amid Swiss ban on large gatherings", "description": "In an unprecedented move, organizers have canceled the Geneva International Motor Show, one of the global auto industry’s largest public events, due to concerns about the spreading coronavirus.", "url": "https://www.nbcnews.com/business/autos/geneva-motor-show-canceled-amid-swiss-ban-large-gatherings-n1144856", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2020_09/3248331/200228-geneva-auto-show-canceled-ew-1005a_b7820cb050b8b441d4ae675d14c6d9eb.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T15:21:07Z", "content": "In an unprecedented move, organizers have canceled the Geneva International Motor Show, one of the global auto industrys largest public events, due to concerns about the spreading coronavirus.\r\nThe 90th running of the show, which was to have begun March 3 wit… [+2217 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Tom Sunderland", "title": "ONE Championship 2020: 'King of the Jungle' Results and Highlights", "description": "Janet Todd dethroned Stamp Fairtex in stunning fashion to become the new women's a tomweight kickboxing champion  when the 2020 ONE Championship returned in King of the Jungle on Friday...", "url": "https://bleacherreport.com/articles/2878390-one-championship-2020-king-of-the-jungle-results-and-highlights", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/854/941/hi-res-bdbef64f6b0d35956102c407183c67a5_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-02-28T15:23:52Z", "content": "Mike Roach/Getty Images\r\nJanet Todd dethroned Stamp Fairtex in stunning fashion to become the new women's atomweight kickboxing champion when the 2020 ONE Championship returned in King of the Jungle on Friday.\r\nFairtex came into the clash as the heavy favouri… [+6046 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Nahila Bonfiglio", "title": "Alissa Violet is in Italy—and fans are worried she’ll get coronavirus", "description": "'Alissa get out of there coronavirus just hit Milan.' The post Alissa Violet is in Italy—and fans are worried she’ll get coronavirus appeared first on The Daily Dot.", "url": "https://www.dailydot.com/unclick/alissa-violet-milan-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/02/Alissa_Violet_Milan_coronavirus.jpg", "publishedAt": "2020-02-28T15:19:59Z", "content": "Alissa Violet is far more than just a YouTuber.\r\nThe popular content creator has been working as a model for years, pairing the career with her uploads to YouTube and Instagram. Recently, she even participated in Milan Fashion Week, walking for Philipp Plein.… [+1970 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "HHS watchdog to review agency's coronavirus response", "description": "The decision comes as the Trump administration's response to the virus is under scrutiny.", "url": "https://www.cbsnews.com/news/coronavirus-health-human-services-inspector-general-response/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/26/637a1a45-5c39-44b2-984c-0d056b4918db/thumbnail/1200x630/e2447973dfdb28522c0b6183cc1e095f/gettyimages-1203531103.jpg", "publishedAt": "2020-02-28T16:08:08Z", "content": "The Health and Human Services' Office of Inspector General will conduct a comprehensive review of the agency's coronavirus response efforts, CBS News reports. \r\nThe news comes after an HHS official filed a complaint alleging U.S. workers aided coronavirus eva… [+1533 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Susan Heavey", "title": "Trump administration defends coronavirus response from rising criticism", "description": "The Trump administration on Friday sought to reassure Americans that it was responding to the threat of a U.S. coronavirus outbreak, as the flu-like illness spread to more countries and stock markets dropped sharply again.", "url": "https://www.reuters.com/article/us-china-health-usa-idUSKCN20M2BI", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200228&t=2&i=1496548268&w=1200&r=LYNXNPEG1R1H4", "publishedAt": "2020-02-28T15:36:02Z", "content": "WASHINGTON (Reuters) - The Trump administration on Friday sought to reassure Americans that it was responding to the threat of a U.S. coronavirus outbreak, as the flu-like illness spread to more countries and stock markets dropped sharply again. \r\nVice Presid… [+3735 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Galaxy S20 sales 50% lower than S10, but it's not all Samsung's fault", "description": "According to the South Korea Herald, sales of the Galaxy S20 phones were down 50 percent compared to their predecessors a year earlier. While the latest devices sold around 70,800 units in Korea on Thursday, the Galaxy S10 line, which launched in March 2019, …", "url": "https://www.techspot.com/news/84204-galaxy-s20-sales-50-lower-than-s10-but.html", "urlToImage": "https://static.techspot.com/images2/news/ts3_thumbs/2020/02/2020-02-27-ts3_thumbs-88d.jpg", "publishedAt": "2020-02-28T15:27:00Z", "content": "What just happened? Samsungs new Galaxy S20 phones went on sale in its home region of South Korea yesterday, and things have got off to a slow start. But the sluggish sales have little to do with the handsets themselves: its yet another effect of the coronavi… [+1349 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dow Drops 800 At Open, Extending Worst Week Since Financial Crisis | Velshi & Ruhle | MSNBC - MSNBC", "description": "Dow Drops 800 At Open, Extending Worst Week Since Financial Crisis | Velshi & Ruhle | MSNBC MSNBC Coronavirus just sent the Dow crashing 1,100 points and it could get worse Yahoo Finance Dow Futures Extend Slump Amid Worst Stock Market Slide Since Global Fina…", "url": "https://www.youtube.com/watch?v=oqMFKrdqBH0", "urlToImage": null, "publishedAt": "2020-02-28T15:34:31Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will coronavirus lead to a global recession? - The Sun", "description": "Market analyst Victoria Scholar explains to Sun Online why coronavirus is affecting financial markets, and whether the outbreak could lead to a global recess...", "url": "https://www.youtube.com/watch?v=r8WT89nWip8", "urlToImage": "https://i.ytimg.com/vi/r8WT89nWip8/maxresdefault.jpg", "publishedAt": "2020-02-28T16:03:11Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Rupee dives 60 paise to 72.21 against dollar", "description": "Investor sentiment remained fragile amid sustained foreign fund outflows and concerns over the impact of corona virus outbreak on the global economy.", "url": "https://economictimes.indiatimes.com/markets/forex/rupee-dives-60-paise-to-72-21-against-dollar/articleshow/74404000.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74403968,width-1070,height-580,imgsize-193959,overlay-etmarkets/photo.jpg", "publishedAt": "2020-02-28T15:26:51Z", "content": "Mumbai: The Indian rupee plunged by 60 paise to settle at 72.21 (provisional) against the US dollar on Friday, tracking heavy sell-offs in domestic equities and sustained foreign fund outflows.\r\nAt the interbank foreign exchange market, the local currency ope… [+984 chars]"}, {"source": {"id": null, "name": "Newsarama.com"}, "author": null, "title": "12 New BLOODSHOT Stills", "description": "Can nanotechnology neat coronavirus at the box office?", "url": "https://www.newsarama.com/49233-bloodshot-stills.html", "urlToImage": "https://img.purch.com/h/1000/aHR0cDovL3d3dy5uZXdzYXJhbWEuY29tL2ltYWdlcy9pLzAwMC8yNzcvMDQ1L29yaWdpbmFsL2Jsb29kc2hvdC1CTE9PRFNIT1QtUEstMDlfREYtMDc2NzYuanBn", "publishedAt": "2020-02-28T15:44:00Z", "content": "Now a fortnight away from release, Sony has released 12 new behind-the-scenes and scene stills from Vin Diesel's Bloodshot, based on the Valiant Entertainment character.\r\n\"Vin Diesel stars as Ray Garrison, a soldier recently killed in action and brought back … [+503 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Why today's market move is not surprising: Strategist", "description": "Stocks are plunging today as the markets continue to react to the escalation of the coronavirus. RBC Capital Markets Head of U.S. Equity Strategy Lori Calvasina says the drop in the markets today wasn't surprising. She joins Yahoo Finance's On the Move panel …", "url": "https://finance.yahoo.com/video/why-todays-market-move-not-160632543.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/yooT2ZaGnl0.iH61E6j50g--~B/aD0zMzM2O3c9NTkzODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/28/5e593a8a2d85403b50d4b656/5e593a8a2d85403b50d4b657_o_U_v2.jpg", "publishedAt": "2020-02-28T16:06:32Z", "content": "Stocks are plunging today as the markets continue to react to the escalation of the coronavirus. RBC Capital Markets Head of U.S. Equity Strategy Lori Calvasina says the drop in the markets today wasn't surprising. She joins Yahoo Finance's On the Move panel … [+10 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "This Week On IBD Live (Feb. 28)", "description": "The stock market correction continued this week, as the major indexes are on track for one of their worst week's in history. Stocks on our radar this week included Alibaba, Amazon and several stocks working on coronavirus vaccines like Moderna, Repligen and G…", "url": "https://finance.yahoo.com/video/week-ibd-live-feb-28-161001050.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/7a75RFZlRPeNBpijQwfxeg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/29/5e59acf89947850cd2ed757e/5e59acfbf5f0a60001cc33eb_1280x720_FES_v1.jpg", "publishedAt": "2020-02-28T16:10:01Z", "content": "The stock market correction continued this week, as the major indexes are on track for one of their worst week's in history. Stocks on our radar this week included Alibaba, Amazon and several stocks working on coronavirus vaccines like Moderna, Repligen and G… [+14 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mark Vickery", "title": "Uncertainty the Biggest Factor in Coronavirus Sell-Off", "description": "The unknowns related to the global coronavirus crisis continues to weigh on equities, and will continue to do so until data proves the threat of pandemic is eased.", "url": "https://finance.yahoo.com/news/uncertainty-biggest-factor-coronavirus-sell-151603532.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pdnCjpaQRSQkimWkBVUpRg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNzA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/ArdJTTkHt_qi5cSG4xr1xA--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/fcbbd4b49440f37b1c78b6f2d5d7ce59", "publishedAt": "2020-02-28T15:16:03Z", "content": "Friday, February 28, 2020\r\nPre-market futures are getting hammered again this morning, following the single highest point drop in the history of the Dow Jones yesterday. The Dow at this hour looks to open down another 500 points, the Nasdaq is off 200 and the… [+4030 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Coronavirus outbreak 'getting bigger', says WHO, warning of spread worldwide - Times of India", "description": "Coronavirus outbreak 'getting bigger', says WHO, warning of spread worldwide Times of India Coronavirus live update: Global outbreak risk at a very high level, says WHO chief Livemint Coronavirus: Live Coverage and Updates The New York Times Liberty Vittert: …", "url": "https://timesofindia.indiatimes.com/world/china/coronavirus-outbreak-getting-bigger-says-who-warning-of-spread-worldwide/articleshow/74404627.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74405005,width-1070,height-580,imgsize-134521,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-28T15:49:00Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Adrianna Rodriguez, USA TODAY", "title": "Coronavirus live updates: US workers didn't have proper gear to work with evacuees, whistleblower says", "description": "A whistleblower claims HHS employees weren't prepared to work with evacuees, another Diamond Princess passenger has died, and more coronavirus news.", "url": "https://news.yahoo.com/us-workers-didnt-proper-gear-130000439.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UU2QiFoVfgfc1FPwOz9Rxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/.F9JWB1Unh6pQtvSbPirFA--~B/aD0zODIwO3c9NTczMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/bfe85bac98164a47992b9721d1051301", "publishedAt": "2020-02-28T15:39:56Z", "content": "The coronavirus outbreak that first exploded in Wuhan, China, has now infected more than 83,000 people and killed nearly 3,000 people globally as of Friday morning.\r\nChina, though hardest hit, has seen lower numbers of new infections, with 327 additional case… [+8664 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Phoebe Wall Howard and Nathan Bomey, Detroit Free Press and USA TODAY", "title": "Geneva Motor Show canceled as coronavirus raises questions about New York auto show, Detroit auto show", "description": "The Geneva Motor Show has been canceled due to the coronavirus. Could the New York and Detroit auto shows be next?", "url": "https://finance.yahoo.com/news/geneva-motor-show-canceled-coronavirus-155440653.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7k61LS4umCrfzFYfVHxjtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/IOOpC.hEDCGLasr.eOIN7g--~B/aD0xNjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/9b7b6d0845477533b0f3d893934ac01a", "publishedAt": "2020-02-28T15:54:40Z", "content": "The Geneva Motor Show, which was poised to start next week, has been canceled. The Beijing auto show has been \"postponed.\" \r\nAnd now the coronavirus, whose spread led to those two decisions, is also forcing leaders of April's New York International Auto Show … [+3555 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "White House adviser: More U.S. coronavirus cases likely but won't necessarily 'skyrocket'", "description": "The number of additional coronavirus cases in the United States is likely to increase but that does not mean they will \"skyrocket\" in North America, White House economic adviser Larry Kudlow said on Friday.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/0oL5Kh0VFSQ/white-house-adviser-more-u-s-coronavirus-cases-likely-but-wont-necessarily-skyrocket-idUSKCN20M2FV", "urlToImage": null, "publishedAt": "2020-02-28T16:03:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Stocks dive over COVID-19 fears - CBC News", "description": "Stocks dive over COVID-19 fears CBC News Stocks sink again, heading for the worst week since 2008 KSL.com Wall Street bounce too little, too late as world stocks post shock weekly decline Reuters Market Meltdown: Wall Street on Edge Over Coronavirus, Recessio…", "url": "https://www.youtube.com/watch?v=yOdZ5XEGei4", "urlToImage": null, "publishedAt": "2020-02-28T15:39:49Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Leon Cooperman: Mankind Will Conquer This Problem", "description": "The guru appeared on CNBC and talked business as well as covid-19 Continue reading...", "url": "https://finance.yahoo.com/news/leon-cooperman-mankind-conquer-problem-161109147.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-28T16:11:09Z", "content": "Leon Cooperman (Trades, Portfolio) is the founder and chairman of Omega Advisors. Previously, Cooperman was the CEO and Chairman of Goldman Sachs Asset Management. He worked at Goldman Sachs for 25 years before leaving in 1991 and starting Omega Advisors. Aft… [+1556 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "WHO raises global risk for coronavirus to very high - Livemint", "description": "WHO raises global risk for coronavirus to very high Livemint WHO D-G on coronavirus outbreak: \"We've increased our assessment of the risk to 'very high'\" FRANCE 24 English New COVID-19 epidemic at ‘decisive point’: WHO chief The Hindu WHO: Coronavirus spreadi…", "url": "https://www.livemint.com/news/world/coronavirus-risk-at-very-high-global-level-says-who-chief-11582905373497.html", "urlToImage": "https://images.livemint.com/img/2020/02/28/600x338/TedrosAdhanom_1581435044169_1582905854345.JPG", "publishedAt": "2020-02-28T16:06:08Z", "content": "GENEVA :\r\nThe World Health Organization (WHO) raised its global risk assessment for the novel coronavirus to very high\" from high\" as several countries are struggling with containment.WHO director-general Tedros Adhanom Ghebreyesus said its concerning that ca… [+1832 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Abhinav Ramnarayan and Chibuike Oguh", "title": "As coronavirus fears grow, private equity eyes distressed investments", "description": "Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, executives told an industry meeting this week. Industry officials…", "url": "https://finance.yahoo.com/news/coronavirus-fears-grow-private-equity-153813246.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Rk7mMDmnfwU_7EQeVUwoPA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/tTV8cxkM5Q5eSbPXQGGNTg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e3b611b0dd6adde375cfeea411ae9adc", "publishedAt": "2020-02-28T15:38:13Z", "content": "By Abhinav Ramnarayan and Chibuike Oguh\r\nBERLIN (Reuters) - Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, execu… [+3629 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "info@rideapart.com (Dustin Wheelen)", "title": "Geneva Motor Show Canceled Due To Coronavirus Threat", "description": "Swiss authorities ban large gatherings to limit the spread.", "url": "https://autos.yahoo.com/geneva-motor-show-canceled-due-160521348.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/i2mhiYKS6cAkOocU73WOgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/qIajaht8gDOoqLDrebkNZw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rideapart_us_627/308603ce876c76b2a89542f775bd8c71", "publishedAt": "2020-02-28T16:05:21Z", "content": "GIMS\r\nSwiss authorities ban large gatherings to limit the spread.\r\nThe Coronavirus Disease 2019 (COVID-19) reached several European nations in the past month. Originating in Chinas Wuhan region, the virus has infected 650 people and caused 17 deaths in Italy,… [+1944 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Abhinav Ramnarayan and Chibuike Oguh", "title": "As coronavirus fears grow, private equity eyes distressed investments", "description": "Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, executives told an industry meeting this week. Industry officials…", "url": "https://finance.yahoo.com/news/coronavirus-fears-grow-private-equity-153813152.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ylCWGHSdMx2gLyqdwVW2qg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/VyffYf0lQ0Kae1kLuiUSaw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/e3b611b0dd6adde375cfeea411ae9adc", "publishedAt": "2020-02-28T15:38:13Z", "content": "By Abhinav Ramnarayan and Chibuike Oguh\r\nBERLIN (Reuters) - Major private equity firms, which have built up big distressed debt funds in recent years, are ready to snap up assets on the cheap if the coronavirus outbreak causes deeper market disruptions, execu… [+3629 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mexico Confirms Coronavirus Case, Second Case Being Verified", "description": "(Bloomberg) -- A 35-year-old man was confirmed as the first coronavirus case in Mexico and a second case is awaiting final testing, the country’s deputy health minister said on Friday.The first patient has a mild case and has been put in quarantine along with…", "url": "https://finance.yahoo.com/news/mexico-confirms-coronavirus-case-second-151832212.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/3Y6aW3rcSWughAmgi0wxbA--~B/aD0yMzQ0O3c9NDA1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/5caea0c9c2312a5326ff583d9d4c7dd6", "publishedAt": "2020-02-28T15:18:32Z", "content": "(Bloomberg) -- A 35-year-old man was confirmed as the first coronavirus case in Mexico and a second case is awaiting final testing, the countrys deputy health minister said on Friday.\r\nThe first patient has a mild case and has been put in quarantine along wit… [+2201 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Honor Whiteman", "title": "Letter from the Editor: The importance of accurate reporting - Medical News Today", "description": "Letter from the Editor: The importance of accurate reporting Medical News Today Coronavirus: Big breakthrough in COVID-19 treatment! Scientists decode how it infects lungs The Financial Express How long can coronavirus survive on surfaces? Times of India The …", "url": "https://www.medicalnewstoday.com/articles/letter-from-the-editor-the-importance-of-accuracy", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2020/02/iStock-1065782416-1200x628.jpg", "publishedAt": "2020-02-28T15:22:30Z", "content": "In recent weeks, the novel coronavirus, or COVID-19, has dominated the media across the globe.\r\nAccording to a telebriefing that the Centers for Disease Control and Prevention (CDC) held earlier this week, we could be looking at a pandemic in the United State… [+3109 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Fmr. Ebola Czar: U.S 'so far behind' on Coronavirus response", "description": "The former White House Ebola Coordinator Ron Klain joins Hallie Jackson to speak about the Trump administration's response to the Coronavirus crisis. Klain argues that now is not the time to hear from those \"playing politics,\" and instead the response effort …", "url": "https://www.msnbc.com/hallie-jackson/watch/fmr-ebola-czar-u-s-so-far-behind-on-coronavirus-response-79616069607", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_hallie_klain_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T16:00:33Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Rep. Garamendi: CDC made 'very gross mistake' with Coronavirus evacuees", "description": "Congressman John Garamendi (D-CA) joins Hallie Jackson to discuss the ongoing Coronavirus crisis. With the first newly transmitted case occurring in his district, Garamendi fires at the CDC for \"failing to take immediate, aggressive action\" when receiving eva…", "url": "https://www.msnbc.com/hallie-jackson/watch/rep-garamendi-cdc-made-very-gross-mistake-with-coronavirus-evacuees-79614021568", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_hallie_garamendi_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T15:34:24Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "CVS warns there could be a hand sanitizer shortage", "description": "US drug stores, retailers and suppliers are racing to keep up with surging interest for cleaning products as fears over coronavirus intensify.", "url": "https://www.cnn.com/2020/02/28/business/hand-sanitizers-wipes-cvs-walgreens-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228095745-walgreens-hand-sanitizer-file-restricted-super-tease.jpg", "publishedAt": "2020-02-28T15:43:31Z", "content": null}, {"source": {"id": "national-review", "name": "National Review"}, "author": "David Beckworth, David Beckworth", "title": "It’s Time for the Fed to Take On the Coronavirus Threat", "description": "The central bank can’t stop a supply shock, but it can mitigate the fallout.", "url": "https://www.nationalreview.com/2020/02/its-time-for-the-fed-to-take-on-the-coronavirus-threat/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/stock-market-coronavirus.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-02-28T15:33:28Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "'Tip of the iceberg': Doctor raises alarm over coronavirus-related drug shortages", "description": "Dr. Matt McCarthy, author of \"Superbugs: The Race To Stop an Epidemic,\" discusses coronavirus-related drug shortages with Stephanie Ruhle. \"We're just starting to see the tip of the iceberg with this,\" he says. \"Things are not fine.\"", "url": "https://www.msnbc.com/stephanie-ruhle/watch/-tip-of-the-iceberg-doctor-raises-alarm-over-coronavirus-related-drug-shortages-79615045726", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_ruhle_drug_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-28T15:44:50Z", "content": null}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "WHO bumps coronavirus threat assessment to ‘very high’ global risk", "description": "World Health Organization (WHO) is now worsening its risk assessment of the coronavirus to a “very high” on the global level. The virus has already spread to at least 48 countries besides its hotbed, China. Read Full Article at RT.com", "url": "https://www.rt.com/news/481948-who-coronavirus-risk-upgrade/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e593da985f540083d6c47e1.JPG", "publishedAt": "2020-02-28T16:03:21Z", "content": "\"We have now increased our assessment of the risk of spread and the risk of impact of COVID-19 to very high at global level,\" WHO Director-General Tedros Adhanom Ghebreyesus told media at the agency's headquarters in Geneva.\r\nAs of Friday, 4,351 cases, includ… [+332 chars]"}, {"source": {"id": null, "name": "Eater.com"}, "author": "Jenny G. Zhang", "title": "Corona Beer Still Struggling With Confused Consumers Amid Coronavirus Fears", "description": "There is no link between COVID-19 and Corona beer", "url": "https://www.eater.com/2020/2/28/21157594/coronavirus-covid-19-corona-beer-confusion-continues", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mYIyjswcgm9H2jtMeHl3AGlepJo=/0x331:4623x2751/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19753769/shutterstock_672353038.jpg", "publishedAt": "2020-02-28T16:09:31Z", "content": "The maker of Corona Beer is in the midst of a $40 million marketing push for a Corona hard seltzer, unfortunately coinciding with a worldwide panic over the novel coronavirus COVID-19. | Photo: Goran Jakus /Shutterstock There is no link between COVID-19 and C… [+2662 chars]"}]