[{"source": {"id": null, "name": "Livescience.com"}, "author": "Stephanie Pappas", "title": "How does the new coronavirus spread? - Livescience.com", "description": "How does the new coronavirus spread? Livescience.com How do I know if I have COVID-19? A guide to symptoms CTV News Best practices to take action against COVID-19 | ABC NEWS LIVE PRIME ABC News Shaun Francis: If the virus hits Canada, our hospitals will be ov…", "url": "https://www.livescience.com/how-coronavirus-spreads.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3hyoap4K9TnihHRjK8swsF-1200-80.jpg", "publishedAt": "2020-03-03T12:16:00Z", "content": "The new coronavirus SARS-CoV-2 appears to be fairly easily spread. But the good news is that it's not among the most transmissible diseases out there.\r\nThe new coronavirus spreads mostly through person-to-person contact within about a 6-foot (1.8 meters) radi… [+4138 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sarah Nassauer", "title": "Retailers Confront Coronavirus Uncertainty - The Wall Street Journal", "description": "Retailers Confront Coronavirus Uncertainty The Wall Street Journal Target shares fall on mixed fourth-quarter results CNBC Target Earnings Top, Sales Miss; Target Stock Falls Investor's Business Daily Target posts strong online sales, but revenue comes up sho…", "url": "https://www.wsj.com/articles/retailers-confront-coronavirus-uncertainty-11583235300", "urlToImage": "https://images.wsj.net/im-159731/social", "publishedAt": "2020-03-03T13:05:00Z", "content": "Target Corp., Kohls Corp. and other retailers that posted lackluster holiday results must now confront the uncertainty caused by the coronavirus, which could help or hurt sales in the coming months.\r\nIn recent days, grocers have logged strong sales as some co… [+136 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19: WHO says world is in uncharted territory - CNA", "description": "COVID-19: WHO says world is in uncharted territory CNA We can push coronavirus back, says WHO chief The Straits Times Protective gear to fight COVID-19 'rapidly depleting': WHO CNA View Full coverage on Google News", "url": "https://www.youtube.com/watch?v=WYxU2CkFBMU", "urlToImage": null, "publishedAt": "2020-03-03T12:44:16Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Tim Hardwick", "title": "Apple Stock Rebounded Monday to Record Biggest Single-Day Move in 11 Years", "description": "AAPL shares surged 9.3 percent on Monday as the U.S. stock market rebounded and Apple's rating was upgraded by an analyst who said the company was more prepared than its competitors to absorb the impact of the coronavirus outbreak (via Reuters ). Oppenheimer …", "url": "https://www.macrumors.com/2020/03/03/apple-stock-rebounds-7-percent/", "urlToImage": "https://images.macrumors.com/article-new/2020/02/green-aapl-logo.jpg", "publishedAt": "2020-03-03T12:32:01Z", "content": "AAPL shares surged 9.3 percent on Monday as the U.S. stock market rebounded and Apple's rating was upgraded by an analyst who said the company was more prepared than its competitors to absorb the impact of the coronavirus outbreak (via Reuters). Oppenheimer r… [+1618 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, John Bacon, USA TODAY", "title": "Coronavirus live updates: US cases surpass 100 with 6 deaths; China sees 'coming victory'", "description": "The coronavirus death toll tripled, to six, in the United States but Surgeon General Jerome Adams says not to panic.", "url": "https://www.usatoday.com/story/news/health/2020/03/03/coronavirus-live-updates-covid-19-california-cdc-numbers-deaths/4929223002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/03/USAT/938aedaa-fed3-4d78-8f22-a4819b717e24-AP20063029402914.jpg?crop=3758,2114,x0,y191&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-03T12:21:48Z", "content": "We answer the often searched question: \"What are the symptoms of coronavirus versus the flu?\"\r\nUSA TODAY\r\nThe number of coronavirus cases across the nation surged to more than 100 on Tuesday with six deaths blamed on the outbreak.\r\nThat doesn't mean it's time… [+4077 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Carmen Reinicke), Carmen Reinicke", "title": "Morgan Stanley: 78% of investors expect stocks to tumble during the first 3 three months under a Democratic president", "description": "Reuters Political uncertainty remains a negative for markets going forward, according to a Monday note from Morgan Stanley. A survey by Morgan Stanley conducted in October showed that as many as 78% of investors expect stocks to decline in the first three mon…", "url": "https://www.businessinsider.com/stock-market-investors-expect-fall-democrat-elected-president-morgan-stanley-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5e5e4dc6fee23d733869b142-2400/2020-03-02t153059z1lynxmpeg211qertroptp4usa-trump.jpg", "publishedAt": "2020-03-03T13:02:44Z", "content": "Reuters\r\n<ul><li>Political uncertainty remains a negative for markets going forward, according to a Monday note from Morgan Stanley. </li><li>A survey by Morgan Stanley conducted in October showed that as many as 78% of investors expect stocks to decline in t… [+1610 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Eleanor Cummins, Emanuel Maiberg", "title": "How Funeral Directors Are Preparing for Coronavirus", "description": "As the novel disease spreads around the globe, members of the deathcare industry are sharing tips and ordering respirators.", "url": "https://www.vice.com/en_us/article/bvg53q/how-funeral-directors-are-preparing-for-coronavirus", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e5d5db602e8470097cab93f/lede/1583178510256-GettyImages-1083148536.jpeg?crop=1xw:0.8465011286681715xh;center,center&resize=1200:*", "publishedAt": "2020-03-03T13:00:00Z", "content": "The world is gearing up for the coronavirus. Preppers are stocking sterile gloves and cans of beans. Musicians are postponing long-anticipated concerts. And funeral directors are cleaning out their refrigerators. \r\n The novel disease has infected 89,000 and k… [+6652 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Aaron Gordon, Jason Koebler", "title": "Don’t Let Coronavirus Scare You Away From Public Transit", "description": "People think public transportation is a much bigger cause of pandemics spreading than it actually is.", "url": "https://www.vice.com/en_us/article/z3bw85/dont-let-coronavirus-scare-you-away-from-public-transit", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e5d5360f72eb6009df886d2/lede/1583174936804-GettyImages-1198472710.jpeg?crop=1xw:0.8431xh;0xw,0.1338xh&resize=1200:*", "publishedAt": "2020-03-03T13:00:00Z", "content": "On Sunday night, New York Governor Andrew Cuomo announced that the city had its first case of coronavirus. The patient, a health care worker who just returned from Iran, lives in Manhattan. She is a health care worker, Cuomo tweeted, she knew to take precauti… [+5553 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Seamus Bellamy", "title": "Making your own hand sanitizer is a cinch", "description": "Since the latest coronavirus broke cover and started scaring the bejaysus out of everyone, you may have noticed that the supplies that folks think they’ll need in the event of a pandemic are becoming hard to find. I'm paranoid about potential pandemics, but I…", "url": "https://boingboing.net/2020/03/03/making-your-own-hand-sanitizer.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/alcohol-gel-818254_1280.jpg?fit=1200%2C783&ssl=1", "publishedAt": "2020-03-03T12:20:11Z", "content": "Since the latest coronavirus broke cover and started scaring the bejaysus out of everyone, you may have noticed that the supplies that folks think theyll need in the event of a pandemic are becoming hard to find.\r\nI'm paranoid about potential pandemics, but I… [+3322 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Man spies on scammers through their own security cameras", "description": "Jim Browning ( previously at Boing Boing) turned the tables on another scamming outfit. But this isn't just a video showing a savvy user wasting a scammer's time: he gained access to the criminals' computers and even their office CCTV system. The result is in…", "url": "https://boingboing.net/2020/03/03/man-spies-on-scammers-through.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/scammers.jpg?fit=1200%2C594&ssl=1", "publishedAt": "2020-03-03T13:04:57Z", "content": "Jim Browning (previously at Boing Boing) turned the tables on another scamming outfit. But this isn't just a video showing a savvy user wasting a scammer's time: he gained access to the criminals' computers and even their office CCTV system. The result is inc… [+2576 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Futility Closet", "title": "In 1942, Winnipeg staged a Nazi invasion to promote the sale of war bonds", "description": "In 1942, Manitoba chose a startling way to promote the sale of war bonds -- it staged a Nazi invasion of Winnipeg. For one gripping day, soldiers captured the city, arrested its leaders, and oppressed its citizens. In this week's episode of the Futility Close…", "url": "https://boingboing.net/2020/03/03/in-1942-winnipeg-staged-a-naz.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/2020-03-02-podcast-episode-286-if-day.jpg?fit=700%2C462&ssl=1", "publishedAt": "2020-03-03T12:40:10Z", "content": "In 1942, Manitoba chose a startling way to promote the sale of war bonds -- it staged a Nazi invasion of Winnipeg. For one gripping day, soldiers captured the city, arrested its leaders, and oppressed its citizens. In this week's episode of the Futility Close… [+2246 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Mark DeCambre, Andrea Riquier", "title": "Market Snapshot: U.S. stock futures wobble lower as Wall Street watches for global policy response to coronavirus", "description": "U.S. stock-index futures were trading modestly lower in choppy trading Tuesday morning after G7 finance ministers and central bank governors indicated a willingness to use fiscal and monetary policy to fight the coronavirus epidemic’s impact on the global eco…", "url": "https://www.marketwatch.com/story/us-stock-futures-wobble-lower-as-wall-street-watches-for-global-policy-response-to-coronavirus-2020-03-03", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-GK600_trump__ZG_20180608143636.jpg", "publishedAt": "2020-03-03T12:57:47Z", "content": "Edit\r\nThe G-7 was slated to have a call on a coronavirus response on Tuesday\r\nU.S. stock-index futures were trading modestly lower in choppy trading Tuesday morning after G7 finance ministers and central bank governors indicated a willingness to use fiscal an… [+3885 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Rafi Letzter", "title": "Huge physics conference canceled at the last minute due to coronavirus fears", "description": "Organizers of the American Physical Society's March conference made the decision to cancel due to coronavirus concerns less than two days before the conference was set to begin.", "url": "https://www.space.com/coronavirus-fears-cancel-physics-conference.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6ZxszKVMHmMHHnq8RWPgrg-1200-80.png", "publishedAt": "2020-03-03T12:13:39Z", "content": "One of the world's largest and most important annual physics conferences was canceled this weekend due to COVID-19 coronavirus fears, less than a day and a half before the event was supposed to begin.\r\nThe American Physical Society (APS) March meeting was sch… [+3368 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: China's tech fights back", "description": "Robots, drones and artificial intelligence are being used by China to fight the disease.", "url": "https://www.bbc.co.uk/news/technology-51717164", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1FC3/production/_111113180_gettyimages-1203625451.jpg", "publishedAt": "2020-03-03T12:37:20Z", "content": "Image copyrightGetty ImagesImage caption\r\n A robot on display at a hospital in China\r\nDisinfecting robots, smart helmets, thermal camera-equipped drones and advanced facial recognition software are all being deployed in the fight against Covid-19 at the heart… [+6182 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Quint Forgey", "title": "Trump pummels Fed as economic leaders cope with coronavirus", "description": "The president again urged the central bank to lower interest rates.", "url": "https://www.politico.com/news/2020/03/03/trump-fed-economy-coronavirus-119372", "urlToImage": "https://static.politico.com/f2/eb/d0d76f1a4a85bd34521197a5fc9f/200303-jerome-powell-gty-773.jpg", "publishedAt": "2020-03-03T12:59:53Z", "content": "The presidents posts come hours before a planned interagency meeting led by the White Houses National Economic Council to discuss the coronavirus effect on the U.S. economy. \r\nFinancial ministers and central bankers of the Group of Seven major economies are a… [+1654 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of Major U.S. Airlines Declined in February", "description": "Coronavirus fears caused legacy carrier shares to plummet.", "url": "https://www.fool.com/investing/2020/03/03/why-shares-of-major-us-airlines-declined-in-februa.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561073/airport-airplanes-source-getty.jpg", "publishedAt": "2020-03-03T13:10:00Z", "content": "What happened\r\nShares of the legacy U.S. airlines all lost altitude in February, according to data provided by S&amp;P Global Market Intelligence, caught in the broader COVID-19 coronavirus-related market downdraft. Shares of American Airlines Group(NASDAQ:AA… [+2787 chars]"}, {"source": {"id": null, "name": "Wyff4.com"}, "author": null, "title": "2 Georgia coronavirus cases confirmed, linked to Italy trip - WYFF4 Greenville", "description": "2 Georgia coronavirus cases confirmed, linked to Italy trip WYFF4 Greenville Georgia confirms first 2 coronavirus cases Fox News First 2 cases of coronavirus confirmed in Georgia, Gov. Kemp says WSPA 7News Officials confirm Georgia’s first 2 cases of coronavi…", "url": "https://www.wyff4.com/article/2-georgia-coronavirus-cases-confirmed-linked-to-italy-trip/31204785", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/coronavirus-1579720400.jpg?crop=0.809xw:0.809xh;0,0&resize=1200:*", "publishedAt": "2020-03-03T13:05:00Z", "content": "ATLANTA —State officials say Georgia's first coronavirus cases have been confirmed in two people in the same Atlanta area household. \r\n(Video above: Morning headlines)\r\nGov. Brian Kemp announced the cases at a news conference late Monday. \r\nOfficials said the… [+656 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "IAG CEO Walsh on Coronavirus Impact, Heathrow Runway, Retirement", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-03/iag-ceo-walsh-on-coronavirus-impact-heathrow-runway-retirement-video", "urlToImage": null, "publishedAt": "2020-03-03T12:50:36Z", "content": null}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "iPhone maker Hon Hai says it expects its Chinese plants to begin operating normally by the end of March, after the disruption caused by the coronavirus (Bloomberg)", "description": "Bloomberg : iPhone maker Hon Hai says it expects its Chinese plants to begin operating normally by the end of March, after the disruption caused by the coronavirus — - Hon Hai says its facilities are at 50% seasonal capacity — The epidemic has disrupted Apple…", "url": "https://www.techmeme.com/200303/p4", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ieWl5DQE7QeM/v0/1200x800.jpg", "publishedAt": "2020-03-03T12:45:05Z", "content": null}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Alex Tabarrok", "title": "The WHO Report on COVID-19", "description": "The Report of the WHO-China Joint Mission on Coronavirus Disease 2019 (COVID-19) is the best source of information on COVID-19 that I have seen. The Joint Mission consisted of 25 national and international experts from China, Germany, Japan, Korea, Nigeria, R…", "url": "https://marginalrevolution.com/marginalrevolution/2020/03/the-who-report-on-covid-19.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-03-03T12:25:35Z", "content": "The Report of the WHO-China Joint Mission on Coronavirus Disease 2019 (COVID-19) is the best source of information on COVID-19 that I have seen.\r\nThe Joint Mission consisted of 25 national and international experts from China, Germany, Japan, Korea, Nigeria, … [+4639 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Mike Rosenstein | NJ Advance Media for NJ.com", "title": "Coronavirus outbreak: NBA, NHL, MLB, NCAA bracing for the worst - NJ.com", "description": "Coronavirus outbreak: NBA, NHL, MLB, NCAA bracing for the worst NJ.com NBA's coronavirus memo reportedly encourages players to shun high-fives for fist bumps, limit autographs Yahoo Sports NBA to teams: Avoid high-fives with fans, strangers as virus concerns …", "url": "https://www.nj.com/sports/2020/03/coronavirus-outbreak-nba-nhl-mlb-ncaa-bracing-for-the-worst.html", "urlToImage": "https://www.nj.com/resizer/M7Db8aEvHN_ykEI7JMR4_TgIhoY=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/PFPUTQZ5OFGEFK3P64YEWDF26M.jpg", "publishedAt": "2020-03-03T12:50:00Z", "content": "College and pro sports leagues have begun making contingency plans in the event the spreading coronavirus outbreak threatens to disrupt their schedules.\r\nNBA\r\nThe league sent out a memo with short-term recommendations. Players should utilize fist-bumps over h… [+2649 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "ET Daily Rundown: Coronavirus unfolds in India", "description": "ET Daily Rundown: Coronavirus unfolds in IndiaThe virus which has claimed over 3000 lives is beginning to unfold in India. A school in Noida has been put under quarantine, and six other people in Agra are also being tested. While the government comes up with …", "url": "https://economictimes.indiatimes.com/news/podcasts/et-daily-rundown-coronavirus-unfolds-in-india/articleshow/74460631.cms", "urlToImage": null, "publishedAt": "2020-03-03T12:55:24Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Two coronavirus cases confirmed in Atlanta. Here’s what we know so far - Raleigh News & Observer", "description": "Two coronavirus cases confirmed in Atlanta. Here’s what we know so far Raleigh News & Observer Georgia confirms first 2 coronavirus cases Fox News U.S. Coronavirus Infections Rise as Cases Outside China Pass 10,000 The Wall Street Journal Officials confirm Ge…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiPmh0dHBzOi8vd3d3Lm5ld3NvYnNlcnZlci5jb20vbGF0ZXN0LW5ld3MvYXJ0aWNsZTI0MDgzMTAyNi5odG1s0gE-aHR0cHM6Ly9hbXAubmV3c29ic2VydmVyLmNvbS9sYXRlc3QtbmV3cy9hcnRpY2xlMjQwODMxMDI2Lmh0bWw?oc=5", "urlToImage": null, "publishedAt": "2020-03-03T12:54:00Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "peterdeadline", "title": "Disney Cancels Disney+ European Launch Event Over Coronavirus Fears", "description": "Disney has been forced to scrap plans for a glitzy European press launch for Disney+ in London this week after the event became one of the latest industry gatherings to be hit by coronavirus fears. Disney was hosting the party at the Exhibition London event s…", "url": "https://deadline.com/2020/03/disney-european-launch-axed-coronavirus-1202873059/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/07/disney-logo.png?w=1024", "publishedAt": "2020-03-03T12:49:18Z", "content": "Disney has been forced to scrap plans for a glitzy European press launch for Disney+ in London this week after the event became one of the latest industry gatherings to be hit by coronavirus fears.\r\nDisney was hosting the party at the Exhibition London event … [+1966 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Coronavirus: iPads, Facebook VR sets in short supply", "description": "Coronavirus: iPads, Facebook VR sets in short supplyHP’s Envy, Pavilion and Slim desktop computers are out of stock, as are some of the company’s Sprocket mobile photo printers.", "url": "https://economictimes.indiatimes.com/magazines/panache/sold-out-ipads-facebook-vr-headsets-in-short-supply-as-coronavirus-spreads/articleshow/74457089.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74457284,width-1070,height-580,imgsize-463659,overlay-etpanache/photo.jpg", "publishedAt": "2020-03-03T12:22:43Z", "content": "By Mark GurmanSome products from Apple Inc., Facebook Inc. and HP Inc. are in short supply in a possible sign of the coronavirus outbreak’s effect on the global manufacturing system.\r\nThe iPad Pro tablet is seeing limited availability at stores in major citie… [+7482 chars]"}, {"source": {"id": null, "name": "Theguardian.comnews"}, "author": "Patrick Wintour Diplomatic editor", "title": "Iran offers Nazanin Zaghari-Ratcliffe temporary jail release", "description": "Officials claim British-Iranian dual national has not been affected by coronavirus Nazanin Zaghari-Ratcliffe is being offered temporary release from Evin prison in Tehran due to the risk of the coronavirus outbreak reaching Iran’s jails. The news was confirme…", "url": "https://amp.theguardian.comnews/2020/mar/03/iran-offers-nazanin-zaghari-ratcliffe-temporary-jail-release-coronavirus", "urlToImage": "https://i.guim.co.uk/img/media/636b14c3539e0d199fda284a3d3ec8c731d18698/53_0_3307_1985/master/3307.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5b7c7775c6700528a71cffa4dadf9e8", "publishedAt": "2020-03-03T12:50:07Z", "content": "Nazanin Zaghari-Ratcliffe is being offered temporary release from Evin prison in Tehran due to the risk of the coronavirus outbreak reaching Irans jails.\r\nThe news was confirmed by the Iranian ambassador to the UK, Hamid Baeidinejad, and by Zaghari-Ratcliffes… [+3334 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan confirms two new coronavirus infections in Osaka: Kyodo", "description": "Japan on Tuesday confirmed two new coronavirus infections in Osaka, western Japan, a man in his 50s and a woman in her 40s, Kyodo newswire reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-osaka-idUSKBN20Q1IH", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T12:16:58Z", "content": "TOKYO (Reuters) - Japan on Tuesday confirmed two new coronavirus infections in Osaka, western Japan, a man in his 50s and a woman in her 40s, Kyodo newswire reported. \r\nThe woman had visited a music venue in nearby Osaka that has been the source of several in… [+73 chars]"}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Summer Chen", "title": "Disinformers are targeting Taiwan as a country where coronavirus is out of control", "description": "While struggling to fight the new coronavirus, Taiwan is also witnessing a serious digital attack driven by malicious disinformers. In the last few days, dozens of profiles and bots on Facebook and Twitter have posted different pieces of content suggesting th…", "url": "https://www.poynter.org/fact-checking/2020/disinformers-are-targeting-taiwan-as-a-country-where-coronavirus-is-out-of-control/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/Screen-Shot-2020-03-02-at-2.26.26-PM.png", "publishedAt": "2020-03-03T12:45:16Z", "content": "While struggling to fight the new coronavirus, Taiwan is also witnessing a serious digital attack driven by malicious disinformers.\r\nIn the last few days, dozens of profiles and bots on Facebook and Twitter have posted different pieces of content suggesting t… [+3342 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Jesus Diaz", "title": "Samsung Galaxy A21 is the cheap Galaxy S20 alternative you're looking for - Tom's Guide", "description": "Samsung Galaxy A21 is the cheap Galaxy S20 alternative you're looking for Tom's Guide What is a 'foldable phone' and why does it matter? Android Central Here are the first images of Galaxy A21 with a quadruple-camera Gizchina.com Samsung Galaxy A21 surfaces w…", "url": "https://www.tomsguide.com/news/samsung-galaxy-a21-is-the-cheap-galaxy-s20-alternative-youre-looking-for", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hYm6oPVbaxgyGsnLVJXDi7-1200-80.jpeg", "publishedAt": "2020-03-03T12:44:00Z", "content": "This is the new Samsung Galaxy A21. It's Samsungs newest low budget phone and it has little to do with the shiny Galaxy S20. \r\nIt doesnt have the latest and fanciest camera features, or the fastest processors or the insane amount of RAM and storage available … [+3610 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK PM Johnson: Coronavirus will not stop me shaking hands", "description": "British Prime Minister Boris Johnson said on Tuesday that coronavirus would not stop him greeting people with a handshake, adding that he had shaken the hands of everyone at a hospital where infected patients were being treated.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-handshake-idUSKBN20Q1IO", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498141994&w=1200&r=LYNXMPEG220XP", "publishedAt": "2020-03-03T12:16:25Z", "content": "LONDON (Reuters) - British Prime Minister Boris Johnson said on Tuesday that coronavirus would not stop him greeting people with a handshake, adding that he had shaken the hands of everyone at a hospital where infected patients were being treated. \r\nJohnson w… [+1136 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Richard Lawler", "title": "The Morning After: NASA is taking applications for new astronauts", "description": "Hey, good morning! You look fabulous. SXSW 2020 has not been canceled and will start as planned in just a couple of weeks. However, the show will lack some social media muscle due to the absence of Facebook and 2007 SXSW darling, Twitter. Both companies annou…", "url": "https://www.engadget.com/2020/03/03/nasa-is-hiring-astronauts-morning-after/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2020-03%252F4a8d63b0-5d48-11ea-bdff-ca3dbd43f1d0%26client%3Da1acac3e1b3290917d92%26signature%3Dff947bf59c415f9d724adfde2b8258ec4e3241ba&client=amp-blogside-v2&signature=0578e1f0bafa4196aa1627d11f542fae7b8258a3", "publishedAt": "2020-03-03T12:45:00Z", "content": "What will you do with $25?Apple will pay up to $500 million to settle throttled iPhone lawsuit \r\nAccording to Reuters, Apple will pay up to $500 million to settle one of the lawsuits that came out of the company throttling older iPhones. Depending on how many… [+3626 chars]"}, {"source": {"id": null, "name": "Newatlas.com"}, "author": "Paul Ridden", "title": "Hyundai swaps steering wheel for joysticks in Prophecy EV concept", "description": "It's motor show week... or it would be if the Geneva Motor Show hadn't been canceled due coronavirus concerns. Still, auto concepts are still being showcased, if only online. And the latest is from the Hyundai Motor Company, which has revealed a sporty electr…", "url": "https://newatlas.com/automotive/hyundai-prophecy-electric-sports-concept/", "urlToImage": "https://assets.newatlas.com/dims4/default/67cb2d0/2147483647/strip/true/crop/4928x2587+0+346/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2Ffa%2F27%2F75fb4a724480b521ea0c43f67e98%2Flarge-40369-prophecyconceptev.jpg", "publishedAt": "2020-03-03T13:05:47Z", "content": "It's motor show week... or it would be if the Geneva Motor Show hadn't been canceled due coronavirus concerns. Still, auto concepts are still being showcased, if only online. And the latest is from the Hyundai Motor Company, which has revealed a sporty electr… [+2908 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Victoria Forster, Contributor, Victoria Forster, Contributor https://www.forbes.com/sites/victoriaforster/", "title": "There Is A Drug Already Used In Japan Which May Treat COVID-19, Says New Study", "description": "A group of scientists in Germany have found a drug which may work to combat COVID-19, the disease caused by the SARS-CoV-2 coronavirus sweeping the globe.", "url": "https://www.forbes.com/sites/victoriaforster/2020/03/03/there-is-a-drug-already-used-in-japan-which-may-treat-covid-19-says-new-study/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1134490146%2F960x0.jpg", "publishedAt": "2020-03-03T12:30:00Z", "content": "Scientists in Germany may have identified a possible treatment for COVID-19 and it has already been ... [+] tested in humans with other diseases.\r\nGetty\r\nA group of scientists in Germany have identified a drug which they believe may work to combat COVID-19, t… [+10573 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "Two Countries That Are Taking Coronavirus Travel Bans To The Greatest Extremes", "description": "Samoa is requiring all passengers entering the country or transiting through it to undergo medical screening three days prior to travel to the country. The government is also enforcing reductions in international air service. Meanwhile Micronesia banned trave…", "url": "https://viewfromthewing.com/two-countries-that-are-taking-coronavirus-travel-bans-to-the-greatest-extremes/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2020/03/apia.png", "publishedAt": "2020-03-03T13:04:33Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Rupee breaches 73-mark, dives 47 paise vs dollar", "description": "The local unit had settled at 72.76 against the greenback on Monday.", "url": "https://economictimes.indiatimes.com/markets/forex/rupee-breaches-73-mark-dives-47-paise-against-us-dollar-amid-coronavirus-uncertainty/articleshow/74460216.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74460245,width-1070,height-580,imgsize-753335,overlay-etmarkets/photo.jpg", "publishedAt": "2020-03-03T12:31:42Z", "content": "Falling for the third consecutive session, the rupee on Tuesday slumped 47 paise to 73.23 (provisional) against the US dollar, as investor sentiment remained fragile amid concerns over the impact of coronavirus. Forex traders said the Indian rupee which start… [+1121 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "Pope Francis tests negative for COVID-19, says Italy report", "description": "Vatican spokesman Matteo Bruni said he had no immediate comment on the report", "url": "https://www.thehindu.com/news/international/pope-francis-tests-negative-for-covid-19-says-italy-report/article30972627.ece", "urlToImage": "https://www.thehindu.com/news/international/mmigwc/article30956809.ece/ALTERNATES/LANDSCAPE_615/VATICANPOPE", "publishedAt": "2020-03-03T12:24:18Z", "content": "Pope Francis, who canceled a Lent retreat for the first time in his papacy because he is suffering from a cold, has tested negative for coronavirus, the Italian newspaper Il Messaggero reported on Tuesday.\r\nVatican spokesman Matteo Bruni said he had no immedi… [+742 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Jonathan Garber", "title": "Coronavirus: G7 vows to protect global markets - Fox Business", "description": "Concern about the epidemic and its impact on corporate profits has hammered global markets, with major U.S. indexes suffering their steepest losses since the financial crisis last week.", "url": "https://www.foxbusiness.com/markets/coronavirus-g7-moves-to-reassure-investors", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/coronavirus-BT.jpg?ve=1&tl=1", "publishedAt": "2020-03-03T12:49:08Z", "content": "G7 finance ministers and central bankers reassured investors Tuesday that they're ready to protect the global economy from the impact of the widening coronavirus outbreak, but did not promise any specific actions.\r\n“Given the potential impacts of COVID-19 on … [+2198 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Student from Singapore hurt in Oxford Street attack", "description": "Jonathan Mok says a group of men told him they didn't \"want your coronavirus in our country\".", "url": "https://www.bbc.co.uk/news/uk-england-london-51722686", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2D33/production/_111117511_copyofuntitleddesign.png", "publishedAt": "2020-03-03T12:14:52Z", "content": "Image copyrightJonathan MokImage caption\r\n Jonathan Mok posted photos of his injuries on Facebook which have since been shared by thousands\r\nA student from Singapore has said he was beaten up by a group of men who told him: \"I don't want your coronavirus in m… [+1089 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: China's tech fights back - BBC News", "description": "Robots, drones and artificial intelligence are being used by China to fight the disease.", "url": "https://www.bbc.com/news/technology-51717164", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1FC3/production/_111113180_gettyimages-1203625451.jpg", "publishedAt": "2020-03-03T12:38:21Z", "content": "Image copyrightGetty ImagesImage caption\r\n A robot on display at a hospital in China\r\nDisinfecting robots, smart helmets, thermal camera-equipped drones and advanced facial recognition software are all being deployed in the fight against Covid-19 at the heart… [+6182 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Hughes", "title": "Coronavirus Tester Gets $10 Billion of Good News", "description": "(Bloomberg Opinion) -- For a company that develops coronavirus tests, it can’t be much of a surprise that somebody wants to buy the entire business.  European diagnostics group Qiagen NV on Tuesday accepted a 9 billion-euro ($10 billion) takeover offer from a…", "url": "https://finance.yahoo.com/news/coronavirus-tester-gets-10-billion-123930099.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-03T12:39:30Z", "content": "(Bloomberg Opinion) -- For a company that develops coronavirus tests, it cant be much of a surprise that somebody wants to buy the entire business.  European diagnostics group Qiagen NV on Tuesday accepted a 9 billion-euro ($10 billion) takeover offer from a … [+3116 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Brent Nyitray, CFA)", "title": "Better Buy: Universal Display vs. LG Display", "description": "A maker versus a toll-taker.", "url": "https://www.fool.com/investing/2020/03/03/better-buy-universal-display-vs-lg-display.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559661/couple-watching-tv-getty-6217.jpg", "publishedAt": "2020-03-03T13:07:00Z", "content": "Universal Display(NASDAQ:OLED) and LG Display(NYSE:LPL) are both in the Organic LED (OLED) business, which is rapidly gaining share in smartphones, TVs, tablets, and monitors. OLED technology provides a better picture and is more energy-efficient -- it is a b… [+3084 chars]"}, {"source": {"id": null, "name": "Iphonehacks.com"}, "author": "Rajesh Pandey", "title": "Apple Supplier Foxconn Expects Its Chinese Factories To Run At Full Capacity by March-end", "description": "Apple’s major supply-chain partner Foxconn has announced that it expects production to go back to its full capacity in China by the end of March. Nonetheless, the company expects a 15% decline in its revenue in the first quarter due to the virus outbreak. Con…", "url": "http://www.iphonehacks.com/2020/03/apple-supplier-foxconn-expects-chinese-factories-run-full-capacity-march.html", "urlToImage": "http://cdn.iphonehacks.com/wp-content/uploads/2020/02/Foxconn.jpg", "publishedAt": "2020-03-03T12:33:04Z", "content": "Apple’s major supply-chain partner Foxconn has announced that it expects production to go back to its full capacity in China by the end of March. Nonetheless, the company expects a 15% decline in its revenue in the first quarter due to the virus outbreak. \r\nF… [+1442 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Tobias Hoonhout, Tobias Hoonhout", "title": "Congress Set to Agree on Coronavirus Funding Bill, Will Avoid FISA Pitfall", "description": "Congress is close to reaching a bipartisan deal on coronavirus funding, with negotiators close to a $7-$8 billion package which could be unveiled Tuesday.", "url": "https://www.nationalreview.com/news/congress-set-to-agree-to-coronavirus-funding-will-avoid-fisa-pitfall/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/coronavirus-022820-17.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-03-03T13:02:23Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sue Hayward, Sue Hayward", "title": "Counting the cost of coronavirus", "description": "Travel disruption and self-isolation could wreck economic havoc – but who is footing the bill?", "url": "https://www.independent.co.uk/money/spend-save/cost-coronavirus-travel-insurance-work-sick-pay-self-isolate-fco-a9371031.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/16/istock-1204765491.jpg", "publishedAt": "2020-03-03T12:20:17Z", "content": "As cases of coronavirus rise, the financial impact is being felt around the globe. Stock markets have plunged with some of the biggest falls since the 2008 financial crisis and one of the biggest casualties of coronavirus could be the travel industry. Airline… [+5233 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Here's why the coronavirus may clobber your retirement plans via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_f4ad4ac01790ac384d9728c7842fe402", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-03T12:40:08Z", "content": "Wilson County, Tornado, Mt. Juliet, Lebanon, Storm\r\nNASHVILLE, Tenn. (WKRN) Officials said that Wilson County teachers could see bigger paychecks soon. On Tuesday, the county will vote on a new..."}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Dan Lyman", "title": "Coronavirus Dealing Heavy Blow to Airlines", "description": "Rapidly falling passenger numbers forcing drastic measures globally", "url": "https://www.infowars.com/coronavirus-dealing-heavy-blow-to-airlines/", "urlToImage": "https://assets.infowars.com/2020/03/luft.jpg", "publishedAt": "2020-03-03T12:23:51Z", "content": "Hit already by dramatically falling passenger numbers, the novel COVID-19 pathogen is forcing global airlines to make costly contingency plans to contain the spread of the virus, darkening the horizon for the struggling industry even further.\r\nJust on Monday,… [+4802 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Sagar", "title": "OnePlus 8 series to be unveiled in mid-April", "description": "OnePlus unveiled the OnePlus 7 and 7 Pro in May last year but it was rumored to announce their successors - OnePlus 8 and 8 Pro - in late March or sometime in April this year. Now a report by TechRadar India, citing a source close to the company, says that th…", "url": "https://www.gsmarena.com/oneplus_8_series_launch_date_mid_april-news-41797.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/19/10/oneplus-8-pro-leaked-renders/-476x249w4/gsmarena_002.jpg", "publishedAt": "2020-03-03T12:38:01Z", "content": "OnePlus unveiled the OnePlus 7 and 7 Pro in May last year but it was rumored to announce their successors - OnePlus 8 and 8 Pro - in late March or sometime in April this year. Now a report by TechRadar India, citing a source close to the company, says that th… [+800 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan confirms six new coronavirus infections in Nagoya, Kyoto: Kyodo", "description": "Japan on Tuesday confirmed six new coronavirus infections in Nagoya in central Japan, and Kyoto further west, Kyodo newswire reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-cases-idUSKBN20Q1LB", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-03T12:42:33Z", "content": "TOKYO (Reuters) - Japan on Tuesday confirmed six new coronavirus infections in Nagoya in central Japan, and Kyoto further west, Kyodo newswire reported. \r\nFive of those are men and women in Nagoya, who in their sixties and eighties, with the new case in Kyoto… [+176 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus outbreak: Who should be concerned?", "description": "As the U.S. death toll for coronavirus climbs to six people with at least 102 confirmed cases, public health officials are working to make federal, state and local preparations while also making sure Americans have all the information they need regarding what…", "url": "https://www.cbsnews.com/video/coronavirus-outbreak-who-should-be-concerned/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/03/614ea1c1-6a84-4dec-bb0e-34cab7c32f4e/thumbnail/1200x630/26ad6a7e3c062a40f65b3e22217061dc/0303-ctm-coronavirusconcerns-narula-2040187-640x360.jpg", "publishedAt": "2020-03-03T12:27:24Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "G-7 Pledges to Fight Virus Risks, Stops Short of Specific Action - Bloomberg", "description": "G-7 Pledges to Fight Virus Risks, Stops Short of Specific Action Bloomberg U.S. cuts rates as G7 pledges action but no quick coronavirus fix Reuters G-7 pledges to use ‘all appropriate policy tools’ to fight coronavirus MarketWatch What the Coronavirus Demand…", "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=39a5cac0-5d8d-11ea-a319-f3ebf737514d&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wMy0wMy9nLTctc2F5cy1jbG9zZWx5LW1vbml0b3JpbmctdmlydXMtYW5kLXJlYWR5LXRvLXRha2UtYWN0aW9u", "urlToImage": null, "publishedAt": "2020-03-03T12:46:00Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Leroy Leo", "title": "Coronavirus: One more tests positive in Jaipur - Livemint", "description": "Coronavirus: One more tests positive in Jaipur Livemint States Step up Vigil as Sixth Coronavirus Case Detected in Country; Airlines and Airport on Alert News18 Coronavirus in Jaipur: Italian tourist under quarantine Times of India Coronavirus update: Another…", "url": "https://www.livemint.com/news/india/coronavirus-one-more-tests-positive-in-jaipur-11583240168488.html", "urlToImage": "https://images.livemint.com/img/2020/03/03/600x338/PTI2_16_2020_000137A_1581856916341_1583240613011.jpg", "publishedAt": "2020-03-03T13:05:50Z", "content": "lNEW DELHI: India reported one more case of COVID-19, taking the total to six in the country. A person in Jaipur who tested positive for the virus is now one among the three patients undergoing treatment.One (1) case has been confirmed as positive for COVID-1… [+1278 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Outbreak : Coronavirus in Hyderabad 30 Suspected Cases Hospitalised | NewsX - NewsX", "description": "Coronavirus Outbreak : Coronavirus in Hyderabad 30 Suspected Cases Hospitalised | NewsX NewsX 27 Things Coronavirus Is Changing Right Now Forbes Coronavirus outbreak: South Korea postpones opening schools as new cases rise to almost 500 Global News Orion Town…", "url": "https://www.youtube.com/watch?v=-opKHB0rxC0", "urlToImage": "https://i.ytimg.com/vi/-opKHB0rxC0/maxresdefault.jpg", "publishedAt": "2020-03-03T12:42:05Z", "content": "Coronavirus Outbreak : Coronavirus in Hyderabad 30 Suspected Cases Hospitalised | NewsX\r\n#Corronavirus#Hyderabad#30CasesinHyderabad#Newsx\r\nWatch More Videos: https://www.youtube.com/user/newsxliv...For More information on this News Visit: https://www.newsx.co… [+1 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "NEWS YOU CAN USE: Surfaces? Sneezes? Sex? How the Coronavirus Can and Cannot Spread….", "description": "NEWS YOU CAN USE: Surfaces? Sneezes? Sex? How the Coronavirus Can and Cannot Spread.", "url": "https://pjmedia.com/instapundit/360121/", "urlToImage": null, "publishedAt": "2020-03-03T12:52:43Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Beijing to quarantine travelers from coronavirus hotspots as China sees spike in IMPORTED cases", "description": "Beijing will begin to isolate travelers arriving in the Chinese capital from countries hit hard by the coronavirus outbreak, amid a rise in imported cases of the disease. Shanghai has reportedly taken similar measures. Read Full Article at RT.com", "url": "https://www.rt.com/news/482187-china-coronavirus-import-quarantine/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5e4f4e20302750e62b0d98.JPG", "publishedAt": "2020-03-03T12:40:15Z", "content": "All individuals entering Beijing from South Korea, Japan, Iran and Italy will be quarantined for 14 days, the Deputy Secretary General of the Beijing Municipal Government, Chen Bei, said on Tuesday. The countries placed on the quarantine list are among the la… [+1618 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rekha Khandelwal)", "title": "What Makes ONEOK Stock Attractive?", "description": "Some key factors make ONEOK attractive in a beaten down energy sector.", "url": "https://www.fool.com/investing/2020/03/03/what-makes-oneok-stock-attractive.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560595/gas-pipeline_fUO5FwA.jpg", "publishedAt": "2020-03-03T12:35:00Z", "content": "As stock markets grapple with the effects of coronavirus, investors are understandably concerned. The timing of the coronavirus outbreak couldn't have been worse for energy investors, who have long been hoping for a recovery. \r\nAn expected fall in demand seem… [+5443 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Beth McKenna)", "title": "Why Disney Stock Dropped 15% in February", "description": "COVID-19 has spooked investors in the entertainment giant.", "url": "https://www.fool.com/investing/2020/03/03/why-disney-stock-dropped-15-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561151/dis-stock-disney-stock-coronavirus-earnings.png", "publishedAt": "2020-03-03T13:11:00Z", "content": "What happened\r\nWalt Disney (NYSE:DIS) stock fell 14.9% in February, according to data from S&amp;P Global Market Intelligence. For context, the S&amp;P 500 index dropped 8.2% last month. The market sell-off was due to concerns that COVID-19, the coronavirus d… [+3324 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus-hit nursing home residents \"held hostage,\" relative says", "description": "Family members of LifeCare Center's elderly residents told CBS News they are concerned those showing symptoms will not be tested or hospitalized until critically ill.", "url": "https://www.cbsnews.com/news/coronavirus-outbreak-washington-nursing-home-king-county-medical-response-lifecare-center/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/03/42e5a20e-9205-4ab1-8ee6-4f5cedcc99b4/thumbnail/1200x630/0e2e203742df8cbd6f5fa683a6c56609/1583237723778.png", "publishedAt": "2020-03-03T12:16:09Z", "content": "Health officials have focused in on a cluster of conronavirus infections inside a nursing home outside of Seattle. Family members of LifeCare Center's elderly residents told CBS News their loved ones are being isolated in their rooms and their temperatures mo… [+1865 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Deepak Upadhyay", "title": "Coronavirus LIVE update: Fear intensifies, countries adopt swab test beside thermal screening at airports - Livemint", "description": "Coronavirus LIVE update: Fear intensifies, countries adopt swab test beside thermal screening at airports Livemint Coronavirus outbreak live updates: Six cases with 'high-viral load' detected in Agra Times of India Two coronavirus cases reported & confirmed i…", "url": "https://www.livemint.com/news/world/coronavirus-live-update-coronavirus-cases-in-india-delhi-telangana-reported-death-toll-today-11583230321257.html", "urlToImage": "https://images.livemint.com/img/2020/03/03/600x338/PTI2_16_2020_000137A_1581856916341_1583235144631.jpg", "publishedAt": "2020-03-03T12:11:37Z", "content": "The deadly coronavirus outbreak has spread to more than 70 countries and is wreaking havoc globally. The deadly infection has killed over 3,000 people and infecting almost 90,000 globally since first detected in December in China last year.On Monday, the Indi… [+18655 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Stephanie Pappas", "title": "What are the symptoms of the new coronavirus? - Livescience.com", "description": "What are the symptoms of the new coronavirus? Livescience.com China looks to recovered to develop effective COVID-19 treatments Al Jazeera English How to Confront the Coronavirus at Every Level The New York Times Coronavirus: Global cases top 90,000 DW (Engli…", "url": "https://www.livescience.com/coronavirus-symptoms.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Nw4ngzejFCEmAeb3oGaYkB-1200-80.jpg", "publishedAt": "2020-03-03T12:23:00Z", "content": "The novel coronavirus\r\n that causes the disease COVID-19 has spread from the site of the original outbreak in China to affect 75 countries around the world. If effective controls aren't put into place, COIVID-19 could ultimately infect between 40% and 70% of … [+4266 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "TODAY.com", "title": "Dr. Anthony Fauci offers advice on how to avoid coronavirus - TODAY", "description": "Dr. Anthony Fauci offers advice on how to avoid coronavirus TODAY Top US doctor says coronavirus now an 'outbreak,' possibly a 'pandemic' New York Post 'You don't want to go to war with a president' POLITICO Top Government Health Official Warns Americans Of C…", "url": "https://www.today.com/video/dr-anthony-fauci-offers-advice-on-how-to-avoid-coronavirus-79876165672", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/tdy_health_engel_virus_200303_1920x1080.social_share_1200x630_center.jpg", "publishedAt": "2020-03-03T13:01:37Z", "content": null}, {"source": {"id": null, "name": "Wishtv.com"}, "author": null, "title": "Tuesday's business headlines - WISHTV.com", "description": "Here's a look at Tuesday's business headlines.", "url": "https://www.wishtv.com/news/business/tuesdays-business-headlines-84/", "urlToImage": "https://i2.wp.com/www.wishtv.com/wp-content/uploads/2015/02/skyline_37762428_ver1.0.jpg?fit=650%2C340&ssl=1", "publishedAt": "2020-03-03T12:47:00Z", "content": "INDIANAPOLIS (WISH) – Here’s a look at Tuesday’s business headlines.\r\nIndy Happy Hour\r\nIndianapolis is the second cheapest city for after-work drinks.\r\nSimple Texting says the cost for one appetizer, two drinks and a rideshare home average just under $30 in I… [+994 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "NewsHound Ellen", "title": "John Oliver Magnificently Shreds Trump And Fox News Economist Playing Coronavirus Expert", "description": "John Oliver was in top form Sunday night as he brutally exposed Donald Trump’s epic failure in responding to the coronavirus epidemic. Caught up in the exposé was a Fox Business Network guest using the public health crisis to make a bigoted smear of the Chine…", "url": "https://crooksandliars.com/2020/03/john-oliver-magnificently-shreds-trump-and", "urlToImage": "https://crooksandliars.com/files/embeds/2020/03/39360.jpg", "publishedAt": "2020-03-03T13:07:05Z", "content": "John Oliver was in top form Sunday night as he brutally exposed Donald Trumps epic failure in responding to the coronavirus epidemic. Caught up in the exposé was a Fox Business Network guest using the public health crisis to make a bigoted smear of the Chines… [+1980 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Rory Sullivan, Rory Sullivan", "title": "Coronavirus: Supermarket shelves left empty after panic buying in Australia", "description": "Stock shortages include long-life pantry items and household staples", "url": "https://www.independent.co.uk/news/world/australasia/coronavirus-australia-outbreak-sydney-supermarket-panic-buying-a9371751.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/03/11/empty-shelves-sydney.png", "publishedAt": "2020-03-03T12:26:30Z", "content": "Customers in Australia have emptied supermarket shelves as panic buying spreads in the wake of the coronavirus outbreak.\r\nVideos posted on social media show people in Sydney hurriedly buying essential items such as toilet paper, leaving empty shelves in some … [+1517 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus outbreak at Washington nursing home raises fear", "description": "Health officials have focused in on a cluster of coronavirus infections inside a nursing home outside of Seattle. Family members of LifeCare Center’s elderly residents told CBS News their loved ones are being isolated in their rooms with their temperatures mo…", "url": "https://www.cbsnews.com/video/coronavirus-outbreak-at-washington-nursing-home-raises-fear/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/03/c476a008-48dd-4453-9cfc-7e706be0fae8/thumbnail/1200x630/f58539ab0692a2d517096f83b93fc39c/0303-ctm-coronavirusus-vigliotti-2040178-640x360.jpg", "publishedAt": "2020-03-03T12:26:02Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Mike Adams", "title": "HHS can't do math, official claims 35 million masks is \"10%\" of needed amount of 3.5 billion (it's actually just 1%)", "description": "(Natural News) As America descends into idiocracy, plunging far below any level of scientific and mathematical competence required to realistically deal with this coronavirus outbreak, a stunning example of sheer stupidity emerged today via HHS where CNBC.com…", "url": "https://www.naturalnews.com/2020-03-03-hhs-cant-do-math-claim-that-35-million-masks-is-10-percent-coronavirus.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Troubled-Math-Science-Equation.jpg", "publishedAt": "2020-03-03T12:38:43Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "UK PM Johnson: Coronavirus will not stop me shaking hands", "description": "British Prime Minister Boris Johnson said on Tuesday that coronavirus would not stop him greeting people with a handshake, adding that he had shaken the hands of everyone at a hospital where infected patients were being treated.", "url": "https://news.yahoo.com/uk-pm-johnson-coronavirus-not-121625793.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/k2.sWvaDIBZKan1XKgZgGQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDYuNA--/https://s.yimg.com/uu/api/res/1.2/3nbk3middoKaPILTwj.fzg--~B/aD01Mjk7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/4ec47ccb5362b154f267adc664391b5b", "publishedAt": "2020-03-03T12:16:25Z", "content": "LONDON (Reuters) - British Prime Minister Boris Johnson said on Tuesday that coronavirus would not stop him greeting people with a handshake, adding that he had shaken the hands of everyone at a hospital where infected patients were being treated.\r\nJohnson wa… [+1130 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "China Reports Rise In Imported Coronavirus Cases - NDTV News", "description": "China Reports Rise In Imported Coronavirus Cases NDTV News Coronavirus deaths in Italy at 79, China cases slow: Live updates Al Jazeera English Coronavirus: China orders travellers quarantined amid outbreak BBC News Global virus infections near 90,000. Cases …", "url": "https://www.ndtv.com/world-news/coronavirus-outbreak-in-china-increase-in-imported-virus-cases-2189167", "urlToImage": "https://c.ndtvimg.com/2020-01/t8k5o09k_china-coronavirusreuters_625x300_21_January_20.jpg", "publishedAt": "2020-03-03T12:56:00Z", "content": "China's containment efforts are being undone by cases brought into the country (File)\r\nPequim, China: China reported an increase Tuesday in cases of the new coronavirus coming from abroad, as the country where the disease first emerged now worries about impor… [+2513 chars]"}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Tom Jones", "title": "Why we should’ve seen Chris Matthews’ departure coming » USA vs. China in media personnel » Where to watch Super Tuesday", "description": "The Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, click here. Stunning but not surprising: Matthews is out It was somehow both stunning and not surprising all at the same time. And it was long overdue. Chris M…", "url": "https://www.poynter.org/newsletters/2020/why-we-shouldve-seen-chris-matthews-departure-coming-usa-vs-china-in-media-personnel-where-to-watch-super-tuesday/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/AP_20063058234571.jpg", "publishedAt": "2020-03-03T12:30:40Z", "content": "The Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, click here.\r\nStunning but not surprising: Matthews is out\r\nIt was somehow both stunning and not surprising all at the same time.\r\nAnd it was long overdue.\r\nChr… [+9533 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Peter Bergen, CNN", "title": "Coronavirus Shows Eight of Trump's Failings as a Leader", "description": "So far Trump has stumbled in his handling of the coronavirus crisis and there are reasons to think he's particularly ill-suited to address this challenge -- his penchant for lying, his belief he's smarter than his advisers, his surrounding himself with yes me…", "url": "https://www.realclearpolitics.com/2020/03/03/coronavirus_shows_eight_of_trumps_failings_as_a_leader_503237.html", "urlToImage": null, "publishedAt": "2020-03-03T12:24:45Z", "content": "So far Trump has stumbled in his handling of the coronavirus crisis and there are reasons to think he's particularly ill-suited to address this challenge -- his penchant for lying, his belief he's smarter than his advisers, his surrounding himself with yes me… [+74 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "COVID-19 outbreak to impact State’s economy: Isaac", "description": "A prolonged global outbreak of the Coronavirus disease 2019 (COVID-19) is bound to adversely impact the State’s economy, Finance Minister T.M. Thomas Isaac has cautioned.While replying to questions in", "url": "https://www.thehindu.com/news/cities/Thiruvananthapuram/covid-19-outbreak-to-impact-states-economy-isaac/article30972855.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-03-03T12:53:41Z", "content": "A prolonged global outbreak of the Coronavirus disease 2019 (COVID-19) is bound to adversely impact the States economy, Finance Minister T.M. Thomas Isaac has cautioned.\r\nWhile replying to questions in the Assembly on Tuesday, Dr. Isaac assessed that the impa… [+1019 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Dow Futures Erase Gains after G7 Statement Falls Short - Investing.com", "description": "Dow Futures Erase Gains after G7 Statement Falls Short Investing.com View Full Coverage on Google News", "url": "https://www.investing.com/news/stock-market-news/dow-futures-erase-gains-after-g7-statement-falls-short-2099645", "urlToImage": "https://i-invdn-com.akamaized.net/news/LYNXNPEF3H0P5_L.jpg", "publishedAt": "2020-03-03T12:51:00Z", "content": "By Noreen Burke \r\nInvesting.com - Dow futures erased gains on Tuesday after G7 finance officials stopped short of committing to specific actions to offset fallout in the global economy from the coronavirus outbreak.\r\nBy around 07:45 AM ET (1245 GMT) Dow futur… [+1593 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Ben Warren", "title": "Economist: Fed Setting Us Up For Bigger Crisis Than 2008", "description": "Says stock market still significantly overvalued even after last week's drop", "url": "https://www.infowars.com/economist-fed-setting-us-up-for-bigger-crisis-than-2008/", "urlToImage": "https://assets.infowars.com/2020/03/NYSEGReenGetty3320.jpg", "publishedAt": "2020-03-03T12:50:31Z", "content": "On Sunday, March, 1, Peter Schiff appeared on Fox News to discuss the market and economic turbulence surrounding coronavirus.\r\nPeter said the coronavirus isn’t the real problem. It’s the Fed. Everything the central bank has done since 2008 has only made thing… [+2256 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Stephen Alpher", "title": "G7 committed to using all appropriate policy tools; markets groan - Seeking Alpha", "description": "<ul><li>The G7 finance ministers and central bank chiefs just wrapped a conference call to discuss the coronavirus.</li><li><a href=\"https://home.treasury.gov/news/press-releases/sm927\" target=\"_blank\">From the joint statement:</a> \"We reaffirm our commitment…", "url": "https://seekingalpha.com/news/3547943-g7-committed-to-using-all-appropriate-policy-tools-markets-groan", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-03-03T12:59:00Z", "content": "The G7 finance ministers and central bank chiefs just wrapped a conference call to discuss the coronavirus.\r\nFrom the joint statement: \"We reaffirm our commitment to use all appropriate policy tools to achieve strong, sustainable growth and safeguard against … [+397 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Yes, but what was the question? UK PM Johnson asked about paternity leave", "description": "British Prime Minister Boris Johnson went some way toward committing to taking paternity leave after his partner Carrie Symonds gives birth to his child later this year, but quickly said he could not remember the question.", "url": "https://www.reuters.com/article/us-britain-politics-johnson-baby-idUSKBN20Q1JQ", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200303&t=2&i=1498145980&w=1200&r=LYNXMPEG220YK", "publishedAt": "2020-03-03T12:25:13Z", "content": "LONDON (Reuters) - British Prime Minister Boris Johnson went some way toward committing to taking paternity leave after his partner Carrie Symonds gives birth to his child later this year, but quickly said he could not remember the question. \r\nAt a news confe… [+963 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Advait Rao Palepu", "title": "Rupee Falls To 16-Month Low As Virus Fears Spread - BloombergQuint", "description": "Rupee Falls To 16-Month Low As Virus Fears Spread BloombergQuint Rupee falls sharply beyond 73 against US dollar: 5 things to know Livemint Coronavirus impact: Rupee tanks to 15-month low Deccan Herald Rupee breaches 73-mark, dives 47 paise against US dollar …", "url": "https://www.bloombergquint.com/business/rupee-falls-to-sixteen-month-low-as-virus-fears-spread", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2017-03%2Fb9035b59-9b79-4c92-b665-73d6518f9031%2F309397315_1-6.jpg?rect=0%2C143%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-03-03T12:48:15Z", "content": ""}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Charlie Kirk", "title": "CHARLIE KIRK: Presidential Leadership On Display With The Coronavirus", "description": "The Democrats need to stop backseat driving, because President Trump has got the coronavirus situation completely under control.", "url": "https://dailycaller.com/2020/03/03/charlie-kirk-presidential-leadership-on-display-with-the-coronavirus/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/03/GettyImages-1208916340-e1583239674934.jpg", "publishedAt": "2020-03-03T12:52:07Z", "content": "The Democrats need to stop backseat driving. The President is the one who’s supposed to handle emergencies, and President Trump has got the coronavirus situation completely under control.\r\nThe Executive Branch is tasked with coordinating and implementing the … [+3083 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Coronavirus ‘worst case scenario’ could see 80% of UK population infected – England’s chief medical officer", "description": "England’s chief medical officer has warned that coronavirus has the potential to infect 80 percent of the UK population and kill one percent of those who contract the disease, as the government unveils its Covid-19 battle plan. Read Full Article at RT.com", "url": "https://www.rt.com/uk/482192-coronavirus-infection-uk-population/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e5e51c620302752057b9425.JPG", "publishedAt": "2020-03-03T12:55:11Z", "content": "During a joint-Downing Street press conference on Tuesday where UK PM Boris Johnson announced the publication of the government’s 28-page ‘Coronavirus: action plan’, Professor Chris Whitty told reporters about the “worst case scenario.” \r\nAlso on rt.comVote o… [+802 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "Reuters, Asad Ullah Qasim, AFP, AFP, AFP", "title": "Wash your hands, Khamenei says, as coronavirus toll rises in Iran", "description": "Iran has had the highest number of deaths from the coronavirus outside China, where the virus originated The post Wash your hands, Khamenei says, as coronavirus toll rises in Iran appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2168647/3-wash-hands-khamenei-says-coronavirus-toll-rises-iran/", "urlToImage": "https://c.tribune.com.pk/2020/03/2168647-khameni-1583237509-949-640x480.jpg", "publishedAt": "2020-03-03T12:14:41Z", "content": "Iran has had the highest number of deaths from the coronavirus outside China, where the virus originated. PHOTO: AFP/FILE \r\nBEIJING: Iran’s Supreme Leader Aytollah Ali Khamenei said on Tuesday that Iranians should follow the recommendations of authorities to … [+1286 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Matthew J. Belvedere", "title": "What to watch today: Dow to drop after Monday's huge gain as morning G-7 statement disappoints", "description": "Dow futures point to losses at Tuesday's open after a coronavirus G-7 statement contained no specifics.", "url": "https://www.cnbc.com/2020/03/03/dow-to-drop-after-huge-monday-gain-as-g-7-statement-disappoints.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106420198-1583178639892gettyimages-1209906390.jpeg?v=1583178718", "publishedAt": "2020-03-03T12:40:32Z", "content": "The spread of the coronavirus in China is slowing while new cases in many other countries are accelerating. The vast majority of the more than 91,000 global cases and over 3,100 deaths are still in China. (CNBC)https://www.cnbc.com/2020/03/03/coronavirus-live… [+3012 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Eye Opener: Tornadoes rip through Tennessee", "description": "At least two tornadoes tore through the Nashville, Tennessee area overnight, killing at least five and destroying dozens of buildings. Also, the coronavirus death toll in the United States rises to six people. All that and all that matters in today’s Eye Open…", "url": "https://www.cbsnews.com/video/eye-opener-tornadoes-rip-through-tennessee/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/03/7813fb45-303c-4cf0-9dfd-53a2d0527640/thumbnail/1200x630/aa82cd4a04f86429ffc219a12b1e1d65/0303-ctm-7ameyeopener-2040163-640x360.jpg", "publishedAt": "2020-03-03T12:15:53Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Techpinions.com"}, "author": "Bob O'Donnell", "title": "Coronavirus-Induced Pause Gives Tech Industry Opportunity to Reflect", "description": "As the news has now made clear, the COVID-19 coronavirus is having a significant impact, not just on the tech industry, but on society and the globe as a whole. There are still huge numbers of unanswered questions about the virus and what it’s full effect wil…", "url": "https://techpinions.com/coronavirus-induced-pause-gives-tech-industry-opportunity-to-reflect/59417", "urlToImage": null, "publishedAt": "2020-03-03T13:00:57Z", "content": "Reading Time: 3minutesAs the news has now made clear, the COVID-19 coronavirus is having a significant impact, not just on the tech industry, but on society and the globe as a whole. There are still huge numbers of unanswered questions about the virus and wha… [+4316 chars]"}, {"source": {"id": null, "name": "Travelupdate.com"}, "author": "TravelUpdate", "title": "Coronavirus Outbreak: Complete list of Airline restrictions & fee waivers", "description": "If you're traveling soon, here's a handy list of policies, fee waivers and restrictions from major global airlines in the wake of the Coronavirus outbreak. The post Coronavirus Outbreak: Complete list of Airline restrictions & fee waivers appeared first on Tr…", "url": "https://travelupdate.com/coronavirus/", "urlToImage": "https://travelupdate.com/wp-content/uploads/2020/03/cv-1024x683.jpg", "publishedAt": "2020-03-03T13:10:25Z", "content": "Disclosure: I receive NO compensation from credit card affiliate partnerships. Support the blog by applying for a card through my personal referral links\r\nCoronavirus Outbreak\r\nThe Coronavirus outbreak is already eliciting a response, with governments around … [+4750 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Head of Iran's Emergency Medical Services Diagnosed With Coronavirus - Reports", "description": "Earlier in the day, the Iranian Health Ministry reported 835 new cases of coronavirus in the last 24 hours with 77 deaths and 2,336 infected.", "url": "https://sputniknews.com/middleeast/202003031078462337-head-of-irans-emergency-medical-services-diagnosed-with-coronavirus---reports/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107230/85/1072308589.png", "publishedAt": "2020-03-03T12:18:17Z", "content": null}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Victoria Friedman, Victoria Friedman", "title": "Boris Reveals Coronavirus Battle Plan, More Outbreaks 'Highly Likely', But for Now It's Business as Usual for Britain", "description": "Prime Minister Boris Johnson has said that it is \"highly likely\" there will be a \"growing number\" of coronavirus, with the government's chief medical officer saying that around one per cent of Britons who contract the virus could die.", "url": "https://www.breitbart.com/europe/2020/03/03/boris-reveals-coronavirus-battle-plan-stresses-now-its-business-usual-britain/", "urlToImage": "https://media.breitbart.com/media/2020/03/Boris-Johnson-640x335.jpg", "publishedAt": "2020-03-03T13:11:12Z", "content": "Prime Minister Boris Johnson has said that it is “highly likely” there will be a “growing number” of coronavirus cases, with the government’s chief medical officer saying that around one per cent of Britons who contract the virus could die.\r\nThe government ha… [+4057 chars]"}, {"source": {"id": null, "name": "Decanter.com"}, "author": "Chris Mercer", "title": "Coronavirus fears: RAW fair joins growing list of wine events postponed", "description": "Prowein 2019 in Germany attracted 61,500 visitors. Concerns about the spread of coronavirus have hit wine events in March... The post Coronavirus fears: RAW fair joins growing list of wine events postponed appeared first on Decanter.", "url": "https://www.decanter.com/wine-news/coronavirus-wine-events-postponed-433259/", "urlToImage": "https://keyassets.timeincuk.net/inspirewp/live/wp-content/uploads/sites/34/2020/03/prowein-2019-GettyImages-1136718859.jpg", "publishedAt": "2020-03-03T12:25:29Z", "content": "Coronavirus hits wine events\r\nAnnual Burgundy wine festival Les Grands Jours de Bourgogne, will not take place as planned from 9 to 13 March, announced the regions wine council, the BIVB, late yesterday (2 March). \r\nIt said that going ahead would be irrespons… [+2938 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Doug K. Le Du", "title": "New Preferred Stock IPOs, February 2020", "description": "Eleven new preferred stocks were introduced during February, offering an average annual coupon of 6.3 percent.There are currently 123 high quality preferred stocks selling for an average price of $25.73 per share (investment grade, cumulative dividends) offer…", "url": "https://seekingalpha.com/article/4329059-new-preferred-stock-ipos-february-2020", "urlToImage": "https://static2.seekingalpha.com/uploads/2020/3/489122_15830904923591_rId5.png", "publishedAt": "2020-03-03T12:30:00Z", "content": "Buyers its time for you to start paying attention.\r\nIt took a virus scare out of China to make it happen, but the price relief that income investors have been waiting for since December 2018 arrived during February. Of the 123 high quality preferred stocks cu… [+20976 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tobias Hoonhout", "title": "Congress Set to Agree on Coronavirus Funding Bill, Will Avoid FISA Pitfall", "description": "Congress is close to reaching a bipartisan deal on coronavirus funding, with negotiators for House Speaker Nancy Pelosi (D., Calif.) and Senate Majority Leader Mitch McConnell (R., Ky.) close to a $7-$8 billion package which could be unveiled Tuesday.“We work…", "url": "https://news.yahoo.com/congress-set-agree-coronavirus-funding-130223257.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3rvVjkzsodpoVN0n7Ohz9A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuOTc5NDcyMTQwNzYyNQ--/https://s.yimg.com/uu/api/res/1.2/hoZHpSxnXR6jCKzrs_J95A--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/36d9c0bd0034917fcda0b04f006c590b", "publishedAt": "2020-03-03T13:02:23Z", "content": "Congress is close to reaching a bipartisan deal on coronavirus funding, with negotiators for House Speaker Nancy Pelosi (D., Calif.) and Senate Majority Leader Mitch McConnell (R., Ky.) close to a $7-$8 billion package which could be unveiled Tuesday.\r\nWe wor… [+1479 chars]"}, {"source": {"id": null, "name": "Livejournal.com"}, "author": "ananasonastick", "title": "Twitter encourages its employees to work from home to avoid spreading coronavirus", "description": "Twitter is the first major U.S. corporation to strongly encourage its employees to work from home to avoid spreading coronavirus. “Beginning today, we are strongly encouraging all employees globally to work from home if they’re able.” https://t.co/UvWuenOrMU …", "url": "https://ohnotheydidnt.livejournal.com/117327368.html", "urlToImage": "https://l-files.livejournal.net/og_image/3616053/458310?v=1583238026", "publishedAt": "2020-03-03T12:20:24Z", "content": "Twitter is the first major U.S. corporation to strongly encourage its employees to work from home to avoid spreading coronavirus.\r\nBeginning today, we are strongly encouraging all employees globally to work from home if theyre able. https://t.co/UvWuenOrMU\r\n—… [+384 chars]"}, {"source": {"id": null, "name": "Balloon-juice.com"}, "author": "download my app in the app store mistermix", "title": "Wash Hand For Kill Coronavirus", "description": "This video, from the Vietnamese Health Department, and the Tik-Tok under it, are both informative and funny as hell. I got them via the John Oliver story that Anne Laurie posted in her COVID-19 post. The whole Oliver video is worth watching. In other topics, …", "url": "https://www.balloon-juice.com/2020/03/03/wash-hand-for-kill-coronavirus/", "urlToImage": null, "publishedAt": "2020-03-03T13:06:54Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aleks Klosok, CNN", "title": "IOC President Thomas Bach looks forward to 'successful' Tokyo 2020", "description": "Olympics chief Thomas Bach says Games organizers are preparing for a \"successful\" Tokyo 2020 despite the ongoing worries around coronavirus.", "url": "https://edition.cnn.com/2020/03/03/sport/olympics-tokyo-2020-thomas-bach-ioc-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200226051210-coronavirus-olympics-tokyo-2020-super-tease.jpg", "publishedAt": "2020-03-03T12:20:04Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "AMIR VAHDAT, JON GAMBRELL", "title": "Iran orders troops to fight coronavirus outbreak as 77 dead", "description": "Iranian media reported that 23 members of parliament now had the virus, as did the head of the country's emergency services.", "url": "https://www.bostonglobe.com/2020/03/03/nation/iran-orders-troops-fight-coronavirus-outbreak-77-dead/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/-dIY_kNVk-UbxhXTaSICj_dIDyc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/UJRBOOERTJA53CK2ZI3QRJJGDI.jpg", "publishedAt": "2020-03-03T12:29:55Z", "content": "\"Whatever helps public health and prevents the spread of the disease is good and what helps to spread it is sin, Khamenei said, who has not worn gloves at past arbor day plantings.\r\nAfter downplaying the coronavirus as recently as last week, Iranian authoriti… [+4608 chars]"}, {"source": {"id": null, "name": "Comicbookmovie.com"}, "author": "Mark Cassidy", "title": "Disney Scraps Thursday's Disney+ Launch Event In London Amid Growing Coronavirus Fears", "description": "Disney was set to host an event on March 5th in London ahead of the launch of Disney+ in Europe, but the Mouse House has now decided to cancel the gathering amid growing Coronavirus fears. Check it out...", "url": "https://www.comicbookmovie.com/disney/disney-scraps-thursdays-disney-launch-event-in-london-amid-growing-coronavirus-fears-a173554", "urlToImage": "https://www.comicbookmovie.com/images/articles/173554.jpg", "publishedAt": "2020-03-03T12:45:00Z", "content": "Fans were hoping to get some updates and announcements about the upcoming Disney+ Marvel and Star Wars shows at a press event this Thursday in London, but Disney has now been forced to cancel the industry gathering amid growing concerns over the spread of Cor… [+845 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Rupee breaches 73-mark, dives 47 paise against US dollar amid coronavirus uncertainty", "description": "The domestic unit finally settled at 73.23 against the greenback, down 47 paise over its previous closing price.", "url": "https://www.moneycontrol.com/news/business/rupee-breaches-73-mark-dives-47-paise-against-us-dollar-amid-coronavirus-uncertainty-4997601.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/08/rupee-770x433.jpg", "publishedAt": "2020-03-03T12:14:05Z", "content": "Falling for the third consecutive session, the rupee on Tuesday slumped 47 paise to 73.23 (provisional) against the US dollar, as investor sentiment remained fragile amid concerns over the impact of coronavirus. Forex traders said the Indian rupee which start… [+1249 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Alcovirus: Hungover Student Sparks Coronavirus Fear Inflight, Quarantined For Fortnight", "description": "Last week, the Mirror reported that the UK's Department of Health closed the Holiday Inn hotel at Heathrow airport to quarantine visitors arriving from coronavirus-hit countries.", "url": "https://sputniknews.com/world/202003031078461362-alcovirus-hungover-student-sparks-coronavirus-fear-inflight-quarantined-for-fortnight/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107846/21/1078462160.jpg", "publishedAt": "2020-03-03T12:41:01Z", "content": "Last week, the Mirror reported that the UK's Department of Health closed the Holiday Inn hotel at Heathrow airport to quarantine visitors arriving from coronavirus-hit countries.Julia Walentin, a 26-year-old student from south London, sparked fears that she m… [+1554 chars]"}, {"source": {"id": null, "name": "Pharmaceutical-technology.com"}, "author": "Divya Tirumalaraju", "title": "SARS drugs can help treat Covid-19, new study findings show - Pharmaceutical Technology", "description": "Researchers in the US have mapped a SARS-CoV-2 protein, which could help use drugs developed to treat SARS coronavirus as effective treatments for Covid-19.", "url": "https://www.pharmaceutical-technology.com/news/protein-target-sars-drugs-covid-19/", "urlToImage": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/10/2020/03/coronavirus-1.jpg", "publishedAt": "2020-03-03T12:13:00Z", "content": "This newly mapped coronavirus protein, called Nsp15, helps the virus replicate. SARS drugs could help. Credit: Northwestern University.\r\nVisit our Covid-19 microsite for the latest coronavirus news, analysis and updates\r\nFollow the latest updates of the outbr… [+1577 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "President Xi calls for international collaboration to find cure, vaccine to halt coronavirus - Devdiscourse", "description": "With the coronavirus outbreak emerging as a global menace claiming over 3,000 lives in China and abroad, Chinese President Xi Jinping has called for internatio", "url": "https://www.devdiscourse.com/article/international/899634-president-xi-calls-for-international-collaboration-to-find-cure-vaccine-to-halt-coronavirus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/25_01_2019_08_52_39_4624886.jpg?width=920&format=jpeg", "publishedAt": "2020-03-03T13:08:43Z", "content": "With the coronavirus outbreak emerging as a global menace claiming over 3,000 lives in China and abroad, Chinese President Xi Jinping has called for international cooperation to develop a cure and vaccine to halt the COVID-19 on its tracks. Public health secu… [+2821 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Ken Moritsugu, Matt Sedensky", "title": "While other countries battle mushrooming coronavirus outbreaks, China claims victory is 'not far' - The Globe and Mail", "description": "While other countries battle mushrooming coronavirus outbreaks, China claims victory is 'not far' The Globe and Mail WHO chief warns 'we are in uncharted territory' as number of coronavirus cases worldwide passes 90,000 CNN Coronavirus: China orders traveller…", "url": "https://www.theglobeandmail.com/world/article-while-other-countries-battle-mushrooming-coronavirus-outbreaks-china/", "urlToImage": "https://www.theglobeandmail.com/resizer/2L_qEt8K3o9CzklN851n6TVlK1U=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/HZ3U7ALA5JBKPILI3IV5KLBYAU.JPG", "publishedAt": "2020-03-03T12:14:00Z", "content": "A maintenance worker wipes down an off-duty bus at the King County Metro Atlantic and Central Base in Seattle on March 2, 2020. All six U.S. fatalities from COVID-19 have been in Washington state.\r\nJASON REDMOND/Reuters\r\nIranians hoarded medical supplies, Ita… [+5906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jerome M. Adams", "title": "Surgeon general: Be cautious, but not afraid of coronavirus", "description": "Jerome Adams writes that Americans should take comfort in knowing that we have the best team in the world to protect them from coronavirus", "url": "https://www.cnn.com/2020/03/03/opinions/coronavirus-prepare-not-panic-opinion-adams/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120829145900-coughing-man-bed-sick-super-tease.jpg", "publishedAt": "2020-03-03T12:40:03Z", "content": "Vice Adm. Jerome M. Adams, M.D., is the 20th surgeon general of the United States. He is a board-certified anesthesiologist with a master's degree in public health and a member of the President's Coronavirus Task Force. Before being selected for his current p… [+4207 chars]"}, {"source": {"id": null, "name": "Internetretailing.net"}, "author": "Chloe Rigby", "title": "How supermarkets are responding to the first effects of coronavirus", "description": "UK supermarkets are responding as what seem to be the first effects of coronavirus on retail make themselves felt", "url": "https://internetretailing.net/industry/industry/how-supermarkets-are-responding-to-the-first-effects-of-coronavirus-21049", "urlToImage": "https://content.internetretailing.net/AcuCustom/Sitename/DAM/038/ocado-mobile-image_Thumb.png", "publishedAt": "2020-03-03T13:07:09Z", "content": "UK supermarkets are responding as what seem to be the first effects of coronavirus on retail make themselves felt.\r\nOcado has warned its customers to book their delivery slots well ahead at a time when they are filling up fast.\r\nIn an email to customers, the … [+2056 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "As Coronavirus Numbers Rise, C.D.C. Testing Comes Under Fire (New York Times)", "description": "New York Times : As Coronavirus Numbers Rise, C.D.C. Testing Comes Under Fire — Federal health officials botched an initial diagnostic test and restricted widespread screening. Missteps may have raised the risks to Americans, critics say. — The coronavirus ha…", "url": "https://www.memeorandum.com/200303/p12", "urlToImage": "https://static01.nyt.com/images/2020/03/02/science/02VIRUS-TESTING1/02VIRUS-TESTING1-facebookJumbo.jpg", "publishedAt": "2020-03-03T12:55:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}]