[{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lisa Rowan", "title": "Why You Can't Use Your Own Cup at Starbucks Right Now", "description": "If you routinely take your own cup to Starbucks for the discount (and, you know, for the planet), you should know that the coffee chain has changed its policy in light of the coronavirus outbreak. Read more...", "url": "https://lifehacker.com/why-you-cant-use-your-own-cup-at-starbucks-right-now-1842159515", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/kmr37nvjkafhh7mzzxym.jpg", "publishedAt": "2020-03-06T20:15:00Z", "content": "If you routinely take your own cup to Starbucks for the discount (and, you know, for the planet), you should know that the coffee chain has changed its policy in light of the coronavirus outbreak. \r\nAlong with increasing its store-cleaning routines, Starbucks… [+989 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Taylor Lyles", "title": "Emerald City Comic Con postponed due to coronavirus outbreak", "description": "Seattle’s annual comic book convention, Emerald City Comic Con, has been postponed amid growing concern of the coronavirus outbreak. The event will be held sometime this summer, though a firm date has yet to be announced.", "url": "https://www.theverge.com/2020/3/6/21168264/emerald-city-comic-con-2020-postponed-cornavirus-seattle-washington", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DC2OJ7weSPVTYa0iPE8oV5YPnPs=/0x19:928x505/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19773608/emerald_city_comic_con_logo.jpg", "publishedAt": "2020-03-06T20:59:37Z", "content": "Seattles annual comic book convention will now be held this summer\r\nPhoto: Emerald City Comic Con\r\nSeattles annual comic book convention, Emerald City Comic Con, has been postponed amid growing concern surrounding the coronavirus outbreak. The event, which ha… [+1206 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Erica Bahrenburg", "title": "Here are some ways to ease your coronavirus anxieties", "description": "Stay calm, take a deep breath, wash your hands, and please stop touching your face. Read more... More about Health, Mashable Video, Mental Health, Coronavirus, and Covid 19", "url": "https://mashable.com/video/ways-to-ease-coronavirus-anxiety/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252F7b%252F4c93ccba76ca4cd09ae3941a954d1280.bd42f.png%252F1200x630.png?signature=xQuVQqR-fzRv2QqWC6PvNOLHNNw=", "publishedAt": "2020-03-06T20:24:42Z", "content": "Stay calm, take a deep breath, wash your hands, and please stop touching your face."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "FIA to set up coronavirus crisis cell to monitor implications for F1", "description": "The FIA sets up a \"crisis cell\" to meet every two days and monitor the implications of the coronavirus.", "url": "https://www.bbc.co.uk/sport/formula1/51777656", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/2843/production/_111170301_virus_getty.jpg", "publishedAt": "2020-03-06T20:22:17Z", "content": "Doubts remain over the staging of next month's Vietnam Grand Prix\r\nMotorsport's governing body, the FIA, has set up a \"crisis cell\" to monitor the implications of the coronavirus.\r\nOn Friday, a race of the all-electric Formula E championship scheduled for Rom… [+1329 chars]"}, {"source": {"id": null, "name": "Dailyhive.com"}, "author": "Megan Devlin", "title": "Health officials explain what will happen if there's a coronavirus outbreak in BC | News - Daily Hive", "description": "Health officials explain what will happen if there's a coronavirus outbreak in BC | News Daily Hive B.C. premier outlines province’s COVID-19 response plan Global News B.C. ramps up coronavirus response, opening 4 new labs and appointing special committee CBC…", "url": "https://dailyhive.com/vancouver/bc-coronavirus-pandemic-response", "urlToImage": "https://images.dailyhive.com/20200306123935/horgan-500x256.jpg", "publishedAt": "2020-03-06T20:47:00Z", "content": "British Columbia health officials want to reassure citizens the province is prepared in case there ends up being a community outbreak of COVID-19 here.\r\nAt a media briefing Friday, Premier John Horgan and Provincial Health Officer Dr. Bonnie Henry explained t… [+2448 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Bryan Menegus", "title": "Senator to Uber and Other Gig Companies: Have You Considered Just Giving Workers Sick Days?", "description": "As the novel coronavirus continues to spread—thanks in part to the disastrously inadequate response by failing governments like those in Iran and the United States—events are being cancelled faster than reporters can keep track of them, and employees in vario…", "url": "https://gizmodo.com/senator-to-uber-and-other-gig-companies-have-you-consi-1842160705", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/nk4pzxxprhtelbklwkmf.jpg", "publishedAt": "2020-03-06T21:00:00Z", "content": "As the novel coronavirus continues to spreadthanks in part to the disastrously inadequate response by failing governments like those in Iran and the United Statesevents are being cancelled faster than reporters can keep track of them, and employees in various… [+2348 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Avery Hartmans", "title": "Elon Musk weighs in on the coronavirus, calling panic over the outbreak 'dumb' (TSLA)", "description": "Elon Musk has weighed in on the coronavirus outbreak. \"The coronavirus panic is dumb,\" the Tesla and SpaceX CEO tweeted Friday afternoon. His comments come as the coronavirus continues to spread worldwide. There have been 240 cases reported in the US and 14 p…", "url": "https://www.businessinsider.com/elon-musk-calls-coronavirus-panic-dumb-2020-3", "urlToImage": "https://i.insider.com/5ddd2f37fd9db2239c6b7f82?width=1200&format=jpeg", "publishedAt": "2020-03-06T21:08:34Z", "content": "Tesla and SpaceX Elon Musk has weighed in on the coronavirus, downplaying panic over the outbreak. \r\n\"The coronavirus panic is dumb,\" Musk tweeted on Friday afternoon, his first comments on the outbreak. \r\nThe coronavirus, which began in Wuhan, China, two mon… [+569 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Factbox: Latest on the spread of coronavirus around the world", "description": "The number of people infected with coronavirus surpassed 100,000 across the world as the outbreak reached more countries and intensified economic damage, with business districts beginning to empty and stock markets tumbling.", "url": "https://www.reuters.com/article/us-health-coronavirus-latest-factbox-idUSKBN20T2T7", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499729023&w=1200&r=LYNXMPEG251YC", "publishedAt": "2020-03-06T21:11:22Z", "content": "(Reuters) - The number of people infected with coronavirus surpassed 100,000 across the world as the outbreak reached more countries and intensified economic damage, with business districts beginning to empty and stock markets tumbling. \r\n(Interactive graphic… [+5229 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Mia de Graaf), Mia de Graaf", "title": "Photos show why hand sanitizer doesn't work as well as soap and water to remove germs", "description": "Paul Barcena Actress Kristen Bell posted a photo on Instagram of her mom's hands, lit up with UV-light to show the germs. The photos showed how much of a difference it makes to rinse your hands for six seconds, or to scrub them with soap and water for 30 seco…", "url": "https://www.businessinsider.com/coronavirus-photos-why-you-should-wash-hands-with-soap-water-2020-3", "urlToImage": "https://i.insider.com/5e62a2affee23d571760c363?width=1200&format=jpeg", "publishedAt": "2020-03-06T20:14:00Z", "content": "It can be hard to change the way you've been doing something for your whole life.\r\nBut with widespread concern about the spread of the coronavirus, it's a challenge many people face.\r\nAll of us (hopefully) wash our hands daily, and yet it's rare to see somebo… [+4633 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Jennifer Locke", "title": "Konami's TurboGrafx-16 Mini is the first console delayed by the coronavirus", "description": "The mini console has been delayed indefinitely. What you need to know The TurboGrafx-16 is a home video game console that first released in 1987. Konami announced it had plans to release a mini version of the console. This mini version has since been delayed …", "url": "https://www.androidcentral.com/konamis-turbografx-16-mini-first-console-delayed-coronavirus", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2020/03/turbografx-16-mini-banner-17t3.jpg?itok=2Ld7nslG", "publishedAt": "2020-03-06T20:34:16Z", "content": "Ever heard of the TurboGrafx-16? Probably not, and I don't blame you. It was a big hit in Japan and rivaled the SNES but never really gained enough traction to become a global phenomenon. Still, Konami had plans to make a mini version of the console, similar … [+2782 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joey Hadden and Debanjali Bose", "title": "The coronavirus outbreak could cost America millions in tourism revenue — here are the major travel destinations that stand to lose the most.", "description": "New York, Yellowstone, Austin's annual South by Southwest festival (SXSW), and other major US travel destinations may lose millions in revenue from the coronavirus outbreak. As of Friday, there are over 100,000 confirmed cases of coronavirus, the majority of …", "url": "https://www.businessinsider.com/us-travel-destinations-that-are-losing-money-from-of-the-coronavirus-2020", "urlToImage": "https://i.insider.com/5e6281c7fee23d26fe42ff45?width=1200&format=jpeg", "publishedAt": "2020-03-06T20:30:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "Tech companies have canceled some high-profile conferences, causing an estimated economic loss of $666 million amid coronavirus concerns. Here's what's been called off so far.", "description": "The coronavirus disease, known as COVID-19, is forcing tech companies to adapt as remote work and suspended travel become realities. Some of the biggest tech conferences of the year are being canceled as well, as companies heed the CDC's advice to \"modify, po…", "url": "https://www.businessinsider.com/tech-conferences-cancelled-over-coronavirus-concerns-2020-3", "urlToImage": "https://i.insider.com/5e62af5dfee23d62e13e9f06?width=1200&format=jpeg", "publishedAt": "2020-03-06T20:56:37Z", "content": "The coronavirus disease, known as COVID-19, is spreading and so are concerns over the virus.\r\nMore than 100,000 people have been infected with the virus worldwide and 3,400 have died, with most cases coming in China, where it originated. There are 148 confirm… [+1235 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Read the email from Cisco alerting workers that an employee at its Silicon Valley headquarters came in contact with someone who has the coronavirus disease (CSCO)", "description": "Cisco is warning its employees that a worker at its Silicon Valley headquarters was in \"close contact\" with someone diagnosed with COVID-19, the coronavirus disease. Read the email Cisco sent to employees about the exposure and its next steps below. Visit Bus…", "url": "https://www.businessinsider.com/cisco-silicon-valley-worker-coronavirus-exposure-2020-3", "urlToImage": "https://i.insider.com/5e62b241fee23d033e0e20d6?width=1200&format=jpeg", "publishedAt": "2020-03-06T20:29:12Z", "content": "Cisco has alerted its workforce that one of its employees was exposed to someone with a confirmed case of COVID-19, the disease caused by the coronavirus. The employee did not have symptoms and has not been diagnosed with the disease, according to an internal… [+2230 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Hannah Smothers, Rachel Miller", "title": "All Your Horny Little Coronavirus Questions, Answered", "description": "The CDC won't tell us if it's safe to kiss or do hand stuff, so we investigated for you.", "url": "https://www.vice.com/en_us/article/bvgpy8/can-you-get-coronavirus-from-sex", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e629daada72d7009cc87fc5/lede/1583526889820-ARC_Shutterstock_1018750132_Lesbian_couple_kissing_VICE_RF-2.jpeg?crop=1xw:0.8419xh;0xw,0.0007xh&resize=1200:*", "publishedAt": "2020-03-06T20:55:57Z", "content": "As COVID-19, or coronavirus, continues to spread through communities around the United States, the CDC has been extremely proactive in issuing all sorts of guidance for not getting sick. The organization has addressed a lot of concernstravel, pets, pregnancy,… [+7223 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Alex Lubben, Michael Learmonth", "title": "Seattle Comic Con Just Got Postponed Because Coronavirus", "description": "DC Comics and other Comic Con regulars had already started to announce that they’d be pulling out.", "url": "https://www.vice.com/en_us/article/m7qxpp/seattle-comic-con-just-got-postponed-because-coronavirus", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e62ad7ee5d21f009df27c32/lede/1583525247042-comic-con.jpeg?crop=1xw:0.8424336973478939xh;center,center&resize=1200:*", "publishedAt": "2020-03-06T20:13:59Z", "content": "Coronavirus just took out the biggest nerd convention in the Northwest.\r\nSeattle Comic Con, one of the biggest cons in the country, pulled the plug Friday, officially postponing the event which was to start March 12.\r\nEmerald City Comic Con in Seattle attract… [+3881 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Zachary Boddy", "title": "The coronavirus has lead Twitch to cancel TwitchCon Amsterdam", "description": "Making moves to keep people safe. What you need to know The COVID-19 virus continues to spread, especially in Europe. The popular streaming service Twitch has decided to cancel their bi-annual TwitchCon. The event was to be held from May 2-3 in Amsterdam. Wit…", "url": "https://www.windowscentral.com/twitchcon-amsterdam-cancelled-amid-growing-coronavirus-threat-europe", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/03/twitch-surface-pro-x-1.jpg?itok=UnQpWsq9", "publishedAt": "2020-03-06T20:32:44Z", "content": "With the coronavirus reaching nearly 100,000 cases across the globe, according to a report by CNBC, it's more important than ever to do anything you can to stay safe and healthy. Many events and conferences have already been canceled, and companies like Micro… [+758 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "David Pescovitz", "title": "These gears aren't spinning. It's an optical illusion. Really. (strobe warning)", "description": "For those of you who enjoyed \" These boxes aren't rotating \" from earlier this week... These gears aren't spinning either. I promise. You are experiencing the a \"reverse-phi\" illusion. Read the rest", "url": "https://boingboing.net/2020/03/06/these-gears-arent-spinning.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/screenshot-27.jpg?fit=801%2C642&ssl=1", "publishedAt": "2020-03-06T20:44:34Z", "content": "Before Clearview Became a Police Tool, It Was a Secret Plaything of the Rich. That’s the title of the New York Times piece, and that’s the horrifying reality of how artificial intelligence and facial recognition are already being used in ways that violate you… [+1519 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Apple is encouraging employees in Silicon Valley and Seattle to work from home as an \"additional precaution\" against the outbreak of coronavirus (Mark Gurman/Bloomberg)", "description": "Mark Gurman / Bloomberg : Apple is encouraging employees in Silicon Valley and Seattle to work from home as an “additional precaution” against the outbreak of coronavirus — Apple Inc. is encouraging employees in Silicon Valley to work from home as an “additio…", "url": "https://www.techmeme.com/200306/p15", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i3O0AOXINybs/v0/1200x800.jpg", "publishedAt": "2020-03-06T20:12:54Z", "content": null}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Julia Lindau, Christina Sterbenz, Michael Learmonth", "title": "I Just Got Back From a Coronavirus Hot Zone, and No One at JFK Seemed to Notice", "description": "I breezed right through security, faster than any other time I can remember.", "url": "https://www.vice.com/en_us/article/akwyna/i-just-got-back-from-a-coronavirus-hot-zone-and-no-one-at-jfk-seemed-to-notice", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e62b3afe6e585009769e47c/lede/1583527041591-IMG_7051.jpeg?crop=1xw:0.7493xh;0xw,0.109xh&resize=1200:*", "publishedAt": "2020-03-06T20:37:51Z", "content": "Want the best of VICE News straight to your inbox? Sign up here.\r\n NEW YORK When I arrived at New Yorks JFK airport Thursday after spending days in a Coronavirus hot zone in Italy, I was expecting a shakedown: a temperature check at customs and some questions… [+5071 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Jennifer Locke", "title": "Konami's TurboGrafx-16 Mini is the first console delayed by the coronavirus", "description": "The mini console has been delayed indefinitely. What you need to know The TurboGrafx-16 is a home video game console that first released in 1987. Konami announced it had plans to release a mini version of the console. This mini version has since been delayed …", "url": "https://www.windowscentral.com/konamis-turbografx-16-mini-first-console-delayed-coronavirus", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/03/turbografx-16-mini-banner.jpg?itok=MZahYyJ7", "publishedAt": "2020-03-06T20:32:45Z", "content": "Ever heard of the TurboGrafx-16? Probably not, and I don't blame you. It was a big hit in Japan and rivaled the SNES but never really gained enough traction to become a global phenomenon. Still, Konami had plans to make a mini version of the console, similar … [+1618 chars]"}, {"source": {"id": null, "name": "Technologyreview.com"}, "author": "Neel V. Patel", "title": "The best, and the worst, of the Coronavirus dashboards", "description": "There are dozens of sites that show you how coronavirus is spreading around the world. Here is our ranking.", "url": "https://www.technologyreview.com/s/615330/best-worst-coronavirus-dashboards/", "urlToImage": "https://cdn.technologyreview.com/i/images/screen-shot-2020-03-06-at-14.24.21.png?cx=0&cy=0&cw=1014&ch=570&sw1200", "publishedAt": "2020-03-06T20:55:16Z", "content": "If youve been on the web to learn more about the latest pandemic, chances are youve stumbled upon at least one or two coronavirus dashboards. These are the landing pages for interactive maps and visuals that show where the virus has spread, as well as numbers… [+9575 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Coronavirus: Avoid mass gatherings, says govt", "description": "The Centre on Friday advised all states to avoid or postpone mass gatherings till Covid-19 is contained as various regulators and institutions went into prevention mode to arrest the spread of the novel coronavirus infection that has so far affected 31 people…", "url": "https://timesofindia.indiatimes.com/india/avoid-mass-gatherings-says-govt-as-corona-cases-hit-31/articleshow/74520610.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74520619,width-1070,height-580,imgsize-1846044,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-06T20:40:31Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "Lufthansa may park Airbus A380s as coronavirus impact worsens", "description": "Lufthansa may park its fleet of Airbus A380s in what would be a superjumbo symbol of how badly fears of the COVID-19 coronavirus outbreak are hitting travel demand. The Star Alliance carrier is “examining” temporarily removing its 14 A380s from service if the…", "url": "http://thepointsguy.com/news/lufthansa-airbus-a380s-coronavirus/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/05/Lufthansa-A380-at-Los-Angeles-International-LAX-3-Ryan-Patterson..jpg?fit=1600%2C1067px&ssl=1", "publishedAt": "2020-03-06T20:30:25Z", "content": "Lufthansa may park its fleet of Airbus A380s in what would be a superjumbo symbol of how badly fears of the COVID-19 coronavirus outbreak are hitting travel demand.\r\nThe Star Alliance carrier is “examining” temporarily removing its 14 A380s from service if th… [+2747 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Speights)", "title": "Why These Canadian Marijuana Stocks Plunged Today", "description": "Aurora Cannabis, Canopy Growth, Emerald Health Therapeutics, and Village Farms went lower today on coronavirus concerns.", "url": "https://www.fool.com/investing/2020/03/06/why-marijuana-stocks-aurora-cannabis-canopy-growth.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562010/cannabis-leaf-with-arms-and-legs-and-giving-a-thumb-down.jpg", "publishedAt": "2020-03-06T20:58:00Z", "content": "What happened\r\nSeveral Canadian marijuana stocks plunged on Friday as worries about the novel coronavirus, COVID-19, caused the major market indexes to fall. Shares of the biggest Canadian cannabis producer, Canopy Growth(NYSE:CGC), were down by 10.5% as of 3… [+1678 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Samuel Axon", "title": "Apple updates its App Store policies to combat abuse, spam, and misinformation", "description": "Cupertino is also rejecting coronavirus-related apps from untrusted sources.", "url": "https://arstechnica.com/gadgets/2020/03/apple-updates-its-app-store-policies-to-combat-abuse-spam-and-misinformation/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/04/iPad-Air-front-e1555381547629-760x380.jpeg", "publishedAt": "2020-03-06T20:55:02Z", "content": "Enlarge/ The front of the 2019 iPad Air.\r\n4 with 3 posters participating\r\nEarlier this week, Apple notified app developers of a revised set of App Store review guidelinesthe rules by which Apple curates its iOS/iPadOS, tvOS, watchOS, and macOS App Stores.\r\nAm… [+4553 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Jyoti Shelar", "title": "204 test negative in Maharashtra", "description": "As many as 229 people were placed under isolation in the State so far for suspected exposure to novel coronavirus, of whom 204 have tested negative. Reports of 25 people are still awaited. State offic", "url": "https://www.thehindu.com/news/national/other-states/204-test-negative-in-maharashtra/article31005361.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-03-06T20:44:40Z", "content": "As many as 229 people were placed under isolation in the State so far for suspected exposure to novel coronavirus, of whom 204 have tested negative. Reports of 25 people are still awaited. \r\nState officials said 13 people were under isolation at Kasturba Hosp… [+386 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Climate change or coronavirus? 'Pick your evil', protesters say", "description": "Demonstrators led by Greta Thunberg say global governments have raised more alarm over virus than climate emergency.", "url": "https://www.aljazeera.com/news/2020/03/climate-change-coronavirus-pick-evil-protesters-200306195937709.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/6/9fbce278de0f480b83b1011826a6d271_18.jpg", "publishedAt": "2020-03-06T20:37:48Z", "content": "Protesters at a rally led by climate activist Greta Thunberg on Friday denounced governments for taking urgent action against the coronavirus outbreak but failing to treat global warming as an emergency.\r\nSeveral thousand people braved the rain in Brussels wi… [+2047 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "David Robb", "title": "SAG-AFTRA Preparing For Various Coronavirus Scenarios", "description": "SAG-AFTRA leaders said Friday they’re “currently making preparations for various scenarios” to deal with the spread of the coronavirus. “As this is a dynamic and evolving situation, SAG-AFTRA will continue to closely monitor COVID-19 events and will update me…", "url": "https://deadline.com/2020/03/sag-aftra-coronavirus-message-membership-1202876335/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/08/sag-aftra-building-los-angeles.jpg?w=1024", "publishedAt": "2020-03-06T20:23:11Z", "content": "SAG-AFTRA leaders said Friday they’re “currently making preparations for various scenarios” to deal with the spread of the coronavirus. “As this is a dynamic and evolving situation, SAG-AFTRA will continue to closely monitor COVID-19 events and will update me… [+1456 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Crocs Shares Plunged 31% Last Month", "description": "Shares of the footwear company dove as the coronavirus forced it to cut its guidance for 2020.", "url": "https://www.fool.com/investing/2020/03/06/why-crocs-shares-plunged-31-last-month.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562002/crocs.jpeg", "publishedAt": "2020-03-06T20:49:00Z", "content": "What happened\r\nShares of Crocs (NASDAQ:CROX) were tumbling last month after the casual-footwear maker warned that the coronavirus would impact its performance in 2020 when it reported fourth-quarter earnings. As a result, the stock finished February down 31% … [+2041 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Hits America Where It's Weakest With Big Health Gaps", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/coronavirus-hits-america-where-it-s-weakest-with-big-health-gaps", "urlToImage": null, "publishedAt": "2020-03-06T20:50:11Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Citi to Waive Fees for Retail Customers Affected by Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/citi-to-waive-fees-for-retail-customers-affected-by-coronavirus", "urlToImage": null, "publishedAt": "2020-03-06T20:54:03Z", "content": null}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Nick Ewen", "title": "Alaska offering bonus elite-qualifying miles through mid-April", "description": "It’s no secret that the coronavirus outbreak is having a massive impact on the travel industry. Many companies are trimming back business travel, which has many road warriors are questioning whether they’ll be able to requalify for elite status. Well, if you’…", "url": "http://thepointsguy.com/news/alaska-bonus-elite-qualifying-miles/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2019/10/alaska-airlines-boeing-737-900.jpg?fit=3000%2C2000px&ssl=1", "publishedAt": "2020-03-06T21:00:37Z", "content": "It’s no secret that the coronavirus outbreak is having a massive impact on the travel industry. Many companies are trimming back business travel, which has many road warriors are questioning whether they’ll be able to requalify for elite status. Well, if you’… [+3652 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Watch A California National Guard Helicopter Deliver Coronavirus Testing Kits To Quarantined Cruise Ship", "description": "Pararescue jumpers from the California National Guard deliver Covid-19 test kits to a cruise ship stuck in limbo.", "url": "https://digg.com/video/california-national-guard-delivers-testing-kit-to-cruise-ship", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/03/06160228/Screen-Shot-2020-03-06-at-11.02.15-AM.jpg", "publishedAt": "2020-03-06T21:02:56Z", "content": "It's an internet fight and only the funniest meme will emerge victorious. This week, we have: the most fascinating ethical debates on film, \"I meet someone, we talk, they leave,\" a failed sociological experiment, and CDC memes."}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "White House Mulls Coronavirus Relief for Airlines, Cruise Industry", "description": "No firm plans have been announced.", "url": "https://www.fool.com/investing/2020/03/06/white-house-mulls-coronavirus-bailout-for-airlines.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561977/3-d-rendering-of-scary-looking-viruses-on-a-red-background.jpg", "publishedAt": "2020-03-06T20:15:00Z", "content": "Airline stocks including Delta(NYSE:DAL), American(NASDAQ:AAL), and United Airlines(NASDAQ:UAL) turned sharply higher in Friday afternoon trading. The reason:\r\nThe Trump Administration may \"consider deferring taxes for the cruise, travel and airline industrie… [+1226 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Delhi Confidential: Corridor speech", "description": "The coronavirus scare seems to have reached Parliament House too. This would impact the people who have got their passes for a visit to Parliament.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-corridor-speech-6303116/", "urlToImage": "https://images.indianexpress.com/2020/03/derek-759.jpg?w=759", "publishedAt": "2020-03-06T20:41:56Z", "content": "OBrien has recorded a video of him speaking on the issue from a corridor in Parliament and uploaded it on YouTube, claiming that the government is not letting the House function.The first week of Rajya Sabha after the recess was a washout as the Opposition de… [+1904 chars]"}, {"source": {"id": null, "name": "King5.com"}, "author": null, "title": "Some Life Care Center residents moving to hospitals for coronavirus treatment - KING5.com", "description": "Some Life Care Center residents moving to hospitals for coronavirus treatment KING5.com Heartbreaking photos show elderly couple separated due to coronavirus quarantine Yahoo News ‘It’s Pure Panic’: A Wrenching Wait at Nursing Home Where Coronavirus Took Hold…", "url": "https://www.king5.com/article/news/health/coronavirus/life-care-center-kirkland-coronavirus-patients-moved-treatment/281-079da2ce-5a61-438c-a266-a5af399e2a75", "urlToImage": "https://media.king5.com/assets/KING/images/d926ea10-4d98-44b1-8a8c-1604cb338896/d926ea10-4d98-44b1-8a8c-1604cb338896_1140x641.jpg", "publishedAt": "2020-03-06T20:33:00Z", "content": "KIRKLAND, Wash. Several residents of the Life Care Center nursing home in Kirkland that's at the center of the coronavirus (COVID-19) outbreak in the state have been moved out of the facility. \r\nKing County Executive Dow Constantine said Friday there are curr… [+2818 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Jessica Beym | For NJ.com", "title": "3rd person tests positive for the coronavirus in N.J., this time in Camden County - NJ.com", "description": "3rd person tests positive for the coronavirus in N.J., this time in Camden County NJ.com Camden County announces first presumptive positive coronavirus case WPVI-TV Coronavirus News: New Jersey advises all public schools to prepare for building closures WABC-…", "url": "https://www.nj.com/bergen/2020/03/nj-reports-3rd-presumptive-positive-case-of-coronavirus-this-time-in-camden-county.html", "urlToImage": "https://www.nj.com/resizer/rBMq-BwgrwmX1DQIVdQzc3sNiQ4=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/EOTYHTHWBFA6BJ4SXCELGJEAAA.png", "publishedAt": "2020-03-06T20:19:39Z", "content": "Camden County health officials reported a presumptive positive case of novel coronavirus, or COVID-19, making it the third such case in New Jersey as of Friday.\r\nThe person is identified as a male resident of Camden County in his 60s, who is hospitalized in s… [+1970 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Colombia has confirmed first case of coronavirus: health ministry", "description": "Colombia confirmed its first case of coronavirus on Friday, joining other South American countries which have reported cases of the fast-spreading disease.", "url": "https://www.reuters.com/article/us-health-coronavirus-colombia-idUSKBN20T2QQ", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T20:12:55Z", "content": "BOGOTA (Reuters) - Colombia confirmed its first case of coronavirus on Friday, joining other South American countries which have reported cases of the fast-spreading disease. \r\nThe virus broke out in Wuhan, China, late last year and has since infected nearly … [+211 chars]"}, {"source": {"id": null, "name": "Thewirecutter.com"}, "author": "Ganda Suthivarakom", "title": "You Probably Don’t Need to Disinfect Your Phone to Avoid Coronavirus. (But Here’s How If You Insist.)", "description": "The onslaught of coronavirus news has a lot of people on edge—especially about the things we touch. For most of us, it’s easy enough to heed advice not to grip stairwell railings. But what about the phones we handle all day? Yes, your phone is covered in ever…", "url": "https://thewirecutter.com/blog/disinfect-your-phone-coronavirus/", "urlToImage": "https://cdn.thewirecutter.com/wp-content/uploads/2020/03/cleanphone-lowres-1136190117-570x380.jpg", "publishedAt": "2020-03-06T21:05:30Z", "content": "The onslaught of coronavirus news has a lot of people on edgeespecially about the things we touch.\r\nFor most of us, its easy enough to heed advice to avoid gripping stairwell railings. But what about the phones we handle all day? Yes, your phone is covered in… [+5300 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Paul G. Stoltz Ph.D.", "title": "Pandemic!", "description": "Coronavirus (COVID-19) is just the latest, and certainly won’t be the last global threat to humanity. How will—more importantly—how could you respond?", "url": "https://www.psychologytoday.com/us/blog/put-your-mindset-work/202003/pandemic", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/image_for_blog_3-5-20.png?itok=siem6X_L", "publishedAt": "2020-03-06T20:41:45Z", "content": "Its here.  How willmore importantlyhow could you respond?  Here are three tips for weathering the storm with zen-like grace and energizing possibilities.\r\nCoronavirus (COVID-19) is just the latest, and certainly wont be the last global threat to humanity.  Bu… [+3754 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Paul G. Stoltz Ph.D.", "title": "Finding the Upside In Any Circumstance—Including A Pandemic", "description": "Coronavirus (COVID-19) is just the latest, and certainly won’t be the last global threat to humanity. How will—more importantly—how could you respond?", "url": "https://www.psychologytoday.com/us/blog/put-your-mindset-work/202003/finding-the-upside-in-any-circumstance-including-pandemic", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/image_for_blog_3-5-20.png?itok=siem6X_L", "publishedAt": "2020-03-06T20:41:45Z", "content": "Its here.  How willmore importantlyhow could you respond?  Here are three tips for weathering the storm with zen-like grace and energizing possibilities.\r\nCoronavirus (COVID-19) is just the latest, and certainly wont be the last global threat to humanity.  Bu… [+3754 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Paul G. Stoltz Ph.D.", "title": "Pandemic!", "description": "Coronavirus (COVID-19) is just the latest, and certainly won’t be the last global threat to humanity. How will—more importantly—how could you respond?", "url": "https://www.psychologytoday.com/ca/blog/put-your-mindset-work/202003/pandemic", "urlToImage": null, "publishedAt": "2020-03-06T20:41:45Z", "content": null}, {"source": {"id": null, "name": "Onemileatatime.com"}, "author": "Ben (Lucky)", "title": "Will Airlines Extend Elite Status Due To Coronavirus?", "description": "Here in the US we've seen airline stocks plummet, airlines issue travel waivers, and Southwest's CEO has even said that the drop in demand is comparable to post-9/11. One thing I've been asked over and over by readers in the past several days is if I think th…", "url": "https://onemileatatime.com/airlines-extend-elite-status/", "urlToImage": "https://onemileatatime.com/wp-content/uploads/2020/01/Delta-A321-First-Class-2.jpg", "publishedAt": "2020-03-06T20:31:42Z", "content": "Here in the US we’ve seen airline stocks plummet, airlines issue travel waivers, and Southwest’s CEO has even said that the drop in demand is comparable to post-9/11.\r\nOne thing I’ve been asked over and over by readers in the past several days is if I think t… [+4527 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "David Ljunggren", "title": "Canada's tourism industry 'deeply affected' by virus outbreak: minister", "description": "The outbreak of the new coronavirus is hammering Canada's tourism industry, a senior government official said on Friday, as the number of visitors from China plummeted and after the cancellation of a major technology convention.", "url": "https://www.reuters.com/article/us-health-coronavirus-canada-tourism-idUSKBN20T2RR", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499717303&w=1200&r=LYNXMPEG251X3", "publishedAt": "2020-03-06T20:38:53Z", "content": "OTTAWA/TORONTO (Reuters) - The outbreak of the new coronavirus is hammering Canada’s tourism industry, a senior government official said on Friday, as the number of visitors from China plummeted and after the cancellation of a major technology convention. \r\nC… [+2147 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Austria introducing 'spot' health checks at Italian border", "description": "Austria is introducing \"spot\" health checks at its border with Italy for two weeks as of next week in response to the coronavirus outbreak, in which Italy is the hardest-hit country in Europe, Chancellor Sebastian Kurz said on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-austria-idUSKBN20T2RV", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499716987&w=1200&r=LYNXMPEG251X4", "publishedAt": "2020-03-06T20:38:53Z", "content": "VIENNA (Reuters) - Austria is introducing “spot” health checks at its border with Italy for two weeks as of next week in response to the coronavirus outbreak, in which Italy is the hardest-hit country in Europe, Chancellor Sebastian Kurz said on Friday. \r\nAus… [+266 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Joe Biden is crushing Bernie Sanders by 16 points in national polling after the best week of his candidacy", "description": "Former Vice President Joe Biden has surged past Sen. Bernie Sanders in new national polling. While Sanders bested Biden among voters under the age of 45, the former vice president dominated by a significantly larger margin among voters over 45. Biden's boost …", "url": "https://www.businessinsider.com/joe-biden-leads-bernie-sanders-by-16-points-new-poll-2020-3", "urlToImage": "https://i.insider.com/5e61620efee23d70246c5525?width=1200&format=jpeg", "publishedAt": "2020-03-06T20:52:33Z", "content": "Former Vice President Joe Biden has surged past Sen. Bernie Sanders in new national polling following a significant narrowing of the presidential field since the South Carolina primary last Saturday.  \r\nMore than half of Democratic primary voters — 54% — said… [+1073 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Jeanette Settembre", "title": "Coronavirus prep for the uber wealthy - Fox Business", "description": "How the wealthy are combating coronavirus with luxury amenities, private flights and spa treatments.", "url": "https://www.foxbusiness.com/lifestyle/coronavirus-america-rich", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/private-plane-iStock.jpg?ve=1&tl=1", "publishedAt": "2020-03-06T20:30:30Z", "content": "The 1 percent is sparing no expense when it comes to protecting against the coronavirus.\r\nWhether it’s flying private, seeking refuge in salt rooms or shelling out hundreds of dollars for air masks, a number of businesses and luxury designers have seen a boos… [+4051 chars]"}, {"source": {"id": null, "name": "Carscoops.com"}, "author": "Michael Gauthier", "title": "Coronavirus Continues To Take Toll On Auto Industry, Latest Victim Is Press Drives", "description": "As the coronavirus continues to spread in the United States, Chevrolet has canceled the press drive for the 2021 TrailBlazer.", "url": "https://www.carscoops.com/2020/03/coronavirus-continues-to-take-toll-on-auto-industry-latest-victim-is-press-drives/", "urlToImage": "https://www.carscoops.com/wp-content/uploads/2020/03/2021-Chevrolet-TrailBlazer.jpg", "publishedAt": "2020-03-06T21:02:24Z", "content": "The automotive industry was dealt a heavy blow when the Geneva Motor Show was canceled at the last minute. However, the effects of the coronavirus are still being felt.\r\nThe latest victim is press drives as we were originally scheduled to get behind the wheel… [+2661 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Carlie Porterfield, Forbes Staff, Carlie Porterfield, Forbes Staff https://www.forbes.com/sites/carlieporterfield/", "title": "An Unexpected Coronavirus Effect: Cheap Lobster (Lower Meat Prices, Too)", "description": "But, experts say, don’t expect them to last", "url": "https://www.forbes.com/sites/carlieporterfield/2020/03/06/an-unexpected-coronavirus-effect-cheap-lobster-lower-meat-prices-too/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F941908180%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D3048%26cropY1%3D209%26cropY2%3D1925", "publishedAt": "2020-03-06T21:07:42Z", "content": "Lobster has fallen to its lowest price in four years since the coronavirus outbreak.\r\nBoston Globe via Getty Images\r\nTopline: As the coronavirus outbreak has limited shipments into China, the price of U.S. exports like lobster and, to a lesser extent, pork, c… [+2763 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "U.S. Doesn’t ‘Have Enough Tests’ for Coronavirus to Meet Demand, Says Mike Pence", "description": "The U.S. will not be able to meet the previously promised goal of testing around one million Americans for the new coronavirus by the end of the week due to a lack of testing kits, Vice President Mike Pence said Thursday. “We don’t have enough tests today to …", "url": "https://people.com/health/us-doesnt-have-enough-coronavirus-tests-says-pence/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcoronavirus-testing.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T20:26:15Z", "content": "The U.S. will not be able to meet the previously promised goal of testing around one million Americans for the new coronavirus by the end of the week due to a lack of testing kits, Vice President Mike Pence said Thursday.\r\n“We don’t have enough tests today to… [+2694 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Rachel DeSantis", "title": "University of Washington Cancels In-Person Classes as Coronavirus Continues to Spread", "description": "The University of Washington has joined a growing number of schools that have canceled in-person classes for the time being as the coronavirus continues to spread. The university announced Friday that beginning on Monday, all classes and finals will be held r…", "url": "https://people.com/human-interest/university-washington-cancels-in-person-classes-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Funiversity-of-washington.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T20:44:35Z", "content": "The University of Washington has joined a growing number of schools that have canceled in-person classes for the time being as the coronavirus continues to spread.\r\nThe university announced Friday that beginning on Monday, all classes and finals will be held … [+2852 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Allison Martell", "title": "In Canada, doctors broadened coronavirus testing, and made an unlikely save", "description": "Canada's official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to Iran before the scale…", "url": "https://www.reuters.com/article/us-health-coronavirus-canada-testing-idUSKBN20T2NZ", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499713617&w=1200&r=LYNXMPEG251UO", "publishedAt": "2020-03-06T20:28:11Z", "content": "TORONTO (Reuters) - Canada’s official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to I… [+3388 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Howard Schneider", "title": "Standard U.S. economic weapons may be inadequate for coronavirus crisis", "description": "As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people can't go to work, are told to stay home, or stop going out in public entirely.", "url": "https://www.reuters.com/article/us-health-coronavirus-fed-idUSKBN20T2TZ", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499728536&w=1200&r=LYNXMPEG251Y0", "publishedAt": "2020-03-06T21:02:42Z", "content": "NEW YORK/WASHINGTON (Reuters) - As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people can’t go to work, are told to stay home, or stop going out… [+5916 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Eric Abent", "title": "eBay bans predatory coronavirus listings amid price gouging and bogus claims", "description": "Following the US Surgeon General’s recommendation that the general public stop buying face masks with the goal of preventing the spread of coronavirus, eBay has announced that it will halt sales of masks and a couple of other items that are associated with th…", "url": "https://www.slashgear.com/ebay-bans-predatory-coronavirus-listings-amid-price-gouging-and-bogus-claims-06612438/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/03/slashgear_novelcoronavirus_COVID-19.jpg", "publishedAt": "2020-03-06T20:34:56Z", "content": "Following the US Surgeon General’s recommendation that the general public stop buying face masks with the goal of preventing the spread of coronavirus, eBay has announced that it will halt sales of masks and a couple of other items that are associated with th… [+1563 chars]"}, {"source": {"id": null, "name": "Ieee.org"}, "author": "Emily Waltz", "title": "Software and Genetic Sequencing Track the Coronavirus's Path", "description": "Online tools such as Nextstrain map the movement of the new coronavirus based on genetic mutations", "url": "https://spectrum.ieee.org/the-human-os/biomedical/devices/genetic-sequencing-and-online-software-tools-track-caronaviruss-path?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IeeeSpectrum+%28IEEE+Spectrum%29", "urlToImage": null, "publishedAt": "2020-03-06T20:15:00Z", "content": null}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Richard Winton, Soumya Karlamangla", "title": "A second LAX screener tests positive for the coronavirus", "description": "A second person who works at LAX as a medical screener has tested positive for the novel coronavirus. LAX says it taken steps to prevent the virus' spread.", "url": "https://www.latimes.com/california/story/2020-03-06/second-lax-screener-tests-positive-for-coronavirus", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/d90c391/2147483647/strip/true/crop/1542x810+0+41/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2F45%2F6973e3cce875f5c3edf427397ffc%2Fla-me-ln-lax-scare-20140928-001", "publishedAt": "2020-03-06T20:21:49Z", "content": "A second LAX worker has tested positive for coronavirus, officials said Friday.\r\nFew details were available about the worker, but Los Angeles County health officials said they still dont see signs of community spread.\r\nWe know that as we see increased cases t… [+1559 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Aiden Research", "title": "Bilibili: Great Growth Target Despite The Impact From Coronavirus Outbreak", "description": "BILI has been growing rapidly with a very high user retention rate.Currently, the company is still operating at losses, but the profitability will improve significantly since it is still low in terms of monetization level.The recent outbreak will bring a shor…", "url": "https://seekingalpha.com/article/4330373-bilibili-great-growth-target-despite-impact-from-coronavirus-outbreak", "urlToImage": "https://static.seekingalpha.com/uploads/2020/3/4/saupload_bilibili-Header-001-20171010_thumb1.jpg", "publishedAt": "2020-03-06T21:04:35Z", "content": "Investment Thesis\r\nBilibili Inc. (BILI) is the biggest community for Anime, Comic, and Gaming (ACG) in China. The high user retention rate of BILI makes us believe that the company is able to maintain strong growth in the future. Currently, the company still … [+4584 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "Alan Boyle", "title": "UW Medicine: We’ve processed 400 tests for coronavirus so far — and can handle 1,000 a day", "description": "The University of Washington School of Medicine says its virology lab is now capable of performing 1,000 genetic tests for the COV-19 coronavirus every day — but all that capacity hasn’t yet fully come into play. If the coronavirus outbreak ramps up as projec…", "url": "https://www.geekwire.com/2020/uw-medicine-weve-processing-400-tests-coronavirus-far-can-handle-1000-day/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2020/03/200306-test2-1260x790.png", "publishedAt": "2020-03-06T20:12:20Z", "content": "Lab workers process coronavirus test samples at UW Medicines virology lab. (UW Medicine Photo)\r\nThe University of Washington School of Medicine says its virology lab is now capable of performing 1,000 genetic tests for the COV-19 coronavirus every day but all… [+2575 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Tracy Bloom", "title": "SoCal Costco places purchasing limits on some items as panic buying creates long lines, supply shortages - KTLA", "description": "SoCal Costco places purchasing limits on some items as panic buying creates long lines, supply shortages KTLA How Costco is Handling Panicked Coronavirus Shoppers Inside Edition 'It's pandemonium': virus panic-buying hits Los Angeles Yahoo News ‘It’s been nut…", "url": "https://ktla.com/news/local-news/panic-shopping-creates-long-lines-at-socal-costcos-as-some-stores-place-purchasing-limits-on-certain-items/", "urlToImage": "https://ktla.com/wp-content/uploads/sites/4/2020/03/Costco-line.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-03-06T20:59:00Z", "content": "Some Costcos have taken to limiting the amount of certain products that can be purchased at a time as stores struggle to keep inventory amid a wave of panic buying spurred by fears of the coronavirus outbreak spreading. \r\nFriday once again saw large crowds at… [+3381 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bill Hardekopf, Contributor, Bill Hardekopf, Contributor https://www.forbes.com/sites/billhardekopf/", "title": "This Week In Credit Card News: How The Coronavirus Concerns Are Impacting Your Credit Cards", "description": "What took place this week in the credit card and payment industries", "url": "https://www.forbes.com/sites/billhardekopf/2020/03/06/this-week-in-credit-card-news-how-the-coronavirus-concerns-are-impacting-your-credit-cards/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1072906084%2F0x0.jpg", "publishedAt": "2020-03-06T21:09:25Z", "content": "Fed Cuts Rates Sharply In Response To Coronavirus Risk To Economy, Markets\r\nThe Federal Reserve cut interest rates Tuesday in a rare emergency move, responding aggressively to the growing threat the coronavirus poses to the economy and financial markets. The … [+5936 chars]"}, {"source": {"id": null, "name": "Ieee.org"}, "author": "Tekla S. Perry", "title": "Coronavirus Is Triggering Fear of Going to Work", "description": "A survey by Blind shows fear of the workplace is steadily going up and productivity down, thanks to coronavirus", "url": "https://spectrum.ieee.org/view-from-the-valley/at-work/tech-careers/coronavirus-is-triggering-fear-of-going-to-work?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IeeeSpectrum+%28IEEE+Spectrum%29", "urlToImage": null, "publishedAt": "2020-03-06T21:00:00Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Columbia U doctor on federal response to coronavirus: ‘gross amateur hour incompetence’", "description": "This morning President Trump signed an emergency bill for $8.4 billion coronavirus funding. \nDr. Irwin Redlener, Director Of Columbia University's National Center For Disaster Preparedness joins Yasmin Vossoughian to discuss the federal response to the corona…", "url": "https://www.msnbc.com/katy-tur/watch/columbia-u-doctor-on-federal-response-to-coronavirus-gross-amateur-hour-incompetence-80173637594", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_tur_2pDocABlock_200306_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T20:37:57Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jason Hall)", "title": "Crude Oil is in Freefall as Russia Plays Chicken With OPEC", "description": "Crude futures are down 9% as some of the world's biggest oil producers stare each other down over production cuts.", "url": "https://www.fool.com/investing/2020/03/06/crude-oil-is-in-freefall-as-russia-plays-chicken-w.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562009/ngl-gathering-system.jpg", "publishedAt": "2020-03-06T20:24:00Z", "content": "The crude oil sell-off has gone from bad to worse. Brent futures are on track to lose 9% on March 6, while West Texas crude is down 9.5% with only a couple of hours remaining in the final trading session of the week. Today's massive drop was started by news t… [+2221 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Saudi Arabia suspends public attendance at sports events until further notice", "description": "The Saudi ministry of sports announced on Friday it will suspend public attendance at all sports events starting Saturday, a statement from the ministry reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-saudi-idUSKBN20T2S6", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T20:42:15Z", "content": "CAIRO (Reuters) - The Saudi ministry of sports announced on Friday it will suspend public attendance at all sports events starting Saturday, a statement from the ministry reported. \r\nThe statement added that this comes as a precautionary measure to stop the s… [+167 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Jenni Lada", "title": "Nintendo and Microsoft Will Let Employees in Washington Work From Home Due to the Coronavirus", "description": "Both Nintendo and Microsoft are addressing coronavirus concerns in King County, Washington by allowing employees to work from home. The post Nintendo and Microsoft Will Let Employees in Washington Work From Home Due to the Coronavirus appeared first on Silico…", "url": "https://www.siliconera.com/nintendo-and-microsoft-will-let-employees-in-washington-work-from-home-due-to-the-coronavirus/", "urlToImage": "https://www.siliconera.com/wp-content/uploads/2020/03/nintendo-coronavirus-work-from-home.jpg", "publishedAt": "2020-03-06T21:00:07Z", "content": "Concerns about the coronavirus have prompted two video game companies to have their employees work from home. Both Microsoft, which has a Redmond campus in Washington, and Nintendo of America, which has its headquarters in Redmond, will have employees telecom… [+1058 chars]"}, {"source": {"id": null, "name": "Mindbodygreen.com"}, "author": "Sarah Regan", "title": "5 Ways To Get The Most Of Your Hand Sanitizer, From A Doctor", "description": "Does hand sanitizer even have a place in the corona conversation?", "url": "https://www.mindbodygreen.com/articles/heres-what-to-know-about-hand-sanitizer", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_196,w_1200,h_674/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/u0ioovrk8k7fblud4.jpg", "publishedAt": "2020-03-06T20:21:00Z", "content": "As coronavirus, or COVID-19, makes its rounds internationally, the CDC announced today that 164 people have now been infected with the virus here in the United States. And as worries rise, stores are running out of things like bulk foods and hand sanitizer as… [+348 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Allison Martell", "title": "In Canada, doctors broadened coronavirus testing, and made an unlikely save", "description": "Canada's official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to Iran before the scale…", "url": "https://www.reuters.com/article/us-health-coronavirus-canada-testing-idUSKBN20T2NZ", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499713617&w=1200&r=LYNXMPEG251UO", "publishedAt": "2020-03-06T20:28:11Z", "content": "TORONTO (Reuters) - Canada’s official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to I… [+3388 chars]"}, {"source": {"id": null, "name": "Sciencefriday.com"}, "author": "wnycdigital@gmail.com (Science Friday and WNYC Studios), Science Friday and WNYC Studios", "title": "Coronavirus Genetics, Prosthetic Hands. March 6, 2020, Part 1", "description": "A New Trick For Dexterity In Prosthetic Hands Researchers working on the next generation of prosthetic limbs have a few fundamental engineering problems to overcome. For starters, how can people using prosthetic limbs effectively signal what motions they want…", "url": "https://www.sciencefriday.com/episodes/march-6-2020/", "urlToImage": null, "publishedAt": "2020-03-06T20:58:04Z", "content": null}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Cubs RHP Darvish feeling better after sick day", "description": "Amid widespread concern about the coronavirus, Chicago Cubs pitcher Yu Darvish decided to be extra careful after he developed a cough this week", "url": "https://www.foxsports.com/mlb/story/cubs-rhp-darvish-feeling-better-after-sick-day-030620", "urlToImage": "https://b.fssta.com/uploads/2020/03/3262c30b6ac94f6e885240d953cd08c1.vresize.1200.630.high.70.jpg", "publishedAt": "2020-03-06T20:46:34Z", "content": "MESA, Ariz. (AP) — Amid widespread concern about the coronavirus, Chicago Cubs pitcher Yu Darvish decided to be extra careful after he developed a cough this week.\r\nThe Japanese right-hander visited with at least two doctors and stayed away from the team for … [+1945 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Michael McSweeney", "title": "Coronavirus risks lead to postponement of this month’s major crypto and blockchain events", "description": "The global coronavirus outbreak is affecting this season's cryptocurrency and blockchain events, with two organizers announcing postponements Friday due to health concerns.The post Coronavirus risks lead to postponement of this month's major crypto and blockc…", "url": "https://finance.yahoo.com/news/coronavirus-risks-lead-postponement-month-203250502.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/nYJyVwK7YzlC5ofe7F5pQA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/kmT8kLYY0gOwuxk0XDOSXA--~B/aD00NTA7dz02NzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/the_block_83/5e8e15f172cb905f132c21d0e010466d", "publishedAt": "2020-03-06T20:32:50Z", "content": "The global coronavirus outbreak is affecting this season's cryptocurrency and blockchain events, with two organizers announcing postponements Friday due to health concerns.\r\nBitcoin 2020, organized by BTC Inc, was originally scheduled fro, March 27-28. Howeve… [+2578 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Health experts answer your coronavirus questions", "description": "Health experts weigh in on what coronavirus does to your body, how long it lives on surfaces and more.", "url": "https://www.cbsnews.com/news/coronavirus-questions-what-to-know-health-experts-doctors/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/06/f537ad1e-757d-4ab2-804e-3e4d1fcbaa14/thumbnail/1200x630/6fb71679ecf8ea37868c4cb3289b54af/1583525871853.png", "publishedAt": "2020-03-06T20:18:50Z", "content": "As coronavirus spreads in the United States and around the world, health experts are learning more about the disease. Here are some of the things they say you should know.\r\nWhat does the coronavirus actually do to your body? \r\n\"Any point of entry to the body,… [+3205 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Jesse Holland", "title": "Coronavirus Strikes Again", "description": "The continuing outbreak of Coronavirus postpones ONE Championship, ARES FC events in Vietnam, Belgium, until the global threat subsides.", "url": "https://www.mmamania.com/2020/3/6/21168342/coronavirus-shuts-down-one-championship-ares-fc-events-vietnam-belgium-mma", "urlToImage": "https://cdn.vox-cdn.com/thumbor/j8uqtqq-pIc1ONgx3xi44FXDGaM=/0x0:4928x2580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19725650/609662360.jpg.jpg", "publishedAt": "2020-03-06T20:22:37Z", "content": "Photo credit should read ROSLAN RAHMAN/AFP via Getty Images Coronavirus strikes again. Not long after ONE Championship was forced to convert its “King of the Jungle” fight card to a closed event, the Singapore-based mixed martial arts (MMA) will now postpone … [+1098 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Public health expert Dr. Leana Wen on “The Takeout” - 3/6/2020", "description": "Public health expert Dr. Leana Wen answers coronavirus questions on this week’s episode of “The Takeout with Major Garrett.”", "url": "https://www.cbsnews.com/video/public-health-expert-dr-leana-wen-on-the-takeout-362020/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/06/13e7bf5e-b9f6-4e8b-a067-07251d6d203b/thumbnail/1200x630/d4203648cc9ebbe2ad4672a3b28f2962/0306-cbsn-thetakeout-full-2042808-640x360.jpg", "publishedAt": "2020-03-06T21:04:45Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "GuruFocus.com", "title": "A Rare Opportunity to Own Aflac", "description": "The coronavirus crisis may have provided a good opportunity to own this dividend aristocrat at a good price Continue reading...", "url": "https://finance.yahoo.com/news/rare-opportunity-own-aflac-201214820.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aps3nId5pbcyHUWEU7bzxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0zODUuNTQyMTY4Njc0Njk4OA--/https://s.yimg.com/uu/api/res/1.2/6PAM72DbLIndYqZTTrn0hQ--~B/aD0yNTA7dz04MzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/us.finance.gurufocus/79e76dd669b42db28f5d167d60f2702e", "publishedAt": "2020-03-06T20:12:14Z", "content": "Known for duck mascot, U.S. insurance company Aflac Inc. (NYSE:AFL) garners 70% of its revenue from its Japanese business, where it is the oldest and biggest cancer insurance provider. In the U.S., most of its business comes from providing supplemental insura… [+2125 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus, Big Tech, Tesla & An ETF to Invest in Disruption", "description": "Neena Mishra speaks with Gene Munster about the impact of coronavirus on tech stocks and a disruptive ETF.", "url": "https://news.yahoo.com/coronavirus-big-tech-tesla-etf-201508143.html", "urlToImage": null, "publishedAt": "2020-03-06T20:15:08Z", "content": null}, {"source": {"id": null, "name": "Survivalblog.com"}, "author": "James Wesley Rawles", "title": "Letter: Some Wuhan Coronavirus Observations", "description": "Everyone will have a different perspective on this. Here are some ramblings: Things are rapidly downshifting in greater Seattle. In less than seven days. There are strong parallels with the 2011 B-movie Contagion. Numerous employers are telling much of their …", "url": "https://survivalblog.com/letter-wuhan-coronavirus-observations/", "urlToImage": "https://survivalblog.com/wp-content/uploads/2020/01/Swine_Flu_Virus-e1579187126549.jpg", "publishedAt": "2020-03-06T20:21:44Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Shaun TANDON", "title": "Pompeo speaks of 'Wuhan virus' despite China's protests", "description": "The novel coronavirus is getting a new name from Secretary of State Mike Pompeo -- the \"Wuhan virus\" -- despite objections from China where the illness was first detected. For the second day in a row, Pompeo on Friday publicly referred to COVID-19 as the \"Wuh…", "url": "https://news.yahoo.com/pompeo-speaks-wuhan-virus-despite-chinas-protests-165826114.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sSHesNnlLMrUD5JMNR9cYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/RXK3q22GnDLOPqljCrAKeg--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/7344ce93b3187e35186941f40e32de10774fa669.jpg", "publishedAt": "2020-03-06T20:41:15Z", "content": "The novel coronavirus is getting a new name from Secretary of State Mike Pompeo -- the \"Wuhan virus\" -- despite objections from China where the illness was first detected.\r\nFor the second day in a row, Pompeo on Friday publicly referred to COVID-19 as the \"Wu… [+2701 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Aaron Colen", "title": "Chinese couples divorcing in record numbers after being stuck home together due to coronavirus", "description": "After about a month of being stuck at home, some married couples in China are getting fed up with each other. So fed up, in fact, that they're rushing to get divorced, according to Global Times. Marriage registration offices had been closed for some time, and…", "url": "https://www.theblaze.com/news/chinese-couples-divorcing-in-record-numbers-after-being-stuck-home-together-due-to-coronavirus", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg1NjYwMS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU5MjY5NTQzMX0.bRqhyIcxs7RhmldzoZXefQGfrScO75qnXry1JQPlfTM/img.jpg?width=1200&coordinates=0%2C238%2C0%2C238&height=600", "publishedAt": "2020-03-06T20:33:22Z", "content": "After about a month of being stuck at home, some married couples in China are getting fed up with each other. So fed up, in fact, that they're rushing to get divorced, according to Global Times.\r\nMarriage registration offices had been closed for some time, an… [+1820 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Examining how coronavirus can affect the economy", "description": "NBC News Senior Business Correspondent Stephanie Ruhle and New York Times Economics Writer Ben Casselman joins Yasmin Vossoughian to discuss how the coronavirus outbreak will directly affect American businesses.", "url": "https://www.msnbc.com/katy-tur/watch/examining-how-coronavirus-can-affect-the-economy-80174661548", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_tur_TurCBlock_200306_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T20:46:46Z", "content": null}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "W. E. Messamore", "title": "eBay’s Hand Sanitizer Ban Just Made Coronavirus Deadlier", "description": "Crusading journalists pumping the coronavirus crisis for outrage clicks could get people killed if hand sanitizer hoarding brings shortages. The post eBay’s Hand Sanitizer Ban Just Made Coronavirus Deadlier appeared first on CCN.com", "url": "https://www.ccn.com/ebays-hand-sanitizer-ban-just-made-coronavirus-deadlier/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/coronavirus-shortages-ap.jpg", "publishedAt": "2020-03-06T20:57:11Z", "content": "<ul><li>eBay just issued a ban on sales of face masks and hand sanitizer.</li><li>Because economically illiterate journalists are on a crusade.</li><li>Price gouging prevents shortages that make coronavirus deadlier.</li></ul>eBay is banning all sales of hand… [+2588 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Lisa Rowan", "title": "Why You Can't Use Your Own Cup At Starbucks Right Now", "description": "If you routinely take your own cup to Starbucks for the discount (and, you know, for the planet), you should know that the coffee chain has changed its policy in light of the coronavirus outbreak. More »", "url": "https://www.lifehacker.com.au/2020/03/why-you-cant-use-your-own-cup-at-starbucks-right-now/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/kmr37nvjkafhh7mzzxym.jpg", "publishedAt": "2020-03-06T20:15:00Z", "content": "If you routinely take your own cup to Starbucks for the discount (and, you know, for the planet), you should know that the coffee chain has changed its policy in light of the coronavirus outbreak.\r\nAlong with increasing its store-cleaning routines, Starbucks … [+989 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Blake Montgomery", "title": "Coronavirus Is Killing. Meanwhile, Jeff Bezos Is Chasing a Common Cold Cure", "description": "(Photo by Alex Wong/Getty Images) Talk about awkward timing. CNBC reported Friday that Jeff Bezos’ e-commerce goliath Amazon has been working for years on a secret cure for the common cold, a goal that has eluded mainstream medicine for centuries, in a scheme…", "url": "https://www.thedailybeast.com/coronavirus-is-killing-meanwhile-jeff-bezos-is-chasing-a-common-cold-cure", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583527631/GettyImages-1036093724_jwpnis", "publishedAt": "2020-03-06T20:50:41Z", "content": "Talk about awkward timing.\r\nCNBC reported Friday that Jeff Bezos e-commerce goliath Amazon has been working for years on a secret cure for the common cold, a goal that has eluded mainstream medicine for centuries, in a scheme known internally as Project Gesun… [+2239 chars]"}, {"source": {"id": null, "name": "Coindesk.com"}, "author": "Daniel Cawrey", "title": "Bitcoin’s $9,000 Price Stays Steady as Sentiment Stays Positive", "description": "As global equity markets continue to get pummeled, bitcoin’s return to the $9,000 level may have been driven by some of the same forces causing a rally in bonds — a desire for respite from a coronavirus-plagued markets. After sharp gains in price Thursday, bi…", "url": "https://www.coindesk.com/bitcoins-9000-price-stays-steady-as-sentiment-stays-positive", "urlToImage": "https://www.coindesk.com/wp-content/uploads/2020/03/bpileadimage030620-1200x628.jpg", "publishedAt": "2020-03-06T20:16:26Z", "content": "As global equity markets continue to get pummeled, bitcoins return to the $9,000 level may have been driven by some of the same forces causing a rally in bonds a desire for respite from a coronavirus-plagued markets. \r\nAfter sharp gains in price Thursday, bit… [+2306 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Anthony Chan on Fed policy: Nobody has enough ammo to do anything", "description": "The Federal Reserve cut rates by 50 basis points this week amid coronavirus concern, but critics believe it's not enough. Former JP Morgan Chief Economist Anthony Chan said of the Fed, \"nobody has enough ammo to do anything\". He joins Yahoo Finance's Seana Sm…", "url": "https://finance.yahoo.com/video/anthony-chan-fed-policy-nobody-210413177.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wi_A0sUwECm97gqB7vIl1Q--~B/aD0yMzA1O3c9NDEwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e62bacede7e2726cc4e052e/5e62bacede7e2726cc4e052f_o_U_v2.jpg", "publishedAt": "2020-03-06T21:04:13Z", "content": "The Federal Reserve cut rates by 50 basis points this week amid coronavirus concern, but critics believe it's not enough. Former JP Morgan Chief Economist Anthony Chan said of the Fed, \"nobody has enough ammo to do anything\". He joins Yahoo Finance's Seana Sm… [+28 chars]"}, {"source": {"id": null, "name": "Newswars.com"}, "author": "Dan Lyman", "title": "Five Schools In Pennsylvania Shut Down Due to Coronavirus Exposure", "description": "Party attendee from out of state may have infected students, teachers", "url": "https://www.newswars.com/five-schools-in-pennsylvania-shut-down-due-to-coronavirus-exposure/", "urlToImage": "https://www.newswars.com/wp-content/uploads/2020/03/pennasdf.jpg", "publishedAt": "2020-03-06T20:55:11Z", "content": "Party attendee from out of state may have infected students, teachers \r\nImage Credits: Juanmonino / Getty Images.\r\nBy\r\nDan Lyman \r\nFriday, March 06, 2020 \r\nFive schools in Pennsylvania have been closed after students and teachers attended a party with an out-… [+1643 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Facebook shuts down London offices over Covid-19 after visiting Singapore employee tests positive", "description": "Facebook has shut down its three London offices until Monday after a Singapore-based staff member who’d visited two weeks earlier was diagnosed with coronavirus, the social media company confirmed. Read Full Article at RT.com", "url": "https://www.rt.com/uk/482528-facebook-closes-london-offices-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.03/article/5e62b593203027693a1335ce.JPG", "publishedAt": "2020-03-06T20:49:05Z", "content": "\"An employee based in our Singapore office who has been diagnosed with COVID-19 visited our London offices 24-26 February 2020,” a Facebook spokesperson told Sky News on Friday, explaining that all three London offices would be closed for “deep cleaning” and … [+2559 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Washington state announces new coronavirus death, 15th in U.S.", "description": "A hospital in Washington state said on Friday that a 12th person had died there from coronavirus, bringing to 15 the total deaths from the respiratory illness in the United States.", "url": "https://www.reuters.com/article/us-health-coronavirus-washington-state-idUSKBN20T2QY", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T20:44:42Z", "content": "(Reuters) - A hospital in Washington state said on Friday that a 12th person had died there from coronavirus, bringing to 15 the total deaths from the respiratory illness in the United States. \r\nEvergreenHealth Medical Center in the Seattle suburb of Kirkland… [+198 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Tim Reid", "title": "Michigan to sanitize voting booths, machines amid coronavirus fears", "description": "Officials in Michigan are telling election clerks to repeatedly sanitize voting booths, touchscreen machines, pencils and other equipment ahead of Tuesday's Democratic primary, amid concerns about the impact of coronavirus on the 2020 presidential contest.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-election-idUSKBN20T2S8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T20:44:42Z", "content": "(Reuters) - Officials in Michigan are telling election clerks to repeatedly sanitize voting booths, touchscreen machines, pencils and other equipment ahead of Tuesday’s Democratic primary, amid concerns about the impact of coronavirus on the 2020 presidential… [+1958 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Taylor Carmichael)", "title": "Why Was Vir Biotechnology Up 74% in February?", "description": "The 'broken IPO' zooms upwards on fears of COVID-19.", "url": "https://www.fool.com/investing/2020/03/06/why-was-vir-biotechnology-up-74-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562004/gettyimages-1201634413_YHoAiXs.jpg", "publishedAt": "2020-03-06T20:27:00Z", "content": "What happened\r\nShares of Vir Biotechnology (NASDAQ:VIR) jumped 74.6% in February, according to data provided by S&amp;P Global Market Intelligence. In fact, the entire year has been fantastic for this stock. Vir is up a startling 264% since Jan. 2, compared t… [+2368 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Filthy dollars: Fed quarantines currency repatriated from Asia - Aljazeera.com", "description": "Filthy dollars: Fed quarantines currency repatriated from Asia Aljazeera.com Fed May Need to Buy Other Assets to Replenish Tool Kit, Official Says The New York Times The market now sees the Fed cutting by 75 basis points in March CNBC Steve Chapman: The coron…", "url": "https://www.aljazeera.com/ajimpact/filthy-dollars-fed-quarantines-currency-repatriated-asia-200306193919088.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/6/24/99e63a774c0e49b2a4a9de41349c59cf_18.jpg", "publishedAt": "2020-03-06T20:18:00Z", "content": "The greenback faces the same fate as many travellers returning home from China and other coronavirus hot spots.\r\nThe United States Federal Reserve has begun quarantining physical dollars that it repatriates from Asia before recirculating them in the US financ… [+2700 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Union tells Trump administration to take coronavirus seriously for government workers", "description": "A union representing U.S. government employees called on the Trump administration on Friday \"to take the coronavirus seriously\" for federal workers, especially those working in areas directly impacted by the outbreak.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-union-idUSKBN20T2SN", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T20:45:20Z", "content": "WASHINGTON (Reuters) - A union representing U.S. government employees called on the Trump administration on Friday “to take the coronavirus seriously” for federal workers, especially those working in areas directly impacted by the outbreak. \r\nThe American Fed… [+1818 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Haven Orecchio-Egresitz)", "title": "These couples spent nearly a month under confinement in a coronavirus quarantine, and yes, they're still married", "description": "When a man aboard the Diamond Princess cruise ship was diagnosed with coronavirus, thousands of people were quarantined to their rooms, spending days in isolation with their partners.", "url": "https://news.yahoo.com/couples-spent-nearly-month-under-204334436.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_6iRKk22lXSlnYIZ6wOp0Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NTkuNzMyMjE3NTczMjIxOA--/https://s.yimg.com/uu/api/res/1.2/zkr3JzPx57snFzFjMMUn9A--~B/aD04OTY7dz0xMTk1O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/EN/business_insider_articles_888/441174fa95e91aa8476000b89bcd5b8f", "publishedAt": "2020-03-06T20:43:34Z", "content": "The cruise ship Diamond Princess anchored at Daikoku Pier Cruise Terminal in Yokohama on February 7, 2020.\r\nKim Kyung-Hoon/Reuters\r\n<ul><li>When the Diamond Princess cruise ship went under mandatory quarantine, many guests were trapped with their partners in … [+10067 chars]"}, {"source": {"id": null, "name": "Ieee.org"}, "author": "Emily Waltz", "title": "Software and Genetic Sequencing Track the Coronavirus's Path", "description": "Online tools such as Nextstrain map the movement of the new coronavirus based on genetic mutations", "url": "https://spectrum.ieee.org/the-human-os/biomedical/devices/genetic-sequencing-and-online-software-tools-track-caronaviruss-path?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IeeeSpectrumFullText+%28IEEE+Spectrum+Full+Text%29", "urlToImage": null, "publishedAt": "2020-03-06T20:15:00Z", "content": null}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Samira Sadeque", "title": "Iran’s doctors are dancing to keep spirits high amid coronavirus scare", "description": "The videos also defy the country's rules against dancing. The post Iran’s doctors are dancing to keep spirits high amid coronavirus scare appeared first on The Daily Dot.", "url": "https://www.dailydot.com/irl/videos-iran-doctor-dancing-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/Iran-Doctor-Dancing.png", "publishedAt": "2020-03-06T20:12:03Z", "content": "As countries scramble to find contain global outbreaks of coronavirus, some doctors in Iran are dancing on camera to keep spirits high.\r\nVideos shared on social media show doctors in full radioactive gear, masks, and caps showing off their moves in hospital h… [+1876 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Howard Schneider, Jonnelle Marte and Lindsay Dunsmuir", "title": "Standard U.S. economic weapons may be inadequate for coronavirus crisis", "description": "NEW YORK/WASHINGTON (Reuters) - As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people can't go to work, are told to stay home, or stop going out…", "url": "https://news.yahoo.com/standard-u-economic-weapons-may-210242946.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Z7yMWtxNPvZTI2cfoollew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDg-/https://s.yimg.com/uu/api/res/1.2/Y3t7TgkcJrmlsa_AB_D13A--~B/aD01MzA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/95d65df7d5cf7b1c9b67bc0546a8d111", "publishedAt": "2020-03-06T21:02:42Z", "content": "By Howard Schneider, Jonnelle Marte and Lindsay Dunsmuir\r\nNEW YORK/WASHINGTON (Reuters) - As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people … [+5950 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Howard Schneider, Jonnelle Marte and Lindsay Dunsmuir", "title": "Standard U.S. economic weapons may be inadequate for coronavirus crisis", "description": "NEW YORK/WASHINGTON (Reuters) - As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people can't go to work, are told to stay home, or stop going out…", "url": "https://finance.yahoo.com/news/standard-u-economic-weapons-may-210242902.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/z0Jf335lIr1s86kSdd.7dQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDg-/https://s.yimg.com/uu/api/res/1.2/GCOTT4RytdLR7s5y4u3HiA--~B/aD01MzA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/a36c535795214d994e3e3d3cd804dc66", "publishedAt": "2020-03-06T21:02:42Z", "content": "By Howard Schneider, Jonnelle Marte and Lindsay Dunsmuir\r\nNEW YORK/WASHINGTON (Reuters) - As the risks of the coronavirus outbreak continue to rise, U.S. officials are wrestling with what to do in the worst-case economic scenarios, if large numbers of people … [+5950 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Tim Reid", "title": "Michigan to sanitize voting booths, machines amid coronavirus fears", "description": "The guidelines to election officials in Michigan follow a move by Democrats in Washington state - which also holds a primary on Tuesday - to cancel a fundraising event this weekend over concerns about the rapidly spreading and highly infectious virus, which h…", "url": "https://news.yahoo.com/michigan-sanitize-voting-booths-machines-204340850.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/deIBADOIZ0vhrUnMTxkWEw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/tyAiQ4TvOSiiDwO6Wv9WdA--~B/aD01MzQ7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/938f6150a5522ce303b69c70148c5b85", "publishedAt": "2020-03-06T20:43:40Z", "content": "By Tim Reid\r\n(Reuters) - Officials in Michigan are telling election clerks to repeatedly sanitize voting booths, touchscreen machines, pencils and other equipment ahead of Tuesday's Democratic primary, amid concerns about the impact of coronavirus on the 2020… [+1965 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Aridis Pharmaceuticals to Postpone Investor Day Due to Coronavirus Concerns", "description": "Aridis Pharmaceuticals, Inc. (Nasdaq: ARDS), a biopharmaceutical company focused on the discovery and development of novel anti-infective therapies to treat life-threatening bacterial infections, announced today the postponement of its Investor Day scheduled …", "url": "https://news.yahoo.com/aridis-pharmaceuticals-postpone-investor-day-210500193.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rw1qHUyVhOy5shV6RvbGHA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTc1NjtoPTUwNg--/https://s.yimg.com/uu/api/res/1.2/87IbTb830rQWgNWMfdXFhg--~B/aD0yNTM7dz0zNzg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/f9d31394c173db1b9268eced34762a5e", "publishedAt": "2020-03-06T21:05:00Z", "content": "SAN JOSE, Calif., March 6, 2020 /PRNewswire/ -- Aridis Pharmaceuticals, Inc. (Nasdaq: ARDS), a biopharmaceutical company focused on the discovery and development of novel anti-infective therapies to treat life-threatening bacterial infections, announced today… [+5989 chars]"}, {"source": {"id": null, "name": "Ieee.org"}, "author": "Tekla S. Perry", "title": "Coronavirus Is Triggering Fear of Going to Work", "description": "A survey by Blind shows fear of the workplace is steadily going up and productivity down, thanks to coronavirus", "url": "https://spectrum.ieee.org/view-from-the-valley/at-work/tech-careers/coronavirus-is-triggering-fear-of-going-to-work?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+IeeeSpectrumFullText+%28IEEE+Spectrum+Full+Text%29", "urlToImage": null, "publishedAt": "2020-03-06T21:00:00Z", "content": null}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Mare Holding", "title": "Signature Update: Solid Now, Solid Later", "description": "The business and general aviation (B&GA) market looks resilient into the end-of-year and has backstops in a coronavirus-impacted 2020.Signature's network initiatives continue to make progress, especially important now that chief competitor Atlantic is up for …", "url": "https://seekingalpha.com/article/4330361-signature-update-solid-now-solid-later", "urlToImage": "https://static2.seekingalpha.com/uploads/2020/3/3/51181085-1583245754343662.jpg", "publishedAt": "2020-03-06T20:31:00Z", "content": "Signature Aviation (OTCPK:BBAVF) initially caught our eye on infrastructure screeners when we discovered that Bill Gates was substantially invested, both through his foundation and the Cascade Investment family office. Their recession resistance really stood … [+9951 chars]"}]