[{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "China President Xi Jinping goes to Wuhan to inspect epidemic work - state media", "description": "China's President Xi Jinping arrived in Wuhan, the epicenter of coronavirus outbreak, on Tuesday morning where he is set to inspect epidemic control efforts and visit front line staff such as medical workers, state media reported.", "url": "https://www.reuters.com/article/us-health-coronavirus-china-president-idUSKBN20X0BE", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501072630&w=1200&r=LYNXMPEG29070", "publishedAt": "2020-03-10T03:31:57Z", "content": "SHANGHAI (Reuters) - China’s President Xi Jinping arrived in Wuhan, the epicenter of coronavirus outbreak, on Tuesday morning where he is set to inspect epidemic control efforts and visit front line staff such as medical workers, state media reported. \r\nHis v… [+184 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy House / Bloomberg", "title": "Trump’s Incoming Chief of Staff in Self-Quarantine After Possible Coronavirus Exposure", "description": "Mark Meadows was tested for the coronavirus, and although that test came back negative, he’s staying at home until Wednesday", "url": "https://time.com/5799965/mark-meadows-coronavirus-quarantine/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/Mark-Meadows.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2020-03-10T03:33:12Z", "content": "President Donald Trump has yet to be tested for the coronavirus, even as his incoming chief of staff and at least four other GOP lawmakers put themselves in quarantine after coming into contact with an infected person at a political event.\r\nMark Meadows, the … [+1884 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ryan W. Miller and Jordan Culver, USA TODAY", "title": "Missouri man breaks coronavirus self-quarantine to attend father-daughter dance. Now, the school is canceling classes", "description": "A Missouri man ignored directions to self-quarantine by attending a father-daughter dance after his other daughter tested positive for coronavirus.", "url": "https://news.yahoo.com/missouri-man-breaks-coronavirus-self-035832400.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ptWM6n3a.NAKf6iO_M4S3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/82B8kVB7d5qpqFz_Ds75Nw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e6236a1de7e2726cc4e0259/5e6236a40b5662000196adfa_1920x1080_FES_v1.jpg", "publishedAt": "2020-03-10T03:58:32Z", "content": "A Missouri man ignored health officials' directions to self-quarantine when he and his daughter attended a school dance after his other daughter tested positive for coronavirus.\r\nVilla Duchesne and Oak Hill School wrote on Facebook that classes were canceled … [+3048 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Santa Clara County Bans All Gatherings of 1000+ People After Coronavirus Death", "description": "The County of Santa Clara's Public Health Department today issued a mandatory order that requires all mass gatherings of 1,000 or more people in Santa Clara County to be canceled. Santa Clara County includes cities like Cupertino, Palo Alto, Mountain View, an…", "url": "https://www.macrumors.com/2020/03/09/santa-clara-county-bans-large-gatherings/", "urlToImage": "https://images.macrumors.com/article-new/2018/06/apple-park-drone-june-2018-2.jpg", "publishedAt": "2020-03-10T03:12:51Z", "content": "The County of Santa Clara's Public Health Department today issued a mandatory order that requires all mass gatherings of 1,000 or more people in Santa Clara County to be canceled.\r\nSanta Clara County includes cities like Cupertino, Palo Alto, Mountain View, a… [+2243 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Riot Games announces LoL Mid-Season Invitational moved to July", "description": "The 2020 League of Legends MSI has been postponed due to travel-related coronavirus concerns. It will take place July 3-19.", "url": "https://www.espn.com/esports/story/_/id/28874362/riot-games-announces-lol-mid-season-invitational-moved-july", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0906%2Fr594182_2_1296x729_16%2D9.jpg", "publishedAt": "2020-03-10T03:33:39Z", "content": "Riot Games announced Tuesday that the 2020 League of Legends Mid-Season Invitational has been postponed. It will take place July 3-19. All Rift Rivals tournaments have been canceled.\r\n\"After discussing with our leagues and other stakeholders, we've made the d… [+3299 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Yanan Wang / AP", "title": "China’s President Xi Jinping Makes First Visit to Coronavirus-Ravaged Wuhan", "description": "State media reported Xi arrived in the morning in Wuhan, which has been under lockdown along with several nearby cities since late January", "url": "https://time.com/5799975/xi-jinping-wuhan-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/xi-jinping-wuhan.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-10T04:11:02Z", "content": "(BEIJING) — President Xi Jinping on Tuesday made his first visit to the central Chinese city hit hardest by the new virus epidemic since the first cases of a then-unidentified respiratory illness emerged in December.\r\nThe disease’s spread in China cast scruti… [+6273 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ed Mazza", "title": "‘You’re A Monster!’ Colbert Puts ‘Idiot’ Trump On Notice Over Coronavirus Tweets", "description": "\"Late Show\" host seems fed up with the president's defensive tweets over the infection.", "url": "https://www.huffpost.com/entry/stephen-colbert-trump-coronavirus_n_5e66f664c5b6670e72fd3e30", "urlToImage": "https://img.huffingtonpost.com/asset/5e6709a9230000cb15dde56e.jpeg?cache=XsVIYTrjDU&ops=1200_630", "publishedAt": "2020-03-10T03:44:39Z", "content": "Trump finished with a “think about that!” and so the “Late Show” host did.\r\n“OK, let me think about that,” he said. “You’re a monster.” \r\nThe audience cheered. \r\n“Here’s the thing: We can criticize Trump’s golfing and tweeting,” he said. “But when he hunkers … [+120 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Madison Bloom", "title": "SXSW 2020 Cancellation Leads to Major Layoffs", "description": "The annual Austin festival was called off earlier this month due to coronavirus concerns", "url": "https://pitchfork.com/news/sxsw-2020-cancellation-leads-to-major-layoffs/", "urlToImage": "https://media.pitchfork.com/photos/5e67112dbe35b2000813af4d/2:1/w_790/SXSW-GettyImages-1206292285.jpg", "publishedAt": "2020-03-10T04:07:34Z", "content": "On March 6, SXSWcanceled its 2020 festival due to concerns surrounding the recent coronavirus outbreak. It marked the first cancellation in the annual Austin events 34-year history. Now, SXSWs parent company SXSW LLC has laid off roughly a third of its 175 ye… [+1080 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Noah Yoo, Evan Minsker", "title": "Is Coachella 2020 Being Postponed Due to Coronavirus Concerns?", "description": "Sources say the Indio festival is working to push the festival to October in response to public health concerns", "url": "https://pitchfork.com/news/is-coachella-2020-being-postponed-due-to-coronavirus-concerns/", "urlToImage": "https://media.pitchfork.com/photos/5e615aec58ffb900080a4914/2:1/w_790/Coachella.png", "publishedAt": "2020-03-10T03:45:49Z", "content": "Goldenvoice is reportedly working to postpone both weekends of the Coachella Valley Music and Arts Festival 2020 amid concerns about the coronavirus disease (COVID-19), sources tell Pitchfork. The festival is currently scheduled to take place in Indio, Califo… [+1338 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "No, cocaine doesn’t cure coronavirus, you big dummy", "description": "A bizarre rumor that cocaine can cure or prevent a coronavirus infection began to gain traction online. The false claims were accompanied by fake news stories, further fueling the spread. Eventually, the rumor gained enough momentum that French officials had …", "url": "https://bgr.com/2020/03/09/no-cocaine-doesnt-cure-coronavirus-you-big-dummy/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/03/1881794a-e1583768056837.jpg?quality=98&strip=all", "publishedAt": "2020-03-10T03:16:20Z", "content": "<ul><li>A bizarre rumor that cocaine can cure or prevent a coronavirus infection began to gain traction online. </li><li>The false claims were accompanied by fake news stories, further fueling the spread. </li><li>Eventually, the rumor gained enough momentum … [+2826 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Amy X. Wang", "title": "Coachella Is Preparing to Postpone", "description": "The music festival's organizers are in talks to delay the festival until October, as the U.S. reports new coronavirus cases, sources tell Rolling Stone", "url": "https://www.rollingstone.com/music/music-news/coachella-music-festival-postpone-coronavirus-964858/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/10215865ba.jpg", "publishedAt": "2020-03-10T03:41:36Z", "content": "Organizers of the Coachella Music and Arts Festival are in talks to postpone the festival amid the growing coronavirus outbreak in the U.S., multiple sources tell Rolling Stone.\r\nThe annual festival was originally scheduled to take place over two back-to-back… [+2991 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus Live Updates: WHO says threat of pandemic ‘very real’; Manipur closes border with Myanmar", "description": "Coronavirus outbreak Live Updates, Coronavirus in India Latest Updates: The number of deaths due to COVID-19 has crossed 4,000. In India, at least 47 people have tested positive for the virus.", "url": "https://indianexpress.com/article/live-news/coronavirus-live-updates-india-china-kerala-delhi-italy-iran-6307656/", "urlToImage": "https://images.indianexpress.com/2020/03/Corona-Holi-1.jpg?w=759", "publishedAt": "2020-03-10T03:28:27Z", "content": "People wearing protective masks at Khan Market in New Delhi on Saturday. (Express Photo by Tashi Tobgyal/File)\r\nThe battle to halt the coronavirus brought sweeping new restrictions Monday, with Italy expanding a travel ban to the entire country, Israel orderi… [+1632 chars]"}, {"source": {"id": null, "name": "Pocketnow.com"}, "author": "Samuel Martinez", "title": "Italy’s quarantined coronavirus hot zones are getting Amazon Prime Video for free", "description": "The coronavirus has hit Italy with force, the whole country is in lockdown, but at least certain areas will get access to Amazon Prime Video for free The post Italy’s quarantined coronavirus hot zones are getting Amazon Prime Video for free appeared first on …", "url": "https://pocketnow.com/italys-quarantined-coronavirus-hot-zones-are-getting-amazon-prime-video-for-free", "urlToImage": "https://pocketnow.com/wp/../files/2020/03/800px-Amazon_Prime_Video_logo.svg_.png", "publishedAt": "2020-03-10T03:51:09Z", "content": "Italy has become one of the most affected countries by the coronavirus. Their government has quarantined parts of North Italy to prevent further infections, and they are being extremely strict about traveling, forcing more than 16 million people to stay in th… [+768 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Ginger Christ, The Plain Dealer", "title": "Mayor Frank Jackson says Cleveland is “prepared” to handle coronavirus - cleveland.com", "description": "Mayor Frank Jackson says Cleveland is “prepared” to handle coronavirus cleveland.com Three Ohioans, all from Cuyahoga County, have coronavirus, Gov. Mike DeWine says cleveland.com Ohio is under a state of emergency because of the coronavirus. What does that m…", "url": "https://www.cleveland.com/business/2020/03/mayor-frank-jackson-says-cleveland-is-prepared-to-handle-coronavirus.html", "urlToImage": "https://www.cleveland.com/resizer/a8L0qfcO9k_jifM4oRSN9OsFj0E=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/DIHNBMEKGFGUDJKZDIJ2HUNRJU.jpg", "publishedAt": "2020-03-10T04:06:00Z", "content": "CLEVELAND, Ohio Cleveland Mayor Frank Jackson said Cleveland and Cuyahoga County are \"prepared to respond to the three confirmed new coronavirus cases in the county.\r\nJackson and other local officials addressed the media during a press conference today at Cit… [+3176 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Commonly asked questions about the coronavirus, answered - CNN", "description": "Commonly asked questions about the coronavirus, answered CNN Tapper to Adams: Is Trump 'Artificially' Keeping Coronavirus Figures Low? Newsweek Italy Now has More Coronavirus Cases Than South Korea—and Six Times as Many Deaths The Daily Beast CNN polled Ameri…", "url": "https://www.youtube.com/watch?v=fGo5WqNjrOc", "urlToImage": "https://i.ytimg.com/vi/fGo5WqNjrOc/maxresdefault.jpg", "publishedAt": "2020-03-10T03:28:27Z", "content": "CNN chief medical correspondent Dr. Sanjay Gupta answers frequently asked questions about the novel coronavirus. #CNN#News"}, {"source": {"id": null, "name": "Wesh.com"}, "author": null, "title": "Health officials announce second coronavirus case in Volusia County - WESH 2 Orlando", "description": "Health officials announce second coronavirus case in Volusia County WESH 2 Orlando Florida issues mistaken coronavirus travel advisory; lawmakers waffle on their own isolation Tampa Bay Times Florida health department announces new coronavirus case in Volusia…", "url": "https://www.wesh.com/article/health-officials-announce-second-coronavirus-case-in-volusia-county/31305960", "urlToImage": "https://kubrick.htvapps.com/vidthumb/26f552f8-8349-4e9b-a611-61a7646cfcb1/26f552f8-8349-4e9b-a611-61a7646cfcb1_image.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "publishedAt": "2020-03-10T03:28:52Z", "content": "VOLUSIA COUNTY, Fla. —The Florida Department of Health has announced another presumptive positive coronavirus case in Volusia County.\r\nAuthorities said the 60-year-old woman has a recent travel history and is currently isolated.\r\nThis is the second case to te… [+1879 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US Republicans self-quarantine amid outbreak - BBC News", "description": "Coronavirus: US Republicans self-quarantine amid outbreak BBC News 5 congressmen -- including Trump's future chief of staff and lawmaker who shook President's hand -- to self-quarantine after CPAC CNN President Trump On Coronavirus Financial Aid: \"You're Not …", "url": "https://www.bbc.com/news/world-us-canada-51812153", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9290/production/_111202573_tv059722878.jpg", "publishedAt": "2020-03-10T03:38:59Z", "content": "Image copyrightEPAImage caption\r\n Texan Senator Ted Cruz is one of several high-profile Republicans to have quarantined themselves\r\nFive senior US Republicans have quarantined themselves after coming into contact with a person who tested positive for coronavi… [+4845 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Angelique Jackson", "title": "Andie MacDowell Talks Ageism, Yvette Nicole Brown Praises Elizabeth Warren at Int’l Women’s Day Event", "description": "In the midst of Coronavirus crisis, Andie MacDowell, Logan Browning and Yvette Nicole Brown were among those who put their worries aside to celebrate International Women’s Day at the National Women’s History Museum’s eighth annual Women Making History Awards.…", "url": "https://variety.com/2020/scene/awards/andie-macdowell-yvette-nicole-brown-logan-browning-women-making-history-awards-1203528479/", "urlToImage": "https://pmcvariety.files.wordpress.com/2020/03/shutterstock_editorial_10577257dl.gif?w=700&h=393&crop=1", "publishedAt": "2020-03-10T03:43:26Z", "content": "In the midst of Coronavirus crisis, Andie MacDowell, Logan Browning and Yvette Nicole Brown were among those who put their worries aside to celebrate International Women’s Day at the National Women’s History Museum’s eighth annual Women Making History Awards.… [+3483 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan PM says won't hesitate to do what's needed in coronavirus fight", "description": "Japanese Prime Minister Shinzo Abe said on Tuesday the government would carry out whatever measures are needed without hesitation to respond to the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-health-coronavirus-japan-abe-idUSKBN20X0CO", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501078945&w=1200&r=LYNXMPEG2907K", "publishedAt": "2020-03-10T03:52:41Z", "content": "TOKYO (Reuters) - Japanese Prime Minister Shinzo Abe said on Tuesday the government would carry out whatever measures are needed without hesitation to respond to the coronavirus outbreak. \r\nAbe told reporters markets were showing nervous movements. The govern… [+269 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "2Pac's 'Me Against The World' Receives 25th Anniversary 2LP Vinyl Reissue", "description": "Amaru Entertainment and Interscope are celebrating the 25th anniversary of 2Pac's Me Against The World with a special 180-gram 2LP vinyl reissue. The LP release accompanies the previously announced '90s hip-hop merchandise from the Tupac Shakur estate, also d…", "url": "https://hypebeast.com/2020/3/2pac-me-against-the-world-25-anniversary-2lp-reissue", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2F2pac-me-against-the-world-25-anniversary-double-lp-reissue-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-10T03:58:36Z", "content": "Amaru Entertainment and Interscope are celebrating the 25th anniversary of 2Pac‘s Me Against The World with a special 180-gram 2LP vinyl reissue. The LP release accompanies the previously announced ’90s hip-hop merchandise from the Tupac Shakur estate, also d… [+722 chars]"}, {"source": {"id": null, "name": "Brooklynvegan.com"}, "author": "BrooklynVegan Staff", "title": "Coachella postponed to October, according to sources", "description": "According to sources, the coronavirus is causing the postponement of yet another festival. Continue reading…", "url": "http://www.brooklynvegan.com/coachella-postponed-to-october-according-to-sources/", "urlToImage": "http://www.brooklynvegan.com/files/2019/04/coachella2019-w2-friday-04.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2020-03-10T03:23:27Z", "content": "Coachella 2019 Weekend 2 (more by Pooneh Ghana)\r\nThe coronavirus has already caused the cancellation or postponement of many festivals and tours, including Ultra, SXSW, and Pearl Jam’s spring tour. According to sources, it’s lead to the postponement of yet an… [+1762 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Kevin Yamamura", "title": "Silicon Valley county bans all mass gatherings for 3 weeks in most forceful U.S. action yet", "description": "The mandatory order applies to all events with at least 1,000 people and was issued by Sara Cody, Santa Clara County's health officer.", "url": "https://www.politico.com/states/california/story/2020/03/09/silicon-valley-county-bans-all-mass-gatherings-for-3-weeks-in-most-forceful-us-action-yet-1266316", "urlToImage": "https://static.politico.com/2c/10/9ecce03445b0a5c6cf71f151f759/ap-18255602360827.jpg", "publishedAt": "2020-03-10T03:53:14Z", "content": "People wait outside of the Steve Jobs Theater before an event to announce new Apple products | Marcio Jose Sanchez/AP Photo\r\nHealth officials in the heart of the Silicon Valley took the most dire coronavirus steps yet in the U.S. by banning large public gathe… [+1536 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Robyn Merrett", "title": "White House Says Trump Has Not Been Tested for Coronavirus and 'Remains in Excellent Health'", "description": "The White House has issued a statement on whether or not Donald Trump has been tested for coronavirus after the president came in contact with at least three politicians who have decided to self-quarantine. “The President has not received COVID-19 testing bec…", "url": "https://people.com/politics/white-house-trump-not-tested-coronavirus-remains-in-excellent-health/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Ftrump.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T03:30:26Z", "content": "The White House has issued a statement on whether or not Donald Trump has been tested for coronavirus after the president came in contact with at least three politicians who have decided to self-quarantine.\r\n“The President has not received COVID-19 testing be… [+4349 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "Alanna Autler", "title": "Frisco ISD Disinfects School In Wake Of Parent Testing Positive For Presumptive Case Of Coronavirus - CBS Dallas / Fort Worth", "description": "Frisco ISD Disinfects School In Wake Of Parent Testing Positive For Presumptive Case Of Coronavirus CBS Dallas / Fort Worth View Full Coverage on Google News", "url": "https://dfw.cbslocal.com/2020/03/09/frisco-isd-disinfects-school-parent-testing-positive-coronavirus/", "urlToImage": "https://dfw.cbslocal.com/wp-content/uploads/sites/15909545/2020/03/aaschool.jpg?w=1280", "publishedAt": "2020-03-10T03:17:54Z", "content": "FRISCO, Texas (CBSDFW.COM) – Frisco ISD is already taking action after alerting the community about a presumptive case of COVID-19.The superintendent sent an email to parents and employees Monday confirming that a parent in his 30s had tested positive for a p… [+3044 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Diana Raab PhD", "title": "How to Deal with the Fear of Coronavirus", "description": "In regard to the coronavirus, are the facts and stories instilling you with fear? Here a a few ideas to help you minimize your fear, while also helping you cope.", "url": "https://www.psychologytoday.com/ca/blog/the-empowerment-diary/202003/how-deal-the-fear-coronavirus", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_images/2020-03/desperate-2048905_1920.jpg?itok=qbdh1I_i", "publishedAt": "2020-03-10T03:28:41Z", "content": "Most of us cling to our fears, which often causes us to give away our power and makes us feel more vulnerable. All the news surrounding the risks, challenges, and deaths associated with the current coronavirus, Covid-19, has definitely weakened us.\r\nAs a high… [+4528 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Diana Raab PhD", "title": "How to Deal with the Fear of Coronavirus", "description": "In regard to the coronavirus, are the facts and stories instilling you with fear? Here a a few ideas to help you minimize your fear, while also helping you cope.", "url": "https://www.psychologytoday.com/us/blog/the-empowerment-diary/202003/how-deal-the-fear-coronavirus", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_images/2020-03/desperate-2048905_1920.jpg?itok=qbdh1I_i", "publishedAt": "2020-03-10T03:28:41Z", "content": "Most of us cling to our fears, which often causes us to give away our power and makes us feel more vulnerable. All the news surrounding the risks, challenges, and deaths associated with the current coronavirus, Covid-19, has definitely weakened us.\r\nAs a high… [+4528 chars]"}, {"source": {"id": null, "name": "Digiday.com"}, "author": "Tim Peterson", "title": "‘Basically irreplaceable’: Olympic ad dollars could evaporate from market if coronavirus causes cancellation", "description": "If the Olympics are canceled, advertisers would likely refrain from reallocating their ad dollars in order to protect their businesses’ bottom lines. The post ‘Basically irreplaceable’: Olympic ad dollars could evaporate from market if coronavirus causes canc…", "url": "https://digiday.com/marketing/basically-irreplaceable-olympic-ad-dollars-evaporate-market-coronavirus-causes-cancellation/", "urlToImage": "https://digiday.com/wp-content/uploads/2020/02/corona3.jpg", "publishedAt": "2020-03-10T04:01:15Z", "content": "NBCUniversal has sold more than $1.25 billion worth of national advertising inventory for this years Olympics. However, if the coronavirus outbreak leads to the Games cancellation, much of the ad money won’t be reallocated to other channels.On Feb. 25, a seni… [+4024 chars]"}, {"source": {"id": null, "name": "Kbtx.com"}, "author": "Mekena Rodriguez", "title": "Some local restaurants seeing drop in business amid coronavirus concerns - KBTX", "description": "Concerns circling around coronavirus are starting to have some impact on local restaurants.", "url": "https://www.kbtx.com/content/news/Local-restaurants-seeing-drop-in-business-amid-coronavirus-concerns-568652291.html", "urlToImage": "https://media.graytvinc.com/images/coronavirus32.JPG", "publishedAt": "2020-03-10T03:51:26Z", "content": "BRYAN, Tex. (KBTX)- Concerns circling around coronavirus are starting to have some impact on local restaurants. \r\nCody Whitten, owner of J Codys BBQ in Bryan says he started to notice a dip in sales towards the end of January.\r\nWe think that were down more th… [+1619 chars]"}, {"source": {"id": null, "name": "Digiday.com"}, "author": "Kristina Monllos", "title": "‘Ruthlessly planning ahead’: Male agency execs on balancing work and family in the age of coronavirus", "description": "Men also have to manage family life and work but often the question of a work/life balance is relegated to women in power. This year, for International Women's Day, Digiday asked male agency execs how they balance work and family. The post ‘Ruthlessly plannin…", "url": "https://digiday.com/marketing/ruthlessly-planning-ahead-male-agency-execs-balancing-work-family-age-coronavirus/", "urlToImage": "https://digiday.com/wp-content/uploads/2020/03/balancekids.jpg", "publishedAt": "2020-03-10T04:00:01Z", "content": "Balancing work and family is tricky — regardless of your gender. As the spread of COVID-19, more commonly known as coronavirus, changes workplaces and makes it more likely that schools or daycare may be closed, people with children will have to figure out how… [+7182 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Nellie Andreeva", "title": "‘Jeopardy’ & ‘Wheel Of Fortune’ To Film Without Audience Because Of Coronavirus Concerns", "description": "In what may be precursor to things to come in the TV industry as the U.S. is trying to contain the rapidly growing coronavirus outbreak, game shows Jeopardy! and Wheel Of Fortune will tape episodes without studio audiences for the foreseeable future, Deadline…", "url": "https://deadline.com/2020/03/jeopardy-wheel-of-fortune-film-without-audience-because-of-coronavirus-concerns-1202878109/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/10/alex-trebek-on-jeopardy.jpg?w=1000", "publishedAt": "2020-03-10T03:18:44Z", "content": "In what may be precursor to things to come in the TV industry as the U.S. is trying to contain the rapidly growing coronavirus outbreak, game shows Jeopardy! and Wheel Of Fortune will tape episodes without studio audiences for the foreseeable future, Deadline… [+624 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Anne Gulland", "title": "Donors pledge nearly £100m to find coronavirus treatment", "description": "Researchers are to begin screening a bank of 10,000 drug compounds in a bid to find new treatments for the coronavirus sweeping the world.", "url": "https://www.telegraph.co.uk/global-health/climate-and-people/donors-pledge-nearly-100m-find-coronavirus-treatment/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/09/TELEMMGLPICT000227395073-xlarge_trans_NvBQzQNjv4Bqr-CAX0237pW5VS1eHdEbwvxBTT_EjvUpzgN5AUdWLhQ.jpeg?imwidth=1200", "publishedAt": "2020-03-10T04:01:00Z", "content": "Researchers are to begin screening a bank of 10,000 drug compounds in a bid to find new treatments for the coronavirus sweeping the world.\r\nThere are currently no specific treatments for the virus, which has now infected more than 110,000 people globally and … [+3015 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Reed Albergotti, Faiz Siddiqui, Mark Berman", "title": "Grand Princess cruise ship carrying coronavirus patients docks in Oakland - The Washington Post", "description": "Grand Princess cruise ship carrying coronavirus patients docks in Oakland The Washington Post People fighting over 'rotten' food on coronavirus-stricken Grand Princess cruise: passenger New York Post Grand Princess finally allowed to dock at California port |…", "url": "https://www.washingtonpost.com/nation/2020/03/09/grand-princess-cruise-ship-infected-with-coronavirus-docks-oakland/", "urlToImage": "https://www.washingtonpost.com/resizer/u0JH_8VyLNfM_Z5wFg8aTnrD-X4=/1440x0/smart/d1i4t8bqe7zgj6.cloudfront.net/03-09-2020/t_2392257cb4d0483c8c62bb2bff1e725d_name_thumbnailprincess_scaled.jpg", "publishedAt": "2020-03-10T03:48:33Z", "content": "Thank you, shouted one passenger. Others waved at the dock workers.\r\nRoughly five hours later, a slow line of passengers moved down the walkway as people finally disembarked. Workers in the area donned full-body protective clothing, including tan suits, scrub… [+8994 chars]"}, {"source": {"id": null, "name": "Fox5sandiego.com"}, "author": "City News Service", "title": "City to prosecute businesses suspected of coronavirus-related price gouging - FOX 5 San Diego", "description": "The San Diego County District Attorney’s Office advised local business owners and consumers Monday that it will prosecute businesses that unnecessarily raise prices during the coronavirus sta…", "url": "https://fox5sandiego.com/news/coronavirus/city-to-prosecute-businesses-suspected-of-coronavirus-related-price-gouging/", "urlToImage": "https://fox5sandiego.com/wp-content/uploads/sites/15/2020/03/Hand-sanitizer.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-03-10T03:17:45Z", "content": "SAN DIEGO (CNS) — The San Diego County District Attorney’s Office advised local business owners and consumers Monday that it will prosecute businesses that unnecessarily raise prices during the coronavirus state of emergency.\r\nOvercharging for essential goods… [+1496 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Ashley Boucher", "title": "Pearl Jam Postpones First Leg of Tour and Calls Out Trump Administration Amid Coronavirus Concerns", "description": "Pearl Jam is postponing the first leg of their upcoming concert tour, the band announced on Twitter Monday, amidst growing concerns about the novel coronavirus (COVID-19). In a lengthy, multi-tweet statement on Twitter, the band — including frontman Eddie Ved…", "url": "https://people.com/music/pearl-jam-postpones-first-leg-of-tour-slams-trump-administration-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fpearl-jam-11.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T03:39:28Z", "content": "Pearl Jam is postponing the first leg of their upcoming concert tour, the band announced on Twitter Monday, amidst growing concerns about the novel coronavirus (COVID-19).\r\nIn a lengthy, multi-tweet statement on Twitter, the band — including frontman Eddie Ve… [+3495 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: Italy on lockdown as number of COVID-19 cases surges - Global News", "description": "Coronavirus outbreak: Italy on lockdown as number of COVID-19 cases surges Global News Italy expands its quarantine to the entire country as coronavirus cases and deaths surge CNBC All of Italy is now on lockdown due to coronavirus CNN BREAKING: Italy Locks D…", "url": "https://www.youtube.com/watch?v=csg5YkMPdhs", "urlToImage": "https://i.ytimg.com/vi/csg5YkMPdhs/maxresdefault.jpg", "publishedAt": "2020-03-10T03:48:28Z", "content": "After locking down much of northern Italy, the country's prime minister, Giuseppe Conte said Monday that strict travel restrictions would be imposed across the entire country as the number of COVID-19 cases continues to grow.\r\nItaly has more than 9,000 confir… [+427 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Julie Steenhuysen", "title": "Gates, other charities pledge $125 million towards COVID-19 treatments", "description": "The Bill & Melinda Gates Foundation and two other large charities on Tuesday pledged up to $125 million to help speed the development of treatments for the fast-spreading coronavirus, which the World Health Organization said on Monday was nearing pandemic pro…", "url": "https://www.reuters.com/article/us-health-coronavirus-charity-idUSKBN20X0E7", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501082748&w=1200&r=LYNXMPEG2908F", "publishedAt": "2020-03-10T04:06:30Z", "content": "CHICAGO (Reuters) - The Bill &amp; Melinda Gates Foundation and two other large charities on Tuesday pledged up to $125 million to help speed the development of treatments for the fast-spreading coronavirus, which the World Health Organization said on Monday … [+1418 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Businesses blame coronavirus fears for fall in confidence - Sky News", "description": "Other challenges cited by bosses were domestic economic challenges and uncertainty over the UK's trading status with the EU.", "url": "https://news.sky.com/story/business-directors-blame-coronavirus-fears-for-fall-in-confidence-11953893", "urlToImage": "https://e3.365dm.com/20/03/1600x900/skynews-coronavirus-mask-london_4940483.jpg?20200307023517", "publishedAt": "2020-03-10T03:28:56Z", "content": null}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Alex Young", "title": "Coachella Likely Pushed Back to Fall Due to Coronavirus", "description": "Festival organizers are currently in talks to move the festival to October. Coachella Likely Pushed Back to Fall Due to Coronavirus Alex Young", "url": "https://consequenceofsound.net/2020/03/coachella-postponmenet/", "urlToImage": "https://consequenceofsound.net/wp-content/uploads/2020/03/Coachella-2020.png", "publishedAt": "2020-03-10T03:40:24Z", "content": "As concerns over the coronavirus permeate throughout the concert industry, Coachella organizers are considering a plan to push back the California music festival to the fall.\r\nGoldenvoice, the production company behind Coachella, is examining the possibility … [+1734 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: NHS targets fake news spreading online", "description": "Health service officials are working with major social media firms to try to combat misinformation.", "url": "https://www.bbc.co.uk/news/uk-51812326", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7D78/production/_111202123_hi059849220.jpg", "publishedAt": "2020-03-10T03:32:36Z", "content": "Image copyrightPA Media\r\nOfficial NHS guidance about coronavirus is to appear at the top of internet search results in an attempt to combat misinformation about the infection.\r\nThe NHS said it was working with firms including Google and Facebook on ways to he… [+3216 chars]"}, {"source": {"id": null, "name": "Complex.com"}, "author": "Jose Martinez", "title": "Study Claims That Coronavirus Can Travel Farther and Last Longer Than What Was Thought", "description": "As if you needed anymore coronavirus-related bad news.", "url": "https://www.complex.com/life/2020/03/study-claims-coronavirus-can-travel-farther-than-previously-thought", "urlToImage": "https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1/zgxhvovf245zof0xozpo/coronavirus-spread-study", "publishedAt": "2020-03-10T03:49:14Z", "content": "A new study claims that COVID-19, popularly known as coronavirus, can be transmitted from a further distance than previously thought, and last longer on certain surfaces than originally suspected. \r\nIn a paper for the Practical Preventive Medicine journal obt… [+1694 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " 23 Haunting Pictures Of Northern Italy On Lockdown Due To The Coronavirus via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_0a65e9b50338e9b786122f2f1050d03d", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T03:40:09Z", "content": "The Ohio State University, Coronavirus\r\nIn an effort to stop the spread of the coronavirus, Ohio State is suspending all in-person classes through at least March 30, instead moving to..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " This bar is over it via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_85ea997de8803fbe3a3d2ae2f1e6293e", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T03:40:09Z", "content": "The Ohio State University, Coronavirus\r\nIn an effort to stop the spread of the coronavirus, Ohio State is suspending all in-person classes through at least March 30, instead moving to..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " My dog's grave. He died on the 6th, of old age. He was 15. via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_f3625fe1687b5126c772031dda59c55c", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T03:40:09Z", "content": "The Ohio State University, Coronavirus\r\nIn an effort to stop the spread of the coronavirus, Ohio State is suspending all in-person classes through at least March 30, instead moving to..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The Trump Administration Is Stalling an Intel Report That Warns the U.S. Isnt Ready for a Global Pandemic via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_1116b979b17097da9b397e848862f659", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T03:40:09Z", "content": "The Ohio State University, Coronavirus\r\nIn an effort to stop the spread of the coronavirus, Ohio State is suspending all in-person classes through at least March 30, instead moving to..."}, {"source": {"id": null, "name": "Masslive.com"}, "author": "Matt Vautour | mvautour@masslive.com", "title": "Coronavirus concerns has Bruins at San Jose Sharks game on March 21 in doubt (report) - MassLive.com", "description": "Coronavirus concerns has Bruins at San Jose Sharks game on March 21 in doubt (report) MassLive.com First Bay Area coronavirus death: A woman in her 60s from Santa Clara County Los Angeles Times Santa Clara County bans gatherings of 1,000-plus after first deat…", "url": "https://www.masslive.com/bruins/2020/03/coronavirus-concerns-cancels-bruins-at-san-jose-sharks-game-on-march-21-report.html", "urlToImage": "https://www.masslive.com/resizer/2uvozomjZpU6-u4Ek7Hl8s_TXzA=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/X4ZZCKICTJDCDMONTCPEDRMN44.jpg", "publishedAt": "2020-03-10T04:02:00Z", "content": "The Boston Bruins game at the San Jose Sharks on March 21 is among the events potentially affected by the Santa Clara County temporary ban on gatherings of 1,000 or more people.\r\nInitially, the San Jose Mercury News reported that all events at the SAP Center … [+1771 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Matt Stieb", "title": "Monday’s Eight Most Daunting Coronavirus Stories", "description": "The most troublesome reports on Monday show how deep into the crisis we already are — and how far left there is to go.", "url": "http://nymag.com/intelligencer/2020/03/mondays-eight-most-daunting-coronavirus-stories.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/01/09/priest_collar.w1200.h630.jpg", "publishedAt": "2020-03-10T03:56:32Z", "content": "Well that could have gone better: The first day of the second week of March ended with a blistering number of news stories indicating that coronavirus outbreaks in the United States will continue to soar as the market tumbles. Below are some of the days more … [+3582 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Krishna N. Das", "title": "In Malaysia's Silicon Valley, fortunes flip as virus wrecks trade war gains", "description": "Tech firms at Malaysia's one-time Silicon Valley of the East, swimming in orders from customers fleeing trade war-hit China, have seen fortunes turn again in the space of just a year as the coronavirus outbreak cuts them off from Chinese suppliers.", "url": "https://www.reuters.com/article/us-health-coronavirus-malaysia-focus-idUSKBN20X0BG", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501076975&w=1200&r=LYNXMPEG29075", "publishedAt": "2020-03-10T03:45:26Z", "content": "PENANG, Malaysia (Reuters) - Tech firms at Malaysia’s one-time Silicon Valley of the East, swimming in orders from customers fleeing trade war-hit China, have seen fortunes turn again in the space of just a year as the coronavirus outbreak cuts them off from … [+5546 chars]"}, {"source": {"id": null, "name": "Straitstimes.com"}, "author": "hermesauto", "title": "Singapore business confidence falls to record low on coronavirus worries: Survey - The Straits Times", "description": "Business sentiment tumbled to -7.88 percentage points in Q2 2020 from 5.31 percentage points in Q1 2020 as all six of the study's indicators reported negative numbers.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/business/economy/singapore-business-confidence-falls-to-record-low-on-coronavirus-worries-survey", "urlToImage": "https://www.straitstimes.com/sites/default/files/styles/x_large/public/articles/2020/03/10/fhsgvirus10.jpg?itok=v_t9azkr", "publishedAt": "2020-03-10T03:20:01Z", "content": "SINGAPORE (THE BUSINESS TIMES) - Business sentiment among Singapore firms plunged to an all-time low in the second quarter of 2020 because of coronavirus health risks and potential economic impact.\r\nThis is according to the Singapore Commercial Credit Bureau'… [+2748 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Google restricts visits to curb coronavirus risk", "description": "Google on Monday began restricting visits to its offices in Silicon Valley, San Francisco and New York as it ramped up precautions against the deadly novel coronavirus. The added measure was enacted as word went out that Apple had joined the list of technolog…", "url": "https://news.yahoo.com/google-restricts-visits-curb-coronavirus-risk-034146770.html", "urlToImage": null, "publishedAt": "2020-03-10T03:41:46Z", "content": null}, {"source": {"id": null, "name": "Paultan.org"}, "author": "Gerard Lye", "title": "Cadillac Lyriq unveiling delayed due to coronavirus", "description": "It isn’t just motor shows that are affected by the coronavirus, as Cadillac has decided to cancel the debut of its new crossover electric vehicle – the Lyriq – which was originally planned for April […] The post Cadillac Lyriq unveiling delayed due to coronav…", "url": "https://paultan.org/2020/03/10/cadillac-lyriq-unveiling-delayed-due-to-coronavirus/", "urlToImage": "https://s1.paultan.org/image/2020/03/Cadillac-EV-002-1200x628.jpg", "publishedAt": "2020-03-10T03:43:12Z", "content": "It isnt just motor shows that are affected by the coronavirus, as Cadillac has decided to cancel the debut of its new crossover electric vehicle – the Lyriq – which was originally planned for April 2. The Lyriq was originally planned to be unveiled in Los Ang… [+1151 chars]"}, {"source": {"id": null, "name": "Ajc.com"}, "author": "Ligaya Figueras", "title": "Restaurants take extra safety precautions amid decline in business - Atlanta Journal Constitution", "description": "Restaurants take extra safety precautions amid decline in business Atlanta Journal Constitution", "url": "https://www.ajc.com/entertainment/dining/restaurants-take-extra-safety-precautions-amid-decline-business/H08bpqTSdjY9i4z3ZZTN2J/", "urlToImage": "https://www.ajc.com/rf/image_large/Pub/p11/AJC/2020/03/09/Images/newsEngin.25438336_081218-sla-varsity-HS10.jpg", "publishedAt": "2020-03-10T03:54:11Z", "content": "Less than two weeks ago, Chinese restaurant owners in metro Atlanta reported a sharp decline in business due to diner concerns about contracting the coronavirus. But as COVID-19 has spread across the globe, other local food service operators have begun to exp… [+3971 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bloomberg News", "title": "China’s New Cases Slow; Xi Visits Wuhan: Virus Update", "description": "(Bloomberg) -- President Donald Trump promised “very dramatic” actions to support the U.S. economy as the World Health Organization said the threat of a pandemic is “very real.”Infections climbed across Europe and Italy attempted a nationwide lockdown, but th…", "url": "https://finance.yahoo.com/news/travel-companies-pull-forecasts-italy-215206338.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/UeSacinYuP.jNdM_U2TQkA--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/ff695600d861fc33f8c9fffb1e7b1479", "publishedAt": "2020-03-10T03:42:31Z", "content": "(Bloomberg) -- President Donald Trump promised very dramatic actions to support the U.S. economy as the World Health Organization said the threat of a pandemic is very real.\r\nInfections climbed across Europe and Italy attempted a nationwide lockdown, but the … [+12418 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Digital Desk", "title": "Coronavirus Outbreak: WHO calls threat of pandemic very real - Republic World - Republic World", "description": "Coronavirus Outbreak: WHO calls threat of pandemic very real - Republic World Republic World WHO: Coronavirus mortality rate more than flu's Times of India Threat of coronavirus pandemic now 'very real': World Health Organization Livemint Threat of coronaviru…", "url": "https://www.republicworld.com/world-news/global-event-news/coronavirus-outbreak-who-calls-threat-of-pandemic-very-real.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/osykyfzttekaocnj_1583810015.jpeg?tr=f-jpeg", "publishedAt": "2020-03-10T03:13:00Z", "content": "The World Health Organisation warned on Monday there was now a \"very real\" threat that the global outbreak of the new deadly coronavirus will become a pandemic, but stressed the virus could still be controlled.\r\n\"The threat of a pandemic has become very real,… [+1709 chars]"}, {"source": {"id": null, "name": "Thefader.com"}, "author": "Shaad D'Souza", "title": "Miley Cyrus and Lil Nas X cancel concert over coronavirus fears", "description": "The show, featuring Miley Cyrus, Lil Nas X, and The Veronicas, was due to take place this Friday.", "url": "https://www.thefader.com/2020/03/09/miley-cyrus-lil-nas-x-cancel-concert-over-coronavirus-fears", "urlToImage": "https://thefader-res.cloudinary.com/private_images/c_limit,w_1024/c_crop,h_458,w_879,x_66,y_0,f_auto,q_auto:eco/GettyImages-1159236399_cguel6/GettyImages-1159236399_cguel6.jpg", "publishedAt": "2020-03-10T03:58:58Z", "content": "Miley Cyrus has announced that her Australian bushfire relief concert featuring Lil Nas X and The Veronicas, set to happen this Friday March 13th, will no longer go ahead due to fears over coronavirus. The one-off show was announced last month as a benefit fo… [+1448 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Hilary Pollack, Hilary Pollack", "title": "Coachella Will Likely Be Postponed Until October", "description": "Officials are in the final stages of deciding what to do about the festival amid concerns about coronavirus, according to Billboard.", "url": "https://www.vice.com/en_us/article/xgq734/coachella-will-likely-be-postponed-until-october", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e6707228dbef1019b2e88be/lede/1583810341136-GettyImages-671669202.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*", "publishedAt": "2020-03-10T04:03:24Z", "content": "It's hard to believe that just a couple weeks ago, most Americans were going about business as usual despite news stories beginning to proliferate about the potentially disastrous consequences of coronavirus landing in the States. But as the spread of COVID-1… [+2128 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Elizabeth Elkind", "title": "Coronavirus vs. common flu: Doctor explains the difference", "description": "Flu symptoms like high fever, cough and shortness of breath can also be seen in coronavirus patients, which is why \"tests are so important.\"", "url": "https://news.yahoo.com/coronavirus-vs-common-flu-doctor-032155795.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.VAH9wk_NDGFhELGcRnX3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/29BpGRp01Nexl01scKg59Q--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/cbs_news_897/ef034f8a2fb2a8afcf63aae68ff3aa22", "publishedAt": "2020-03-10T03:21:55Z", "content": "As public alarm about coronavirus grows, so does concern and confusion over what separates it from more familiar illnesses such as the common flu. CBS News Chief Medical Correspondent Dr. Jon LaPook explains why the viruses are very \"different things.\" \r\n\"The… [+2375 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Trump Hasn’t Been Tested for Virus But Top Aide Is Quarantined - Bloomberg", "description": "Trump Hasn’t Been Tested for Virus But Top Aide Is Quarantined Bloomberg Incoming White House chief of staff Mark Meadows among lawmakers sidelined by coronavirus concerns The Washington Post Mark Meadows, Trump’s incoming chief of staff, to self-quarantine o…", "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=4f586230-628b-11ea-90ad-319a85de111b&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wMy0xMC9tYXJrLW1lYWRvd3MtcXVhcmFudGluZXMtaGltc2VsZi1hZnRlci1jb3JvbmF2aXJ1cy1jb250YWN0", "urlToImage": null, "publishedAt": "2020-03-10T04:06:20Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "The mammoth task of tracing contacts of coronavirus-affected Bengaluru techie - The News Minute", "description": "The mammoth task of tracing contacts of coronavirus-affected Bengaluru techie The News Minute Karnataka declares holiday for LKG, UKG over Covid-19 scare Times of India Coronavirus update: Two test positive in Punjab, Karnataka; count climbs to 45 Livemint Co…", "url": "https://www.thenewsminute.com/article/mammoth-task-tracing-contacts-coronavirus-affected-bengaluru-techie-119864", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Corona-repn-image.jpg", "publishedAt": "2020-03-10T03:33:48Z", "content": "The Bengaluru techie who tested positive works in an MNC and has had primary or secondary contact with around 2,666 people since his return from the USA.Karnataka recorded its first case of coronavirus in the state with a software engineer in Bengaluru with a… [+2833 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus Live Updates: IAF C-17 Globemaster rescues 58 pilgrims from Iran; 46 COVID-19 cases in India - The Financial Express", "description": "Coronavirus Live Updates: IAF C-17 Globemaster rescues 58 pilgrims from Iran; 46 COVID-19 cases in India The Financial Express Coronavirus Outbreak LIVE Updates: Global Death Toll Crosses 4,000; India Closes Border With Myanmar News18 Coronavirus Live Updates…", "url": "https://news.google.com/__i/rss/rd/articles/CBMivgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2Nvcm9uYXZpcnVzLWxpdmUtdXBkYXRlcy1jb3JvbmF2aXJ1cy1sYXRlc3QtbmV3cy11cGRhdGVzLW9uLWNvcm9uYXZpcnVzLWluLWluZGlhLXN5bXB0b21zLXByZXZlbnRpb24tcHVuZS1kZWxoaS1iYW5nYWxvcmUtaHlkZXJhYmFkLzE4OTM4ODAv0gHDAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvY29yb25hdmlydXMtbGl2ZS11cGRhdGVzLWNvcm9uYXZpcnVzLWxhdGVzdC1uZXdzLXVwZGF0ZXMtb24tY29yb25hdmlydXMtaW4taW5kaWEtc3ltcHRvbXMtcHJldmVudGlvbi1wdW5lLWRlbGhpLWJhbmdhbG9yZS1oeWRlcmFiYWQvMTg5Mzg4MC9saXRlLw?oc=5", "urlToImage": null, "publishedAt": "2020-03-10T04:08:52Z", "content": null}, {"source": {"id": null, "name": "Spin.com"}, "author": "Daniel Kohn", "title": "Coachella 2020 Could Be Postponed Until October", "description": "Coachella could be postponed until the weekends of Oct. 9 and 16 respectively following the coronavirus outbreak, multiple people familiar with the matter tell SPIN. On March 6, Ultra Music Festival and South-by-Southwest were canceled by the cities of Miami …", "url": "https://www.spin.com/2020/03/coachella-2020-could-be-postponed-until-october/", "urlToImage": "https://s3-us-west-1.amazonaws.com/static-spin-com/files/2020/03/GettyImages-1138602544_opt-1583536174.jpg", "publishedAt": "2020-03-10T03:55:36Z", "content": "Coachella could be postponed until the weekends of Oct. 9 and 16 respectively following the coronavirus outbreak, multiple people familiar with the matter tell SPIN.\r\nOn March 6, Ultra Music Festival and South-by-Southwest were canceled by the cities of Miami… [+1010 chars]"}, {"source": {"id": null, "name": "Mlbtraderumors.com"}, "author": "Connor Byrne", "title": "KBO Postpones Start Of Season; MLB Doesn’t Plan To Change Schedule", "description": "Major League Baseball decided Monday to close clubhouses to media members for an undisclosed period of time because of the coronavirus outbreak. Japan’s Nippon Professional Baseball took the more drastic measure to postpone the start of its regular season. Th…", "url": "https://www.mlbtraderumors.com/2020/03/kbo-postpones-start-of-season-mlb-doesnt-plan-to-change-schedule.html", "urlToImage": "https://cdn.mlbtraderumors.com/files/2020/02/USATSI_137770731-1024x682.jpg", "publishedAt": "2020-03-10T03:42:17Z", "content": "Major League Baseball decided Monday to close clubhouses to media members for an undisclosed period of time because of the coronavirus outbreak. Japan’s Nippon Professional Baseball took the more drastic measure to postpone the start of its regular season.\r\nT… [+1209 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Donald Trump hasn’t been tested for coronavirus but top aide is quarantined - Livemint", "description": "Donald Trump hasn’t been tested for coronavirus but top aide is quarantined Livemint Concern over Trump coming within two degrees of separation from coronavirus Times of India White House says US President Trump not tested for coronavirus Hindustan Times Trum…", "url": "https://www.livemint.com/news/world/donald-trump-hasn-t-been-tested-for-coronavirus-but-top-aide-is-quarantined-11583810056016.html", "urlToImage": "https://images.livemint.com/img/2020/03/10/600x338/2020-03-10T000932Z_343613632_RC2OGF9UVO9T_RTRMADP_3_USA-CORONAVIRUS-TRUMP_1583812221545_1583812248441.JPG", "publishedAt": "2020-03-10T03:51:31Z", "content": "WASHINGTON :\r\nPresident Donald Trump has yet to be tested for the coronavirus, even as his incoming chief of staff and at least four other GOP lawmakers put themselves in quarantine after coming into contact with an infected person at a political event.Mark M… [+1858 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "Coronavirus: Kerala puts over 1,000 people under observation - Livemint", "description": "Coronavirus: Kerala puts over 1,000 people under observation Livemint Coronavirus outbreak live updates: 6 new confirmed cases in Kerala, 3 in K'taka; global virus toll at over 4,000 Times of India Coronavirus patient in Kerala claims they informed airport of…", "url": "https://www.livemint.com/news/india/coronavirus-kerala-puts-over-1-000-people-under-observation-11583812434140.html", "urlToImage": "https://images.livemint.com/img/2020/03/10/600x338/20200309146L_1583813261049_1583813274794.jpg", "publishedAt": "2020-03-10T04:10:08Z", "content": "THIRUVANANTHAPURAM :\r\nKerala Health Minister KK Shailaja on Monday said that the administration has strengthened surveillance after six persons tested positive for COVID-19. \"We have strengthened the surveillance after 6 positive cases since yesterday. In the… [+1299 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump faces huge leadership crisis over coronavirus and the economy", "description": "Coronavirus fears and a fight over oil prices drove markets to a disastrous start to the week as the Trump administration continues to grapple with responding to the coronavirus outbreak.", "url": "https://www.msnbc.com/11th-hour/watch/trump-faces-huge-leadership-crisis-over-coronavirus-and-the-economy-80375877957", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_bwms_coronavirus_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:24:54Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Coachella and Stagecoach May Be Postponed Over Coronavirus", "description": "Travis Scott, Frank Ocean, and Rage Against the Machine are scheduled to headline the April festival.", "url": "https://www.vulture.com/2020/03/coachella-and-stagecoach-may-be-postponed-over-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2019/12/13/9-Coachella-Postponed.w1200.h630.jpg", "publishedAt": "2020-03-10T03:57:32Z", "content": "Guess youll have to wear all your festival outfits in the privacy of your own home this year. Just days after the organizers of SXSW decided to cancel this years events in Austin over concerns about the spread of coronavirus, Billboard reports that both Coach… [+484 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Jaipur: In A First, India Uses Second-Line Anti-HIV Drugs For Treatment Of Italian Couple With Coronavirus - Swarajya", "description": "Jaipur: In A First, India Uses Second-Line Anti-HIV Drugs For Treatment Of Italian Couple With Coronavirus Swarajya First time in India, anti-HIV drugs used on Italian couple with coronavirus in Jaipur The Indian Express In a first, India uses anti-HIV drugs …", "url": "https://swarajyamag.com/insta/jaipur-in-a-first-india-uses-second-line-anti-hiv-drugs-for-treatment-of-italian-couple-with-coronavirus", "urlToImage": "https://images.assettype.com/swarajya/2019-01/e97893b4-f4a3-43e5-b516-2bcde423b688/harsh.PNG?w=700", "publishedAt": "2020-03-10T03:58:03Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Police to enforce coronavirus ban on events with more than 1,000 people in Silicon Valley county: report", "description": "Santa Clara County in the heart of Silicon Valley is enacting a new ban on large public gatherings to an effort to combat the COVID-19 coronavirus. “Just hours after Santa Clara County reported its first coronavirus-related death, the county has implemented a…", "url": "https://www.rawstory.com/2020/03/police-to-enforce-coronavirus-ban-on-events-with-more-than-1000-people-in-silicon-valley-county-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2018/04/Sacrementoriotpolice.png", "publishedAt": "2020-03-10T03:50:53Z", "content": "Santa Clara County in the heart of Silicon Valley is enacting a new ban on large public gatherings to an effort to combat the COVID-19 coronavirus.\r\n“Just hours after Santa Clara County reported its first coronavirus-related death, the county has implemented … [+1250 chars]"}, {"source": {"id": null, "name": "Straitstimes.com"}, "author": "hermesauto", "title": "In Penang, fortunes flip for tech firms as coronavirus wrecks trade war gains - The Straits Times", "description": "PENANG (REUTERS) - Tech firms in Penang, Malaysia's one-time Silicon Valley of the East, swimming in orders from customers fleeing trade war-hit China, have seen fortunes turn again in the space of just a year as the coronavirus outbreak cuts them off from Ch…", "url": "https://www.straitstimes.com/business/economy/in-penang-fortunes-flip-for-tech-firms-as-coronavirus-wrecks-trade-war-gains", "urlToImage": "https://www.straitstimes.com/sites/default/files/styles/x_large/public/articles/2020/03/10/rk_pentamaster_100320.jpg?itok=_YNrB8bn", "publishedAt": "2020-03-10T04:05:14Z", "content": "PENANG (REUTERS) - Tech firms in Penang, Malaysia's one-time Silicon Valley of the East, swimming in orders from customers fleeing trade war-hit China, have seen fortunes turn again in the space of just a year as the coronavirus outbreak cuts them off from Ch… [+5436 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Coachella and Stagecoach May Be Postponed Over Coronavirus", "description": "Travis Scott, Frank Ocean, and Rage Against the Machine are currently set to headline the megafestival next month.", "url": "https://www.vulture.com/2020/03/coachella-2020.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2019/12/13/9-Coachella-Postponed.w1200.h630.jpg", "publishedAt": "2020-03-10T03:57:32Z", "content": "Looks like youll have to completely redo your festival wardrobe for a new season, but reportedly, youll have the time. Just days after the organizers of SXSW decided to cancel this years events in Austin over concerns about the spread of coronavirus, Billboar… [+973 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Indonesia readying measures to stabilize financial markets - finance minister", "description": "Indonesia Finance Minister Sri Mulyani Indrawati said on Tuesday that authorities are prepared to use all measures they implemented during the 2008 global financial crisis to stabilize financial markets.", "url": "https://www.reuters.com/article/us-indonesia-markets-idUSKBN20X0D4", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501080045&w=1200&r=LYNXMPEG2908A", "publishedAt": "2020-03-10T03:55:39Z", "content": "JAKARTA (Reuters) - Indonesia Finance Minister Sri Mulyani Indrawati said on Tuesday that authorities are prepared to use all measures they implemented during the 2008 global financial crisis to stabilize financial markets. \r\nThe options include buying back g… [+494 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "North Korea says Kim supervised second artillery drill in week", "description": "Official photos show Kim, wearing a black fur hat and carrying binoculars, watching the military drill.", "url": "https://www.aljazeera.com/news/2020/03/north-korea-kim-supervised-artillery-drill-week-200310030142752.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/10/8c50f79d4ed841f293afcd4aefb252fd_18.jpg", "publishedAt": "2020-03-10T03:31:09Z", "content": "North Korean leader Kim Jong Un supervised his second live-fire artillery exercise in a week, state media said on Tuesday, as the country continues to expand its military capabilities.\r\nThe report by Pyongyang's Korean Central News Agency (KCNA) came a day af… [+2026 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Abigail Feldman", "title": "Arlington elementary student tests positive for coronavirus", "description": "The student, who attends the Stratton Elementary School, is the child of a woman who attended a meeting of Biogen employees in February, Arlington officials said in a statement.", "url": "https://www.bostonglobe.com/2020/03/10/nation/arlington-elementary-student-tests-positive-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/-knyPX88nW4KcWZRZD90yMqLc8c=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/RJIH7ZT57FG3VLJBHYZTUIH6NA.jpg", "publishedAt": "2020-03-10T03:37:15Z", "content": "ARLINGTON A young student has tested positive for coronavirus, town officials said Monday evening, in the first known case of a Massachusetts child becoming infected.\r\nThe student, who attends the Stratton Elementary School, is the child of a woman in her 40s… [+2176 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Aparna Banerjea", "title": "Worried about germs on your iPhone? Apple says you can use disinfecting wipes - Livemint", "description": "Worried about germs on your iPhone? Apple says you can use disinfecting wipes Livemint Coronavirus effect: Apple ‘warns’ of supply shortage for replacement iPhones Hindustan Times Google unveils massive coronavirus response, including Search updates BGR Apple…", "url": "https://www.livemint.com/technology/gadgets/worried-about-germs-on-your-iphone-apple-says-you-can-use-disinfecting-wipes-11583810862168.html", "urlToImage": "https://images.livemint.com/img/2020/03/10/600x338/2019-10-30T203631Z_2_LYNXMPEF9T1VT_RTROPTP_3_APPLE-RESULTS_1572577356874_1583811658319.JPG", "publishedAt": "2020-03-10T03:43:59Z", "content": "Apple on its site, has recently added fresh instructions on how to clean its products including iPhones and other gadgets. The move might have resulted from peopel's widespread concerns of getting infected by the highly contagious novel coronavirus, which ori… [+1678 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dell employee from India visits Austin, tests positive for coronavirus after returning home | KVUE - KVUE", "description": "Dell employee from India visits Austin, tests positive for coronavirus after returning home | KVUE KVUE Dell employee visited Austin area before testing positive for COVID-19 in India KXAN.com Dell India employee who recently visited Austin now testing positi…", "url": "https://www.youtube.com/watch?v=ftSX7ncLLtU", "urlToImage": null, "publishedAt": "2020-03-10T03:18:17Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Nina Shapiro, Contributor, Nina Shapiro, Contributor https://www.forbes.com/sites/ninashapiro/", "title": "FDA Issues Warnings To Companies Selling Fraudulent COVID-19 Therapies", "description": "Name the lotion, potion, supplement, or detox, and it’s been recommended to prevent and/or treat Covid-19 infections.", "url": "https://www.forbes.com/sites/ninashapiro/2020/03/09/fda-issues-warnings-to-companies-selling-fraudulent-covid-19-therapies/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1166287309%2F0x0.jpg", "publishedAt": "2020-03-10T03:55:09Z", "content": "Ingredients for essential oil. Different herbs and bottles of essential oil.\r\nGetty\r\nThe worldwide spread of the novel coronavirus, or Covid-19, has meant that many people all over the world, are living in a perpetual state a panic. The severity of an infecte… [+7495 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Washington planning ahead for expected coronavirus surge", "description": "Washington Governor Jay Inslee talks with Rachel Maddow about how his state is coping with being on the front line of the coronavirus outbreak in the United States and the planning going into dealing with the surge in cases as the virus spreads.", "url": "https://www.msnbc.com/rachel-maddow/watch/washington-planning-ahead-for-expected-coronavirus-surge-80377413635", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_maddow_inslee1_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:53:11Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "Pearl Jam postpones first leg of tour over virus concerns", "description": "Pearl Jam is postponing the North American leg of its Gigaton world tour because of concerns over the new coronavirus, the band announced Monday.", "url": "https://www.bostonglobe.com/2020/03/10/nation/pearl-jam-postpones-first-leg-tour-over-virus-concerns/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/l7V3T9sv3N8ggYqdIPtZ-JF5whA=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/RFIWCRHONBGVRGSKKQY33X2ROQ.jpg", "publishedAt": "2020-03-10T03:52:34Z", "content": "LOS ANGELES (AP) Pearl Jam is postponing the North American leg of its Gigaton world tour because of concerns over the new coronavirus, the band announced Monday.\r\nSeventeen U.S. and Canadian performances, beginning on March 18 in Toronto through April 19 in … [+1605 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "The Dangerous Delays in U.S. Coronavirus Testing Continue (The Atlantic)", "description": "The Atlantic : The Dangerous Delays in U.S. Coronavirus Testing Continue — Without adequate testing, people with coronavirus symptoms are left to agonize over the right course of action on their own. — Nearly two weeks after the new coronavirus was first foun…", "url": "https://www.memeorandum.com/200309/p151", "urlToImage": "https://cdn.theatlantic.com/thumbor/tKIuNWoP1sEO06JHg52b5OHiG0E=/0x105:2000x1147/960x500/media/img/mt/2020/03/WebArt_coronavirustime_copy/original.jpg", "publishedAt": "2020-03-10T03:55:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Jeff Poor, Jeff Poor", "title": "FBN's Regan: Coronavirus Hysteria Is Trump Impeachment 'All Over Again' -- Democrats 'Don't Care Who They Hurt'", "description": "Monday during Fox Business Network's \"Trish Regan Primetime,\" host Trish Regan hammered Democrats and other institutions of the left for using the coronavirus to advance their political standing and to hurt President Donald Trump. | Clips", "url": "https://www.breitbart.com/clips/2020/03/09/fbns-regan-coronavirus-hysteria-trump-impeachment-all-over-again-democrats-dont-care-who-they-hurt/", "urlToImage": "https://media.breitbart.com/media/2020/03/Regan39-640x335.jpg", "publishedAt": "2020-03-10T03:27:38Z", "content": "Monday during Fox Business Network’s “Trish Regan Primetime,” host Trish Regan hammered Democrats and other institutions of the left for using the coronavirus to advance their political standing and to hurt President Donald Trump.\r\nRegan explained how such an… [+1504 chars]"}, {"source": {"id": null, "name": "Spacenews.com"}, "author": "Jeff Foust", "title": "Space industry sees growing effects of coronavirus outbreak - SpaceNews", "description": "Space industry sees growing effects of coronavirus outbreak SpaceNews Coronavirus: NASA Ames tells staff to work from home after one tests positive Livemint NASA center in California issues mandatory work-from-home policy after employee tests positive for COV…", "url": "https://spacenews.com/space-industry-sees-growing-effects-of-coronavirus-outbreak/", "urlToImage": "https://spacenews.com/wp-content/uploads/2014/11/AmesAerial_NASA4X3-1024x768.jpg", "publishedAt": "2020-03-10T03:13:19Z", "content": "WASHINGTON As the economic impact of the coronavirus outbreak grows worldwide, executives believe the space industry will not be immune from its effects but also may not be hurt as badly as other sectors.\r\nThe spread of the coronavirus disease, formally known… [+5715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Coronavirus shows up Trump's compassion deficit", "description": "Donald Trump's response to the coronavirus outbreak has highlighted his inability to recognize the need of others, writes Michael D'Antonio. \"He is angry and narcissistic, and the best those around him can do is coddle him in the hopes that he won't make thin…", "url": "https://www.cnn.com/2020/03/10/opinions/trump-grisham-white-house-coronavirus-exposure-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309190222-donald-trump-coronavirus-mike-pence-medicamentos-riesgo-bajo-grand-princess-caida-bolsa-brk-00000000-super-tease.jpg", "publishedAt": "2020-03-10T04:03:05Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author with Peter Eisner of \"The Shadow President: The Truth About Mike Pence.\" The opinions expressed in this commentary are those of the author. View … [+5093 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump compared coronavirus to the flu. Here's why that's a bad idea.", "description": "The president has, on more than one occasion, likened the coronavirus to the flu. Infectious disease specialist and epidemiologist Dr. Celine Gounder explains why that's a flawed comparison.", "url": "https://www.msnbc.com/11th-hour/watch/trump-compared-coronavirus-to-the-flu-here-s-why-that-s-a-bad-idea-80376389777", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_bwms_flu_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:39:15Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Ruhle: 'Fears of a global recession are real' due to coronavirus", "description": "NBC News Sr. Business Correspondent Stephanie Ruhle breaks down the very real concern that coronavirus could pontentially lead to a global recession.", "url": "https://www.msnbc.com/11th-hour/watch/ruhle-fears-of-a-global-recession-are-real-due-to-coronavirus-80377413504", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_bwms_recession_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:31:28Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "White House Says Trump Not Tested for Coronavirus", "description": "US President Donald Trump has reportedly in recent days been in contact with at least three people who have since gone into quarantine as a precautionary measure after allegedly coming into contact with a person at the Conservative Political Action Conference…", "url": "https://sputniknews.com/us/202003101078524370-white-house-says-trump-not-tested-for-coronavirus/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107852/44/1078524412.jpg", "publishedAt": "2020-03-10T03:18:39Z", "content": "US President Donald Trump has reportedly in recent days been in contact with at least three people who have since gone into quarantine as a precautionary measure after allegedly coming into contact with a person at the Conservative Political Action Conference… [+2023 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Japan PM says won't hesitate to do what's needed in coronavirus fight", "description": "Japanese Prime Minister Shinzo Abe said on Tuesday the government would carry out whatever measures are needed without hesitation to respond to the coronavirus outbreak. Abe told reporters markets were showing nervous movements. The government will closely co…", "url": "https://news.yahoo.com/japan-pm-says-wont-hesitate-034348575.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Jl20Uq.hOncQB6tpdWatYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzMuNg--/https://s.yimg.com/uu/api/res/1.2/uZC84dSNjgANw8w95afM.w--~B/aD01NDY7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/05bf1deedf7ff3a92895a9ea28b2eaf2", "publishedAt": "2020-03-10T03:43:48Z", "content": "TOKYO (Reuters) - Japanese Prime Minister Shinzo Abe said on Tuesday the government would carry out whatever measures are needed without hesitation to respond to the coronavirus outbreak.\r\nAbe told reporters markets were showing nervous movements. The governm… [+269 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Gates, other charities pledge $125 million towards COVID-19 treatments - The Jakarta Post - Jakarta Post", "description": "Gates, other charities pledge $125 million towards COVID-19 treatments - The Jakarta Post Jakarta Post Gates, Wellcome and Mastercard launch $125 million fund to finance COVID-19 treatments TechCrunch Bill Gates Is Donating Rs 37 Crore Of Coronavirus Test Kit…", "url": "https://www.thejakartapost.com/life/2020/03/10/gates-other-charities-pledge-125-million-towards-covid-19-treatments.html", "urlToImage": "https://img.jakpost.net/c/2020/02/10/2020_02_10_86356_1581325914._large.jpg", "publishedAt": "2020-03-10T04:05:00Z", "content": "The Bill &amp; Melinda Gates Foundation and two other large charities on Tuesday pledged up to $125 million to help speed the development of treatments for the fast-spreading coronavirus, which the World Health Organization said on Monday was nearing pandemic… [+1333 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Peter Weber", "title": "Texas GOP Rep. Louie Gohmert, exposed to the coronavirus, is back in Congress, leading public tours", "description": "Rep. Louie Gohmert (R-Texas), like several of his colleagues, was informed he was exposed to the novel coronavirus at the Conservative Political Action Conference in late February. Unlike his colleagues, Gohmert declined to self-quarantine, saying Monday that…", "url": "https://news.yahoo.com/texas-gop-rep-louie-gohmert-035300777.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GhfM2n2pvaAp4g1yeFtSfw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/kcFEu83hsV8LxkNRgrNlKQ--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/e8d74d644f5835c31d7780013442e581", "publishedAt": "2020-03-10T03:53:00Z", "content": "Rep. Louie Gohmert (R-Texas), like several of his colleagues, was informed he was exposed to the novel coronavirus at the Conservative Political Action Conference in late February. Unlike his colleagues, Gohmert declined to self-quarantine, saying Monday that… [+1131 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Ignacio Lopez-Goni", "title": "10 reasons why you don’t need to panic about coronavirus - ThePrint", "description": "10 reasons why you don’t need to panic about coronavirus ThePrint A COVID-19 outbreak could 'overwhelm us very quickly' Sky News Australia Opinion | It makes no sense for us to panic over the coronavirus Livemint How Chinese social media platforms control inf…", "url": "https://theprint.in/health/10-reasons-why-you-dont-need-to-panic-about-coronavirus/378204/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/02/Coronavirus-1.jpg", "publishedAt": "2020-03-10T03:35:29Z", "content": "Regardless of whether we classify the new coronavirus as a pandemic, it is a serious issue. In less than two months, it has spread over several continents. Pandemic means sustained and continuous transmission of the disease, simultaneously in more than three … [+6354 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Washington drawing on multiple partners to build coronavirus testing capacity", "description": "Washington Governor Jay Inslee talks with Rachel Maddow about how the state of Washington is calculating the forecast of the spread of the novel coronavirus as well as the state's strategy for building testing capacity for the virus.", "url": "https://www.msnbc.com/rachel-maddow/watch/washington-drawing-on-multiple-partners-to-build-coronavirus-testing-capacity-80376901720", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_maddow_inslee2_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:54:42Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump admin bungling overshadows crucial coronavirus advice: AP", "description": "Rachel Maddow shares a report from the Associate Press that the White House prevented the federal health officials from cautioning older Americans to avoid flying out of concern over the risks of contracting the novel coronavirus, which is science has found i…", "url": "https://www.msnbc.com/rachel-maddow/watch/trump-admin-bungling-overshadows-crucial-coronavirus-advice-ap-80377925506", "urlToImage": "https://media11.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_maddow_worstcase_200309_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T03:45:49Z", "content": null}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "WOMEN HARDEST HIT, OF COURSE: Why the new coronavirus may kill more men than women. Plus: “”We ma…", "description": "WOMEN HARDEST HIT, OF COURSE: Why the new coronavirus may kill more men than women. Plus: “”We make these broad sweeping assumptions that men and women are the same behaviorally, in terms of comorbidities, biology and our immune system, and we just are not.” …", "url": "https://pjmedia.com/instapundit/360900/", "urlToImage": null, "publishedAt": "2020-03-10T03:27:01Z", "content": "WOMEN HARDEST HIT, OF COURSE: Why the new coronavirus may kill more men than women. Plus: “”We make these broad sweeping assumptions that men and women are the same behaviorally, in terms of comorbidities, biology and our immune system, and we just are not.” … [+127 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "China relaxes environmental standards deadline on coronavirus", "description": "China will give firms that do not currently meet environmental standards more time to make rectifications because of the coronavirus outbreak, the environment ministry said on Tuesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-china-environment-idUSKBN20X0AG", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501068319&w=1200&r=LYNXMPEG2906I", "publishedAt": "2020-03-10T03:16:25Z", "content": "BEIJING/SHANGHAI (Reuters) - China will give firms that do not currently meet environmental standards more time to make rectifications because of the coronavirus outbreak, the environment ministry said on Tuesday. \r\nXu Bijiu, a senior official at China’s Mini… [+379 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Saleha Mohsin, Jennifer Jacobs and Justin Sink", "title": "Trump’s Virus Aid Package to Leave Out Travel Industry for Now", "description": "(Bloomberg) -- The economic package to be unveiled by President Donald Trump will leave out for now any aid for the travel industry, which has been battered by the coronavirus outbreak, according to people familiar with the matter, raising the risk that the p…", "url": "https://finance.yahoo.com/news/trump-virus-aid-package-leave-032208157.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wAKYvJLJhD3SidX9_aK7Kg--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/762ff0f81b8572429e8f5539a0da5537", "publishedAt": "2020-03-10T03:22:08Z", "content": "(Bloomberg) -- The economic package to be unveiled by President Donald Trump will leave out for now any aid for the travel industry, which has been battered by the coronavirus outbreak, according to people familiar with the matter, raising the risk that the p… [+3856 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "It's now or never for the U.S. if it hopes to keep coronavirus from burning out of control (Tom Bossert/Washington Post)", "description": "Tom Bossert / Washington Post : It's now or never for the U.S. if it hopes to keep coronavirus from burning out of control — This column has been updated. — Tom Bossert served as homeland security adviser to President Trump from 2017 to 2018. — The first phas…", "url": "https://www.memeorandum.com/200310/p1", "urlToImage": "https://www.washingtonpost.com/resizer/i32Qi496FXkvXaSFYKZDJFRpwtI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/A732JRDCGAI6VCUOLRJTNMZHMA.jpg", "publishedAt": "2020-03-10T04:05:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sanam Mirchandani and Pavan Burugula", "title": "Shares of ONGC, RIL plunge while HPCL, BPCL gain", "description": "Shares of Reliance dive 12% over concern that lower oil prices could affect a proposed deal with Saudi Aramco that’s critical for reducing Mukesh Ambani-owned co’s debt", "url": "https://economictimes.indiatimes.com/markets/stocks/news/shares-of-ongc-ril-plunge-while-hpcl-bpcl-gain/articleshow/74560271.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74560274,width-1070,height-580,imgsize-216977,overlay-etmarkets/photo.jpg", "publishedAt": "2020-03-10T03:24:37Z", "content": "Mumbai: The slump in oil prices on Monday precipitated by the price war between Saudi Arabia and Russia saw shares of Indian oil explorers plummeting. Oil and Natural Gas Corporation (ONGC) dropped 16% and Oil India declined 10.7% on Monday as lower crude pri… [+3757 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "The Latest: Panama confirms 1st case of coronavirus", "description": "ROME (AP) — The Latest on the coronavirus epidemic sweeping the globe (all times local):", "url": "https://www.bostonherald.com/2020/03/09/the-latest-panama-confirms-1st-case-of-coronavirus/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/Virus_Outbreak_Philippines_07553-1.jpg?w=1024&h=683", "publishedAt": "2020-03-10T03:19:54Z", "content": "ROME (AP) — The Latest on the coronavirus epidemic sweeping the globe (all times local):\r\n3 a.m.\r\nPanama has confirmed its first case of the new coronavirus.\r\nThe patient is a Panamanian woman who had returned Sunday from Madrid. While only a few dozen cases … [+12473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Trump scare shows no American is immune from coronavirus risk", "description": "The White House insists President Donald Trump doesn't need a coronavirus test, despite several members of his political circle self-quarantining after they came into contact with a man later diagnosed with the disease.", "url": "https://www.cnn.com/2020/03/10/politics/coronavirus-donald-trump-test-mike-pence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309190222-donald-trump-coronavirus-mike-pence-medicamentos-riesgo-bajo-grand-princess-caida-bolsa-brk-00000000-super-tease.jpg", "publishedAt": "2020-03-10T04:00:44Z", "content": "(CNN)The White House insists President Donald Trump doesn't need a coronavirus test, despite several members of his political circle self-quarantining after they came into contact with a man later diagnosed with the disease.\r\nThey include Florida GOP Rep. Mat… [+8628 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady and Julia Horowitz, CNN Business", "title": "Could coronavirus shut Wall Street? Banks begin moving staff out", "description": "US stock markets were halted briefly Monday as a record fall in oil prices and fears of the coronavirus triggered panic selling. But the epidemic poses a much bigger logistical headache for Wall Street — how to keep trading going if banks have to evacuate the…", "url": "https://www.cnn.com/2020/03/10/business/wall-street-coronavirus-shutdown/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309112524-21-stock-market-0309-new-york-super-tease.jpg", "publishedAt": "2020-03-10T04:05:28Z", "content": null}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Italians told to stay home in desperate bid to limit virus", "description": "ROME: Italy imposed unprecedented national restrictions on its 60 million people Tuesday over the deadly coronavirus that US President Donald Trump said had \"blindsided the world\".", "url": "https://www.bangkokpost.com/world/1875649/italians-told-to-stay-home-in-desperate-bid-to-limit-virus", "urlToImage": "https://static.bangkokpost.com/media/content/20200310/c1_3558464_700.jpg", "publishedAt": "2020-03-10T03:45:00Z", "content": "ROME: Italy imposed unprecedented national restrictions on its 60 million people Tuesday over the deadly coronavirus that US President Donald Trump said had \"blindsided the world\".\r\nThe outbreak, combined with a crash in oil prices, has caused carnage on fina… [+3957 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "County ban of large gatherings could impact Sharks, Stanford", "description": "The status of three San Jose Sharks hockey games, the NCAA women's basketball tournament at Stanford and one MLS game are in doubt", "url": "https://www.foxsports.com/other/story/county-ban-of-large-gatherings-could-impact-sharks-stanford-030920", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-10T03:44:31Z", "content": "SAN JOSE, Calif. (AP) — The status of three San Jose Sharks hockey games, the NCAA women’s basketball tournament at Stanford and one MLS game are in doubt after Santa Clara County announced a ban of all large gatherings of at least 1,000 people for the rest o… [+2748 chars]"}]