[{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Italy extends coronavirus measures nationwide", "description": "PM Giuseppe Conte says measures, including a ban on gatherings, will be extended to the whole country.", "url": "https://www.bbc.co.uk/news/world-europe-51810673", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-09T20:52:12Z", "content": "Italy is extending its strict coronavirus quarantine measures, which include a ban on public gatherings, to the entire country. \r\nPrime Minister Giuseppe Conte said the measures, which come into effect on Tuesday, were necessary to defend the most fragile mem… [+489 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "The psychology behind why toilet paper, of all things, is the latest coronavirus panic buy", "description": "Toilet paper does not offer special protection against the virus. It's not considered a staple of impending emergencies, like milk and bread are. So why are people buying up rolls more quickly than they can be restocked? There are several reasons.", "url": "https://www.cnn.com/2020/03/09/health/toilet-paper-shortages-novel-coronavirus-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305023448-02-coronavirus-supplies-shortage-super-tease.jpg", "publishedAt": "2020-03-09T20:41:57Z", "content": null}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Philadelphia", "title": "Source: Children’s Hospital Of Philadelphia Doctor At King Of Prussia Site Tests Positive For Coronavirus - CBS Philly", "description": "Source: Children’s Hospital Of Philadelphia Doctor At King Of Prussia Site Tests Positive For Coronavirus CBS Philly Pennsylvania coronavirus: 6 positive COVID-19 cases confirmed in Pennsylvania 6abc.com Montgomery County patient critical after testing presum…", "url": "https://philadelphia.cbslocal.com/2020/03/09/coronavirus-childrens-hospital-of-philadelphia-doctor-king-of-prussia-site-tests-positive-covid19-lower-merion-school-district-simmons-elementary/", "urlToImage": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2020/03/lns-Chopper-KOP-CHOP-Dr-Tested-Positive-3.9_frame_12584.png?w=1440", "publishedAt": "2020-03-09T20:31:23Z", "content": "KING OF PRUSSIA, Pa. (CBS) — A Children’s Hospital of Philadelphia cardiologist at the King of Prussia Specialty Care site is currently hospitalized after testing positive for coronavirus. Montgomery County officials say the man contracted the virus while tra… [+2410 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Movement restricted across Italy in new coronavirus crackdown: PM Conte", "description": "Movement across Italy will be sharply restricted in a dramatic new clampdown aimed at halting the spread of the coronavirus, Prime Minister Giuseppe Conte said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-conte-idUSKBN20W2XZ", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500960925&w=1200&r=LYNXMPEG281XH", "publishedAt": "2020-03-09T21:08:10Z", "content": "ROME (Reuters) - Movement across Italy will be sharply restricted in a dramatic new clampdown aimed at halting the spread of the coronavirus, Prime Minister Giuseppe Conte said on Monday. \r\nConte told reporters that measures introduced just two days ago in mu… [+224 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Cadillac cancels debut of all-electric Lyriq over COVID-19 concerns", "description": "Cadillac has cancelled the upcoming debut of the Lyriq, an all-electric mid-sized SUV designed to be an entry point into luxury brand’s new EV lineup, over concerns about the COVID-19 outbreak. GM’s luxury brand had planned to reveal the Lyriq on April 2 at a…", "url": "http://techcrunch.com/2020/03/09/cadillac-cancels-debut-of-all-electric-lyriq-over-covid-19-concerns/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-07-at-10.40.16-AM.jpg?w=764", "publishedAt": "2020-03-09T21:11:34Z", "content": "Cadillac has cancelled the upcoming debut of the Lyriq, an all-electric mid-sized SUV designed to be an entry point into luxury brand’s new EV lineup, over concerns about the COVID-19 outbreak.\r\nGM’s luxury brand had planned to reveal the Lyriq on April 2 at … [+2284 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Amanda Connolly", "title": "Montreal Liberal MP in self-isolation after attending event with coronavirus patient - Global News", "description": "Montreal Liberal MP in self-isolation after attending event with coronavirus patient Global News Josh Matlow to self-isolate after contact with COVID-19 patient CityNews Toronto Quebec MP in self-isolation after attending event with possible COVID-19 exposure…", "url": "http://globalnews.ca/news/6651643/liberal-mp-coronavirus-isolation/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2019/02/cpt127529529-1.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-09T20:48:17Z", "content": "Montreal Liberal MP Anthony Housefather says he is in self-isolation “out of an abundance of caution” after attending an event where someone had COVID-19, the illness caused by the novel coronavirus.\r\nHousefather confirmed the move to Global News, saying he i… [+3485 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "Health insurers are cutting members' costs for coronavirus testing and letting them get refills early as the outbreak threatens the US", "description": "The number of cases of the novel coronavirus is rising in the US. As more come in contact and more testing is performed, concerns have been raised that getting tested for the virus may be unaffordable to many. From waiving payments for members to allowing vir…", "url": "https://www.businessinsider.com/how-health-insurers-aetna-unitedhealth-cigna-are-covering-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e66af2d84159f17e77ee526?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:04:00Z", "content": "As the novel coronavirus spreads around the US, the costs associated with testing and treatment for the virus are weighing on patients. \r\nIt's happening at a time when patients are on the hook for more of the cost of medical care than ever before. For those o… [+5162 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rhea Mahbubani", "title": "Italy's Prime Minister just extended the restriction zone around coronavirus to the entire country", "description": "The number of coronavirus cases in Italy shot past 9,000 on Monday, forcing Prime Minister Giuseppe Conte to put the entire country on lockdown. Over the weekend, the government quarantined the northern region of Lombardy and 14 neighboring provinces. On Mond…", "url": "https://www.businessinsider.com/italy-prime-minister-extends-coronavirus-restriction-zone-entire-country-2020-3", "urlToImage": "https://i.insider.com/5e66ad6d84159f157c70eff8?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:04:53Z", "content": "The number of coronavirus cases in Italy shot past 9,000 on Monday, forcing Prime Minister Giuseppe Conte to put the entire country on lockdown.\r\nOver the weekend, the government quarantined the northern region of Lombardy and 14 neighboring provinces. On Mon… [+534 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Bryan Clark", "title": "Airlines increasingly reliant on ‘ghost flights’ during coronavirus outbreak", "description": "Industry analysts expect demand for air travel to hit its lowest point since the 2008 financial crisis. This year, according to the International Air Transport Association (IATA), carriers could lose upwards of $113 billion in revenue if coronavirus continues…", "url": "https://thenextweb.com/?p=1277317", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F11%2Fethereum-blockchain-airline.jpg&signature=898788deeda9a472abae31ed65a926a9", "publishedAt": "2020-03-09T20:17:00Z", "content": "Industry analysts expect demand for air travel to hit its lowest point since the 2008 financial crisis. This year, according to the International Air Transport Association (IATA), carriers could lose upwards of $113 billion in revenue if coronavirus continues… [+1719 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kayla Epstein", "title": "4 members of Congress have self-quarantined after coming into contact with a coronavirus patient at CPAC", "description": "Four Republican members of Congress — Senator Ted Cruz, Congressman Doug Collins, Matt Gaetz and Congressman Paul Gosar — have self-guaranteed after they came into contact with a person who had the coronavirus at the Conservative Political Action Conference (…", "url": "https://www.businessinsider.com/4-members-of-congress-self-quarantine-after-cpac-coronavirus-alert-2020-3", "urlToImage": "https://i.insider.com/5e66a0f684159f04ec0d7263?width=1200&format=jpeg", "publishedAt": "2020-03-09T20:48:09Z", "content": "At least four members of Congress have decided to enter a precautionary self-quarantine after coming into contact with a coronavirus patient at the Conservative Political Action Conference (CPAC) in Maryland last month.\r\nCPAC alerted attendees on Saturday tha… [+3638 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Sonnemaker", "title": "Airbnb tells Bay Area employees to work from home for the next 2 weeks due to coronavirus concerns and says it will continue to pay hourly workers", "description": "Airbnb has told its Bay Area employees to work from home for the next two weeks as concerns grow surrounding the coronavirus, a spokesperson told Business Insider. Airbnb is also working with vendors to ensure hourly workers continue to be paid during this ti…", "url": "https://www.businessinsider.com/airbnb-tells-bay-area-employees-work-remote-covid-19-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5cd9b597021b4c25c359b516?width=1200&format=jpeg", "publishedAt": "2020-03-09T21:06:18Z", "content": "Airbnb has instructed all employees and contingent workers in the Bay Area to work from home for the next two weeks as the coronavirus continues to spread, a spokesperson told Business Insider.\r\nThe online travel giant is the latest company to ask employees t… [+576 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Telecom Operators in India Warn People of Coronavirus Outbreak, Share Tips", "description": "Telecom operators in India have started to warn users of Covid-19 spread after more than three dozen cases have been detected in the nation. From a report: Subscribers of Reliance Jio, Airtel, and state-run BSNL were greeted with a warning in Hindi and Englis…", "url": "https://tech.slashdot.org/story/20/03/09/1959221/telecom-operators-in-india-warn-people-of-coronavirus-outbreak-share-tips", "urlToImage": "https://a.fsdn.com/sd/topics/communications_64.png", "publishedAt": "2020-03-09T20:52:00Z", "content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, George Petras, Ramon Padilla and Veronica Bravo, USA TODAY", "title": "Why a coronavirus vaccine is a more than a year away, despite medical researchers' progress", "description": "Even with an international full-court press, we're still 12-18 months from a coronavirus vaccine", "url": "https://www.usatoday.com/in-depth/news/2020/03/09/biotech-international-effort-makes-big-push-for-coronavirus-vaccine/4927298002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/07/USAT/97bc2b03-be50-4814-9389-9b5e52e3045b-promo-art.png?crop=5658,3183,x794,y621&width=1200", "publishedAt": "2020-03-09T20:41:28Z", "content": "As the coronavirus spreads, deaths mount and fears grow across the globe, biotech companies, universities and government agencies scramble  some together, others alone for a vaccine to contain it. \r\nA number of companies have announced progress. Some, using g… [+8437 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Wall Street’s terrible, horrible, no good, very bad day ends with the Dow down 2,000", "description": "At least it’s over. The markets endured their worst day of trading of this young year as the Dow Jones Industrial Average dropped 2,000 points to close at 23,850.79 — a 7.79% decline. The Nasdaq Composite Index fell 624.94, to close at 7,950.68, and losses to…", "url": "http://techcrunch.com/2020/03/09/wall-streets-terrible-horrible-no-good-very-bad-day-ends-with-the-dow-down-2000/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-1187891590.jpg?w=600", "publishedAt": "2020-03-09T20:49:02Z", "content": "At least it’s over.\r\nThe markets endured their worst day of trading of this young year as the Dow Jones Industrial Average dropped 2,000 points to close at 23,850.79  — a 7.79% decline. The Nasdaq Composite Index fell 624.94, to close at 7,950.68, and losses … [+1805 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Collapse in oil prices triggers a plunge in energy sector - Business News - Castanet.net", "description": "Collapse in oil prices triggers a plunge in energy sector - Business News Castanet.net TSX plunges as much as 10%, prompting trading halt Yahoo Canada Finance Biggest drop since '87 crash: US$218B lost in Canada stocks BNNBloomberg.ca Collapse in oil triggers…", "url": "https://www.castanet.net/news/Business/278946/Collapse-in-oil-prices-triggers-a-plunge-in-energy-sector", "urlToImage": "https://www.castanet.net/content/2020/3/NYRD104-39_2020_113651_p3443539.jpg", "publishedAt": "2020-03-09T20:55:00Z", "content": "UPDATE: 1:55 p.m.\r\nCanada's main stock index closed down 10.3 per cent to its lowest level in 14 months as a collapse in oil prices triggers a plunge in the energy sector.\r\nThe S&amp;P/TSX composite index lost 1,660.78 points to close at 14,514.24 and the cap… [+4049 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Lahut", "title": "This image from Fox Business says everything you need to know about the markets today: The only thing that's 'up' right now is coronavirus", "description": "There wasn't much good news to report on Fox Business since the markets opened on Monday, with feel-good green arrows remaining scant. However, at one point during the network's 2 to 3 p.m. program — \"Making Money with Charles Payne\" — a green arrow made its …", "url": "https://www.businessinsider.com/fox-business-channel-chryon-shows-markets-down-coronavirus-up-2020-3", "urlToImage": "https://i.insider.com/5e66a03584159f037a3fa9b2?width=1200&format=jpeg", "publishedAt": "2020-03-09T20:33:10Z", "content": "As markets plummeted all day Monday — save for an automatic halt to trading early in the day triggered by too rapid of a drop — those feel-good green arrows were hard to find on Fox Business.\r\nHowever, at one point during the network's 2 to 3 p.m. show, \"Maki… [+747 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Anna Medaris Miller", "title": "CDC: Americans will probably be exposed to coronavirus at some point, 'and there's a good chance many will become sick'", "description": "In a media telebriefing about the novel coronavirus, the Centers for Disease Control and Prevention's Dr. Nancy Messonnier said \"many Americans\" will be exposed to the virus at some point. She also said \"there's a good chance many will become sick.\" Still, sh…", "url": "https://www.businessinsider.com/cdc-many-americans-will-be-exposed-to-coronavirus-get-sick-2020-3", "urlToImage": "https://i.insider.com/5e66a75454f25c0e62599662?width=1200&format=jpeg", "publishedAt": "2020-03-09T20:30:00Z", "content": "Americans should get used to the idea that they'll likely come into contact with the novel coronavirus at some point over the next year or two, Dr. Nancy Messonnier, director of the Centers for Disease Control and Prevention's National Center for Immunization… [+2673 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Louise Hall", "title": "Coronavirus: School forced to close after father of patient ignores quarantine to attend dance", "description": "The father of the first coronavirus patient in Missouri disregarded his quarantine to attend a school dance, forcing the whole school to shut down.Administrators made the decision to close the school after learning that the father of a woman in her 20s, who h…", "url": "https://news.yahoo.com/coronavirus-school-forced-close-father-210700287.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/nFSsv9x8g9nx7QaPWIH0Og--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/q_y4FoQX4LPweQpCIXFs_A--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/c203dcade38ac6967f1aa4c0f66555f1", "publishedAt": "2020-03-09T21:07:00Z", "content": "AFP via Getty Images\r\nThe father of the first coronavirus patient in Missouri disregarded his quarantine to attend a school dance, forcing the whole school to shut down.\r\nAdministrators made the decision to close the school after learning that the father of a… [+2980 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Trump shook hands with congressman Doug Collins now in self-quarantine", "description": "White House officials are mum about a photograph that appeared on Twitter showing Donald Trump shaking hands with a congressman who has put himself in self-quarantine over coronavirus fears.Doug Collins, who has self-quarantined, greeting Trump in Georgia las…", "url": "https://news.yahoo.com/trump-shook-hands-congressman-doug-205128928.html", "urlToImage": null, "publishedAt": "2020-03-09T20:51:28Z", "content": null}, {"source": {"id": null, "name": "Calculatedriskblog.com"}, "author": "Calculated Risk", "title": "Seattle Real Estate in February: Sales up 5.2% YoY, Inventory down 32.5% YoY", "description": "The  Northwest Multiple Listing Service reported NWMLS brokers report brisk activity, noting “too early to tell” if coronavirus will soften ...", "url": "https://www.calculatedriskblog.com/2020/03/seattle-real-estate-in-february-sales.html", "urlToImage": null, "publishedAt": "2020-03-09T20:47:00Z", "content": "The Northwest Multiple Listing Service reported NWMLS brokers report brisk activity, noting “too early to tell” if coronavirus will soften sales\r\n“It’s still too early to tell if the broadening effects of the coronavirus will sideline buyers,” said Matthew Ga… [+1225 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "It Takes About 5 Days for Sick People to Show Coronavirus Symptoms, New Study Says", "description": "Questions about coronavirus—how it behaves, who it strikes, and how bad it can get—are spreading almost as fast as the virus itself. Among the most important questions to answer is how long it takes people who are infected by SARS-CoV-2, the virus that causes…", "url": "https://time.com/5797300/coronavirus-incubation-period/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/coronavirus-incubation-period.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-09T21:00:20Z", "content": "Questions about coronavirus—how it behaves, who it strikes, and how bad it can get—are spreading almost as fast as the virus itself. Among the most important questions to answer is how long it takes people who are infected by SARS-CoV-2, the virus that causes… [+2923 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Rhea Mahbubani)", "title": "Almost 200 North Korean soldiers have reportedly died from coronavirus cases while thousands more are in quarantine. The government won't acknowledge they even exist.", "description": "Military leaders are scrambling to deal with the epidemic by disinfecting areas and increasing the amount of food given to each soldier.", "url": "https://news.yahoo.com/almost-200-north-korean-soldiers-193704254.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j6BXm2uavX1XtwrDSpmaxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/XdOGlOOPXQBpfIlMenYvhw--~B/aD0xNDczO3c9MTk2NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/404831266407e0e499aca09f5aedb24d", "publishedAt": "2020-03-09T20:11:38Z", "content": "<ul><li>North Korea's official stance on the coronavirus as of Monday remains the same, according to a state-run newspaper: \"The infectious disease did not flow into our country yet.\"\r\n</li></ul><ul><li>South Korea's Daily NK news organization, however, repor… [+4128 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Lydia O'Connor", "title": "Rep. Matt Gaetz To Self-Quarantine After COVID-19 Exposure At CPAC", "description": "Gaetz is one of multiple Republican lawmakers who have to enter a 14-day self-quarantine amid the COVID-19 outbreak.", "url": "https://www.huffpost.com/entry/matt-gaetz-coronavirus-self-quarantine_n_5e66a205c5b68d6164590551", "urlToImage": "https://img.huffingtonpost.com/asset/5e66a3902600000423b60813.jpeg?ops=1200_630", "publishedAt": "2020-03-09T20:19:36Z", "content": "Rep. Matt Gaetz (R-Fla.) announced Monday that he is among the Republicans in self-quarantine after learning that he came into contact with someone who tested positive for the coronavirus at last month’s Conservative Political Action Conference.\r\nGaetz said h… [+1561 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "The Dow tanks more than 2,000 points: Worst day since 2008 crisis - Aljazeera.com", "description": "The Dow tanks more than 2,000 points: Worst day since 2008 crisis Aljazeera.com The market triggered a 'circuit breaker' that kept stocks from falling through the floor. Here's what you need to know CNBC Billions of dollars in value vanishes on major markets …", "url": "https://www.aljazeera.com/ajimpact/dow-tanks-2000-points-worst-day-2008-crisis-200309193604633.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/9/2fda82e15e494af9956e3ed08e67b81c_18.jpg", "publishedAt": "2020-03-09T21:01:00Z", "content": "Saudi Arabia is throwing a tantrum, and the fallout is unleashing some crisis-era deja vu on United States stock markets.\r\nAfter the kingdom slashed what it charges for a barrel of oil in retaliation for Russia's refusal to support a dramatic cut in crude pro… [+4644 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Vietnam vows to punish hiders of coronavirus after new cases", "description": "Vietnamese authorities vowed Monday to punish anyone concealing sickness after 13 people caught the deadly new coronavirus on a flight to Hanoi, sparking lockdowns and panic-buying in the capital. The Southeast Asian country had previously reported only 16 ca…", "url": "https://news.yahoo.com/vietnam-vows-punish-hiders-coronavirus-cases-111324687.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/VnikW6eb1SljJW8LkreISA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/DyxIdH.8Od6FRFDq9becjw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/5908f0e66a6549f3210fe45f843674e30e109879.jpg", "publishedAt": "2020-03-09T20:37:43Z", "content": "Vietnamese authorities vowed Monday to punish anyone concealing sickness after 13 people caught the deadly new coronavirus on a flight to Hanoi, sparking lockdowns and panic-buying in the capital.\r\nThe Southeast Asian country had previously reported only 16 c… [+2262 chars]"}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Nasdaq closes down 7.29% and S&P 500 down 7.6% extending last week's selloff, amid fears over the spread of the coronavirus and a new oil price war (Yun Li/CNBC)", "description": "Yun Li / CNBC : Nasdaq closes down 7.29% and S&P 500 down 7.6% extending last week's selloff, amid fears over the spread of the coronavirus and a new oil price war — Stocks plunge as investors fear coronavirus outbreak and oil price war—Five experts on what t…", "url": "https://www.techmeme.com/200309/p25", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106432337-1583784489088aaimg_100_116_196_1737655_1000-1583784254812.jpg?v=1583784539", "publishedAt": "2020-03-09T20:15:44Z", "content": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 4:15 PM ET, March 9, 2020.\r\nThe most current version of the site as always is available at our home page.\r\nTo view an earlier snapshot click here\r\nand then modify the date in… [+7 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "John T Bennett", "title": "'I'm frightened there's not a sense of urgency': Most Americans don't approve of Trump's handling of coronavirus", "description": "A slight majority of Americans disapprove of the way Donald Trump is handling the coronavirus outbreak, and just under 40 per cent say his response would make them less likely to vote for his re-election.The survey, conducted last week by Public Policy Pollin…", "url": "https://news.yahoo.com/im-frightened-theres-not-sense-205021940.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/PHgYCqJMi4BdIM6j0LQJYQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MDI-/https://s.yimg.com/uu/api/res/1.2/SZ.8wYzlZP.5G1naMtHCVw--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/23d7fffa5bb6b9459b94b5ec9819168b", "publishedAt": "2020-03-09T20:50:21Z", "content": "Donald Trump speaks before a dinner: AP\r\nA slight majority of Americans disapprove of the way Donald Trump is handling the coronavirus outbreak, and just under 40 per cent say his response would make them less likely to vote for his re-election.\r\nThe survey, … [+2211 chars]"}, {"source": {"id": null, "name": "Theonion.com"}, "author": "The Onion", "title": "Pope Francis Urges Priests To Refrain From Molesting Children Over Coronavirus Fears", "description": "VATICAN CITY—Stressing that ensuring the safety of all clergy members remained the Holy See’s primary concern, Pope Francis issued a statement Monday urging priests worldwide to refrain from molesting children over escalating coronavirus fears. “During this t…", "url": "https://www.theonion.com/pope-francis-urges-priests-to-refrain-from-molesting-ch-1842220949", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ge2ojvxuslzs0jgqvqjt.jpg", "publishedAt": "2020-03-09T20:55:00Z", "content": "VATICAN CITYStressing that ensuring the safety of all clergy members remained the Holy Sees primary concern, Pope Francis issued a statement Monday urging priests worldwide to refrain from molesting children over escalating coronavirus fears. During this tryi… [+828 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Randall Colburn on News, shared by Randall Colburn to The A.V. Club", "title": "Plug your favorite song lyrics into this hand-washing PSA generator", "description": "As the novel coronavirus continues to spread, thus wrecking your travel plans and endangering a city’s local economy, it’s become more important than ever to actually wash your hands before doing the weird Face/Off hand thing to other people. It’s been recomm…", "url": "https://news.avclub.com/plug-your-favorite-song-lyrics-into-this-hand-washing-p-1842220412", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/uavbvw7suj3zntqcbgdh.png", "publishedAt": "2020-03-09T20:39:00Z", "content": "As the novel coronavirus continues to spread, thus wrecking your travel plans and endangering a citys local economy, its become more important than ever to actually wash your hands before doing the weird Face/Off hand thing to other people. Its been recommend… [+958 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Princess Cruise Lines Sued by Quarantined Passengers Claiming Coronavirus Exposure", "description": "The coronavirus is now turning legal -- a quarantined cruise in California has been sued for allegedly putting passengers at risk... when they knew the virus was running rampant on the ship. Ronald and Eva Weissberger -- two elderly passengers who…", "url": "https://www.tmz.com/2020/03/09/princess-cruise-line-sued-by-passenger-contracted-coronavirus/", "urlToImage": "https://imagez.tmz.com/image/8f/16by9/2020/03/09/8f25270c23fd495cb1df6cd09cecdd7b_xl.jpg", "publishedAt": "2020-03-09T20:55:24Z", "content": "The coronavirus is now turning legal -- a quarantined cruise in California has been sued for allegedly putting passengers at risk ... when they knew the virus was running rampant on the ship.\r\nRonald and Eva Weissberger -- two elderly passengers who are curre… [+1705 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Oil Crash and Coronavirus Roil Markets (Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-09/oil-crash-and-coronavirus-roil-markets-podcast", "urlToImage": null, "publishedAt": "2020-03-09T20:46:41Z", "content": null}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Kory Grow", "title": "Kiss Cancel Meet-and-Greets Amid Coronavirus Worries", "description": "Band's End of the Road tour will carry on otherwise", "url": "https://www.rollingstone.com/music/music-news/kiss-cancel-meet-and-greets-amid-coronavirus-worries-964710/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/kiss-cancels-meet-and-greets.jpg", "publishedAt": "2020-03-09T21:05:27Z", "content": "Kiss fans who want to shake hands with the band will have to wait. The group has decided to cancel all upcoming meet-and-greets over concerns about the spread of the coronavirus COVID-19.\r\n“Our meet-and-greets have always offered us and you, our fans, a uniqu… [+1587 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "UPDATE: Coronavirus-Stricken Cruise Ship Arrives At Port Of Oakland...", "description": "UPDATE: Coronavirus-Stricken Cruise Ship Arrives At Port Of Oakland... (Second column, 2nd story, link ) Related stories: As coronavirus spreads, warnings become more urgent for elderly and frail... 'War Zone'... Bill Gates-funded program will soon offer home…", "url": "https://sanfrancisco.cbslocal.com/2020/03/09/coronavirus-stricken-grand-princess-golden-gate-bridge-sick-passengers-oakland/", "urlToImage": "https://sanfrancisco.cbslocal.com/wp-content/uploads/sites/15116056/2020/03/grand-princess-golden-gate.jpg?w=720", "publishedAt": "2020-03-09T20:37:38Z", "content": "OAKLAND (CBS SF) — The coronavirus-stricken Grand Princess made its way under the famed Golden Gate Bridge Monday, heading toward the Port of Oakland where the more than 2,000 passengers will disembark under heavy military security, undergo medical examinatio… [+6048 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "4 stupid things to do with your money when the stock market is tanking", "description": "Financial-market stress has reached a 12-year high in the US as coronavirus panic continues to mount. But the vast majority of investors should follow a few simple rules: Don't touch your investments, keep saving money, and spend within your means. It can be …", "url": "https://www.businessinsider.com/money-mistakes-avoid-when-stock-market-down", "urlToImage": "https://i.insider.com/59b19369609c30a6028b4ef0?width=1200&format=jpeg", "publishedAt": "2020-03-09T20:41:49Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective.\r\nIt's excee… [+3029 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Italy suspends all sports including Serie A", "description": "All sporting events in Italy are to be suspended until April 3 due to the growing spread of the coronavirus, Italian Prime Minister Giuseppe Conte has announced.", "url": "https://www.skysports.com/football/news/11854/11953959/coronavirus-italy-suspends-all-sporting-events-until-april-3", "urlToImage": "https://e1.365dm.com/16/08/1600x900/italy-italian-flag-euro-2016_3772220.jpg", "publishedAt": "2020-03-09T21:00:00Z", "content": "All sporting events in Italy are to be suspended until April 3 due to the growing spread of the coronavirus, Italian Prime Minister Giuseppe Conte has announced.\r\nItaly's top sports body, the Italian Olympic Committee (CONI) had earlier called for all sports … [+982 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Anders Bylund)", "title": "Why MercadoLibre Stock Crashed Today", "description": "The Latin American e-commerce specialist suffered from coronavirus worries and plunging oil prices.", "url": "https://www.fool.com/investing/2020/03/09/why-mercadolibre-stock-crashed-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562346/red-arrow-crashing-down-through-the-floor.jpg", "publishedAt": "2020-03-09T20:15:16Z", "content": "What happened\r\nShares of Latin American e-commerce giant MercadoLibre(NASDAQ:MELI) fell as much as 12.5% on Monday. Investors backed away from the stock as the novel coronavirus expanded its spread over South and Central America.\r\nSo what\r\nAccording to a Reut… [+1275 chars]"}, {"source": {"id": null, "name": "Pocketnow.com"}, "author": "Lee Kelly", "title": "Coronavirus outbreak might delay Apple’s iPhone SE 2 and iPhone 12", "description": "The coronavirus outbreak might delay the iPhone SE 2’s launch and even push back the production of iPhone 12 series by at least a month. The post Coronavirus outbreak might delay Apple’s iPhone SE 2 and iPhone 12 appeared first on Pocketnow.", "url": "https://pocketnow.com/coronavirus-outbreak-might-delay-apples-iphone-se-2-and-iphone-12", "urlToImage": "https://pocketnow.com/wp/../files/2020/01/2020-iPhone-SE-2-4.7-LCD-display-1536x864-1.jpg", "publishedAt": "2020-03-09T21:09:00Z", "content": "The deadly coronavirus has had a massive impact on the entire consumer tech industry, and Apple is no exception. After witnessing a massive slump in sale and market value, analysts expect that two of Apples highly-anticipated products might be delayed. \r\niPho… [+583 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Claudia Assis", "title": "Revlon goes for layoffs, debt refinancing to shore up its balance sheet", "description": "Revlon Inc. late Monday unveils a plan to save costs and refinance its debt amid deepening losses for U.S. equities.", "url": "http://www.marketwatch.com/story/revlon-goes-for-layoffs-debt-refinancing-to-shore-up-its-balance-sheet-2020-03-09", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HF986_Revlon_ZG_20190319153452.jpg", "publishedAt": "2020-03-09T21:09:38Z", "content": "Shares of Revlon Inc. fell more than 2% late Monday after the cosmetics company said it would lay off workers, cut costs, and refinance its debt amid deepening losses for U.S. equities.Revlon\r\n REV, \r\n -14.76%\r\nstruck an $850 million agreement with Jefferies … [+2065 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Carli Velocci", "title": "Reggie Fils-Aimé to join GameStop board of directors", "description": "A new gig for the former president of Nintendo, who retired in 2019. What you need to know Reggie Fils-Aimé, former president of Nintendo, is joining GameStop's board of directors. The company hopes the board refresh will set it up for \"long-term success.\" Ga…", "url": "https://www.windowscentral.com/former-nintendo-president-reggie-fils-aime-join-gamestop-board-directors", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/03/reggie-fils-aime.jpg?itok=7Y0QvekP", "publishedAt": "2020-03-09T21:02:03Z", "content": "A former Nintendo of America president and figure loved across gaming is joining GameStop. The company announced Monday that Reggie Fils-Aimé has been appointed to the board of directors.\r\nAccording to a press release, GameStop also appointed William Simon, w… [+3563 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "#IStayHome: Italians take to social media to combat coronavirus", "description": "As number of cases surges, celebrities and doctors take to social media urging people to respect government rules.", "url": "https://www.aljazeera.com/news/2020/03/istayhome-italians-social-media-combat-coronavirus-200309131135533.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/9/895f985e84d942c9a04f4a65c3ad1fb1_18.jpg", "publishedAt": "2020-03-09T20:51:17Z", "content": "Artists, doctors and politicians in Italy have thrown their weight behind the government's drastic measures to combat the new coronavirus, calling on their social media followers to abide by an extraordinary lockdown in the country's north.\r\nHours after Prime… [+3695 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Laura Hancock, cleveland.com", "title": "Number of people being tested for coronavirus in Ohio surges to eight - cleveland.com", "description": "Number of people being tested for coronavirus in Ohio surges to eight cleveland.com Ohio is under a state of emergency because of the coronavirus. What does that mean? cleveland.com Three confirmed cases of coronavirus in Ohio cleveland.com Three Ohioans, all…", "url": "https://www.cleveland.com/coronavirus/2020/03/number-of-people-being-tested-for-coronavirus-in-ohio-surges-to-eight.html", "urlToImage": "https://www.cleveland.com/resizer/AuqajG-I2n7SjcbbXzjnaD_54Ng=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/MNQAAX6UVZDOHJWCVZRIVT2IL4.png", "publishedAt": "2020-03-09T20:42:00Z", "content": "COLUMBUS, Ohio - The number people in Ohio who are being tested for coronavirus increased to eight - - the highest number of testing at a single time since the epidemic began.\r\nMeantime, there are no confirmed cases in Ohio. There are 11 negative tests.\r\nAnd … [+2085 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus hits travel industry with biggest crisis since 9/11 - CBS News", "description": "Coronavirus hits travel industry with biggest crisis since 9/11 CBS News Trump shook Representative Doug Collins' hand before congressman self-quarantined CBS News Trump administration delivers mixed messages on coronavirus CBS News Pharmaceutical giant shipp…", "url": "https://www.youtube.com/watch?v=FB8yR0vvCSY", "urlToImage": null, "publishedAt": "2020-03-09T20:25:52Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Broadway Shows Stay Popular in the Face of Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-09/broadway-shows-stay-popular-in-the-face-of-coronavirus-outbreak", "urlToImage": null, "publishedAt": "2020-03-09T20:23:34Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "amiller@businessinsider.com (Anna Medaris Miller)", "title": "CDC: Many Americans will probably be exposed to coronavirus at some point, 'and there's a good chance many will become sick'", "description": "In a media briefing Monday, an organization leader said \"this virus is capable of spreading easily and sustainably from person to person.\"", "url": "https://news.yahoo.com/cdc-many-americans-probably-exposed-203000777.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.KzsXyCUcXuBd.oHiTL4zg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/8Qx_BLSe9lGg1fEgqo_EIQ--~B/aD0xMjYxO3c9MTY4MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/c3dd3dc10154df5dcece05c52f8f4b6d", "publishedAt": "2020-03-09T21:03:20Z", "content": "<ul><li>In a media telebriefing about the novel coronavirus, the Centers for Disease Control and Prevention's Dr. Nancy Messonnier said \"many Americans\" will be exposed to the virus at some point. \r\n</li></ul><ul><li>She also said \"there's a good chance many … [+3223 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Melissa Shepard MD", "title": "Controlling Coronavirus Anxiety", "description": "Are you feeling anxious about the coronavirus crisis? If so, you are not alone. Here are 8 tips that can help you cope.", "url": "https://www.psychologytoday.com/ca/blog/erasing-stigma/202003/controlling-coronavirus-anxiety", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_images/2020-03/coronavirus_covid-19_virus.jpg?itok=p8VA6uZz", "publishedAt": "2020-03-09T20:32:32Z", "content": "The novel coronavirus has now made it to every continent except Antarctica.  As it continues to spread, we are constantly inundated with updates on the virus and the latest death tolls. Understandably, this can be very overwhelming. Here are some things you c… [+6020 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Melissa Shepard MD", "title": "Controlling Coronavirus Anxiety", "description": "Are you feeling anxious about the coronavirus crisis? If so, you are not alone. Here are 8 tips that can help you cope.", "url": "https://www.psychologytoday.com/us/blog/erasing-stigma/202003/controlling-coronavirus-anxiety", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_images/2020-03/coronavirus_covid-19_virus.jpg?itok=p8VA6uZz", "publishedAt": "2020-03-09T20:32:32Z", "content": "The novel coronavirus has now made it to every continent except Antarctica.  As it continues to spread, we are constantly inundated with updates on the virus and the latest death tolls. Understandably, this can be very overwhelming. Here are some things you c… [+6020 chars]"}, {"source": {"id": null, "name": "Nasa.gov"}, "author": null, "title": "NASA Administrator Statement on Coronavirus Situation", "description": "The following is a statement from NASA Administrator Jim Bridenstine:", "url": "https://www.nasa.gov/press-release/nasa-administrator-statement-on-coronavirus-situation", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/698814main_acd12-0026-004_full_0.jpg", "publishedAt": "2020-03-09T20:28:00Z", "content": null}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Peter Sciretta", "title": "Daily Podcast: Coronavirus & The Film Industry, Onward, Universal Monsters, The Mandalorian, Ava DuVernay and Quibi", "description": "On the March 9, 2020 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film weekend editor Brad Oman, senior writer Ben Pearson and writer Chris Evangelista to talk about the latest film and TV news, including SXSW, Onward, Universal …", "url": "https://www.slashfilm.com/daily-podcast-coronavirus-the-film-industry-onward-universal-monsters-the-mandalorian-ava-duvernay-and-quibi/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/onward-ian-desk.jpg", "publishedAt": "2020-03-09T20:15:47Z", "content": "On the March 9, 2020 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film weekend editor Brad Oman, senior writer Ben Pearson and writer Chris Evangelista to talk about the latest film and TV news, including SXSW, Onward, Universal … [+961 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Called ‘coronavirus’ near DU: Woman from NE", "description": "Bharadwaj said the complainant was supposed to give a statement Monday but didn’t turn up, and may come on Tuesday instead.", "url": "https://indianexpress.com/article/cities/delhi/called-coronavirus-near-du-woman-from-northeast-6307438/", "urlToImage": "https://images.indianexpress.com/2020/03/delhi-police-759-1.jpg?w=759", "publishedAt": "2020-03-09T20:34:02Z", "content": "On Monday, an FIR was filed at Roop Nagar police station under IPC sections 354 and 188. (Representational Image)An FIR has been registered on the complaint of a woman from the Northeast who alleged she was hit by water balloons and called coronavirus by two … [+1108 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH: Maryland Gov. Larry Hogan delivers remarks on coronavirus outbreak - Washington Post", "description": "WATCH: Maryland Gov. Larry Hogan delivers remarks on coronavirus outbreak Washington Post Maryland governor criticizes Trump’s statements on coronavirus POLITICO Full Hogan: 'This Thing Is Escalating So Rapidly' As Coronavirus Spreads | Meet The Press | NBC N…", "url": "https://www.youtube.com/watch?v=VO2Jf8-IYZQ", "urlToImage": "https://i.ytimg.com/vi/VO2Jf8-IYZQ/maxresdefault.jpg", "publishedAt": "2020-03-09T20:15:57Z", "content": "Maryland Gov. Larry Hogan delivers remarks on coronavirus outbreak. Subscribe to The Washington Post on YouTube: https://wapo.st/2QOdcqK\r\nFollow us:Twitter: https://twitter.com/washingtonpostInstagram: https://www.instagram.com/washingtonp...Facebook: https:/… [+32 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/courtney.tanner.161, https://www.facebook.com/erin.alberty", "title": "Person with coronavirus went to BYU basketball game, school says - Salt Lake Tribune", "description": "Person with coronavirus went to BYU basketball game, school says Salt Lake Tribune Intermountain enacts hospital visitor restrictions due to coronavirus Salt Lake Tribune View Full Coverage on Google News", "url": "https://www.sltrib.com/news/education/2020/03/09/person-with-coronavirus/", "urlToImage": "https://www.sltrib.com/resizer/McT5bIbFeFPSf6F3TZ1YERgT6S4=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/KLEJFPDLCVFA7DNGWNDLNJRVCQ.jpg", "publishedAt": "2020-03-09T20:47:30Z", "content": "The Utah County Health Department has alerted Brigham Young University that a man with coronavirus attended a basketball game at the school late last month.\r\n BYU tweeted the alert Monday, saying the man had mild symptoms when he went to the game on Feb. 22 m… [+7665 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CNN polled Americans about coronavirus. Here's what they said - CNN", "description": "CNN polled Americans about coronavirus. Here's what they said CNN Hatchet Man Steals Doughnuts and Is Arrested Mid-Bite The Daily Beast Tapper to Adams: Is Trump 'Artificially' Keeping Coronavirus Figures Low? Newsweek Tapper presses surgeon general: You can'…", "url": "https://www.youtube.com/watch?v=4Vsjtvm4cyA", "urlToImage": null, "publishedAt": "2020-03-09T20:47:19Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Jhu.edu"}, "author": null, "title": "Coronavirus symptoms start about five days after exposure, Johns Hopkins study finds - The Hub at Johns Hopkins", "description": "Coronavirus symptoms start about five days after exposure, Johns Hopkins study finds The Hub at Johns Hopkins Coronavirus symptoms usually take 5 days to appear, study says CNN How different countries are handling the coronavirus Yahoo News Coronavirus is so …", "url": "https://hub.jhu.edu/2020/03/09/coronavirus-incubation-period/", "urlToImage": "https://api.hub.jhu.edu/factory/sites/default/files/styles/hub_xlarge/public/coronavirus2.jpg?itok=eon7D3oU", "publishedAt": "2020-03-09T21:00:00Z", "content": "A new study led by researchers at Johns Hopkins Bloomberg School of Public Health suggests that the median incubation period for SARS-CoV-2—the new coronavirus that causes the respiratory illness COVID-19—is 5.1 days.\r\nThis median time from exposure to onset … [+3847 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/susan-ferrechio", "title": "Fifth lawmaker to announce coronavirus self-quarantine shook Trump's hand Friday - Washington Examiner", "description": "Fifth lawmaker to announce coronavirus self-quarantine shook Trump's hand Friday Washington Examiner 5 congressmen -- including Trump's future chief of staff and lawmaker who shook President's hand -- to self-quarantine after CPAC CNN President Trump On Coron…", "url": "https://www.washingtonexaminer.com/news/congress/fifth-lawmaker-to-announce-coronavirus-self-quarantine-shook-trumps-hand-friday", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/3940769/2147483647/strip/true/crop/2263x1188+0+67/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F32%2F35%2F303acc654e04a76cbd2d99031469%2Fcollins-with-trump.jpg", "publishedAt": "2020-03-09T20:25:00Z", "content": "Rep. Doug Collins, a Georgia Republican who is running for the U.S. Senate, announced Monday he will remain quarantined for two weeks after learning he was in contact with an attendee at last months Conservative Political Action Conference who later tested po… [+1741 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Ben Schoon", "title": "Google Maps businesses encouraged to update listings if affected by coronavirus", "description": "Google Maps is a useful place to find information about local businesses, and now, Google has encouraged businesses affected by the COVID-19 coronavirus outbreak to make their potential customers aware by updating their listings. more… The post Google Maps bu…", "url": "https://9to5google.com/2020/03/09/google-maps-coronavirus-listing-update/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2018/10/google_maps_4.jpg?resize=1024,512", "publishedAt": "2020-03-09T20:29:06Z", "content": "Google Maps is a useful place to find information about local businesses, and now, Google has encouraged businesses affected by the COVID-19 coronavirus outbreak to make their potential customers aware by updating their listings.\r\nOn a support page, Google go… [+1597 chars]"}, {"source": {"id": null, "name": "Citylab.com"}, "author": "Kriston Capps", "title": "How Coronavirus Took Down SXSW", "description": "For Austin Mayor Steven Adler, the decision to call off the Texas capital’s signature music and film festival due to COVID-19 fears wasn’t an easy one.", "url": "https://www.citylab.com/equity/2020/03/sxsw-cancellation-coronavirus-austin-music-film-festival/607669/", "urlToImage": "https://cdn.theatlantic.com/thumbor/YNFKRncridzslBsVoPShEOb1IgA=/0x97:2997x1653/960x500/https://cdn.citylab.com/media/img/citylab/2020/03/GettyImages_141490381/original.jpg", "publishedAt": "2020-03-09T21:00:00Z", "content": "On Friday, Austin Mayor Steve Adler announced the cancellation of South by Southwest, a two-week film and music festival that brings thousands of visitors to the city — and hundreds of millions of dollars in revenue. As global alarm over the coronavirus outbr… [+9079 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Walter Frick", "title": "The chance of a US recession in 2020 may have doubled since January", "description": "Quartz asked a group of \"superforecasters\" to update their estimates of a US recession in 2020.", "url": "https://qz.com/1815176/will-coronavirus-cause-a-us-recession-in-2020/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/RTS1AWRS.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-09T20:14:40Z", "content": "Back in January, Quartz asked the forecasters at Good Judgment Inc. to estimate the chance of a United States recession in the this year. The average estimate was 18%. Last week we posed the same question, to see what effect coronavirus has had on the answer.… [+2234 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Apple iPhone Sales In China At 'Doomsday' Level Amid Coronavirus Outbreak - Investor's Business Daily", "description": "Apple iPhone Sales In China At 'Doomsday' Level Amid Coronavirus Outbreak Investor's Business Daily Apple sees China iPhone shipments tank in ‘doomsday’ scenario but bull says to keep the faith MarketWatch iPhone 12 reportedly delayed a month and could miss h…", "url": "https://www.investors.com/news/technology/click/apple-iphone-sales-china-doomsday-level-coronavirus/", "urlToImage": "https://www.investors.com/wp-content/uploads/2019/12/stock-Apple-iphone11-15-company-1.jpg", "publishedAt": "2020-03-09T20:49:48Z", "content": "A Wall Street analyst on Monday called the severe drop in Apple iPhone sales in China during the coronavirus outbreak \"unprecedented\" and unwelcome news for Apple (AAPL) stock.\r\nXThe Chinese Academy of Information and Communications Technology released data s… [+3005 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Jyoti Shelar", "title": "Pune couple tests positive for COVID-19", "description": "State health officials said that the husband and wife had returned to India on March 1 but reported to the hospital on Monday", "url": "https://www.thehindu.com/news/national/other-states/pune-couple-tests-positive-for-covid-19/article31026954.ece", "urlToImage": "https://www.thehindu.com/todays-paper/tp-features/tp-sci-tech-and-agri/twe7m3/article31013114.ece/ALTERNATES/LANDSCAPE_615/08TH-SCIPRASA-GKM77CDOB3jpgjpg", "publishedAt": "2020-03-09T20:16:40Z", "content": "The novel coronavirus (COVID-19) made its way to Maharashtra with two Pune residents with travel history to Dubai testing positive on Monday. \r\nCoronavirus, live updates\r\nState health officials said that the husband and wife had returned to India on March 1 b… [+879 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Alastair Jamieson", "title": "Coronavirus incubation period is 5.1 days, researchers say", "description": "The typical incubation period for the new coronavirus is five days, according to public health scientists.", "url": "https://www.euronews.com/2020/03/09/coronavirus-incubation-period-is-5-1-days-researchers-say", "urlToImage": "https://static.euronews.com/articles/stories/04/55/72/32/1000x563_cmsv2_d27b7c5d-c092-5a13-a335-5ac8ecf9a380-4557232.jpg", "publishedAt": "2020-03-09T21:00:59Z", "content": "The typical incubation period for the new coronavirus is five days, according to public health scientists who say the current COVID-19 quarantine period of two weeks is “reasonable.”\r\nAn accurate estimate of the incubation period for a new virus makes it easi… [+1270 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Alex Kasprak", "title": "Did an Infectious Disease Specialist Write ‘I Am Not Scared of COVID-19’?", "description": "Readers inquired about a viral Facebook post amid an outbreak of the new coronavirus in 2020.", "url": "https://www.snopes.com/fact-check/abdu-sharkawy-coronavirus/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/sharkawy-post.png?fit=1200,628", "publishedAt": "2020-03-09T20:20:51Z", "content": "On March 6, 2020, a Facebook post by Dr. Abdu Sharkawy, internal medicine and infectious diseases consultant with Torontos University Health Network and an assistant professor at University of Toronto, went viral, garnering over 1.3 million shares at the time… [+3234 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Virus-hit cruise ship docks in California port of Oakland", "description": "Authorities said it would take two or three days to get the 2,421 passengers off the ship", "url": "https://www.thehindu.com/news/international/virus-hit-cruise-ship-docks-in-california-port-of-oakland/article31027502.ece", "urlToImage": "https://www.thehindu.com/news/international/q308jw/article31027555.ece/ALTERNATES/LANDSCAPE_615/HEALTH-CORONAVIRUSUSA", "publishedAt": "2020-03-09T20:24:16Z", "content": "A coronavirus-hit cruise ship has docked at Californias port of Oakland, where infected passengers will be the first of thousands to disembark in what officials called an unprecedented and difficult operation.\r\nThe Grand Princess docked on Monday shortly afte… [+3090 chars]"}, {"source": {"id": null, "name": "Wmbfnews.com"}, "author": "", "title": "Myrtle Beach leaders create survey to determine coronavirus impact to businesses, tourism - WMBF", "description": "Myrtle Beach leaders want to know how the intense spread of the coronavirus is impacting the Grand Strand.", "url": "https://www.wmbfnews.com/2020/03/09/myrtle-beach-leaders-create-survey-determine-coronavirus-impact-businesses-tourism/", "urlToImage": "https://www.wmbfnews.com/resizer/e-XhQS0FrUy0VXremMJs2vM4Mr8=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/LEVIX3X3TRARPHZYOBTSWZPX4U.jpg", "publishedAt": "2020-03-09T20:27:00Z", "content": "MYRTLE BEACH, S.C. (WMBF) Myrtle Beach leaders want to know how the intense spread of the coronavirus is impacting the Grand Strand.\r\nThe Myrtle Beach Area Chamber and Visitors Bureau created a survey for businesses to get an assessment of how the virus is af… [+764 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "Media Stocks Swoon With AMC Entertainment, Nexstar, Dish, ViacomCBS In Double-Digit Decline", "description": "Media stocks plunged amidst general carnage in the markets Monday with movie theater shares – AMC Entertainment, Cinemark, National Cinemedia, hard hard hit but declines across sectors from broadcasting to entertainment to satellite. The tech sector was down …", "url": "https://deadline.com/2020/03/media-stocks-swoon-amc-entertainment-nexstar-dish-viacomcbs-declines-1202877797/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2018/02/ap_18033573305162.jpg?w=1024", "publishedAt": "2020-03-09T20:19:09Z", "content": "Media stocks plunged amidst general carnage in the markets Monday with movie theater shares – AMC Entertainment, Cinemark, National Cinemedia, hard hard hit but declines across sectors from broadcasting to entertainment to satellite. The tech sector was down … [+1998 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Jake Offenhartz", "title": "Spread Of Coronavirus \"A Nightmare Waiting To Happen\" For NY Jails & Prisons", "description": "Defense attorneys, criminal justice advocates and health experts are raising the alarm about the likelihood of the outbreak hitting incarcerated populations. [ more › ]", "url": "https://gothamist.com/news/spread-coronavirus-nightmare-waiting-happen-ny-jails-prisons", "urlToImage": "https://cms.prod.nypr.digital/images/32618/fill-1200x650/", "publishedAt": "2020-03-09T20:54:02Z", "content": "More than two dozen people sharing a single toilet. Bedsheets and clothes that haven't been washed in over a week. A ban on hand sanitizer. A dearth of soap, hot water, and medical care.\r\nAs more cases of COVID-19 are confirmed throughout the city, defense at… [+4229 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Daniel Howley", "title": "Apple saw 'doomsday type' iPhone sales in China — but it's not the end for the tech giant", "description": "Apple will take a serious hit in its China revenue in Q2 2020, but it could turn it around with when the new iPhone is launched later this year.", "url": "https://finance.yahoo.com/news/apple-china-iphone-sales-204742315.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-09T20:47:42Z", "content": "Apple is looking at a potentially unprecedented drop in iPhone sales in China amid the COVID-19 outbreak. \r\nThe company, which saw its stores in China shuttered and manufacturing partners idle their factories following the outbreak, shipped about 500,000 iPho… [+4637 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Brian Sumers, Skift", "title": "Coronavirus Is Pushing Some Airlines to the Precipice", "description": "As the panic over coronavirus ripples worldwide, airlines are facing their biggest challenge since the post-9/11 period. While many carriers should have", "url": "https://skift.com/2020/03/09/coronavirus-is-pushing-some-airlines-to-the-precipice/", "urlToImage": "https://skift.com/wp-content/uploads/2019/05/thumbnail-4755793624af052ee9460f2de2a74655-e1557312981646.jpeg", "publishedAt": "2020-03-09T21:10:01Z", "content": "As the panic over coronavirus ripples worldwide, airlines are facing their biggest challenge since the post-9/11 period. While many carriers should have strong enough balance sheets, or enough government support to get through it, some may not make it.\r\nIATA,… [+7052 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Associated Press", "title": "Developing: Italian Travel Restrictions Expanded to Entire Country", "description": "It took less than two days for Italy to move from partial to complete travel restrictions in order to help slow the spread of the coronavirus. -Rachel Bronstein", "url": "https://skift.com/2020/03/09/developing-italian-travel-restrictions-expanded-to-entire-country/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/thumbnail-cbaf0d9593454eea15ff5077ed46f2db-1024x747.jpeg", "publishedAt": "2020-03-09T21:03:46Z", "content": "Italy’s premier has extended internal travel restrictions imposed in the north to the entire country.\r\nThis article was written by The Associated Press from The Associated Press and was legally licensed through the NewsCred publisher network. Please direct al… [+43 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Reuters", "title": "Italy Expands Travel Restrictions to Entire Country", "description": "It took less than two days for Italy to move from partial to complete travel restrictions in order to help slow the spread of the coronavirus. -Jason Clampet", "url": "https://skift.com/2020/03/09/italy-expands-travel-restrictions-to-entire-country/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/thumbnail-d05d6468724b8bb36c191f5e9152d102-1024x692.jpeg", "publishedAt": "2020-03-09T21:03:46Z", "content": "Movement across Italy will be sharply restricted within hours, Prime Minister Giuseppe Conte announced on Monday, in an unprecedented clampdown aimed at beating the coronavirus in Europe’s worst-affected country.\r\nConte told reporters that measures introduced… [+1297 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Chahat Rana", "title": "Panjab: PU-PGI team produces comic book to explain coronavirus to children", "description": "At the heart of the effort are two young children, 9-year-old Aaditya Khaiwal and 14-year-old Lakshya Khaiwal, whose parents — Dr Ravindra Khaiwal from PGIMER and his wife Dr Suman Mor, Assistant Professor at PU Department of Environmental Science — are behin…", "url": "https://indianexpress.com/article/cities/chandigarh/panjab-pu-pgi-team-produces-comic-book-to-explain-coronavirus-to-children-6307398/", "urlToImage": "https://images.indianexpress.com/2020/03/Corona-5.jpg?w=759", "publishedAt": "2020-03-09T20:15:48Z", "content": "Written by Chahat Rana\r\n | Chandigarh | \r\nPublished: March 10, 2020 1:45:48 am\r\nIt was truly a family effort, consisting of me, my wife and two children, as well as a team of young scholars from PU who have been associated with the work I am already producing… [+4847 chars]"}, {"source": {"id": null, "name": "Dpreview.com"}, "author": "Gannon Burgett", "title": "The Photography Show has been postponed due to COVID-19, is still on course for a 2020 show", "description": "The organizers behind The Photography Show and The Video Show, have announced the event is being postponed due to ongoing concerns regarding COVID-19 (the coronavirus). Originally set to take place from March 14 through March 17 at the National Exhibition Cen…", "url": "https://www.dpreview.com/news/5818588081/the-photography-show-has-been-postponed-due-to-covid-19-is-still-on-course-for-a-2020-show", "urlToImage": "https://4.img-dpreview.com/files/p/E~TS940x788~articles/5818588081/TPS_1.png", "publishedAt": "2020-03-09T20:44:00Z", "content": "The organizers behind The Photography Show and The Video Show, have announced the event is being postponed due to ongoing concerns regarding COVID-19 (the coronavirus). Originally set to take place from March 14 through March 17 at the National Exhibition Cen… [+1295 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Coronavirus scare: Delhi HC asks lawyers, public not to crowd premises", "description": "The High Court circular stated that the information regarding the virus be put up on the Delhi High Court Bar Association’s notice board and also be uploaded on the websites of all the district courts in the national capital.", "url": "https://indianexpress.com/article/cities/delhi/coronavirus-scare-delhi-hc-asks-lawyers-public-not-to-crowd-premises-6307424/", "urlToImage": "https://images.indianexpress.com/2019/10/Delhi-High-Court-759.jpg?w=759", "publishedAt": "2020-03-09T20:17:46Z", "content": "The circular also contains Dos and Donts, and provides the number of a state-level control room for any query. (File photo)Reports of coronavirus cases in the capital have prompted the Delhi High Court administration to issue a circular asking advocates and t… [+950 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mark Reeth", "title": "7 Stocks Poised to Profit From Coronavirus", "description": "The best place to start is the pharmaceutical industry, where the battle against coronavirus presents a clear investment opportunity: The company that creates a vaccine for the virus will win big.  Shares of Moderna shot up when the company announced it sent …", "url": "https://finance.yahoo.com/news/7-stocks-poised-profit-coronavirus-201309700.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-09T20:13:09Z", "content": "In the wild throes of shaken markets, opportunity lurks.\r\nMarkets and investors alike have been badly shaken by the rapid spread of the coronavirus. Markets have witnessed the Dow and the S&amp;P 500's largest weekly declines since 2008 and a hasty response f… [+6200 chars]"}, {"source": {"id": null, "name": "Queenseagle.com"}, "author": "Victoria Merlino", "title": "Queens reps push for small business aid amid coronavirus uncertainty - Queens Daily Eagle", "description": "“Many small businesses, in particular Asian American-owned businesses such as restaurants and retailers, have experienced a significant drop in business due to misinformation and xenophobia about coronavirus.”", "url": "https://queenseagle.com/all/2020/3/6/queens-reps-push-for-small-business-aid-amid-coronavirus-uncertainty", "urlToImage": "http://static1.squarespace.com/static/5b9ffe0f1137a680c2c08250/5ba02661cd8366eb6ec50772/5e62c8cd7d4516293d90d110/1583784826286/AP18220814411135.jpg?format=1500w", "publishedAt": "2020-03-09T20:13:46Z", "content": "By Victoria Merlino\r\nThe federal government on Friday instituted a multibillion-dollar emergency spending package to fight the coronavirus, an agreement that includes a provision added by two Queens lawmakers to assist small businesses impacted by illness unc… [+1330 chars]"}, {"source": {"id": null, "name": "Nerdist.com"}, "author": "Eric Diaz", "title": "Check Out the Virtual Alternative to ECCC", "description": "With so many conventions and public gatherings cancelled due to the threat of the Coronavirus, a few have created online virtual alternatives to the postponed shows. The post Check Out the Virtual Alternative to ECCC appeared first on Nerdist.", "url": "https://nerdist.com/article/virtual-alternative-emerald-city-comic-con/", "urlToImage": "https://nerdist.com/wp-content/uploads/2020/03/ESYLYMWU4AEZYZx.jpg", "publishedAt": "2020-03-09T20:29:49Z", "content": "Due to the threat of the COVID-19 virus, and in the spirit of public health, the folks behind Emerald City Comic-Con have had to postpone the convention. The Seattle-based con was slated for March 12-15 at the Washington State Convention Center, but has been … [+3112 chars]"}, {"source": {"id": null, "name": "Geeksaresexy.net"}, "author": "Geeks are Sexy", "title": "Who Should Wear a Mask to Stop the Spread of the Coronavirus [Comic]", "description": "[Source: Weiman Kow Art | Weiman Kow Art on Facebook | Weiman Kow Art on Instagram | Weiman Kow Art on Twitter] The post Who Should Wear a Mask to Stop the Spread of the Coronavirus [Comic] appeared first on Geeks are Sexy Technology News.", "url": "https://www.geeksaresexy.net/2020/03/09/who-should-wear-a-mask-to-stop-the-spread-of-the-coronavirus-comic/", "urlToImage": "https://i1.wp.com/www.geeksaresexy.net/wp-content/uploads/2020/03/maskt.jpg?fit=1200%2C600&ssl=1", "publishedAt": "2020-03-09T21:00:55Z", "content": null}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Maura Dolan", "title": "Grand Princess arrives in an anxious Oakland, now at the center of coronavirus fight", "description": "Anxiety in Oakland as Grand Princess lands and city is put at center of coronavirus fight", "url": "https://www.latimes.com/california/story/2020-03-09/anxiety-in-oakland-as-grand-princess-lands-and-city-is-put-at-center-of-coronavirus-fight", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/21b5cd2/2147483647/strip/true/crop/8688x4561+0+615/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fff%2F7b%2Fd96960aa44289c61f50c93faea9d%2Fla-photos-freelance-contract-503005-la-me-coronavirus-san-fran-9.jpg", "publishedAt": "2020-03-09T20:42:49Z", "content": "After days in coronavirus limbo, the Grand Princess cruise ship arrived at the Port of Oakland on Monday -- and suddenly the city found itself at the center of a public health emergency.\r\nGov. Gavin Newsom has said aggressive steps have been taken to get the … [+3387 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Kellogg Stock Fell 11% in February", "description": "Shares of the packaged-food company declined on a weak outlook for 2020.", "url": "https://www.fool.com/investing/2020/03/09/why-kellogg-stock-fell-11-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562343/kellogg-tony-tiger.jpeg", "publishedAt": "2020-03-09T20:37:00Z", "content": "What happened\r\nShares of Kellogg (NYSE:K) were stumbling last month after the cereal-maker offered up disappointing guidance in its fourth-quarter earnings report. As a result, the stock finished the month down 11% according to data from S&amp;P Global Market… [+1910 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Dives 2,014 Points On Coronavirus Fears, Oil Price Plunge - Investor's Business Daily", "description": "Dow Jones Dives 2,014 Points On Coronavirus Fears, Oil Price Plunge Investor's Business Daily Oil plunges 25 percent, markets sink as Russia-Saudi Arabia feud threatens coronavirus-weakened economy Fox News Oil hits historic lows amidst massive selloff, fledg…", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-dives-new-session-lows-coronavirus-slams-stock-market/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/03/Stock-Virus-04-adobe.jpg", "publishedAt": "2020-03-09T20:42:25Z", "content": "The Dow Jones Industrial Average closed near session lows Monday as the coronavirus continued to wreak havoc on the stock market today.\r\nXThe Dow Jones industrials crashed nearly 8% before paring the loss to 7.8%. The S&amp;P 500 dived 7.6% and the Nasdaq com… [+3024 chars]"}, {"source": {"id": null, "name": "Annals.org"}, "author": null, "title": "The Incubation Period of COVID-19 From Publicly Reported Confirmed Cases - Annals of Internal Medicine", "description": "The Incubation Period of COVID-19 From Publicly Reported Confirmed Cases Annals of Internal Medicine It takes an average of 5 days for coronavirus symptoms to show, new study says CNBC Coronavirus Symptoms Start About Five Days After Infection, New Research F…", "url": "https://annals.org/aim/fullarticle/2762808/incubation-period-coronavirus-disease-2019-covid-19-from-publicly-reported", "urlToImage": null, "publishedAt": "2020-03-09T21:00:46Z", "content": "Johns Hopkins Bloomberg School of Public Health, Baltimore, Maryland (S.A.L., K.H.G., Q.B., F.K.J., Q.Z., H.R.M., A.S.A., J.L.)\r\nSchool of Public Health and Health Sciences, University of Massachusetts, Amherst, Massachusetts, and Ludwig-Maximilians-Universit… [+4071 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Tarah Price", "title": "Glenn Beck joins Pat Gray to talk about the coronavirus", "description": "On Monday's episode of \" Pat Gray Unleashed,\" Glenn Beck stopped by the show to discuss some of the absurd items people are flocking to grocery stores to stock up on in response to the rising number of confirmed cases of Coronavirus. Watch the video below for…", "url": "https://www.theblaze.com/unleashed/glenn-beck-joins-pat-gray-to-talk-about-the-coronavirus", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg2ODI2OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNTUxNzkxMX0.hqY3JlL2kK1rUw6QRDP7Um3Xo4iwd2Eq_bgXnqdcvzI/img.jpg?width=1200&coordinates=0%2C4%2C0%2C4&height=600", "publishedAt": "2020-03-09T20:41:23Z", "content": "On Monday's episode of \"Pat Gray Unleashed,\" Glenn Beck stopped by the show to discuss some of the absurd items people are flocking to grocery stores to stock up on in response to the rising number of confirmed cases of Coronavirus. \r\nWatch the video below fo… [+318 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Zac Bowden", "title": "On this week's podcast... a new Start menu, Cortana, COVID-19, and more", "description": "On this episode of the Windows Central Podcast: New Start menu, COVID-19, Cortana, and more We're back with another exciting episode of the Windows Central Podcast, and this week, there are proposed changes to the Windows 10 Start Menu that will make some peo…", "url": "https://www.windowscentral.com/windows-central-podcast-169", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/03/cortana-commuter-reademail-android-2020.jpg?itok=Hg7Ic16p", "publishedAt": "2020-03-09T21:02:43Z", "content": "Super business laptop\r\nReview: HP Elite Dragonfly is gorgeous but rough around the edges\r\nHP's Elite Dragonfly is a new class of super premium business-class Ultrabook. Featuring a 2-in-1 design, support for Wacom inking, Windows Hello, 4G LTE (and soon 5G), … [+220 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Michael Daly", "title": "Making Coronavirus Patients Pay for Care Would Be Sick", "description": "Flavio Lo Scalzo/Reuters Call it Coronacare for All, a simple guarantee that anyone who develops symptoms of COVID-19 can be tested and quarantined, if needed, at no cost. The idea is that we are all on a cruise ship called Earth and our well-being depends on…", "url": "https://www.thedailybeast.com/making-coronavirus-patients-pay-for-care-would-be-sick", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583785514/200309-daly-corona-virus-tease_hlx9ce", "publishedAt": "2020-03-09T20:32:04Z", "content": "Call it Coronacare for All, a simple guarantee that anyone who develops symptoms of COVID-19 can be tested and quarantined, if needed, at no cost.\r\nThe idea is that we are all on a cruise ship called Earth and our well-being depends on immediately identifying… [+223 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Dow Plunges Over 2,000 Points, Marking Its Worst Day Since 2008", "description": "Add oil prices to a growing list of concerns weighing on investors.", "url": "https://www.fool.com/investing/2020/03/09/dow-plunges-over-2000-points-marking-its-worst-day.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562358/gettyimages-947361300.jpg", "publishedAt": "2020-03-09T20:40:00Z", "content": "The S&amp;P 500 fell more than 7.5% on Monday, its worst single day decline since December 2008, and the Dow Jones Industrial Average fell more than 2,000 points on a day dominated by increasing COVID-19 coronavirus-related concerns, plunging interest rates, … [+1369 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of MasTec Fell Today", "description": "The infrastructure specialist was hit by weakness in the oil sector and fears of a broader downturn.", "url": "https://www.fool.com/investing/2020/03/09/why-shares-of-mastec-fell-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562351/power-utility-transmision-pole-getty.jpg", "publishedAt": "2020-03-09T20:45:29Z", "content": "What happened\r\nShares of MasTec(NYSE:MTZ) fell more than 18% on Monday despite a lack of company-specific news. A sharp drop in the price of oil put the stock under pressure, as did increasing worries that the COVID-19 coronavirus will push the U.S. economy i… [+1306 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "It Takes About 5 Days for Sick People to Show Coronavirus Symptoms, New Study Says", "description": "A new study estimates coronavirus COVID-19's incubation period at five days, meaning it takes five days to show coronavirus symptoms.", "url": "https://news.yahoo.com/takes-5-days-sick-people-210020754.html", "urlToImage": null, "publishedAt": "2020-03-09T21:08:28Z", "content": null}, {"source": {"id": null, "name": "Dcist.com"}, "author": "lmccue", "title": "With Coronavirus Fears Spreading, Here’s The Status Of D.C. Events", "description": "Most D.C. arts and entertainment institutions are operating normally. The post With Coronavirus Fears Spreading, Here’s The Status Of D.C. Events appeared first on DCist.", "url": "https://dcist.com/story/20/03/09/with-coronavirus-fears-spreading-heres-the-status-of-d-c-events/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/03/49550054272_afe2379f64_k-1024x683.jpg", "publishedAt": "2020-03-09T21:10:43Z", "content": null}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Gil Kaufman", "title": "These 10 Coronavirus Songs Bring Some Levity to the Global Panic", "description": "While researchers scramble to cook up a vaccine, a number of artists and governments are reacting to the coronavirus spread with silly songs.", "url": "https://www.billboard.com/articles/news/9330920/coronavirus-parody-songs", "urlToImage": "https://static.billboard.com/files/2020/03/coronavirus-illo-stock-2020-billboard-1548-1583780858-1024x677.jpg", "publishedAt": "2020-03-09T20:39:51Z", "content": "Sometimes when things get the darkest, you just have to have a good morbid laugh. As researchers and governments across the globe scramble to find a vaccine for the quickly spreading COVID-19 virus that has killed more than 4,000 people and infected over 114,… [+4290 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Imani Moise", "title": "Wells Fargo reports confirmed case of coronavirus in California office", "description": "Wells Fargo & Co said on Monday than an employee working at one of its locations in San Francisco tested positive for coronavirus.  The bank was informed over the weekend by the San Francisco Department of Public Health about the results.  After finding out t…", "url": "https://finance.yahoo.com/news/wells-fargo-reports-confirmed-case-204440085.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-09T20:44:40Z", "content": "By Imani Moise\r\nMarch 9 (Reuters) - Wells Fargo &amp; Co said on Monday than an employee working at one of its locations in San Francisco tested positive for coronavirus.\r\nThe bank was informed over the weekend by the San Francisco Department of Public Health… [+517 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "William Feuer", "title": "ITALY QUARANTINES ENTIRE COUNTRY", "description": "ITALY QUARANTINES ENTIRE COUNTRY (Main headline, 1st story, link ) Related stories: MARKET BLOODBATH: STOCKS CRATER: DOW -2013 OIL PLUNGES 24% BANKS HIT HARD FED PUMPS MORE CASH", "url": "https://www.cnbc.com/2020/03/09/italy-extends-its-quarantine-to-the-entire-country-pm-asks-residents-to-stay-at-home.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106432183-1583757095137gettyimages-1205658253.jpeg?v=1583757148", "publishedAt": "2020-03-09T21:04:37Z", "content": "Italian Prime Minister Giuseppe Conte said Monday he will sign a decree that extends the lock down of the Lombardy region to the entire country as Italy's COVID-19 death toll continues to rise.\r\nPeople throughout the country should not leave their homes other… [+440 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Costco, Amazon, and eBay Stocks Sank This Morning -- Then Bounced Back", "description": "Consumer panic might actually be good news for these companies -- when it prompts panic buying.", "url": "https://www.fool.com/investing/2020/03/09/why-costco-amazon-and-ebay-stocks-sank-this-mornin.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562255/word-panic-buying-stamped-in-red-ink.jpg", "publishedAt": "2020-03-09T20:53:00Z", "content": "What happened\r\nThe novel coronavirus is among us, and it's time to panic.\r\nAt least, that appeared to be the consensus among consumers last week. Costco Wholesale(NASDAQ:COST) shelves on the West Coast were denuded of their supplies of bottled water and toile… [+2654 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Lisette Voytko, Forbes Staff, Lisette Voytko, Forbes Staff https://www.forbes.com/sites/lisettevoytko/", "title": "Here’s Where It’s Still OK To Travel During The COVID-19 Coronavirus Outbreak", "description": "“I think you can go anywhere if you don’t mind being delayed by 14 days.”", "url": "https://www.forbes.com/sites/lisettevoytko/2020/03/09/heres-where-its-still-ok-to-travel-during-the-covid-19-coronavirus-outbreak/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1203662366%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D5393%26cropY1%3D202%26cropY2%3D3238", "publishedAt": "2020-03-09T20:42:11Z", "content": "The coronavirus outbreak has thrown a wrench into travel worldwide, with numerous airlines ... [+] cancelling flights, cruise ships quarantining passengers and even domestic trains, such as Amtraks Acela, canceling service between major cities.\r\nPhoto by JACK… [+3392 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Burkina Faso confirms first cases of coronavirus", "description": "Burkina Faso on Monday reported its first two cases of coronavirus, the health minister said, becoming the sixth country in sub-Saharan Africa affected by the virus.", "url": "https://www.reuters.com/article/us-health-coronavirus-burkina-idUSKBN20W2Y9", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T21:10:37Z", "content": "OUAGADOUGOU (Reuters) - Burkina Faso on Monday reported its first two cases of coronavirus, the health minister said, becoming the sixth country in sub-Saharan Africa affected by the virus. \r\nHealth Minister Claudine Lougue told reporters that the two patient… [+184 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Noonan)", "title": "Why Square Stock Climbed 11.6% in February", "description": "Growth for the Cash app boosted the payment-processing stock last month, but March's trading has tested investors' conviction.", "url": "https://www.fool.com/investing/2020/03/09/why-square-stock-climbed-116-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561056/gettyimages-469948507.jpg", "publishedAt": "2020-03-09T21:05:00Z", "content": "What happened\r\nSquare's share price (NYSE:SQ) rose 11.6% in February, according to data from S&amp;P Global Market Intelligence. The fintech stock gained ground thanks to strong fourth-quarter results that allowed the company to defy market pressures brought … [+1916 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Caleb Ecarma", "title": "The Coronavirus Crisis Is Forcing Lawmakers and Journalists Indoors", "description": "CPAC attendees including Ted Cruz and Matt Gaetz, along with reporters from the Washington Post and Politico, are now under self-quarantine, as nerves are being tested on Capitol Hill.", "url": "https://www.vanityfair.com/news/2020/03/coronavirus-crisis-forcing-lawmakers-journalists-indoors", "urlToImage": "https://media.vanityfair.com/photos/5e66adafa62e1100087d1386/16:9/w_1280,c_limit/GettyImages-1206179999.jpg", "publishedAt": "2020-03-09T21:07:47Z", "content": "While speaking at the Conservative Political Action Conference last month, then acting White House chief of staff Mick Mulvaneyinsisted that the media was only focusing on the coronavirus epidemic because they believed it will hurt Donald Trumps reelection ch… [+6200 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rich Smith)", "title": "Why Work-From-Home Stocks Collapsed Today", "description": "Okta, Zoom, Slack, DocuSign -- even Teladoc -- are all falling victim to the market rout.", "url": "https://www.fool.com/investing/2020/03/09/time-sensitive-why-work-from-home-stocks-collapsed.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562216/cartoon-characters-confused-by-stock-chart-arrow-falling-and-crashing-into-floor.jpg", "publishedAt": "2020-03-09T21:07:00Z", "content": "What happened\r\nOkta(NASDAQ:OKTA), Zoom Video Communications (NASDAQ:ZM) Slack Technologies(NYSE:WORK), TeladocHealth(NYSE:TDOC), and DocuSign(NASDAQ:DOCU) are all technology stocks promising to make our lives easier by facilitating work from home (even for do… [+1883 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "“THE DEADLIEST WORDS FOR WORLD MARKETS ARE NOT ‘CORONAVIRUS’ AND ‘COVID-19’ BUT ‘DECADE-…", "description": "“THE DEADLIEST WORDS FOR WORLD MARKETS ARE NOT ‘CORONAVIRUS’ AND ‘COVID-19’ BUT ‘DECADE-LONG BULL MARKET:” Market hysteria is not all down to coronavirus.", "url": "https://pjmedia.com/instapundit/360848/", "urlToImage": null, "publishedAt": "2020-03-09T20:14:03Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Dcist.com"}, "author": "ewilliams", "title": "‘So This Happened’: Washington Nationals Played Golf With President Trump", "description": "The president's golf habits have come under scrutiny as he plays rounds amid the coronavirus' spread through the U.S. The post ‘So This Happened’: Washington Nationals Played Golf With President Trump appeared first on DCist.", "url": "https://dcist.com/story/20/03/09/so-this-happened-washington-nationals-played-golf-with-president-trump/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/03/trump-corbin.jpg", "publishedAt": "2020-03-09T20:19:32Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump shook Rep. Doug Collins' hand before congressman self-quarantined - CBS News", "description": "Trump shook Rep. Doug Collins' hand before congressman self-quarantined CBS News Trump had contact with congressmen Collins and Gaetz before they self-quarantined over coronavirus concerns CNBC 4 members of Congress -- including lawmaker who shook Trump's han…", "url": "https://www.youtube.com/watch?v=kklv1CROvRc", "urlToImage": "https://i.ytimg.com/vi/kklv1CROvRc/maxresdefault.jpg", "publishedAt": "2020-03-09T21:07:02Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "christina capatides", "title": "Rumors say cocaine and bleach can cure coronavirus — they can't", "description": "Millions of tweets and Facebook posts are peddling fake coronavirus cures. Don't believe them.", "url": "https://www.cbsnews.com/news/coronavirus-drinking-bleach-cocaine-false-rumors-social-media-facebook-twitter-instagram-tiktok/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/09/cd63d324-9126-4a66-aaeb-923d66c0d8fa/thumbnail/1200x630/86045edff9f92c5aa6a17a8aab688e9b/gettyimages-137954859.jpg", "publishedAt": "2020-03-09T20:54:19Z", "content": "In the wake of Russia's meddling in the 2016 election, Facebook and Twitter have been forced to respond to the proliferation of fake news on their platforms. And while many probably assume the bulk of that misinformation is political in focus, trolls and bots… [+5135 chars]"}]