[{"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "How to Prepare for the Coronavirus", "description": "U.S. health officials warned on Tuesday that the coronavirus is likely to spread in communities in the United States. They urged individuals to get themselves and their families ready. But what can you do?Infectious disease experts stressed that people should…", "url": "https://news.yahoo.com/prepare-coronavirus-130748350.html", "urlToImage": null, "publishedAt": "2020-02-26T13:07:48Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Bryan Clark", "title": "Social media conspiracies blame coronavirus on 5G internet", "description": "Conspiracy theorists are infecting YouTube and Facebook with bogus theories that 5G mobile internet is responsible for the coronavirus. One prominent anti-5G Facebook group has shared a number of erroneous posts, claiming 5G is the culprit behind a virus that…", "url": "https://thenextweb.com/?p=1274585", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F02%2F5g.jpg&signature=da3d67e4a1f63bfc22700ec10c191517", "publishedAt": "2020-02-26T12:24:22Z", "content": "Conspiracy theorists are infecting YouTube and Facebook with bogus theories that 5G mobile internet is responsible for the coronavirus.\r\nOne prominent anti-5G Facebook group has shared a number of erroneous posts, claiming 5G is the culprit behind a virus tha… [+4692 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "China's coronavirus lockdown is economically terrible for almost everyone except delivery, news, and gaming apps", "description": "Analysis of China's app usage shows that citizens are turning to their phones to keep themselves entertained and fed during the coronavirus outbreak. Social media, news apps, and video games have all seen a significant increase in installs and engagement acco…", "url": "https://www.businessinsider.com/food-delivery-gaming-news-apps-soar-china-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5e565ca9fee23d3fea6a7e02?width=1200&format=jpeg", "publishedAt": "2020-02-26T13:08:12Z", "content": "Stats about China's app usage give a glimpse into what quarantined life amid the coronavirus is like.\r\nAnalysis from Goldman Sachs reveals how mobile internet use has changed in China since the Lunar New Year, when the coronavirus outbreak started to pick up … [+2013 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "10 things you need to know before the opening bell", "description": "Here's what you need to know before the markets open. 1. 'The worst is yet to come': Global stocks plummet as fears mount of a coronavirus pandemic. \"Markets have finally woken up to the threats being presented by COVID-19,\" Michael Every, a senior Asia-Pacif…", "url": "https://www.businessinsider.com/opening-bell-february-26-2020-2", "urlToImage": "https://i.insider.com/5e566937fee23d45f0202185?width=1200&format=jpeg", "publishedAt": "2020-02-26T12:51:53Z", "content": "Here's what you need to know before the markets open.\r\n1. 'The worst is yet to come': Global stocks plummet as fears mount of a coronavirus pandemic. \"Markets have finally woken up to the threats being presented by COVID-19,\" Michael Every, a senior Asia-Paci… [+1969 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tariro Mzezewa", "title": "Second Cruise Ship Blocked From Ports Over Coronavirus Fears", "description": "Following a pattern set by the MS Westerdam, a cruise ship in the Caribbean has been turned away from two ports over fears of the coronavirus. The ship, with...", "url": "https://news.yahoo.com/second-cruise-ship-blocked-ports-130754323.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-26T13:07:54Z", "content": "Following a pattern set by the MS Westerdam, a cruise ship in the Caribbean has been turned away from two ports over fears of the coronavirus. The ship, with more than 4,500 passengers and 1,600 crew members, was not allowed to dock in Jamaica and the Cayman … [+2770 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "Debora MacKenzie", "title": "Covid-19: Why won't the WHO officially declare a coronavirus pandemic?", "description": "With outbreaks in multiple countries, the new coronavirus looks like a pandemic, but the World Health Organization won't declare one because governments may react in the wrong way", "url": "https://www.newscientist.com/article/2235342-covid-19-why-wont-the-who-officially-declare-a-coronavirus-pandemic/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2020/02/26123046/gettyimages-1203052760_web.jpg", "publishedAt": "2020-02-26T12:42:44Z", "content": "By Debora MacKenzie\r\nPassengers arriving from Italy at Debrecen International Airport, Hungary, are being screened for signs of covid-19\r\nAkos Stiller/Bloomberg via Getty Images\r\nPrepare for a pandemic, says the World Health Organization, as the global spread… [+4613 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "William Watts", "title": "Market Snapshot: Stock futures wobble as investors remain focused on coronavirus spread outside China", "description": "Stock-index futures move between small gains and losses as market bulls look for a respite from a selling stampede that’s sent equities sharply lower over the past four days amid rising worries about the spread of COVID-19 outside of China.", "url": "https://www.marketwatch.com/story/stock-futures-wobble-as-investors-remain-focused-on-coronavirus-spread-outside-china-2020-02-26", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HB141_dark_w_ZG_20190102124710.jpg", "publishedAt": "2020-02-26T12:44:45Z", "content": "Stock-index futures were slightly lower Wednesday after flipping between gains and losses as investors looked for a respite from a selling stampede thats sent equities sharply lower over the past four days amid rising worries about the spread of COVID-19 outs… [+2997 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "How coronavirus might lead to major iPhone 12 leaks", "description": "Apple is the best when it comes to keeping smartphone secrets, but every new iPhone leaks in some capacity. It's not as bad as Google's Pixel 3 and 4, or every Galaxy S and Note phone that launched in the past few years, but the newest iPhone is featured in p…", "url": "https://bgr.com/2020/02/26/iphone-12-production-start-early-coronavirus/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2019/11/bgr-iphone-11-pro-1.jpg?quality=98&strip=all", "publishedAt": "2020-02-26T12:31:36Z", "content": "Apple is the best when it comes to keeping smartphone secrets, but every new iPhone leaks in some capacity. It’s not as bad as Google’s Pixel 3 and 4, or every Galaxy S and Note phone that launched in the past few years, but the newest iPhone is featured in p… [+2805 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Retail Stocks Were Sliding for the Second Day in a Row", "description": "Fears around the COVID-19 coronavirus pandemic continued to weigh on the sector.", "url": "https://www.fool.com/investing/2020/02/26/why-retail-stocks-were-sliding-for-the-second-day.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559763/busy-retail-mall-closing-slide-source-getty.jpg", "publishedAt": "2020-02-26T12:15:00Z", "content": "What happened\r\nFor the second day in a row, retail stocks were getting pounded on fears about the novel coronavirus outbreak. Solid earnings reports from Home Depot (NYSE:HD) and Macy's (NYSE:M) were not enough to counteract the broader market sell-off that b… [+4027 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Alison Griswold, John Detrixhe", "title": "Coronavirus is spreading fast—in company earnings calls", "description": "Analysts and executives are trying to calculate the impact of the epidemic on everything from supply chains to commodity prices.", "url": "https://qz.com/1808041/coronavirus-mentions-are-multiplying-in-company-earnings-calls/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/02/RTS33NJD-e1582714505497.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-02-26T12:18:36Z", "content": "Global Economic Disruptions\r\nGlobalization, automation, and inequalityoh my!\r\nThere are still more questions than answers as Covid-19, the novel coronavirus, spreads. Thats put a major dent in stock markets around the world as investors head for the relative … [+7738 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Speights)", "title": "Should You Buy Inovio Pharmaceuticals Stock Right Now?", "description": "The biotech is developing a potential vaccine for the coronavirus. Its pipeline is chock-full of other candidates. Time to buy?", "url": "https://www.fool.com/investing/2020/02/26/should-you-buy-inovio-pharmaceuticals-stock-right.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559670/coronavirus-vial.jpg", "publishedAt": "2020-02-26T12:31:00Z", "content": "Shares of Inovio Pharmaceuticals(NASDAQ:INO) skyrocketed in January with initial worries about the coronavirus outbreak in China. However, the stock gave up most of those gains over the next few weeks.\r\nNow, though, concerns that the coronavirus could become … [+4175 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Speights)", "title": "Meet the Company That Just Might Prevent a Global Recession", "description": "The coronavirus outbreak isn't just a health crisis. It could cause an economic crisis, too. But this biotech could have a solution.", "url": "https://www.fool.com/investing/2020/02/26/meet-the-company-that-just-might-prevent-a-global.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559770/businessman-stopping-dominoes.jpg", "publishedAt": "2020-02-26T12:31:00Z", "content": "You might think it's crazy to even remotely suggest that one company could singlehandedly thwart the onset of a global economic recession. But make no mistake -- that's exactly what I'm doing.\r\nI think the odds are pretty high right now that a recession could… [+5150 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Matrix Partners bet early on Apple and FedEx. Here's why the VC is now investing millions on a trucking startup.", "description": "Los Angeles-based truck-brokerage startup Dray Alliance announced Wednesday that it raised a $10.2 million Series A round. Dray Alliance connects truck drivers and shippers in the ports of Long Beach and Los Angeles — where nearly a third of all containerized…", "url": "https://www.businessinsider.com/venture-capital-vc-trucking-backed-2020-2", "urlToImage": "https://i.insider.com/5e5557b6fee23d1a5b400376?width=1200&format=jpeg", "publishedAt": "2020-02-26T13:00:00Z", "content": "Trucking startup Dray Alliance, founded in 2018 by three childhood friends, announced on Wednesday that it raised a $10.2 million Series A round. \r\nThe lead backer is Matrix Partners — a venture-capital firm with $4 billion in assets under management, which b… [+5467 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Max Grobe", "title": "Here’s What Fashion & Industry Experts Are Saying About Raf Simons’ Move to Prada", "description": "The closing Sunday at Milan Fashion Week was marred by fear as the Lombardy region came to terms with Europe’s biggest outbreak of the coronavirus yet. On another year, the news of Raf Simons’ long-anticipated move to Prada — where he will serve as co-creativ…", "url": "https://www.highsnobiety.com/p/industry-reactions-raf-simons-prada/", "urlToImage": "https://static.highsnobiety.com/thumbor/dTPrLbAEPvIG3EFmAxvrf5-clhA=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2020/02/25145817/industry-reactions-raf-simons-prada-feature.jpg", "publishedAt": "2020-02-26T12:15:06Z", "content": "The closing Sunday at Milan Fashion Week was marred by fear as the Lombardy region came to terms with Europe’s biggest outbreak of the coronavirus yet. On another year, the news of Raf Simons’ long-anticipated move to Prada where he will serve as co-creative … [+8380 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "", "title": "Bloomberg Westminster: Can Sunak Balance The Books?", "description": "Flooding, coronavirus, Brexit. Bloomberg Opinion Columnist Therese Raphael joins to talk about the big issues alongside PMQs. She also tells Bloomberg Westminster’s Roger Hearing and Sebastian Salek that it’s not clear that freeports, a U.K. network of ports …", "url": "https://www.bloomberg.com/news/audio/2020-02-26/bloomberg-westminster-can-sunak-balance-the-books", "urlToImage": "https://assets.bwbx.io/s3/bbiz/images/social_fallbacks/bloomberg_default-a4f15fa7ee.jpg", "publishedAt": "2020-02-26T12:51:37Z", "content": "Flooding, coronavirus, Brexit. Bloomberg Opinion Columnist Therese Raphael joins to talk about the big issues alongside PMQs. She also tells Bloomberg Westminsters Roger Hearing and Sebastian Salek that its not clear that freeports, a U.K. network of ports th… [+334 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Why coronavirus may not hammer Home Depot like other big retailers", "description": "Keep this in mind amidst the coronavirus worries: not all retailers will be hammered.", "url": "https://finance.yahoo.com/news/why-coronavirus-may-not-hammer-home-depot-like-other-big-retailers-130728526.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/GH106hcKeD0OvelGLo5q2Q--~B/aD0yNTkyO3c9MzQ2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-01/304c8860-33e9-11ea-b97e-9a68784ea796", "publishedAt": "2020-02-26T13:07:28Z", "content": "Being a retailer that champions American-based suppliers is always a great thing, but especially when a catastrophic situation such as the coronavirus erupts in China otherwise known as the de-facto supplier base for most of the worlds largest retailers.\r\nHom… [+4299 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Too early for the ECB to contemplate coronavirus response: Makhlouf", "description": "It is too early for the European Central Bank to assess whether it needs to respond to the coronavirus epidemic with policy, even if the epidemic presents a risk to growth, Irish central bank chief Gabriel Makhlouf said on Wednesday.", "url": "https://www.reuters.com/article/us-china-health-ecb-idUSKCN20K1SI", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200226&t=2&i=1495488558&w=1200&r=LYNXNPEG1P18O", "publishedAt": "2020-02-26T12:35:07Z", "content": "FRANKFURT (Reuters) - It is too early for the European Central Bank to assess whether it needs to respond to the coronavirus epidemic with policy, even if the epidemic presents a risk to growth, Irish central bank chief Gabriel Makhlouf said on Wednesday. \r\n“… [+483 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "CORONAVIRUS UPDATE: UAE says ready for ‘worst case’ scenarios as coronavirus spreads in Middle East…", "description": "CORONAVIRUS UPDATE: UAE says ready for ‘worst case’ scenarios as coronavirus spreads in Middle East. Coronavirus spread ‘deeply concerning’ but not a pandemic: WHO’s Tedros. Brazilian Who Visited Italy Is Feared to Be First Coronavirus Patient in Latin Americ…", "url": "https://pjmedia.com/instapundit/359576/", "urlToImage": null, "publishedAt": "2020-02-26T12:52:58Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Chevron staff sent home as coronavirus precaution", "description": "About 300 Chevron staff at one of its London offices have been asked to work from home.", "url": "https://www.bbc.co.uk/news/business-51643621", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9BEA/production/_111041993_chevron.jpg", "publishedAt": "2020-02-26T12:49:53Z", "content": "Image copyrightGetty Images\r\nOil giant Chevron has asked 300 staff at a London office to work from home as a precaution against coronavirus.\r\nChevron took the step after one of its staff returned with flu-like symptoms from a country where there have been cas… [+800 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Vince Martin", "title": "Hudson Looks Like A Buy After Coronavirus-Driven Sell-Off", "description": "HUD has been one of the worst stocks in the travel industry since the coronavirus began to spread.The selling pressure does make some sense, given the contribution of Chinese customers to Hudson's duty-free business.Still, a 30% decline in 16 sessions seems l…", "url": "https://seekingalpha.com/article/4325016-hudson-looks-like-buy-after-coronavirus-driven-sell-off", "urlToImage": "https://static2.seekingalpha.com/uploads/2020/2/16/saupload_64f72008c7ac7c9875c5dbcbaf5b36d8.png", "publishedAt": "2020-02-26T13:00:00Z", "content": "Since the coronavirus outbreak began, investors have had a split opinion toward travel stocks including airport retailer Hudson (HUD). U.S. airlines have held up reasonably well: an equal-weighted basket of the four big stocks in that sector is flat year-to-d… [+16464 chars]"}, {"source": {"id": null, "name": "Dazeddigital.com"}, "author": "Laura Pitcher", "title": "Meet the #TikTokDocs giving professional medical advice through trap music", "description": "Health experts are utilising the app to educate young people on everything from safe sex to coronavirus", "url": "https://www.dazeddigital.com/beauty/soul/article/48119/1/tiktok-doctors-medical-advice-social-media-tiktokdocs-education-awareness", "urlToImage": "https://dazedimg-dazedgroup.netdna-ssl.com/1200/58-0-1617-1078/azure/dazed-prod/1280/6/1286429.jpg", "publishedAt": "2020-02-26T13:00:00Z", "content": "Where previous generations might have Googled medical symptoms, Gen Z appears to want their medical information to background music. Millions of young people use the video-sharing app to learn about their health, with board-certified doctors creating fun and … [+7761 chars]"}, {"source": {"id": null, "name": "Democracynow.org"}, "author": "mail@democracynow.org (Democracy Now!)", "title": "Headlines for February 26, 2020", "description": "CDC Warns of \"Severe\" Disruption to Daily Life in U.S. as Coronavirus Spreads, DHS Secretary Grilled over Coronavirus Preparedness as Trump Downplays Risks, Two Billionaires Join Democratic Debate in SC as Rivals Target Bernie Sanders, At Least 24 Killed in I…", "url": "https://www.democracynow.org/2020/2/26/headlines", "urlToImage": "https://assets.democracynow.org/assets/default_content_image-354f4555cc64afadc730d64243c658dd0af1f330152adcda6c4900cb4a26f082.jpg", "publishedAt": "2020-02-26T13:00:00Z", "content": null}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Aliza Worthington", "title": "Larry Kudlow Lies His Face Off About Coronavirus Being 'Contained'", "description": "Larry Kudlow, Trump's National Economic Council Director, went on CNBC to string together an impressive set of fairy tales about the coronavirus in the United States. First he claimed near \"airtight\" containment. \"We have contained this, we have contained thi…", "url": "https://crooksandliars.com/2020/02/larry-kudlow-lies-his-face-about", "urlToImage": "https://crooksandliars.com/files/mediaposters/2020/02/44428.jpg", "publishedAt": "2020-02-26T13:00:01Z", "content": "Larry Kudlow, Trump's National Economic Council Director, went on CNBC to string together an impressive set of fairy tales about the coronavirus in the United States.\r\nFirst he claimed near \"airtight\" containment. \"We have contained this, we have contained th… [+1686 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Forget Virus Scare, Buy Tech ETFs on the Dip - Yahoo Finance", "description": "Wall Street is suffering a bloodbath on rising coronavirus scare, with tech stocks leading the slump. Use the dip in tech ETFs as a buying point.", "url": "https://finance.yahoo.com/news/forget-virus-scare-buy-tech-130001945.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rAbS7fluUUNBaU.rd9cwAw--~B/aD00OTg7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/c1113b91000d81515b187f045784cf19", "publishedAt": "2020-02-26T13:00:00Z", "content": "Key U.S. indexes lost heavily in the past two days (as of Feb 25, 2020) on the rise in coronavirus cases outside China. Together, Apple AAPL, Facebook FB, Amazon AMZN, Microsoft MSFT and Google-parent Alphabet GOOGL) lost more than $238 billion on Feb 24.\r\nTh… [+3037 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": "Issues & Insights", "title": "Coronavirus For All: Dems' Plans Would Make Us Sick", "description": "Coronavirus For All: Dems' Plans Would Make Us Sick | RealClearPolitics", "url": "https://www.realclearpolitics.com/2020/02/26/coronavirus_for_all_dems_plans_would_make_us_sick_502651.html", "urlToImage": null, "publishedAt": "2020-02-26T12:50:24Z", "content": "Socialist medicine will make outbreaks of infectious diseases worse.\r\nRead Full Article »"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is the U.S. ready for a severe coronavirus outbreak? - CBS This Morning", "description": "Everyone from medical officials to lawmakers on Capitol Hill are looking to make preparations for what the CDC says is an inevitable coronavirus outbreak in ...", "url": "https://www.youtube.com/watch?v=R6snrJmrVYE", "urlToImage": "https://i.ytimg.com/vi/R6snrJmrVYE/maxresdefault.jpg", "publishedAt": "2020-02-26T12:45:17Z", "content": "Everyone from medical officials to lawmakers on Capitol Hill are looking to make preparations for what the CDC says is an inevitable coronavirus outbreak in the country and pandemic across the globe. CDC Principal Deputy Director Anne Schuchat joins CBS This … [+1368 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Leon LaBrecque, Contributor, Leon LaBrecque, Contributor https://www.forbes.com/sites/leonlabrecque/", "title": "Another Yield-Curve Inversion: Symptom Of Covid-19 Or A Recession?", "description": "On 02/25/2020 the 10-year U. S. Treasury minus the 1-year U. S. Treasury yield curve inverted (perhaps briefly), which means that the U. S. Treasury short-term rate was higher than the U. S. Treasury long-term rate.", "url": "https://www.forbes.com/sites/leonlabrecque/2020/02/26/another-yield-curve-inversion-symptom-of-covid-19-or-a-recession/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1145882183%2F0x0.jpg", "publishedAt": "2020-02-26T12:45:36Z", "content": "Another Yield-Curve Inversion\r\nGetty\r\nOn 02/25/2020 the 10-year U.S. Treasury minus the 1-year U.S. Treasury yield curve inverted (perhaps briefly), which means that the U.S. Treasury short-term rate was higher than the U.S. Treasury long-term rate. Typically… [+1870 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Congress prepares for inevitable U.S. coronavirus outbreak", "description": "The CDC issued a stark warning that Americans should prepare for an inevitable coronavirus outbreak, and that the disruption to U.S. life may be severe. So far 58 Americans have been diagnosed with the virus, a number the CDC has called “very few” compared to…", "url": "https://www.cbsnews.com/video/congress-prepares-for-inevitable-us-coronavirus-outbreak/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/26/149318f1-1f2e-4045-a02a-6ec904a47754/thumbnail/1200x630/144c21a6baac7d55a1e123a2ec0c9760/0226-ctm-coronavirusfunding-cordes-2035403-640x360.jpg", "publishedAt": "2020-02-26T12:29:10Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Eric Levitz", "title": "5 Ways a Coronavirus Pandemic Could Change the 2020 Election", "description": "The bug could expose Trump’s misrule and ruin his economic record — or validate his xenophobia and gift him a burst of catch-up growth this fall.", "url": "http://nymag.com/intelligencer/2020/02/how-a-coronavirus-pandemic-could-impact-the-2020-election-economy.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/02/25/25-donald-trump.w1200.h630.jpg", "publishedAt": "2020-02-26T13:00:20Z", "content": "Donald Trump is not known for downplaying foreign threats. And yet, as the Wuhan coronavirus triggered quarantines throughout China, moved into South Korea, Italy, the United States, and at least 36 other countries while throttling global supply chains and de… [+17865 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Adele Peters", "title": "How to prepare your home, your workplace, and yourself for a pandemic", "description": "Stock up on food, work from home, and make it clear workers who are sick will be supported—not fired. Roughly a month after China launched the largest quarantine in human history, with more than 700 million people under full or partial lockdown as of last wee…", "url": "https://www.fastcompany.com/90468382/how-to-prepare-your-home-your-workplace-and-yourself-for-a-pandemic?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=feedburner+fastcompany&utm_content=feedburner", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/02/p-1-90468382-how-to-prepare-for-a-pandemic.jpg", "publishedAt": "2020-02-26T12:30:10Z", "content": "Roughly a month after China launched the largest quarantine in human history, with more than 700 million people under full or partial lockdown as of last week, in an attempt at containment of the new coronavirus, the virus is now quickly spreading in other co… [+4593 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Coronavirus cases emerging faster outside China: WHO - The Jakarta Post - Jakarta Post", "description": "Coronavirus cases emerging faster outside China: WHO - The Jakarta Post Jakarta Post Travel during spread of coronavirus: train, bus, boat, and plane - Business Insider Business Insider Coronavirus latest: California monitoring 8400 people for Covid-19 Financ…", "url": "https://www.thejakartapost.com/news/2020/02/26/coronavirus-cases-emerging-faster-outside-china-who.html", "urlToImage": "https://img.jakpost.net/c/2020/02/26/2020_02_26_87381_1582690828._large.jpg", "publishedAt": "2020-02-26T13:08:00Z", "content": "There are now more new cases of the coronavirus reported each day outside China than inside the hardest-hit country, the World Health Organization said on Wednesday.\r\n\"Yesterday, the number of new cases reported outside China exceeded the number of new cases … [+2009 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Peter Weber", "title": "The Boston Globe endorses Elizabeth Warren. So does Ann Coulter, kind of.", "description": "The Boston Globe editorial board endorsed hometown Sen. Elizabeth Warren (D-Mass.) for president on Wednesday, less that a week before Massachusetts holds its primary on Super Tuesday, and they drew back the curtain and explained why in a video.\n\n'Every Democ…", "url": "https://theweek.com/speedreads/898295/boston-globe-endorses-elizabeth-warren-does-ann-coulter-kind", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/screen_shot_2020-02-26_at_6.09.25_am.jpg?itok=-mTZFsxA", "publishedAt": "2020-02-26T12:41:38Z", "content": "As the Democrats brawled in South Carolina, \"President Trump is on his way home from India,\" where \"he believes the reception he got was like nothing the Indian people had ever given before,\" Jimmy Kimmel laughed on Tuesday's Kimmel Live. \"Of course he got a … [+2095 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Sean Williams)", "title": "4 Stocks You'll Regret Not Buying During This Correction", "description": "It's time to go shopping for high-quality businesses.", "url": "https://www.fool.com/investing/2020/02/26/4-stocks-youll-regret-not-buying-during-this-corre.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559623/buy-low-sell-high-stock-market-chart-investing-retirement-getty.jpg", "publishedAt": "2020-02-26T12:21:00Z", "content": "Investors were in for a bit of a shock earlier this week. On Monday, Feb. 24, all three stock market indexes put up some of their largest point declines in history. The tech-heavy Nasdaq Composite fell 355 points, the broad-based S&amp;P 500 sank almost 112 p… [+7039 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Coronavirus panic could severely hit US services economy, former Fed insider tells Boom Bust", "description": "Stocks are seeing a second straight day of losses as global coronavirus fears shake the financial markets. RT’s Boom Bust looks into economic reactions and at how the Federal Reserve could react. Read Full Article at RT.com", "url": "https://www.rt.com/business/481722-coronavirus-fears-us-economy/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e566d2785f540558a01c418.JPG", "publishedAt": "2020-02-26T13:11:32Z", "content": "Former Fed insider Danielle DiMartino Booth says “you can’t just ignore what’s going on with the coronavirus.”\r\nBooth points out that the Federal Reserve should be looking not at the manufacturing supply chain but focusing on the greater part of the US econom… [+722 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Ju-min Park", "title": "Japan's snow town turns into hotbed of coronavirus cases", "description": "Children played in the snow without masks on Wednesday but Japan's coldest prefecture has become a hotbed of coronavirus infections, shutting schools, raising fears about the Summer Olympics and halting tours of a whisky distillery.", "url": "https://www.reuters.com/article/us-china-health-japan-hokkaido-idUSKCN20K1TV", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-26T12:44:32Z", "content": "SAPPORO, Japan (Reuters) - Children played in the snow without masks on Wednesday but Japan’s coldest prefecture has become a hotbed of coronavirus infections, shutting schools, raising fears about the Summer Olympics and halting tours of a whisky distillery.… [+2190 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Coronavirus: Vistara makes temporary reduction in flights to and from Bangkok, Singapore - Livemint", "description": "Coronavirus: Vistara makes temporary reduction in flights to and from Bangkok, Singapore Livemint Coronavirus outbreak: Vistara to cancel 54 flights in March, Air India, IndiGo suffer too India Today Coronavirus impact: Vistara cancels 54 flights to Bangkok, …", "url": "https://www.livemint.com/companies/news/coronavirus-vistara-makes-temporary-reduction-in-flights-to-and-from-bangkok-singapore-11582719285996.html", "urlToImage": "https://images.livemint.com/img/2020/02/26/600x338/2019-07-11T070222Z_2_LYNXNPEF6A0E0_RTROPTP_3_VISTARA-ORDERS-BOEING-AIRBUS_1563467379669_1582719389439.JPG", "publishedAt": "2020-02-26T12:18:05Z", "content": "New Delhi: Full service carrier Vistara will cancel 54 international flights next month, including on routes connecting Delhi with Bangkok and Singapore, amid weak demand due to the coronavirus outbreak.In a statement on Wednesday, the airline said it has mad… [+2379 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "contact@insideevs.com (EVANNEX)", "title": "Tesla May Be Less Vulnerable To Coronavirus Crisis Than Rivals", "description": "The auto industry is seeing the impact of the coronavirus in a big way, but Tesla has odds in its favor.", "url": "https://autos.yahoo.com/tesla-may-less-vulnerable-coronavirus-130409999.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/P.omdm6RSuZz20r9KVe7Sg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/85Dzi0xgQ62T5yx.o.XqhQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/insideevs_us_833/b8208584e8970f883d6783b7611e2a4d", "publishedAt": "2020-02-26T13:04:09Z", "content": "tesla model 3 gigafactory 3\r\nThe auto industry is seeing the impact of the coronavirus in a big way, but Tesla has odds in its favor.\r\nEDITOR'S NOTE: This article comes to us courtesy of EVANNEX, which makes and sells aftermarket Tesla accessories. The opinio… [+3675 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Christian Bassogog: Cameroon striker pledges $16,000 to compatriots in China", "description": "Cameroon forward Christian Bassogog donates $16,000 to help Cameroonians living in areas of China hit by the coronavirus.", "url": "https://www.bbc.co.uk/sport/football/51645667", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/13C8/production/_111046050_1152907985.jpg", "publishedAt": "2020-02-26T12:57:51Z", "content": "Cameroon forward Christian Bassogog plays for Chinese club Henan Jianye\r\nCameroon attacker Christian Bassogog has announced he will donate 10m CFA Francs ($16,000 or £13,000) to Cameroonian students living in areas of China stricken by the deadly coronavirus.… [+1752 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "How deadly is new coronavirus? It maybe too early to tell - Livemint", "description": "How deadly is new coronavirus? It maybe too early to tell Livemint WION EDIT: Wuhan coronavirus, a global pandemic? WION Global recession likely if coronavirus becomes pandemic: Moody’s Analytics The Indian Express Whisteblower spurs China push for change Dec…", "url": "https://www.livemint.com/news/world/how-deadly-is-new-coronavirus-it-maybe-too-early-to-tell-11582721178720.html", "urlToImage": "https://images.livemint.com/img/2020/02/26/600x338/2020-02-22T125923Z_968524956_RC2O5F9R8RLH_RTRMADP_3_CHINA-HEALTH-ITALY_1582379056903_1582721368496.JPG", "publishedAt": "2020-02-26T12:54:25Z", "content": "Washington: Scientists cant tell yet how deadly the new virus thats spreading around the globe really is and deepening the mystery, the fatality rate differs even within China.As infections of the virus that causes COVID-19 surge in other countries, even a lo… [+4021 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Is the U.S. ready for a severe coronavirus outbreak?", "description": "Everyone from medical officials to lawmakers on Capitol Hill are looking to make preparations for what the CDC says is an inevitable coronavirus outbreak in the country and pandemic across the globe. CDC Principal Deputy Director Anne Schuchat joins “CBS This…", "url": "https://www.cbsnews.com/video/is-the-us-ready-for-a-severe-coronavirus-outbreak/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/26/a36bdd5a-bde7-4743-9db1-f00f6e867890/thumbnail/1200x630/274389a4ea258604d4f3cda377496ba0/0226-ctm-ptschuchat-2035413-640x360.jpg", "publishedAt": "2020-02-26T12:41:58Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Factbox: What the EU can do to tackle coronavirus outbreak in Europe", "description": "An outbreak of coronavirus in northern Italy last week has raised the alarm in the European Union over the epidemic, which until then had been mostly confined to China.", "url": "https://www.reuters.com/article/us-china-health-eu-factbox-idUSKCN20K1SY", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-26T12:37:04Z", "content": "BRUSSELS (Reuters) - An outbreak of coronavirus in northern Italy last week has raised the alarm in the European Union over the epidemic, which until then had been mostly confined to China. \r\nMeasures to tackle the disease remain largely decided at the nation… [+2493 chars]"}, {"source": {"id": null, "name": "Derstandard.de"}, "author": null, "title": "Coronavirus: Der Games Developers Conference laufen die Aussteller davon", "description": "Messe in San Francisco heuer ohne Sony, Facebook, EA und Kojima Productions", "url": "https://www.derstandard.de/story/2000115051249/coronavirus-der-games-developers-conference-laufen-die-aussteller-davon", "urlToImage": "https://at.staticfiles.at/img/meta/meta_image_1200x630-4d0796cf00.png", "publishedAt": "2020-02-26T12:24:48Z", "content": "Ich stimme der Verwendung von Cookies für die Zwecke der Webanalyse und digitaler Werbemaßnahmen zu. Auch wenn ich diese Website weiter nutze, gilt dies als Zustimmung.\r\nMeine Einwilligung kann ich hier widerrufen. Weitere Informationen finde ich in der Daten… [+213 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Centre warns against non-essential travel to coronavirus affected Iran, Italy, S. Korea - Hindustan Times", "description": "Centre warns against non-essential travel to coronavirus affected Iran, Italy, S. Korea Hindustan Times World battles coronavirus outbreak - BBC News BBC News South Korea reports 169 new coronavirus cases, pushing total to 1,146: KCDC Moneycontrol Opinion | C…", "url": "https://www.hindustantimes.com/india-news/centre-warns-against-non-essential-travel-to-coronavirus-affected-iran-italy-s-korea-amid-coronavirus-outbreak/story-zyPLmdU6CzjzeiknUnxsfP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/02/26/Pictures/infected-receiving-government-coronavirus-specialised-protective-clothing_2bcc25f2-5892-11ea-8541-e1442385f8f3.jpg", "publishedAt": "2020-02-26T12:24:04Z", "content": "The Union Health Ministry on Wednesday issued a new travel advisory cautioning Indians against non-essential travel to South Korea, Iran and Italy.\r\nThe advisory comes in view of the evolving coronavirus outbreak situation with deaths being reported from thes… [+385 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Govt prepares for the possibility of the coronavirus becoming a 'global pandemic' - Sky News Australia", "description": "Govt prepares for the possibility of the coronavirus becoming a 'global pandemic' Sky News Australia CDC outlines pandemic planning, as fears send stocks plunging for second day CNBC WION EDIT: Wuhan coronavirus, a global pandemic? WION Australian share marke…", "url": "https://www.youtube.com/watch?v=ymQ9SiKZWuM", "urlToImage": null, "publishedAt": "2020-02-26T12:42:32Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (James Brumley)", "title": "3 Growth Stocks for In-the-Know Investors", "description": "A trio of names offers investors more reliable growth than seems likely on the surface.", "url": "https://www.fool.com/investing/2020/02/26/3-growth-stocks-for-in-the-know-investors.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559538/rising-chart.jpg", "publishedAt": "2020-02-26T12:45:00Z", "content": "Whether the broad market is finally peaking or is gearing up for another bullish go-around remains in question. The fourth quarter's earnings reports have been collectively better than expected, but the novel coronavirus' persistence could up-end what is seem… [+4823 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Austrian high school on LOCKDOWN amid fears teacher is infected with coronavirus", "description": "Students at a school in Vienna, Austria have been barred from leaving the building after one of their instructors was flagged as potentially carrying the deadly coronavirus, currently spreading across the globe. Read Full Article at RT.com", "url": "https://www.rt.com/news/481723-austria-school-coronavirus-lockdown/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e56695920302765bb4fe164.JPG", "publishedAt": "2020-02-26T13:03:32Z", "content": "No one is allowed to leave or enter the Albertgasse high school, located in Vienna’s inner-city neighborhood of Josefstadt, police said in a Twitter message posted on Wednesday. Officers also denied rumors that the school had been evacuated. Streets around th… [+1304 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Ford's incoming COO focuses on cost cuts, launches, change", "description": "Ford Motor Co's incoming chief operating officer will outline on Wednesday his priorities for the company's turnaround, including cost cuts and more efficient new-vehicle launches in a year that includes the introduction of a redesigned F-150 full-sized picku…", "url": "https://finance.yahoo.com/news/fords-incoming-coo-focuses-cost-125700161.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-26T12:57:00Z", "content": "DETROIT, Feb 26 (Reuters) - Ford Motor Co's incoming chief operating officer will outline on Wednesday his priorities for the company's turnaround, including cost cuts and more efficient new-vehicle launches in a year that includes the introduction of a redes… [+1878 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Katy Fallon", "title": "Lesbos on strike amid protests against migrant detention centres", "description": "A growing sense of crisis on the Greek islands which house thousands of migrants is leading to rising tensions.", "url": "https://www.aljazeera.com/news/2020/02/lesbos-strike-protests-migrant-detention-centres-200226120551774.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/26/59cbef1a9c9a43a99052430fd5cb0dc6_18.jpg", "publishedAt": "2020-02-26T12:59:50Z", "content": "Lesbos, Greece - The mood is uneasy in Mytilene; cafes and shops throughout the normally bustling city are shut. A general strike across the island has been organised in the wake of what they call heavy-handed tactics used by police against islanders on Tuesd… [+3685 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Eye Opener: 2020 Democrats face off in heated CBS News debate", "description": "Presidential contenders faced off in a heated CBS News debate during their final confrontation before the South Carolina primary and Super Tuesday. Also, federal health officials say the coronavirus will spread in the U.S., warning it could cause severe disru…", "url": "https://www.cbsnews.com/video/eye-opener-2020-democrats-face-off-in-heated-cbs-news-debate/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/02/26/39ed602a-824b-4551-9a44-d7f85ce84d38/thumbnail/1200x630/f6e703be50b768d64fddfbfd402a12a7/0226-ctm-eyeopenertat7-2035376-640x360.jpg", "publishedAt": "2020-02-26T12:22:37Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Reuters", "title": "COVID-19: What's happening around the world", "description": "Asia reported hundreds of new coronavirus cases on Wednesday, including the first U.S. soldier to be infected, as outbreaks in Italy and Iran spread to more countries.", "url": "https://www.cbc.ca/news/world/covid-19-what-s-happening-around-the-world-1.5476335", "urlToImage": "https://i.cbc.ca/1.5476346.1582715846!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1208732016.jpg", "publishedAt": "2020-02-26T12:16:59Z", "content": "The latest: \r\n<ul><li>WHO director says COVID-19 cases outside China 'deeply concerning' but does not label outbreak a pandemic.</li><li>South Korea case number rises to 1,261, with most cases in and around city of Daegu.</li><li>Japanese PM urges sports and … [+7320 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Elliot Smith", "title": "EasyJet has 'structural advantage' as airline stocks tumble, fund manager says", "description": "British carrier easyJet has a \"structural advantage\" over its peers as airline stocks continue to be hammered by coronavirus fears, according to Miton Group Fund Manager Eric Moore.", "url": "https://www.cnbc.com/2020/02/26/miton-easyjet-has-structural-advantage-as-airline-stocks-tumble.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106212474-1572434458601gettyimages-1132455717.jpeg?v=1572434489", "publishedAt": "2020-02-26T12:49:21Z", "content": "British carrier easyJet has a \"structural advantage\" over its peers as airline stocks continue to be hammered by coronavirus fears, according to Miton Group Fund Manager Eric Moore.\r\nAs the outbreak begins to ripple through Europe and threatens to become a gl… [+1478 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Raneem Alozzi - Staff Reporter", "title": "5th presumptive case of COVID-19 in Ontario, ministry of health says", "description": "The woman went to Sunnybrook hospital on Feb. 24 and had travelled to Iran.", "url": "https://www.thestar.com/news/gta/2020/02/26/5th-presumptive-case-of-covid-19-in-ontario-ministry-of-health-says.html", "urlToImage": "https://images.thestar.com/4AVveMEYHKe46dk60oW2UwmZcgo=/1200x899/smart/filters:cb(1582720805483)/https://www.thestar.com/content/dam/thestar/news/gta/2020/02/26/5th-presumptive-case-of-covid-19-in-ontario-ministry-of-health-says/sunnybrook.jpg", "publishedAt": "2020-02-26T12:40:05Z", "content": "A woman in her 60s has been confirmed as the city’s fifth case of coronavirus in Ontario, according to the Ministry of Health.\r\nThe woman went to Sunnybrook hospital on Feb. 24 and had travelled to Iran. She was cared for using appropriate precautions, and th… [+597 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Congress prepares for inevitable U.S. coronavirus outbreak - CBS This Morning", "description": "Congress prepares for inevitable U.S. coronavirus outbreak CBS This Morning Health authorities expect coronavirus spread on US soil Yahoo News C.D.C. Officials Warn of Coronavirus Outbreaks in the U.S. The New York Times We can’t stop the coronavirus now. But…", "url": "https://www.youtube.com/watch?v=mPa3tdUGfWo", "urlToImage": "https://i.ytimg.com/vi/mPa3tdUGfWo/maxresdefault.jpg", "publishedAt": "2020-02-26T12:31:32Z", "content": "The CDC issued a stark warning that Americans should prepare for an inevitable coronavirus outbreak, and that the disruption to U.S. life may be severe. So far 58 Americans have been diagnosed with the virus, a number the CDC has called very few compared to t… [+1379 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Shaun Lintern, Shaun Lintern", "title": "Coronavirus could kill half a million Britons and infect 80% of UK population, government documents indicate", "description": "Civil servant briefing to ministers on 'reasonable worst case' scenario reveals scale of potential uncontrolled UK outbreak", "url": "https://www.independent.co.uk/news/health/coronavirus-news-latest-deaths-uk-infection-flu-a9360271.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/02/26/12/coronavirus.jpg", "publishedAt": "2020-02-26T12:20:00Z", "content": "A leaked government document has suggested up to 500,000 people could die from coronavirus if the disease is able to infect up to 80 per cent of the country.\r\nWhile the Department of Health and Social Care said it did not expect the scenario to happen, the br… [+21529 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Iskra Petrova", "title": "Facebook will ban and remove ads promising cure for the coronavirus", "description": "While governments are working hard to limit the coronavirus outbreak and to protect their citizens’ health, Facebook is working to protect people from misinformation in regards to the current public health situation., the tech giant will now ban ads promising…", "url": "https://www.phonearena.com/news/Facebook-will-ban-and-remove-ads-promising-cure-for-the-coronavirus_id122538", "urlToImage": "https://i-cdn.phonearena.com/images/article/122538-two/Facebook-will-ban-and-remove-ads-promising-cure-for-the-coronavirus.jpg", "publishedAt": "2020-02-26T12:51:00Z", "content": "While governments are working hard to limit the coronavirus outbreak and to protect their citizens health, Facebook is working to protect people from misinformation in regards to the current public health situation. According to Business Insider, the tech gia… [+794 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Reuters", "title": "WHO reluctant to declare COVID-19 pandemic as coronavirus spreads to more countries", "description": "The sudden rise in cases of novel coronavirus in Italy, Iran and South Korea is \"deeply concerning,\" but the virus can still be contained and does not amount to a pandemic, the World Health Organization (WHO) chief says.", "url": "https://www.cbc.ca/news/world/who-reluctant-to-declare-covid-19-pandemic-as-coronavirus-spreads-to-more-countries-1.5476335", "urlToImage": "https://i.cbc.ca/1.5476346.1582715846!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1208732016.jpg", "publishedAt": "2020-02-26T12:16:59Z", "content": "The latest: \r\n<ul><li>WHO director says COVID-19 cases outside China 'deeply concerning' but does not label outbreak a pandemic.</li><li>South Korea case number rises to 1,261, with most cases in and around city of Daegu.</li><li>Italy sees 12th death as case… [+11282 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Nicholas Rossolillo)", "title": "High Dividend Yield STORE Capital Continues to Grow Its Retail Real Estate Portfolio", "description": "In the digital age, some commercial real estate has lost its luster, but STORE is still finding ways to win.", "url": "https://www.fool.com/investing/2020/02/26/high-dividend-yield-store-capital-grows-reit.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/559513/gettyimages-1046617764.jpg", "publishedAt": "2020-02-26T12:55:00Z", "content": "After notching a total return of nearly 37% in 2019 (share price plus dividends paid), STORE Capital (NYSE:STOR) is off to another strong start in 2020. Shares of the real estate investment trust (or REIT) are up another 3% even as global stock markets sell-o… [+3526 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "KIM TONG-HYUNG and MATT SEDENSKY", "title": "Coronavirus worries grow globally as scientists race to find treatment - Global News", "description": "Coronavirus worries grow globally as scientists race to find treatment Global News World battles coronavirus outbreak - BBC News BBC News Globe braces for long battle against virus as cases spread CTV News Wall Street Gets Worried About the Coronavirus The Ne…", "url": "http://globalnews.ca/news/6597514/coronavirus-worldwide-cases-grow/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/southkorea2.jpeg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-02-26T12:42:46Z", "content": "Scientists raced to find a treatment, crews scrubbed everything from money to buses, and quarantines were enforced Wednesday from a beachfront resort in the Atlantic to an uninhabited island in the Pacific as the world fought the spread of a new virus.\r\nWorri… [+5963 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Mills for MailOnline", "title": "Hong Kong gives £1,000 to every adult resident - around seven million people - to boost its economy", "description": "Financial secretary Paul Chan announced that every adult aged over 18 - around seven million people - would receive payments of 10,000 Hong Kong dollars (£985).", "url": "https://www.dailymail.co.uk/news/article-8046585/Hong-Kong-gives-1-000-adult-resident-seven-million-people-boost-economy.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/26/12/25221444-0-image-a-7_1582719316768.jpg", "publishedAt": "2020-02-26T12:31:07Z", "content": "Hong Kong residents are being given nearly £1,000 each in a bid to boost the economy amid political unrest and fears over the coronavirus.\r\nFinancial secretary Paul Chan announced that every adult aged over 18 - around seven million people - would receive pay… [+3234 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Eric Rosenbaum", "title": "Robotic medicine may be the weapon the world needs to combat the coronavirus", "description": "Medical experts say coronavirus COVID-19 and Ebola outbreaks show that robotic medicine can help fight infectious disease, but the goal needs to be applications in everyday health care.", "url": "https://www.cnbc.com/2020/02/26/robotic-medicine-may-be-the-weapon-needed-to-combat-the-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106403250-1582304018128gettyimages-1201647444.jpeg?v=1582309301", "publishedAt": "2020-02-26T12:54:53Z", "content": "Nurse Cao Shan, right, working in the isolation ward, shows the conditions of a patient to a co-worker in Jinyintan Hospital. She and her husband, a doctor also working at the hospital, have slept in the vehicle for 23 nights to avoid bringing viral hazards a… [+19795 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Why Coronavirus Is So Dangerous Politically", "description": "Playbook: \"The key during public health crises is trust. Do you trust that the administration is being honest with you, and can handle a virus that seems to be spiraling out of control, and putting American citizens like you at risk?\"\"On Tuesday, you had Pres…", "url": "https://politicalwire.com/2020/02/26/why-coronavirus-is-so-dangerous-politically/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-02-26T12:20:21Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Services, wearables, 5G 'iPhone 12' make Morgan Stanley AAPL buyers", "description": "While the coronavirus is still having a big impact on China iPhone production, and the smartphone market as a whole, Morgan Stanley sees the impacts as mostly timing problems for Apple, and are buyers, maintaining a $368 stock price target. In a note to inves…", "url": "https://appleinsider.com/articles/20/02/26/services-wearables-5g-iphone-12-make-morgan-stanley-aapl-buyers", "urlToImage": "https://photos5.appleinsider.com/gallery/34681-62796-Apple-Watches-xl.jpg", "publishedAt": "2020-02-26T12:29:32Z", "content": "While the coronavirus is still having a big impact on China iPhone production, and the smartphone market as a whole, Morgan Stanley sees the impacts as mostly timing problems for Apple, and are buyers, maintaining a $368 stock price target.In a note to invest… [+3035 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Everything Rally Gets Ripped Apart by Virus Fear Lashing Markets", "description": "(Bloomberg) -- Investors who feel like they’ve gone from the best of times to the worst of times in a matter of weeks aren’t far off: Traders started the year toasting the highest returns in a decade; they may end its second month drowning their sorrows.The c…", "url": "https://finance.yahoo.com/news/everything-rally-gets-ripped-apart-130310395.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Xh04If3D4epj3G6YYI0exA--~B/aD03NzI7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/f521ff8e943f48e19c5718f62e272708", "publishedAt": "2020-02-26T13:03:10Z", "content": "(Bloomberg) -- Investors who feel like theyve gone from the best of times to the worst of times in a matter of weeks arent far off: Traders started the year toasting the highest returns in a decade; they may end its second month drowning their sorrows.\r\nThe c… [+3626 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "World’s Best Airline Stock Now Worst as Virus Stymies Travel", "description": "(Bloomberg) -- Two months ago, it was the world’s hottest airline stock. Now, investors are shunning it.Air Canada lost C$3.9 billion ($3 billion) in market capitalization from its January peak, making it the worst-performing airline on the Bloomberg World Ai…", "url": "https://finance.yahoo.com/news/world-best-airline-stock-now-130233821.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/pNWdGdJtYGZnqE89DsIkiA--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/cae62f92148d688bdafe0df293788977", "publishedAt": "2020-02-26T13:02:33Z", "content": "(Bloomberg) -- Two months ago, it was the worlds hottest airline stock. Now, investors are shunning it.\r\nAir Canada lost C$3.9 billion ($3 billion) in market capitalization from its January peak, making it the worst-performing airline on the Bloomberg World A… [+2621 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Brad Reed", "title": "‘Making Washington more stupid’: Morning Joe buries Trump for hiring ‘political dupes’ to fight coronavirus", "description": "MSNBC’s Joe Scarborough on Wednesday unloaded on President Donald Trump for larding his administration with unqualified hacks at a time when the United States faces the possibility of a mass outbreak of the coronavirus. In a scathing assessment of the adminis…", "url": "https://www.rawstory.com/2020/02/making-washington-more-stupid-morning-joe-buries-trump-for-hiring-political-dupes-to-fight-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-24-at-7.07.44-AM.png", "publishedAt": "2020-02-26T12:42:17Z", "content": "MSNBC’s Joe Scarborough on Wednesday unloaded on President Donald Trump for larding his administration with unqualified hacks at a time when the United States faces the possibility of a mass outbreak of the coronavirus.\r\nIn a scathing assessment of the admini… [+1194 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Tom Boggioni", "title": "Trump claim of coming coronavirus vaccine blown up by health expert", "description": "Appearing on CNN’s ” New Day,” on Wednesday, the director of the National Institute of Allergy and Infectious Diseases claimed  that Donald Trump’s administration is running behind on containing the coronavirus — and that the public shouldn’t expect a viable …", "url": "https://www.rawstory.com/2020/02/trump-claim-of-coming-coronavirus-vaccine-blown-up-by-health-expert/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-26-at-7.51.06-AM.png", "publishedAt": "2020-02-26T12:55:54Z", "content": "The 10th Democratic Party presidential primary debate was held on Tuesday night in Charleston, South Carolina. Although the atmosphere was frenzied and almost chaotic at times, it was much like those that came before.\r\nTo this point, the candidates have been … [+823 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Lizzy Gurdus", "title": "U.S. stocks still the best of a bad bunch as sell-off stretches on, says trader. Here's why", "description": "As coronavirus worries grow worldwide, traders are seeking safe havens in the U.S. market — for now.", "url": "https://www.cnbc.com/2020/02/26/us-stocks-still-best-bet-amid-global-coronavirus-sell-off-trader.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105626033-1544723642915gettyimages-946963378.jpeg?v=1582663196", "publishedAt": "2020-02-26T13:02:00Z", "content": "\"One of the things you should be doing right now is developing your shopping list and trying to identify which companies you'd like to own that maybe were too expensive a week or two ago,\" Tepper said.\r\nThe Dow and S&amp;P 500 have each fallen about 7% in the… [+3704 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Reuters", "title": "WHO reluctant to declare COVID-19 pandemic as coronavirus spreads to more countries", "description": "The number of new coronavirus infections inside China — the source of the outbreak — was for the first time overtaken by fresh cases elsewhere on Wednesday, with Italy and Iran emerging as new epicentres of the rapidly spreading illness.", "url": "https://www.cbc.ca/news/world/who-coronavirus-covid-19-1.5476335", "urlToImage": "https://i.cbc.ca/1.5476346.1582715846!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1208732016.jpg", "publishedAt": "2020-02-26T12:16:59Z", "content": "The number of new coronavirus infections inside China the source of the outbreak was for the first time overtaken by fresh cases elsewhere on Wednesday, with Italy and Iran emerging as new epicentres of the rapidly spreading illness.\r\nAsia reported hundreds o… [+8307 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Shirobako Anime Film is Completed Says Director, Opens on February 29", "description": "All events surrounding the film have been canceled due to the coronavirus outbreak There’s some good news and some bad news for people excited to see the Shirobako anime film in Japan when it opens on February 29. The good news is that director Tsutomu Mizush…", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/lvNG2hsnBU0/shirobako-anime-film-is-completed-says-director-opens-on-february-29", "urlToImage": null, "publishedAt": "2020-02-26T12:48:58Z", "content": null}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Harold Maass", "title": "The daily business briefing: February 26, 2020", "description": "1. U.S. stocks plunged for a second straight day Tuesday, capping their worst two-day loss since 2008. After the Centers for Disease Control issued a dire warning about the likelihood of a coronavirus outbreak in the U.S. that could cause widespread disruptio…", "url": "https://theweek.com/business-briefing/898291/daily-business-briefing-february-26-2020", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/gettyimages-1203253358.jpg?itok=MFMetjNP", "publishedAt": "2020-02-26T12:22:00Z", "content": "U.S. stocks plunged for a second straight day Tuesday, capping their worst two-day loss since 2008. After the Centers for Disease Control issued a dire warning about the likelihood of a coronavirus outbreak in the U.S. that could cause widespread disruption, … [+636 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "The Associated Press", "title": "Moody’s downgrades auto sales forecast on virus fears", "description": "FRANKFURT, Germany (AP) — Ratings agency Moody’s is lowering its forecast for global auto sales because of the new coronavirus outbreak. It now reckons that sales will decline 2.5% decline in 2020 instead of only 0.9%. This year’s anticipated decline follows …", "url": "https://www.seattletimes.com/business/moodys-downgrades-auto-sales-forecast-on-virus-fears/", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2020-02-26T13:10:29Z", "content": "FRANKFURT, Germany (AP) Ratings agency Moody’s is lowering its forecast for global auto sales because of the new coronavirus outbreak.\r\nIt now reckons that sales will decline 2.5% decline in 2020 instead of only 0.9%. This year’s anticipated decline follows a… [+771 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Stock market news live: Stock futures point to mixed open after ugly 2-day drop", "description": "Headlines moving the stock market in real time.", "url": "https://finance.yahoo.com/news/stock-market-news-live-updates-february-26-2020-123452405.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DJKmxPOpqF.5.Nt1k6VhIw--~B/aD01MDk5O3c9NzY0OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/2f0b66c0-5891-11ea-b769-330c92fb357f", "publishedAt": "2020-02-26T12:55:44Z", "content": "7:20 a.m. ET: Stock futures point to mixed open; Lowes earnings disappoint, Papa Johns beats expectations\r\nU.S. stocks futures were pointing to a mixed open for the major indices Wednesday, following the worst two-day drop for stocks in four years.\r\nHere were… [+3098 chars]"}, {"source": {"id": null, "name": "Mondediplo.com"}, "author": "Sonia Shah", "title": "The microbes, the animals and us", "description": "The novel coronavirus came out of a ‘wet market' in Wuhan. We don't know its animal origin, but we do know that if we protect wildlife habitats, animal microbes are less likely to cross over into humans. - 2020/03 / article", "url": "https://mondediplo.com/2020/03/05coronavirus", "urlToImage": "https://mondediplo.com/IMG/arton9449.jpg", "publishedAt": "2020-02-26T12:26:41Z", "content": "Accelerating habitat loss behind Covid-19\r\nThe novel coronavirus came out of a wet market’ in Wuhan. We don’t know its animal origin, but we do know that if we protect wildlife habitats, animal microbes are less likely to cross over into humans.\r\nRepeated clo… [+3910 chars]"}, {"source": {"id": null, "name": "Euractiv.com"}, "author": "Sarantis Michalopoulos", "title": "Greece joins Coronavirus ‘club’ as Commission calls for coordination", "description": "A 38-year-old woman was reported as the first case of coronavirus in Thessaloniki, Greek media reported on Wednesday (26 February), as the virus continued spreading through Europe.", "url": "http://www.euractiv.com/section/health-consumers/news/greece-joins-coronavirus-club-as-commission-calls-for-coordination/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2020/02/w_55906506-800x450.jpg", "publishedAt": "2020-02-26T12:41:31Z", "content": "CORONAVIRUS DEVELOPMENTS\r\nIn Austria, the first coronavirus infection was confirmed. Two Italians who have been living in Innsbruck but originate from Lombardy which is Italys most affected part, have been found to have been infected by the coronavirus. For n… [+4804 chars]"}, {"source": {"id": null, "name": "Securityboulevard.com"}, "author": "David Bisson", "title": "Attack Campaign Leveraged Coronavirus Theme to Deliver Remcos RAT", "description": "Security researchers discovered an attack campaign that abused fears surrounding the global coronavirus outbreak to deliver the Remcos RAT. Yoroi Security detected the attack campaign when its threat intelligence activities uncovered a suspicious artifact nam…", "url": "https://securityboulevard.com/2020/02/attack-campaign-leveraged-coronavirus-theme-to-deliver-remcos-rat/", "urlToImage": "https://3b6xlt3iddqmuq5vy2w0s5d3-wpengine.netdna-ssl.com/state-of-security/wp-content/uploads/sites/3/Screenshot-from-2020-02-25-10-34-38.png", "publishedAt": "2020-02-26T12:15:32Z", "content": "Security researchers discovered an attack campaign that abused fears surrounding the global coronavirus outbreak to deliver the Remcos RAT.\r\nYoroi Security detected the attack campaign when its threat intelligence activities uncovered a suspicious artifact na… [+1768 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Stephanie Landsman", "title": "Disaster insurance investment bets strike fever pitch as coronavirus fears soar", "description": "XFA's Bill Looney sees signs the stock market's plunge is far from over.", "url": "https://www.cnbc.com/2020/02/26/disaster-insurance-bets-strike-fever-pitch-as-coronavirus-fears-soar.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106366591-1580473423431scan.jpg?v=1582670685", "publishedAt": "2020-02-26T12:19:31Z", "content": "The coronavirus outbreak is sparking extreme demand for market protection, according to XFA's Bill Looney.\r\nLooney, who runs the firm's global business development, finds options traders are placing call strikes on the Cboe Volatility Index at a fever pitch a… [+1469 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Japan defends cautious approach on COVID-19 testing amid concerns", "description": "Japan's health ministry on Wednesday defended its cautious approach to coronavirus testing as domestic cases increased and South Korea prepared to test more than 200,000 members of a church at the heart of a surge in its outbreak.", "url": "https://www.channelnewsasia.com/news/asia/japan-defends-coronavirus-testing-approach-12472792", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12472790/16x9/991/557/c32b1a679a1be6ff4f0e15664bf67305/PP/passersby-wearing-protective-masks-walk-on-a-snow-covered-street-in-sapporo--hokkaido-17.jpg", "publishedAt": "2020-02-26T12:45:59Z", "content": "TOKYO: Japan's health ministry on Wednesday (Feb 26) defended its cautious approach to coronavirus testing as domestic cases increased and South Korea prepared to test more than 200,000 members of a church at the heart of a surge in its outbreak.\r\nJapan had n… [+2786 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Davide Barbuscia and Babak Dehghanpisheh", "title": "Iranian rial plunges as coronavirus threatens export lifeline", "description": "Iran's rial hit a one-year low against the dollar on Wednesday as a sharp rise in coronavirus cases forced the closure of most of its borders, threatenin...", "url": "https://finance.yahoo.com/news/iranian-rial-plunges-coronavirus-threatens-124003563.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-26T12:40:03Z", "content": "By Davide Barbuscia and Babak Dehghanpisheh\r\nDUBAI, Feb 26 (Reuters) - Iran's rial hit a one-year low against the dollar on Wednesday as a sharp rise in coronavirus cases forced the closure of most of its borders, threatening the non-oil exports that are its … [+2399 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kevin Breuninger", "title": "Trump says he will have a press conference at White House on coronavirus at 6 pm ET", "description": "Trump made the announcement on Twitter after attacking media for \"panicking markets\" through their coverage of the virus.", "url": "https://www.cnbc.com/2020/02/26/trump-says-he-will-have-a-press-conference-at-white-house-on-coronavirus-at-6-pm-et.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106160845-1570037374269gettyimages-1173107188.jpeg?v=1582722358", "publishedAt": "2020-02-26T13:05:00Z", "content": "President Donald Trump said Wednesday that he will discuss the deadly coronavirus outbreak during a news conference at 6 p.m. ET with officials from the Centers for Disease Control and Prevention.\r\nTrump said that \"others\" would also be attending the conferen… [+1216 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Emmeline Saunders)", "title": "Gemma Collins pulls out of China trip over coronavirus fears - but is 'not afraid to die'", "description": "Gemma Collins has been forced to cancel a trip over to China over concerns she could contract deadly coronavirus", "url": "https://www.mirror.co.uk/3am/celebrity-news/gemma-collins-pulls-out-china-21580529", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21121002.ece/ALTERNATES/s1200/0_s-Caroline-Flack-and-Dancing-on-Ices-Michael-Barrymore_11145JPG.jpg", "publishedAt": "2020-02-26T12:15:36Z", "content": "Gemma Collins has been forced to cancel a planned trip to China over coronavirus fears.\r\nThe deadly virus, which has no cure or vaccine, first broke out in the Chinese city of Wuhan in January, and has since spread throughout the world.\r\nAnd now the GC is so … [+1410 chars]"}, {"source": {"id": null, "name": "Talkingpointsmemo.com"}, "author": "Cristina Cabrera", "title": "Trump Insists His Admin Is Doing A ‘GREAT Job’ With Coronavirus", "description": "Everything’s going just fine, okay? President Donald Trump claimed on late Tuesday night that his administration and the Centers for Disease Control and…", "url": "https://talkingpointsmemo.com/news/trump-claim-administration-great-job-coronavirus-cdc", "urlToImage": "https://cdn.talkingpointsmemo.com/wp-content/uploads/2020/02/GettyImages-1202785648-1-804x529.jpg", "publishedAt": "2020-02-26T13:04:23Z", "content": "Everything’s going just fine, okay?\r\nPresident Donald Trump claimed on late Tuesday night that his administration and the Centers for Disease Control and Prevention has the deadly coronavirus under control, despite the CDC’s warning of the disease’s inevitabl… [+1521 chars]"}, {"source": {"id": null, "name": "Theonlinecitizen.com"}, "author": "The Online Citizen", "title": "South Korea starts virus checks on 200,000-plus sect members", "description": "by Kang Jin-kyu More than 200,000 members of a religious sect were being checked for coronavirus symptoms by South Korean authorities Wednesday, as US commanders reported the first case among American forces in the country. Most of South Korea’s novel coronav…", "url": "https://www.theonlinecitizen.com/2020/02/26/south-korea-starts-virus-checks-on-200000-plus-sect-members/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/02/featured-image-corona-virus-test.png", "publishedAt": "2020-02-26T12:14:41Z", "content": "by Kang Jin-kyu\r\nMore than 200,000 members of a religious sect were being checked for coronavirus symptoms by South Korean authorities Wednesday, as US commanders reported the first case among American forces in the country.\r\nMost of South Korea’s novel coron… [+2741 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Lawal Sherifat", "title": "Greece, Brazil confirm first cases of Coronavirus", "description": "WHO says world not ready for pandemic Several European countries have announced their first coronavirus cases, all apparently linked to the growing outbreak in Italy. Austria, Croatia, and Switzerland said the cases involved people who had been to Italy, as d…", "url": "https://www.vanguardngr.com/2020/02/greece-brazil-confirm-first-cases-of-coronavirus/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/Coronavirus11.jpg?fit=1200%2C630&ssl=1", "publishedAt": "2020-02-26T12:23:30Z", "content": "WHO says world not ready for pandemic\r\nSeveral European countries have announced their first coronavirus cases, all apparently linked to the growing outbreak in Italy.\r\nAustria, Croatia, and Switzerland said the cases involved people who had been to Italy, as… [+1240 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "Coronavirus cases emerging faster outside China ―WHO", "description": "There are now more new cases of the coronavirus reported each day outside China than inside the hardest-hit country, the World Health Organization said on Wednesday. “Yesterday, the number of new cases reported outside China exceeded the number of new cases i…", "url": "https://www.vanguardngr.com/2020/02/coronavirus-cases-emerging-faster-outside-china-%e2%80%95who/", "urlToImage": "https://i1.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/coronavirus-1-1024x683@2x.jpg?fit=1368%2C912&ssl=1", "publishedAt": "2020-02-26T13:01:53Z", "content": "There are now more new cases of the coronavirus reported each day outside China than inside the hardest-hit country, the World Health Organization said on Wednesday.\r\n“Yesterday, the number of new cases reported outside China exceeded the number of new cases … [+2040 chars]"}, {"source": {"id": null, "name": "Dailyfx.com"}, "author": "Paul Robinson", "title": "Dow Jones, Crude Oil, Gold Price Outlook &amp; More in Risk-off Mode", "description": "Global markets are plunging on the coronavirus with the Dow trading below its 200-day, crude oil flirting with long-term support, and gold pumped up on haven flows; a reversal may be near.", "url": "https://www.dailyfx.com/forex/market_alert/2020/02/26/Dow-Jones-Crude-Oil-Gold-Price-Outlook-More-PRtech.html", "urlToImage": "https://a.c-dn.net/b/2S1651/headline_shutterstock_391641415.jpg", "publishedAt": "2020-02-26T12:30:00Z", "content": "The US stock market is finally reacting to the coronavirus situation as it becomes more acute. Up until the past few days US indices remained suspended in record territory, but that is changing now with long-term trend support via the 200-day MAs coming under… [+2418 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Brogan-Leigh Hurst)", "title": "Gwyneth Paltrow jokes about Contagion as she debuts mask on flight amid coronavirus fears", "description": "Gwyneth Paltrow made a funny joke about her role in the film Contagion amid coronavirus fear as she covered her face on a trip to Paris", "url": "https://www.mirror.co.uk/3am/celebrity-news/gwyneth-paltrow-jokes-contagion-debuts-21580637", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21580686.ece/ALTERNATES/s1200/0_Screen-Shot-2020-02-26-at-113108JPG.jpg", "publishedAt": "2020-02-26T13:07:57Z", "content": "Gwyneth Paltrow made a joke about her role in deadly virus film Contagion as she donned a mask during a flight to Paris. \r\nThe actress, 47, shared a snap of herself wearing a face mask that covered her mouth as she flew to the city.\r\nThe 2011 movie by Steven … [+1834 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Ex-Mossad chief says Likud app leaks as dangerous to Israel as coronavirus", "description": "After series of dramatic data mishaps in software used in Netanyahu's campaign, Tamir Pardo says it poses 'real security threat,' endangers IDF, Shin Bet, Mossad members", "url": "https://www.timesofisrael.com/ex-mossad-chief-says-likud-app-leaks-as-dangerous-to-israel-as-coronavirus/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2019/03/F180321MV11-1024x640.jpg", "publishedAt": "2020-02-26T13:02:22Z", "content": "A former head of the Mossad spy agency sounded the alarm Wednesday about an app operated by Prime Minister Benjamin Netanyahu’s Likud party ahead of next week’s elections, warning that using it was “a real security threat” and likening the level of danger it … [+5668 chars]"}, {"source": {"id": null, "name": "Hospitalitynet.org"}, "author": "skift Inc.", "title": "Abandoned Hong Kong Hotels Go Into Survival Mode as Virus Fallout Spreads", "description": "As hotel occupancy plunges to a single digit, Hong Kong's leadership toward one of its most important industries is being put to the test during the coronavirus crisis. So is the leadership of hotel CEOs in keeping their companies whole.", "url": "https://www.hospitalitynet.org/news/4097170.html", "urlToImage": "https://www.hospitalitynet.org/picture/xl_153112291.jpg", "publishedAt": "2020-02-26T13:09:23Z", "content": "As hotel occupancy plunges to a single digit, Hong Kong's leadership toward one of its most important industries is being put to the test during the coronavirus crisis. So is the leadership of hotel CEOs in keeping their companies whole.\r\nHong Kong hotels the… [+978 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "Why coronavirus could help save China’s endangered species", "description": "The novel coronavirus outbreak in China may end up saving one of the world’s most trafficked animals after Beijing announced a total ban on the sale and consumption of the pangolin. The scaly mammal — listed by the International Union for Conservation of Natu…", "url": "https://www.vanguardngr.com/2020/02/why-coronavirus-could-help-save-chinas-endangered-species/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/COVID-19_Coronavirus_WHO.jpg?fit=992%2C558&ssl=1", "publishedAt": "2020-02-26T13:08:19Z", "content": "The novel coronavirus outbreak in China may end up saving one of the world’s most trafficked animals after Beijing announced a total ban on the sale and consumption of the pangolin.\r\nThe scaly mammal — listed by the International Union for Conservation of Nat… [+3496 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "No reason to panic about coronavirus in Europe ―EU", "description": "The novel coronavirus is concerning for Europe but there is no reason for alarm, the EU’s health commissioner said on Wednesday as Italy battles the world’s third-biggest outbreak. “This is a situation of concern but we must not give in to panic,” Stella Kyri…", "url": "https://www.vanguardngr.com/2020/02/no-reason-to-panic-about-coronavirus-in-europe-%e2%80%95eu/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/Coronavirus11.jpg?fit=1200%2C630&ssl=1", "publishedAt": "2020-02-26T12:39:09Z", "content": "The novel coronavirus is concerning for Europe but there is no reason for alarm, the EU’s health commissioner said on Wednesday as Italy battles the world’s third-biggest outbreak.\r\n“This is a situation of concern but we must not give in to panic,” Stella Kyr… [+801 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "Greece reports first coronavirus case in traveller from Italy", "description": "Greece on Wednesday reported its first coronavirus case, a woman who had recently travelled to northern Italy. A health ministry spokesman said the 38-year-old woman was in a Thessaloniki hospital and in good condition. “She is in good health and being monito…", "url": "https://www.vanguardngr.com/2020/02/greece-reports-first-coronavirus-case-in-traveller-from-italy/", "urlToImage": "https://i1.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/coronavirus-61.jpg?fit=618%2C410&ssl=1", "publishedAt": "2020-02-26T12:58:48Z", "content": "Greece on Wednesday reported its first coronavirus case, a woman who had recently travelled to northern Italy.\r\nA health ministry spokesman said the 38-year-old woman was in a Thessaloniki hospital and in good condition.\r\n“She is in good health and being moni… [+1987 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "Coronavirus outbreak fuels China black market for supplies", "description": "China’s coronavirus crisis has sparked a thriving black market in fake medical supplies, forcing a crackdown from authorities who have seized 31 million counterfeit or substandard face masks. Fraudsters have begun producing illegal products to satisfy runaway…", "url": "https://www.vanguardngr.com/2020/02/coronavirus-outbreak-fuels-china-black-market-for-supplies/", "urlToImage": "https://i1.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/CORONAVIRUS.jpg?fit=600%2C400&ssl=1", "publishedAt": "2020-02-26T13:10:01Z", "content": "China’s coronavirus crisis has sparked a thriving black market in fake medical supplies, forcing a crackdown from authorities who have seized 31 million counterfeit or substandard face masks.\r\nFraudsters have begun producing illegal products to satisfy runawa… [+1669 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Fun Trading", "title": "Valaris PLC: Surviving Is Getting Tougher", "description": "Total revenues increased to $512.1 million from $399.0 million in the year-ago quarter and down 7.1% sequentially.The reported contract backlog is $2.453 billion as of February 13, 2020.VAL is a great short term trading tool, but I do not recommend a long ter…", "url": "https://seekingalpha.com/article/4327293-valaris-plc-surviving-is-getting-tougher", "urlToImage": "https://static1.seekingalpha.com/uploads/2019/11/3/12290461-15728406062851007.jpg", "publishedAt": "2020-02-26T12:48:27Z", "content": "Source: Valaris.\r\nInvestment Thesis\r\nThe London-based Valaris plc (VAL), formerly EnscoRowan, is no longer part of my long-term investment in the offshore drilling industry. My change of heart was triggered by Valaris' decision to merge with Atwood Oceanics d… [+10510 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Aoife Walsh", "title": "'I bought a years supply of rice' - meet the Irish people preparing for a potential coronavirus outbreak", "description": "Hand sanitiser, air filtering masks, rice, pasta, and cheese are among the necessities Irish people are bulk-buying in fear of the deadly coronavirus infecting Ireland.", "url": "https://www.independent.ie/incoming/i-bought-a-years-supply-of-rice-meet-the-irish-people-preparing-for-a-potential-coronavirus-outbreak-38992479.html", "urlToImage": "https://www.independent.ie/incoming/06fee/38992480.ece/alternates/w700/PV-250220-Stock-4.jpg", "publishedAt": "2020-02-26T12:17:54Z", "content": "Hand sanitiser, air filtering masks, rice, pasta, and cheese are among the necessities Irish people are bulk-buying in fear of the deadly coronavirus infecting Ireland. \r\nNews of a coronavirus outbreak in northern Italy earlier this week saw panic-stricken lo… [+6048 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Futures look for direction after four-day selloff", "description": "U.S. stock index futures were mixed on Wednesday after the Dow and the S&P 500 indexes suffered their sharpest four-day fall in more than two years on fears of the economic damage from the global spread of the coronavirus.", "url": "https://www.channelnewsasia.com/news/business/futures-look-for-direction-after-four-day-selloff-12473154", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12473152/16x9/991/557/f330076bbb0d8d3d9ae1f3f31641da3c/wp/a-trader-works-on-the-floor-of-the-new-york-stock-exchange-shortly-after-the-closing-bell-as-the-market-takes-a-significant-dip-in-new-york-1.jpg", "publishedAt": "2020-02-26T13:06:15Z", "content": "REUTERS: U.S. stock index futures were mixed on Wednesday after the Dow and the S&amp;P 500 indexes suffered their sharpest four-day fall in more than two years on fears of the economic damage from the global spread of the coronavirus.\r\nDemand for defensive p… [+1621 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Two Chinese nurses call for overseas help in stretched COVID-19 wards", "description": "BEIJING: Two Chinese nurses on the frontlines of the coronavirus outbreak in the city of Wuhan made an unusual global appeal for help in a letter published by a prestigious British medical journal. \"We are asking nurses and medical staff from countries around…", "url": "https://www.channelnewsasia.com/news/asia/covid19-china-nurses-call-for-overseas-help-coronvirus-wards-12473020", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12444580/16x9/991/557/c79f261975c2d77588b675ada99c32ee/DH/the-nurses-walk-inside-finished-but-still-unused-building-a2-of-the-shanghai-public-clinical-center-shanghai--following-the-outbreak-of-the-new-coronavirus--in-shanghai-8.jpg", "publishedAt": "2020-02-26T12:23:53Z", "content": "BEIJING: Two Chinese nurses on the frontlines of the coronavirus outbreak in the city of Wuhan made an unusual global appeal for help in a letter published by a prestigious British medical journal.\r\n\"We are asking nurses and medical staff from countries aroun… [+2822 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Medha Singh", "title": "Futures look for direction after four-day selloff", "description": "Demand for defensive plays such as gold remained high as the World Health Organization (WHO) cautioned that the rapid spread of the virus to more places was inevitable, even as the outbreak in China had peaked. The U.S. Centers for Disease Control and Prevent…", "url": "https://finance.yahoo.com/news/futures-look-direction-four-day-130035678.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/K57Fj_QACM8Vy5IO01aQ1Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/o6JAwhyxSV25mmhs4IRk3Q--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/7ab53cba8b888876f37880a723440f30", "publishedAt": "2020-02-26T13:00:35Z", "content": "By Medha Singh\r\n(Reuters) - U.S. stock index futures were mixed on Wednesday after the Dow and the S&amp;P 500 indexes suffered their sharpest four-day fall in more than two years on fears of the economic damage from the global spread of the coronavirus.\r\nDem… [+1522 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Medha Singh", "title": "Futures look for direction after four-day selloff", "description": "Demand for defensive plays such as gold remained high as the World Health Organization (WHO) cautioned that the rapid spread of the virus to more places was inevitable, even as the outbreak in China had peaked. The U.S. Centers for Disease Control and Prevent…", "url": "https://finance.yahoo.com/news/futures-look-direction-four-day-130035464.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/dUwHC52WDHEZx7FAIwl5Rw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/bnZMZOYgF9unof_eOXhkrg--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/7ab53cba8b888876f37880a723440f30", "publishedAt": "2020-02-26T13:00:35Z", "content": "By Medha Singh\r\n(Reuters) - U.S. stock index futures were mixed on Wednesday after the Dow and the S&amp;P 500 indexes suffered their sharpest four-day fall in more than two years on fears of the economic damage from the global spread of the coronavirus.\r\nDem… [+1522 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "5th coronavirus case confirmed in Ontario", "description": "A fifth presumptive case of coronavirus has been confirmed in Ontario, provincial health officials said Wednesday.", "url": "https://www.cbc.ca/news/canada/toronto/coronavirus-ontario-fifth-case-iran-1.5476359", "urlToImage": "https://i.cbc.ca/1.5452610.1580918030!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/breaking-news.png", "publishedAt": "2020-02-26T12:21:02Z", "content": "A fifth presumptive case of coronavirus has been confirmed in Ontario, provincial health officials said Wednesday.\r\nIn a statement, Ontario's chief medical officer of health said that the woman in her 60s went to Sunnybrook Hospital on Feb. 24. She had recent… [+389 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Moody's downgrades auto sales forecast on virus fears", "description": "Ratings agency Moody's is lowering its forecast for global auto sales because of the new coronavirus outbreak", "url": "https://abcnews.go.com/International/wireStory/moodys-downgrades-auto-sales-forecast-virus-fears-69228781", "urlToImage": "null", "publishedAt": "2020-02-26T13:10:58Z", "content": "FRANKFURT, Germany -- \r\nRatings agency Moody's is lowering its forecast for global auto sales because of the new coronavirus outbreak.\r\nIt now reckons that sales will decline 2.5% decline in 2020 instead of only 0.9%. This year's anticipated decline follows a… [+771 chars]"}]