[{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube is demonetizing videos about coronavirus, and creators are mad", "description": "The novel coronavirus outbreak is affecting every industry, and YouTube creators who want to talk about it will have to take a hit on the monetization side in order to make the videos. Some creators are mad about it.", "url": "https://www.theverge.com/2020/3/4/21164553/youtube-coronavirus-demonetization-sensitive-subjects-advertising-guidelines-revenue", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JzWPYqjzWg3AHpklAOMMWraxZlk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11936571/acastro_180806_1777_youtube_cancel_0001.jpg", "publishedAt": "2020-03-04T21:26:48Z", "content": "Its a long-standing issue between the creator community and YouTube\r\nIllustration by Alex Castro / The Verge\r\nEveryone wants to talk about the novel coronavirus outbreak right now, but you might hear YouTubers avoiding the subject if they talk about it, they … [+4148 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Investors move from coronavirus woes to Biden wins as markets rally on Super Tuesday results", "description": "While the aftermath of Super Tuesday has left the Democratic party riven between its more liberal and moderate wings, investors viewed last night’s results as a win for business and markets. Shaking off the steady beat of bad news about the advance of the nov…", "url": "http://techcrunch.com/2020/03/04/investors-move-from-coronavirus-woes-to-biden-wins-as-markets-rally-on-super-tuesday-results/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-1187891590.jpg?w=600", "publishedAt": "2020-03-04T22:05:36Z", "content": "While the aftermath of Super Tuesday has left the Democratic party riven between its more liberal and moderate wings, investors viewed last night’s results as a win for business and markets.\r\nShaking off the steady beat of bad news about the advance of the no… [+1533 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Danny Crichton", "title": "Oyo layoffs, Airbnb’s delayed IPO and the long-term quandary of investing in travel startups", "description": "It’s the best and worst of times for travel startups. Massive growth over the past few decades has made tourism one of the big global industries, covering everything from recreation to business conferences to shopping sprees. But doubts about the future of th…", "url": "http://techcrunch.com/2020/03/04/oyo-layoffs-airbnbs-delayed-ipo-and-the-long-term-quandary-of-investing-in-travel-startups/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1150396412.jpg?w=600", "publishedAt": "2020-03-04T21:13:14Z", "content": "Its the best and worst of times for travel startups.\r\nMassive growth over the past few decades has made tourism one of the big global industries, covering everything from recreation to business conferences to shopping sprees.\r\nBut doubts about the future of t… [+429 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Justin Bachman", "title": "Coronavirus forces United Airlines to cut overseas and U.S. flights, freeze hiring - Los Angeles Times", "description": "Coronavirus forces United Airlines to cut overseas and U.S. flights, freeze hiring Los Angeles Times United cutting US flights because of coronavirus CNN Pence Heads To Washington State As Coronavirus Death Toll Rises NPR How the coronavirus is impacting trav…", "url": "https://www.latimes.com/business/story/2020-03-04/united-airlines-virus", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/dfc9f82/2147483647/strip/true/crop/3000x1575+0+192/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2Fa3%2F505208944fa6a1184553b5b98234%2Fgetty-81769641.jpg", "publishedAt": "2020-03-04T22:02:00Z", "content": "United Airlines Holdings Inc. plans to trim flights, freeze hiring and halt merit pay raises as it grapples with a swift drop in travel demand because of the coronavirus outbreak.\r\nThe domestic schedule will be pared 10% in April and international flying will… [+2423 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Chris Taylor", "title": "What the 1918 flu's hidden history can teach the coronavirus era", "description": "The coronavirus is nothing next to the supremely deadly flu virus of 1918, at least not yet. But when you delve into the history of that epidemic, the main comparison with today becomes clear. It's in our \"it can't happen here\" attitude. In 1918, modern medic…", "url": "https://mashable.com/article/-coronavirus-flu-1918/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F04%252Fef%252F086b6c497f284cee87a31cc0095e44eb.12dd9.jpg%252F1200x630.jpg?signature=44cVKyOSbKoOHKeV2pfy4Nj_8vQ=", "publishedAt": "2020-03-04T21:58:58Z", "content": "The coronavirus is nothing next to the supremely deadly flu virus of 1918, at least not yet. But when you delve into the history of that epidemic, the main comparison with today becomes clear. It's in our \"it can't happen here\" attitude. \r\nIn 1918, modern med… [+9675 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Alex Wilhelm", "title": "Despite earnings beat and upbeat forecast, Zoom shares fall after reporting Q4 results", "description": "Today after the bell, Zoom reported its Q4 earnings. The company’s recorded revenue of $188.3 million and its adjusted per-share profit of $0.15 were ahead of expectations, including $176.55 million in revenue and earnings per share of $0.07, according to Yah…", "url": "http://techcrunch.com/2020/03/04/despite-earnings-beat-and-upbeat-forecast-zoom-shares-fall-after-reporting-q4-results/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/07/GettyImages-1137873346-2.jpg?w=600", "publishedAt": "2020-03-04T21:59:12Z", "content": "Today after the bell, Zoom reported its Q4 earnings. The company’s recorded revenue of $188.3 million and its adjusted per-share profit of $0.15 were ahead of expectations, including $176.55 million in revenue and earnings per share of $0.07, according to Yah… [+865 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "After weeks of silence amid the coronavirus outbreak, Amazon tells its giant network of truck drivers to stay home if feeling sick", "description": "Amazon confirmed to Business Insider that it sent an email to its trucking network on the evening of March 3 with advice on how to conduct business amid coronavirus concerns. The email advised truckers to stay home for at least 24 hours if feeling feverish, t…", "url": "https://www.businessinsider.com/coronavirus-amazon-advises-truck-drivers-silence-2020-3", "urlToImage": "https://i.insider.com/5e6014bdfee23d77985737a2?width=1200&format=jpeg", "publishedAt": "2020-03-04T22:08:22Z", "content": "Amazon emailed the contract carriers who are part of the retailer's giant transportation network on March 3 about how to navigate coronavirus, the company confirmed to Business Insider. \r\nThe email requested that trucking companies advise their employees to s… [+2680 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amir Vahdat and Jon Gambrell / AP", "title": "Saudi Officials Ban Pilgrimages to Mecca Over COVID-19", "description": "The coronavirus outbreak disrupted Islamic worship in Saudi Arabia as the nation banned residents from performing the pilgrimage in Mecca.", "url": "https://time.com/5796035/coronavirus-saudi-arabia-iran-islam-mecca/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/coronavirus-saudi-arabia-iran-islam.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-04T21:42:58Z", "content": "(TEHRAN, Iran) — The coronavirus outbreak disrupted Islamic worship in the Middle East as Saudi Arabia on Wednesday banned its citizens and other residents of the kingdom from performing the pilgrimage in Mecca, while Iran canceled Friday prayers in major cit… [+6210 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Rob Beschizza", "title": "Is it canceled yet?", "description": "No, not problem celebrities. Is it canceled yet? keeps track of events, conferences and gatherings that may or may not have been canceled due to coronavirus fears. Read the rest", "url": "https://boingboing.net/2020/03/04/is-it-canceled-yet.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/coronavirus.jpg?fit=600%2C301&ssl=1", "publishedAt": "2020-03-04T21:20:27Z", "content": "None of the LA cases are connected to community spread\r\nCNN reports that the spread of the coronavirus has greatly reduced demand for oil, “as schools and offices close, airlines cancel flights worldwide and a growing number of people hunker down at home.” “T… [+1264 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Retail Stores Warned About Replacement iPhone Shortages Due to Coronavirus", "description": "Apple recently warned technical support staff at its retail stores that replacement iPhones are in short supply, reports Bloomberg. Replacement iPhones for heavily damaged devices are expected to face supply constraints for two to four weeks. Apple Store empl…", "url": "https://www.macrumors.com/2020/03/04/replacement-iphone-shortages-apple-stores/", "urlToImage": "https://images.macrumors.com/article-new/2019/09/iphone-11-pro-no-white-background.jpg", "publishedAt": "2020-03-04T21:40:18Z", "content": "Apple recently warned technical support staff at its retail stores that replacement iPhones are in short supply, reports Bloomberg.\r\nReplacement iPhones for heavily damaged devices are expected to face supply constraints for two to four weeks. Apple Store emp… [+1126 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Xeni Jardin", "title": "House passes $8.3B coronavirus bill in bipartisan vote, Senate vote expected Thursday", "description": "The U.S. House of Representatives passed a $8.3 billion bill to address the coronavirus outbreak in a bipartisan vote late Wednesday. A Senate vote is expected Thursday. The U.S. House has passed an $8.3 billion measure to battle the coronavirus outbreak. The…", "url": "https://boingboing.net/2020/03/04/house-passes-8-3b-coronavirus.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/ESS-U6sXkAEhIE8-1.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-04T21:54:06Z", "content": "After spending more than $500m on advertising, organizing and bizarre online media stunts involving anything-for-money influencers, billionaire Mike Bloomberg is suspending his campaign. His dismal performance on Super Tuesday, writes Axios’s Alexi McCammond,… [+1802 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Haven Orecchio-Egresitz", "title": "US jails and prisons are 'fertile grounds for infectious disease' and preventing the spread of coronavirus behind bars will be a challenge, say experts", "description": "There are 2.3 million people incarcerated in the US. Like the flu, coronavirus prevention is dependent on frequent handwashing and isolation from people who are sick. In jails and prisons, where people are living in close quarters, that will be a challenge. V…", "url": "https://www.businessinsider.com/experts-keeping-prisons-free-of-coronavirus-will-be-a-challenge-2020-3", "urlToImage": "https://i.insider.com/5e601931fee23d0ea208cef3?width=1200&format=jpeg", "publishedAt": "2020-03-04T22:04:30Z", "content": "More than two million people are being held in jails and prisons across the United States, and oftentimes these men and women are tightly housed.\r\nPreventing the spread of the highly contagious and deadly coronavirus in these institutions will pose unique cha… [+8469 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Chris Bumbaca, USA TODAY", "title": "Chicago State, UMKC cancel basketball games against Seattle U as precaution against coronavirus", "description": "Chicago State, University of Missouri-Kansas City men's basketball teams canceled games at Seattle University this week due to coronavirus concerns.", "url": "https://www.usatoday.com/story/sports/ncaab/wac/2020/03/04/coronavirus-concerns-chicago-state-umkc-college-basketball-cancel-seattle-games/4955020002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/04/USAT/32ad419d-b2d1-4261-9978-eed2cb58eaaa-umkc.JPG?crop=1479,832,x502,y430&width=1600&height=800&fit=bounds", "publishedAt": "2020-03-04T21:29:28Z", "content": "What teams are rising and falling as March madness is quickly approaching.\r\nUSA TODAY\r\nChicago State became the first Division I men's basketball program to cancel games due to the coronavirus outbreak, announcing on Tuesday the decision not to travel to Seat… [+1790 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "A passenger who was on a Princess cruise has died of the coronavirus in California. The ship is set to dock in San Francisco.", "description": "The Grand Princess cruise ship is expected to dock in San Francisco on Thursday as the CDC investigates a \"small cluster\" of coronavirus cases associated with its previous voyage. The first patient to die of the new coronavirus in California was on the Grand …", "url": "https://www.businessinsider.com/princess-cruise-passenger-dies-coronavirus-ship-heads-for-san-francisco-2020-3", "urlToImage": "https://i.insider.com/5e601a87fee23d046265a423?width=1200&format=jpeg", "publishedAt": "2020-03-04T21:39:00Z", "content": "A coronavirus patient who'd recently traveled on the Grand Princess cruise ship has died in California, and the ship is now headed for San Francisco.\r\nThe Grand Princess is expected to dock in the city on Thursday afternoon. The Centers for Disease Control an… [+2822 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julia Naftulin", "title": "Why you can't stop touching your face, even though it's one of the best ways to prevent coronavirus spread", "description": "One of the CDC's top pieces of advice for protecting yourself from the coronavirus is to stop touching your face, eyes, and mouth, but people are having trouble kicking the habit. That's because face-touching is a natural human habit, and like any habit, it c…", "url": "https://www.businessinsider.com/psychological-reason-why-you-cant-stop-touching-face-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e5ede65fee23d18033f2dd3?width=1200&format=jpeg", "publishedAt": "2020-03-04T21:39:00Z", "content": "The coronavirus outbreak has spread global panic, with people searching for sure-fire ways to protect themselves. For a while, many people (inspired by celebrities) thought masks would do it. But according to the health officials around the world, masks are f… [+2844 chars]"}, {"source": {"id": null, "name": "Townandcountrymag.com"}, "author": "Caroline Hallemann", "title": "Kate Middleton Wore a Bold Vintage Oscar De La Renta Dress in Ireland Tonight - TownandCountrymag.com", "description": "Kate Middleton Wore a Bold Vintage Oscar De La Renta Dress in Ireland Tonight TownandCountrymag.com Prince William calls on post-Brexit UK and Ireland to 'recommit to path of friendship' The Sun Kate Middleton Shows Some PDA With Prince William as She Dazzles…", "url": "https://www.townandcountrymag.com/society/tradition/a31228609/kate-middleton-vintage-polka-dot-oscar-de-la-renta-dress-ireland-photos/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1205102382-copy-1583356502.jpg?crop=1.00xw:0.334xh;0,0.0139xh&resize=1200:*", "publishedAt": "2020-03-04T21:53:00Z", "content": "Prince William and Kate Middleton capped off the second day of their royal tour of Ireland with a reception in Dublin at the city's Museum of Literature, and the Duchess of Cambridge looked quite pretty in pink for the occasion.\r\nAfter sporting a sensible wax… [+1398 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Xeni Jardin", "title": "Screener at Los Angeles airport tests positive for coronavirus, federal officials say", "description": "Federal officials say a medical screener at Los Angeles International Airport has tested positive for coronavirus. The DHS contractor was performing CDC medical screenings at LAX airport, and became sick. They have now tested positive for COVID-19. The patien…", "url": "https://boingboing.net/2020/03/04/screener-at-los-angeles-airpor.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/03/CDC-coronavirus-1.jpg?fit=725%2C410&ssl=1", "publishedAt": "2020-03-04T22:09:19Z", "content": "Federal officials say a medical screener at Los Angeles International Airport has tested positive for coronavirus.The DHS contractor was performing CDC medical screenings at LAX airport, and became sick. They have now tested positive for COVID-19. The patient… [+1398 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tim Levin", "title": "Hyundai put joysticks instead of a steering wheel in its new electric concept car, which looks like a mashup between a Porsche and a Tesla", "description": "Hyundai has a new concept car out, which the automaker is calling the Prophecy. Concept cars often show an exaggerated version of where an automaker wants to go in the future, hence this one's name — it's a preview of Hyundai EVs to come. With sweeping lines …", "url": "https://www.businessinsider.com/hyundais-prophecy-electric-concept-tesla-porsche-geneva-photos-2020-3", "urlToImage": "https://i.insider.com/5e5fcd35fee23d29b06d0913?width=1200&format=jpeg", "publishedAt": "2020-03-04T21:54:06Z", "content": "Hyundai has a new electric concept car called the Prophecy, which, as its name suggests, offers a sneak peek at what the brand's future EVs may look like.\r\nIf the car is anything to go by, the future looks pretty darn good. \r\nHyundai debuted the concept on Tu… [+1149 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "BeauHD", "title": "Ask Slashdot: What Features Would Your Ideal Telework Systems Incorporate?", "description": "couchslug writes: Physical commuting has a horrific and enormously expensive carbon footprint. It's costly in lives (auto and other transportation accidents, pollution) and wasted time (billions of hours every year) better spent doing something else. What sof…", "url": "https://tech.slashdot.org/story/20/03/04/1923223/ask-slashdot-what-features-would-your-ideal-telework-systems-incorporate", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2020-03-04T22:00:00Z", "content": "Hard to say, because optimal is to go pure virtual, and then I'll only have play, not work."}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Salvador Hernandez", "title": "A Public Health Official Warned People Not To Touch Their Face Due To Coronavirus — Then Immediately Licked Her Finger", "description": "Seriously, everyone, stop touching your face and wash your hands. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/salvadorhernandez/public-health-official-touch-face-coronavirus", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/4/22/campaign_images/bcc6d9d13983/a-public-health-official-warned-people-not-to-tou-2-576-1583359602-14_dblbig.jpg", "publishedAt": "2020-03-04T22:05:04Z", "content": "Dr. Sara Cody was offering one piece of simple, yet vital, advice on how people can stop the novel coronavirus from spreading: Don't touch your face.\r\n\"Today, start working on not touching your face because one main way viruses spread is when you touch your o… [+2350 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ben Pearson", "title": "Baby Yoda Toys May Be Delayed Due to Coronavirus, Disney Pushes ‘Mulan’ Release Date in Some International Markets", "description": "As the coronavirus continues to claim lives and infect people in multiple countries across the world, the virus is also having an impact on the entertainment industry. A new report says that Hasbro’s supply chain has been interrupted because of the coronaviru…", "url": "https://www.slashfilm.com/baby-yoda-toys-coronavirus/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Baby-Yoda-toys-Mulan-delay.jpg", "publishedAt": "2020-03-04T21:30:17Z", "content": "As the coronavirus continues to claim lives and infect people in multiple countries across the world, the virus is also having an impact on the entertainment industry.\r\nA new report says that Hasbro’s supply chain has been interrupted because of the coronavir… [+3048 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Whitney Kimball", "title": "Ceci N’est Pas Une Sewer-Clogging Bathtub of Orbeez", "description": "There’s a lot happening on social media, more than any one person can safely keep up with. Do you need to know about it? At Hall Monitor, we provide you with a digest to help you make up your mind. Read more...", "url": "https://gizmodo.com/ceci-n-est-pas-une-sewer-clogging-bathtub-of-orbeez-1842090879", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/pcsi1g3v6r2qop1icynu.png", "publishedAt": "2020-03-04T21:40:00Z", "content": "Theres a lot happening on social media, more than any one person can safely keep up with. Do you need to know about it? At Hall Monitor, we provide you with a digest to help you make up your mind.\r\nTikTok Announcement: Plumbing and You\r\nFrench TikToker and Yo… [+4750 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Jon Swartz", "title": "Earnings Results: Zoom shares tumble despite solid results", "description": "Zoom Video Communications Inc. tumbled 7% in after-hours trading Wednesday after it reported better-than-expected results that did not meet lofty expectations.", "url": "https://www.marketwatch.com/story/zoom-shares-tumble-despite-solid-results-2020-03-04", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB444_Zoom_ZG_20200304112408.jpg", "publishedAt": "2020-03-04T21:39:33Z", "content": "Zoom Video Communications Inc. tumbled 7% in after-hours trading Wednesday after it reported better-than-expected results that did not meet lofty expectations. \r\nThus may end the teleconferencing companys \r\nZM, -0.57%\r\n recent spectacular stock run as one of … [+1233 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Why you can't stop touching your face, even though it's one of the best ways to prevent coronavirus spread", "description": "Humans are conditioned to touch their own faces as a way to show self-awareness. Once the habit is formed, it's difficult to break.", "url": "https://news.yahoo.com/why-cant-stop-touching-face-213900812.html", "urlToImage": null, "publishedAt": "2020-03-04T21:39:00Z", "content": null}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Chris Lindahl", "title": "Here Are All the Ways Coronavirus Is Affecting the Entertainment Industry Right Now", "description": "The coronavirus might have a debilitating impact on the business at any time of the year, but its arrival on the cusp of several major international film events is significant.", "url": "https://www.indiewire.com/2020/03/film-industry-coronavirus-impact-1202215108/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2020/03/shutterstock_editorial_10568781d.jpg", "publishedAt": "2020-03-04T21:49:07Z", "content": "Amazon bailed on SXSW. The Thessaloniki Documentary Festival should kick off Thursday, but it’s now postponed. Unifrance pulled out of its annual French film series at Lincoln Center. The MipTV Conference in Cannes was canceled. The new James Bond movie was p… [+6205 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "US coronavirus cases rise; lawmakers near emergency funds deal", "description": "United States lawmakers reach agreement on an $8.3bn emergency bill to help fund efforts to contain the virus.", "url": "https://www.aljazeera.com/news/2020/03/coronavirus-cases-rise-lawmakers-emergency-funds-deal-200304175534050.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/3/21128ef4769047e48eaf49965193949a_18.jpg", "publishedAt": "2020-03-04T21:31:20Z", "content": "One more person has died of the new coronavirus in the Seattle, Washington area, bringing the total number of fatalities there to 10, health officials said on Wednesday, and new confirmed cases were reported around the two most populous cities in the United S… [+3803 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Donald Trump blames the Obama administration for need to change Coronavirus testing - The Sun", "description": "Donald Trump blames the Obama administration for need to change Coronavirus testing The Sun Trump blames 'Obama rule' for slow coronavirus response in US New York Post Trump's false claim blames Obama administration as coronavirus spreads in US CNN Criticized…", "url": "https://www.youtube.com/watch?v=R12N6ubQvFE", "urlToImage": null, "publishedAt": "2020-03-04T21:16:54Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Short Sellers Made Over $50 Billion During Coronavirus Sell-Off", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-04/short-sellers-made-over-50-billion-during-coronavirus-sell-off", "urlToImage": null, "publishedAt": "2020-03-04T21:32:57Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Impact on Wall St. Workers & Dealmaking (Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-04/coronavirus-impact-on-wall-st-workers-dealmaking-podcast", "urlToImage": null, "publishedAt": "2020-03-04T21:33:31Z", "content": null}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Apple retail employees say a memo to technical support staff noted iPhone repair parts and replacement phones would be in short supply for as long as 2-4 weeks (Mark Gurman/Bloomberg)", "description": "Mark Gurman / Bloomberg : Apple retail employees say a memo to technical support staff noted iPhone repair parts and replacement phones would be in short supply for as long as 2-4 weeks — - Company re-opens nearly all of its retail locations in China — Corona…", "url": "https://www.techmeme.com/200304/p25", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/itaMh3eyLH0Y/v0/1200x800.jpg", "publishedAt": "2020-03-04T21:12:44Z", "content": null}, {"source": {"id": null, "name": "Techmeme.com"}, "author": null, "title": "Google moves all job interviews to Hangouts \"for the foreseeable future\" due to coronavirus, while Amazon and Facebook have also limited on-site job interviews (Jay Peters/The Verge)", "description": "Jay Peters / The Verge : Google moves all job interviews to Hangouts “for the foreseeable future” due to coronavirus, while Amazon and Facebook have also limited on-site job interviews — Amazon and Facebook have also limited on-site job interviews — Google ha…", "url": "https://www.techmeme.com/200304/p26", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg", "publishedAt": "2020-03-04T21:40:01Z", "content": null}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Evan Selleck", "title": "Shortage of replacement iPhones at Apple Stores due to coronavirus may be putting a ‘strain’ on supply chain", "description": "Apple may seeing supply shortages for not only iPhone replacements, but also individual parts, due to the coronavirus.", "url": "https://www.idownloadblog.com/2020/03/04/apple-stores-iphone-replacement-shortage/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2015/12/Apple-Genius-Bar.jpg", "publishedAt": "2020-03-04T21:32:29Z", "content": "The global coronavirus outbreak is putting stress on just about everything, and despite the fact that Apple is optimistic about the long-term, the short-term appears to be a bit rocky.\r\nAccording to a new report this week from Bloomberg, Apple is currently in… [+1693 chars]"}, {"source": {"id": null, "name": "Adage.com"}, "author": "Adrianne Pasquarelli", "title": "How the coronavirus is affecting clothing rental sites", "description": "Amid COVID-19 concerns, Rent the Runway added an FAQ about the cleaning of its garments; experts expect rental services may see a decline in business as consumers panic about germs.", "url": "https://adage.com/article/cmo-strategy/how-coronavirus-affecting-clothing-rental-sites/2242416", "urlToImage": "https://s3-prod.adage.com/s3fs-public/styles/800x600/public/20200304_RentTheRunway_3x2.jpg", "publishedAt": "2020-03-04T21:15:41Z", "content": "Germs are always a concern when youre borrowing clothes, but the spread of bacteria could be even more alarming during an outbreak like coronavirus, when hand sanitizer is in short supply. Amid growing consumer anxiety around the spread of COVID-19, some expe… [+1091 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jon Quast)", "title": "Not Even James Bond Is Immune to Coronavirus", "description": "The release of \"No Time to Die,\" the 25th movie in the iconic 007 franchise, is being postponed until November.", "url": "https://www.fool.com/investing/2020/03/04/not-even-james-bond-is-immune-to-coronavirus.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561499/empty-movie-theater.jpg", "publishedAt": "2020-03-04T21:30:00Z", "content": "If you love the fast cars, cool gadgets, and shaken (not stirred) dry vodka martinis of iconic MI6 agent James Bond, you're not going to like this: The premiere of Daniel Craig's fifth outing as 007, No Time To Die, has been delayed until November in light of… [+1583 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Todd Campbell)", "title": "Why Coronavirus News Sent OPKO Health's Shares Soaring 10.8% Today", "description": "The U.S. government has told Opko's BioReference Labs it can apply for approval of a COVID-19 test.", "url": "https://www.fool.com/investing/2020/03/04/why-coronavirus-news-sent-opko-healths-shares-soar.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561522/test-tubes.jpg", "publishedAt": "2020-03-04T21:34:00Z", "content": "What happened\r\nShares of OPKO Health (NASDAQ:OPK) surged 10.8% on Wednesday after the U.S. Centers for Disease Control and Prevention (CDC) said it could file for approval of a test for the COVID-19 coronavirus.\r\nSo what\r\nOver 90,000 cases of the virus have b… [+1309 chars]"}, {"source": {"id": null, "name": "Radio.com"}, "author": "https://facebook.com/wcbs880/", "title": "More Coronavirus Cases Linked To New Rochelle Man - WCBS 880", "description": "More Coronavirus Cases Linked To New Rochelle Man WCBS 880 Coronavirus cases linked to sick NY man jumps to 11 | WNT ABC News NY Gov. Cuomo confirms 5 new cases of coronavirus: 'This is literally like trying to stop air' CNBC 1,000 New Yorkers are being asked…", "url": "https://wcbs880.radio.com/articles/news/more-coronavirus-cases-linked-to-new-rochelle-man", "urlToImage": "https://images.radio.com/wcbsam/49618406157_2d0c47677d_k.jpg?width=1170&height=515&crop=1170:515,smart", "publishedAt": "2020-03-04T21:21:45Z", "content": "NEW YORK (WCBS 880) Five more people connected to a New Rochelle attorney who is hospitalized with coronavirus have tested positive for COVID-19, bringing the total of confirmed cases in New York to 11.\r\nGov. Andrew Cuomo announced Wednesday afternoon the new… [+5038 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Jonathan Sawyer", "title": "‘No Time to Die’ Release Pushed to November Due to Coronavirus", "description": "The effects of the coronavirus epidemic continue to place a stranglehold on various industries, now including the entertainment industry. The New York Times reports that the much-anticipated new James Bond movie, No Time to Die, has officially been postponed …", "url": "https://www.highsnobiety.com/p/no-time-to-die-postponed-coronavirus/", "urlToImage": "https://static.highsnobiety.com/thumbor/1p0j8lUergnQHBuRV5YG3d2e7IA=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2020/03/04212211/no-time-to-die-delayed-coronavirus-feature.jpg", "publishedAt": "2020-03-04T21:39:15Z", "content": "The effects of the coronavirus epidemic continue to place a stranglehold on various industries, now including the entertainment industry. The New York Times reports that the much-anticipated new James Bond movie, No Time to Die, has officially been postponed … [+855 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Naazneen Karmali, Forbes Staff, Naazneen Karmali, Forbes Staff https://www.forbes.com/sites/naazneenkarmali/", "title": "Malaysia's 50 Richest 2020: Slowing Economy Takes A Toll On Country's Tycoons", "description": "Malaysia’s slowing economy, now getting hit by the coronavirus outbreak, took a toll on its tycoons.", "url": "https://www.forbes.com/sites/naazneenkarmali/2020/03/04/malaysias-50-richest-2020-slowing-economy-takes-a-toll-on-countrys-tycoons/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5dfe5fe1e617000758b4a6%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D700%26cropY1%3D2%26cropY2%3D396", "publishedAt": "2020-03-04T21:41:44Z", "content": "No.9 Kuan Kam Hon\r\nCourtesy of Hartalega\r\nThis story is part of Forbes' coverage of Malaysias Richest 2020. See the full list here.\r\nMalaysias slowing economy, now getting hit by the coronavirus outbreak, took a toll on its tycoons. A weaker ringgit and a nea… [+7011 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Shieber", "title": "Investors move from coronavirus woes to Biden wins as markets rally on Super Tuesday results", "description": "While the aftermath of Super Tuesday has left the Democratic party riven between its more liberal and moderate wings, investors viewed last night's results as a win for business and markets. Shaking off the steady beat of bad news about the advance of the nov…", "url": "https://finance.yahoo.com/news/investors-move-coronavirus-woes-biden-220536962.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/c242nm2bjVWT94BkBIqlbg--~B/aD00MDM4O3c9NjA1NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/1b2e76999a6fc7e86b66145883d23f46", "publishedAt": "2020-03-04T22:05:36Z", "content": "While the aftermath of Super Tuesday has left the Democratic Party riven between its more liberal and moderate wings, investors viewed last night's results as a win for business and markets.\r\nShaking off the steady beat of bad news about the advance of the no… [+1538 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ted Knutson, Contributor, Ted Knutson, Contributor https://www.forbes.com/sites/tedknutson/", "title": "Marketplace Contagion: Amazon Has Already Removed A Million Fake Products Related To Coronavirus", "description": "Amazon has also removed tens of thousands of coronavirus related produces for price gouging.", "url": "https://www.forbes.com/sites/tedknutson/2020/03/04/marketplace-contagion-amazon-has-already-removed-a-million-fake-products-related-to-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5ffbf37d6f2600068eaa40%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D4000%26cropY1%3D207%26cropY2%3D2457", "publishedAt": "2020-03-04T21:41:37Z", "content": "Its not just COVID-19 and fear of it that are spreading. So too are false product claims related to the novel coronavirus. \r\nAmazon has already removed more than one million products for making false claims related to the virus, Dharmesh Mehta, Amazons vice p… [+4159 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Muhammad Cohen, Contributor, Muhammad Cohen, Contributor https://www.forbes.com/sites/muhammadcohen/", "title": "Casino Billionaire Chen Lip Keong Places Bets On Russian Expansion", "description": "Despite the coronavirus outbreak taking a toll on gaming, Chen Lip Keong is trying his luck in Russia", "url": "https://www.forbes.com/sites/muhammadcohen/2020/03/04/casino-billionaire-chen-lip-keong-places-bets-on-russian-expansion/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5dfc95e1e617000758b44d%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D700%26cropY1%3D2%26cropY2%3D396", "publishedAt": "2020-03-04T21:41:18Z", "content": "Chen Lip Keong\r\nAdam Dean for Forbes\r\nThis story is part of Forbes' coverage of Malaysias Richest 2020. See the full list here.\r\nDespite the coronavirus outbreak taking a toll on gaming, Chen Lip Keong is trying his luck in Russia: his NagaCorp is building a … [+2131 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Vice President Pence Says Risk of Catching Coronavirus Remains Low in U.S.", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-04/vice-president-pence-says-risk-of-catching-coronavirus-remains-low-in-u-s-video", "urlToImage": null, "publishedAt": "2020-03-04T21:37:47Z", "content": null}, {"source": {"id": null, "name": "Adage.com"}, "author": "Adrianne Pasquarelli", "title": "Coronavirus could hit clothing rental sites", "description": "Amid COVID-19 concerns, Rent the Runway added an FAQ about the cleaning of its garments; experts expect rental services may see a decline in business as consumers panic about germs.", "url": "https://adage.com/article/cmo-strategy/coronavirus-could-hit-clothing-rental-sites/2242416", "urlToImage": "https://s3-prod.adage.com/s3fs-public/styles/800x600/public/20200304_RentTheRunway_3x2.jpg", "publishedAt": "2020-03-04T21:15:41Z", "content": "Germs are always a concern when youre borrowing clothes, but the spread of bacteria could be even more alarming during an outbreak like coronavirus, when hand sanitizer is in short supply. Amid growing consumer anxiety around the spread of COVID-19, some expe… [+1091 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Rosa Escandon, Contributor, Rosa Escandon, Contributor https://www.forbes.com/sites/rosaescandon/", "title": "Sony Pictures Entertainment Closes 3 European Offices Due To Coronavirus Fears", "description": "Sony Pictures Entertainment has closed its offices in London, Paris and Gdynia, Poland because of the coronavirus pandemic.", "url": "https://www.forbes.com/sites/rosaescandon/2020/03/04/sony-pictures-entertainment-closes-3-european-offices-due-to--coronavirus-fears/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1205060088%2F0x0.jpg", "publishedAt": "2020-03-04T21:40:57Z", "content": "LONDON, UNITED KINGDOM - MARCH 04: A man wears a medical mask in Chinatown in London, England on ... [+] March 04, 2020. Thirty four more patients in England have tested positive for coronavirus today and the total number of cases reached to 85 in the UK. (Ph… [+2646 chars]"}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Harrison Mantas", "title": "Chinese social media sites blocked medical information about the coronavirus, research indicates", "description": "Chinese social media platforms like Weibo, WeChat and YY are always monitored by the government but, during the 2019 coronavirus outbreak, these companies may have blocked important medical information regarding the new disease. This is what a recent study pu…", "url": "https://www.poynter.org/fact-checking/2020/chinese-social-media-sites-blocked-medical-information-about-the-coronavirus-research-indicates/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/WhatsApp-Image-2020-03-04-at-16.58.27.jpeg", "publishedAt": "2020-03-04T21:52:53Z", "content": "Chinese social media platforms like Weibo, WeChat and YY are always monitored by the government but, during the 2019 coronavirus outbreak, these companies may have blocked important medical information regarding the new disease. This is what a recent study pu… [+3340 chars]"}, {"source": {"id": null, "name": "Theonion.com"}, "author": "The Onion", "title": "Health Officials Ask Americans To Stop Buying Face Masks", "description": "As the number of confirmed coronavirus cases continues to grow, U.S. Surgeon General Jerome Adams urged Americans to stop purchasing face masks, noting that the masks are intended only for healthcare providers and people who are currently ill. What do you thi…", "url": "https://www.theonion.com/health-officials-ask-americans-to-stop-buying-face-mask-1842099261", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a1glirmtpgnnrgkq96yv.jpg", "publishedAt": "2020-03-04T21:57:00Z", "content": "As the number of confirmed coronavirus cases continues to grow, U.S. Surgeon General Jerome Adams urged Americans to stop purchasing face masks, noting that the masks are intended only for healthcare providers and people who are currently ill. What do you thi… [+312 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Grater", "title": "Coronavirus: French Delegation Including Juliette Binoche & Bruno Dumont Cancels Attendance To Rendez-Vous In New York", "description": "The French talent delegation to Rendez-Vous with French Cinema in New York, which is due to open tomorrow (March 5), have been forced to cancel their trip due to concerns over the coronavirus epidemic. Prominent French personalities including Juliette Binoche…", "url": "https://deadline.com/2020/03/coronavirus-french-delegation-cancels-attendance-rendez-vous-new-york-juliette-binoche-bruno-dumont-1202874511/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/02/rexfeatures_10096154bn.jpg?w=1024", "publishedAt": "2020-03-04T21:21:01Z", "content": "The French talent delegation to Rendez-Vous with French Cinema in New York, which is due to open tomorrow (March 5), have been forced to cancel their trip due to concerns over the coronavirus epidemic.\r\nProminent French personalities including Juliette Binoch… [+1405 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Dan Evon", "title": "Did Councilwoman Candi CdeBaca Tweet ‘#Solidarity’ for This Coronavirus Comment?", "description": "A viral tweet raised eyebrows amid an outbreak of new coronavirus in early 2020.", "url": "https://www.snopes.com/fact-check/candi-cdebaca-tweet-coronavirus/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/Featured-Image-Template35.png?fit=1200,680", "publishedAt": "2020-03-04T21:48:14Z", "content": "In March 2020, a screenshot supposedly showing the above tweet from Denver councilwoman Candi CdeBaca was widelycirculated in conservative circles:\r\nIt was a genuine tweet posted by CdeBaca on Feb. 28, 2020, in response to another users tweet that read: For t… [+1959 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Pranav Mukul", "title": "Coronavirus — Air, rail bookings hit: Flight reservations to Delhi drop by 11%, Jaipur falls almost 1%", "description": "Flight bookings to the Capital have seen an 11 per cent drop in the last two days, compared to a two-day period a fortnight ago. Similarly, flight bookings to Jaipur fell almost 1 per cent, data sourced from travel app ixigo showed.", "url": "https://indianexpress.com/article/business/coronavirus-hit-air-rail-bookings-flight-reservations-to-delhi-drop-by-11-jaipur-falls-almost-1-6299818/", "urlToImage": "https://images.indianexpress.com/2020/03/airport.jpg?w=759", "publishedAt": "2020-03-04T22:03:46Z", "content": "Written by Pranav Mukul\r\n | New Delhi | \r\nPublished: March 5, 2020 3:33:46 am\r\nFlight bookings to Jaipur fell almost 1 per cent, data sourced from travel app ixigo showed.An outbreak of confirmed and potential coronavirus cases in Delhi, Jaipur and Agra over … [+2780 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Philip van Doorn", "title": "Deep Dive: These stocks soared the most after Biden burned Bernie on Super Tuesday", "description": "Health-care stocks led the market rally after Biden took 10 of 14 states, becoming the Democratic front runner.", "url": "https://www.marketwatch.com/story/these-stocks-soared-the-most-after-biden-burned-bernie-on-super-tuesday-2020-03-04", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB462_biden__ZG_20200304140301.jpg", "publishedAt": "2020-03-04T21:49:39Z", "content": "U.S. stocks staged a massive rally Wednesday, with health-care companies leading the charge after former Vice President Joe Biden jumped ahead of Sen. Bernie Sanders in the race toward the Democratic presidential nomination. \r\nAfter Biden took 10 of 14 states… [+8960 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Democrats reportedly finally convinced Montana Gov. Steve Bullock to run for Senate", "description": "Democrats may have finally got their man.Montana Gov. Steve Bullock (D) is reportedly now inclined to run for the state's Senate seat, which is occupied by Trump ally Sen. Steve Daines (R-Mont.), three Democratic officials told The New York Times. Bullock, wh…", "url": "https://news.yahoo.com/democrats-reportedly-finally-convinced-montana-212904409.html", "urlToImage": null, "publishedAt": "2020-03-04T21:29:04Z", "content": null}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Karen  Weintraub", "title": "Deadly Seattle-Area Outbreak Rattles Nursing Homes", "description": "At least five residents of a skilled nursing facility in Washington state have died from COVID-19, prompting facilities around the country to explore its plans and prepare for the worst.", "url": "https://www.webmd.com/lung/news/20200304/deadly-seattle-area-outbreak-rattles-nursing-homes", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/news/2020/02_2020/coronavirus_alert/650x350_coronavirus_alert.jpg", "publishedAt": "2020-03-04T21:28:35Z", "content": "Soap and water is a great invention, she says. It really makes a difference.\r\nBut in many health care facilities shes visited, there arent sinks in convenient locations, or theres no hand soap at the sink, or no paper towels, or no trash can for the paper tow… [+1721 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Dave & Buster's Stock Popped Today", "description": "An activist investor doubled its stake in the dine-and-play chain.", "url": "https://www.fool.com/investing/2020/03/04/why-dave-busters-stock-popped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561527/slide-8-source-dave-busters.jpg", "publishedAt": "2020-03-04T21:49:00Z", "content": "What happened\r\nShares of Dave &amp; Buster's (NASDAQ:PLAY) were gaining today after the private equity firm Kohlberg Kravis Roberts (KKR), the same activist investor that had first taken a stake in D&amp;B in January, upped its investment in the struggling \"e… [+2079 chars]"}, {"source": {"id": null, "name": "Cdm.link"}, "author": "Peter Kirn", "title": "German music tech events enter the age of COVID-19; Musikmesse postponed", "description": "Novel coronavirus SARS-CoV-2, meet the musical instruments and music tech business. Events in Germany are threatened, and more could be in store worldwide. The post German music tech events enter the age of COVID-19; Musikmesse postponed appeared first on CDM…", "url": "https://cdm.link/2020/03/coronavirus-germany/", "urlToImage": "https://cdm.link/app/uploads/2020/03/sars-cov2.jpg", "publishedAt": "2020-03-04T21:54:10Z", "content": "Novel coronavirus SARS-CoV-2, meet the musical instruments and music tech business. Events in Germany are threatened, and more could be in store worldwide.\r\nIt’s too tempting to use the virus image instead of Messe, since, well, while they’re deadly, viruses … [+6097 chars]"}, {"source": {"id": null, "name": "Wabi.tv"}, "author": "Alyssa Thurlow", "title": "Should your business be preparing for the Coronavirus? - WABI", "description": "Fears about the coronavirus have taken a toll on Wall Street. We sat down with a financial expert to see what folks should know amid the stock market mayhem.", "url": "https://www.wabi.tv/content/news/Should-your-business-be-preparing-for-the-Coronavirus-568493761.html", "urlToImage": "https://media.graytvinc.com/images/225_Coronavirus_MGN.jpg", "publishedAt": "2020-03-04T21:58:19Z", "content": "ORONO, Maine (WABI) - The growing threat of coronavirus is not just affecting our health.\r\nIt's also affecting our wallets.\r\n\"They say the ability to adapt is the highest form of intelligence, said Pankaj Agrrawal, Professor Finance at the University of Maine… [+1964 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Colleen Shalby, Soumya Karlamangla", "title": "California coronavirus spread prompts emergency declarations: What you need to know", "description": "Government officials in California are taking new steps to try to control the coronavirus outbreak, including preparation-based emergency declarations.", "url": "https://www.latimes.com/california/story/2020-03-04/california-coronavirus-spread-emergency-declarations", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/3bb19f4/2147483647/strip/true/crop/5000x2625+0+351/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F67%2Fb6%2F5064c267422691a327655c03d13b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1205083336.jpg", "publishedAt": "2020-03-04T21:13:18Z", "content": "Government officials across California are taking new steps to try to control the novel coronavirus, which continues to spread across the state.\r\nThere are now more than 50 patients in California with the virus, with six new cases announced in Los Angeles Cou… [+6363 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Laura Strickler, Andrew Blankstein", "title": "Medical screener at LAX tests positive...", "description": "Medical screener at LAX tests positive... (First column, 5th story, link ) Related stories: CA announces first death... LA declares emergency, confirms 6 new cases... No shutdown orders in Seattle area... 'Ghost town'... Man in mask passes out on NYC sidewalk…", "url": "https://www.nbcnews.com/health/health-news/medical-screener-lax-airport-tests-positive-coronavirus-n1149986", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_10/3256236/200304-los-angeles-international-airport-lax-ew-407p_7bc1b47cc43d9c6155e42196c90a2361.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-04T21:34:37Z", "content": "WASHINGTON A medical professional who conducted passenger screenings at Los Angeles International airport tested positive for the coronavirus late Tuesday night, according to a statement from the Department of Homeland Security and an internal email obtained … [+2375 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ethan Wolff-Mann", "title": "Coronavirus price gouging: 3 charts show Amazon's wild spikes", "description": "Amazon has been fighting against price spikes from third-party sellers after the company's own supplies ran out. The fluctuations have been wild.", "url": "https://finance.yahoo.com/news/coronavirus-price-gouging-3-charts-show-amazons-wild-spikes-215034577.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/a2iVqcmWXKB28Q8hlF2g_A--~B/aD0zNDExO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/7f6d9870-59ab-11ea-bf3d-23690a608431", "publishedAt": "2020-03-04T21:50:34Z", "content": "Amazon (AMZN) and other companies have been fighting price gouging on their platforms as coronavirus fears prompt nervous consumers to hoard supplies to deal with possible quarantines and related disruptions.\r\nIts just one of the problems online platforms tha… [+4352 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Alyssa Newcomb", "title": "Coronavirus is battering the airline industry, turning some airports into ghost towns", "description": "Some of the world’s busiest airports now look like ghost towns as the coronavirus, which has sickened more than 90,000 people, continues to spread around the world.", "url": "https://www.nbcnews.com/business/business-news/coronavirus-battering-airline-industry-turning-some-airports-ghost-towns-n1150011", "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2020_10/3254891/200303-seattle-tacoma-airport-ac-957p_8a54c38384cb0876609d612911eada1e.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-04T21:30:00Z", "content": "Some of the worlds busiest airports now look like ghost towns as the coronavirus, which has sickened more than 90,000 people, continues to spread around the world.\r\nPassengers who are choosing to travel are sharing photos on social media showing once bustling… [+2125 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Ananya Tiwari", "title": "Exports from China hit, Sadar Bazar suffers ahead of Holi", "description": "At Sadar Bazar, where shopkeepers usually stock up on pichkaris and water balloons in the weeks leading to Holi, traders said Chinese markets and factories that supply them have been shut since late January.", "url": "https://indianexpress.com/article/cities/delhi/cronavirus-hits-indian-trade-6299761/", "urlToImage": "https://images.indianexpress.com/2020/03/holi-corona.jpg?w=759", "publishedAt": "2020-03-04T21:17:25Z", "content": "Written by Ananya Tiwari\r\n | New Delhi | \r\nPublished: March 5, 2020 2:47:25 am\r\nMost traders said they preferred Chinese-made goods due to their superior quality. (File)With Holi around the corner, many wholesale markets that had ordered pichkaris from China … [+1717 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jason Hall)", "title": "2 Reasons Colgate-Palmolive Stock Surged Today", "description": "A huge bounce-back day for stocks, and crashing interest rates, have investors flocking to the consumer-goods giant.", "url": "https://www.fool.com/investing/2020/03/04/2-reasons-colgate-palmolive-stock-surged-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561532/line-on-chart-falling-stock-down.jpg", "publishedAt": "2020-03-04T21:57:00Z", "content": "What happened\r\nShares of Colgate-Palmolive(NYSE:CL) gained 5% on March 4, riding a resurgent stock market that's up huge today. The S&amp;P 500 and Dow Jones Industrial Average were up more than 4% on the day.\r\nSo what\r\nTwo things are happening that have inve… [+2279 chars]"}, {"source": {"id": null, "name": "Thestreet.com"}, "author": "Tony Owusu", "title": "Marvell Surges on Q4 Earnings, Sales Beat - TheStreet", "description": "Marvell Surges on Q4 Earnings, Sales Beat TheStreet Finland's Nokia enters 5G partnership with Marvell Technology Yahoo Finance Marvell swings to Q4 profit, sees 5% revenue dip on coronavirus worries in Q1 MarketWatch Nokia tries to raise its chip game throug…", "url": "https://www.thestreet.com/investing/marvell-tops-q4-estimates-in-strong-quarter", "urlToImage": "https://www.thestreet.com/.image/t_share/MTY4NTE2Mzc5MzE4OTUzNzUw/marvell-is-second-big-company-this-week-to-blame-outlook-on-trade.png", "publishedAt": "2020-03-04T21:34:00Z", "content": "Shares of Marvell Technology (MRVL) - Get Report rose sharply after hours Wednesday after the semiconductor maker reported fiscal fourth quarter results that were ahead of analyst expectations for the period. \r\nThe company reported fourth quarter revenue of $… [+1493 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "GuruFocus.com", "title": "2 Undervalued-Predictable Health Care Stocks", "description": "Health care sector gets boost following ‘Super Tuesday’ and coronavirus funding Continue reading...", "url": "https://finance.yahoo.com/news/2-undervalued-predictable-health-care-220720027.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9FV.BzlPukdoR1dfihrZWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/QrvxEoHVlrRaslRYGTeWtg--~B/aD00MDA7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/us.finance.gurufocus/eb53efebf1b1561dfd7cc46fb1b5c6a8", "publishedAt": "2020-03-04T22:07:20Z", "content": "According to the Undervalued-Predictable Screener, one of our Premium value screens, two health care companies with predictable earnings and trading below intrinsic value are Anthem Inc. (NYSE:ANTM) and Amgen Inc. (NASDAQ:AMGN).\r\nDow receives boost following … [+4450 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Rosie Spinks, Skift", "title": "Promoting Tourism in the Time of Coronavirus Is a No-Win", "description": "Tourism marketers are facing somewhat of a conundrum: The optics of tourism campaigns during widespread panic can fall flat, but failing to market low-risk destinations may make a bad problem even worse. -Rosie Spinks", "url": "https://skift.com/2020/03/05/promoting-tourism-in-the-time-of-coronavirus-is-a-no-win/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/thumbnail-f010786878a25ac3fc17fe1b3c52e106-scaled-1.jpeg", "publishedAt": "2020-03-04T22:09:06Z", "content": null}, {"source": {"id": null, "name": "Velonews.com"}, "author": "VeloNews.com", "title": "Rolling Report: Impact of coronavirus on pro racing", "description": "With the impact of coronavirus on pro cycling rapidly escalating Wednesday, this will be your go-to guide for all the most important updates on the situation. March 4, 10:00 (MT): Mitchelton-Scott has pulled its men’s and women’s teams out of races for most o…", "url": "https://www.velonews.com/2020/03/news/rolling-report-impact-of-coronavirus-on-pro-racing_505843", "urlToImage": "https://s27394.pcdn.co/wp-content/uploads/2019/03/GettyImages-1137782624.jpg.webp", "publishedAt": "2020-03-04T21:57:31Z", "content": "\"], \"filter\": { \"nextExceptions\": \"img, blockquote, div\", \"nextContainsExceptions\": \"img, blockquote\"} }'&gt;\r\nStay updated on the latest news around the coronavirus threat and its impact on pro cycling. \r\nWith the impact of coronavirus on pro cycling rapidly… [+4415 chars]"}, {"source": {"id": null, "name": "Sandiegouniontribune.com"}, "author": "Phillip Molnar", "title": "Mortgage rates plummet. What it means for San Diego real estate - The San Diego Union-Tribune", "description": "Mortgage rates plummet. What it means for San Diego real estate The San Diego Union-Tribune Mortgage rates were already at record lows. Now they could go even lower CNN Coronavirus fears create mini mortgage refinance boom Yahoo Money Is it time to refinance?…", "url": "https://www.sandiegouniontribune.com/business/real-estate/story/2020-03-04/mortgage-rates-plummet-what-it-means-for-san-diego-real-estate", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/dd5115f/2147483647/strip/true/crop/2400x1260+0+170/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc2%2Ff0%2F5517d28d4e47a99a6b673e8cbffc%2F476249-sd-me-housing-prices-december-jbg-0230.jpg", "publishedAt": "2020-03-04T21:40:02Z", "content": "Worries about coronavirus have hammered stocks and sent investors fleeing to the safety of U.S. government debt.\r\nAnd that might be good news if youre looking for a mortgage. \r\nMortgage rates have plummeted in recent days, possibly making a home in the expens… [+4132 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Marvell Earnings Beat Q4 Target; MRVL Stock Surges - Investor's Business Daily", "description": "Chipmaker Marvell Technology beat Wall Street's targets for its fiscal fourth quarter. The Marvell earnings report sent MRVL stock higher.", "url": "https://www.investors.com/news/technology/marvell-earnings-q4-2020-mrvl-stock/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/03/Stock-Marvell-SSDcontroller04-company.jpg", "publishedAt": "2020-03-04T21:43:00Z", "content": "Chipmaker Marvell Technology Group (MRVL) late Wednesday beat Wall Street's targets for its fiscal fourth quarter and guided higher for the current period. The Marvell earnings report sent MRVL stock sharply higher in extended trading.\r\nXThe Santa Clara, Cali… [+3442 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Amil Bhatnagar", "title": "85 test positive for swine flu in Meerut", "description": "According to officials, some of the patients who died had low immunity, while one patient had meningitis. Swine flue was not a “causative” factor of the deaths, but merely aggravated the already present illnesses, officials said.", "url": "https://indianexpress.com/article/india/85-test-positive-for-swine-flu-in-meerut-6299763/", "urlToImage": "https://images.indianexpress.com/2020/03/swine-flu.jpg?w=759", "publishedAt": "2020-03-04T21:26:15Z", "content": "Written by Amil Bhatnagar\r\n | Noida | \r\nPublished: March 5, 2020 2:56:15 am\r\nMedical officers, however, say that the eight suffered from other diseases which was worsened by the flu.As many as 85 people have tested positive for swine flu in Meerut, of whom ei… [+2320 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Heather SCOTT", "title": "Fed says coronavirus causing disruptions, widespread concern", "description": "The coronavirus outbreak has already disrupted travel and access to goods for US industry, and businesses nationwide sounded the warning that things could get worse, the Federal Reserve said Wednesday. While activity in the world's largest economy continued t…", "url": "https://news.yahoo.com/fed-says-coronavirus-causing-disruptions-widespread-concern-212256988.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/93EtTvRgTDK64qi4mHNV_A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NTguMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/gU6fkf3jbOwDfbgFHxzIZQ--~B/aD00NTU7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/1685e6a04b8c70d7afe4136ce867837fc447eb99.jpg", "publishedAt": "2020-03-04T21:22:56Z", "content": "Washington (AFP) - The coronavirus outbreak has already disrupted travel and access to goods for US industry, and businesses nationwide sounded the warning that things could get worse, the Federal Reserve said Wednesday.\r\nWhile activity in the world's largest… [+3269 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Josh Barro", "title": "Economists Argue Over Whether Coronavirus Calls for a Fiscal Stimulus", "description": "The answer largely depends on how long one expects the virus to disrupt supply chains.", "url": "http://nymag.com/intelligencer/2020/03/does-coronavirus-call-for-fiscal-stimulus.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/03/03/04-aerial-highway.w1200.h630.jpg", "publishedAt": "2020-03-04T21:59:26Z", "content": "I wrote earlier this week about the Federal Reserves limited scope to help fight the economic drag from the coronavirus epidemic. The Fed is willing to help stimulate the economy and has already cut interest rates by half a point but monetary policy only matt… [+5500 chars]"}, {"source": {"id": null, "name": "Nikonrumors.com"}, "author": "[NR] admin", "title": "Just in: Nikon will not participate in NAB 2020 due to COVID-19", "description": "Nikon just issued an official statement that they will not participate in NAB 2020 due to COVID-19: Nikon and MRMC Will Not Participate in NAB 2020 Due to COVID-19 MELVILLE, NY – Nikon's first priority is always the health and safety of our employees, partner…", "url": "https://nikonrumors.com/2020/03/04/just-in-nikon-will-not-participate-in-nab-2020-due-to-covid-19.aspx/", "urlToImage": "https://nikonrumors.com/wp-content/uploads/2020/03/Nikon-will-not-participate-in-NAB-2020-due-to-COVID-19.png", "publishedAt": "2020-03-04T22:06:04Z", "content": "Nikon just issued an official statement that they will not participate in NAB 2020 due to COVID-19:Nikon and MRMC Will Not Participate in NAB 2020 Due to COVID-19\r\nMELVILLE, NY Nikon's first priority is always the health and safety of our employees, partners … [+280 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rebecca Alter", "title": "The Latest Victim of Coronavirus: Baby Yoda", "description": "The rapid spread of the virus has caused production delays for Hasbro in China.", "url": "http://www.vulture.com/2020/03/baby-yoda-production-may-be-delayed-due-to-coronavirus.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/vulture/2020/03/04/04-baby-yoda.w1200.h630.jpg", "publishedAt": "2020-03-04T21:33:19Z", "content": "Its as though the forces of the universe are conspiring to make sure we never get to cuddle a Baby Yoda of our very own. The Hollywood Reporterhas Hollywood-reported that Hasbro is experiencing coronavirus-related production difficulties in China, meaning tha… [+700 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Dividend Power", "title": "Becton, Dickinson: Dividend Aristocrat That's Down 20% In February", "description": "Becton, Dickinson is a Dividend Aristocrat having raised the dividend for 47 straight years.The dividend is well covered by earnings and free cash flow.The company is facing some challenges with the Alaris Pump Module.The stock price has been beaten down from…", "url": "https://seekingalpha.com/article/4329659-becton-dickinson-dividend-aristocrat-down-20-in-february", "urlToImage": "https://static.seekingalpha.com/uploads/2020/3/3/60842-1583264178287153.png", "publishedAt": "2020-03-04T22:02:10Z", "content": "Introduction and Thesis\r\nThere are a lot of stocks to write about these days. We entered the year with the US stock market arguably overvalued and setting new highs. But the coronavirus has pummeled the market creating bargains in some stocks. We may still ha… [+9841 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": null, "title": "The Way Back Director On Ben Affleck's Return And The Most Emotional Days On Set", "description": "Plus, discussion on the Coronavirus and its growing impact on Hollywood.", "url": "https://www.cinemablend.com/podcasts/the-way-back-director-on-ben-afflecks-return-and-the-most-emotional-days-on-set/2491381/", "urlToImage": "https://img.cinemablend.com/quill/5/1/2/8/b/c/5128bcf1be1286de42ad8d89fb8388ce39311c7f.png", "publishedAt": "2020-03-04T21:11:44Z", "content": "Ben Affleck has almost attained Patron Saint status on the ReelBlend podcast. Between our adoration of his portrayal of Batman to Kevins repeated praise of Afflecks work in the Kevin Smith comedies (and if you havent heard how Kevin got Ben to be in Jay and S… [+1385 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "GeekWire Staff", "title": "Coronavirus Live Updates: How the Seattle tech community is grappling with COVID-19", "description": "The latest about the impact of the novel coronavirus on Seattle and the technology industry. Follow @geekwire for updates. March 4, 2020, 2:00 p.m. — The Amazon employee who tested positive for COVID-19 and went home sick on Feb. 25 had dinner at Facebook’s S…", "url": "https://www.geekwire.com/2020/coronavirus-live-updates-seattle-tech-community-grappling-covid-19/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2019/02/seattleskyline2018-1260x817.jpg", "publishedAt": "2020-03-04T22:06:32Z", "content": "The Seattle skyline. (GeekWire Photo / Kurt Schlosser)\r\nThe latest about the impact of the novel coronavirus on Seattle and the technology industry. Follow @geekwire for updates.\r\nMarch 4, 2020, 2:00 p.m. The Amazon employee who tested positive for COVID-19 a… [+2924 chars]"}, {"source": {"id": null, "name": "Cyclingtips.com"}, "author": "wade wallace", "title": "Coronavirus and cycling: A continuously updated timeline of events", "description": "Supported by How is coronavirus affecting cycling? The news is moving fast. It feels like we’re posting a story every few hours on the subject, as national authorities, the UCI, teams, and race organizers respond. So we thought it’d be handy to put it all in …", "url": "https://cyclingtips.com/2020/03/coronavirus-and-the-cycling-world-a-continuously-updated-timeline-of-events/", "urlToImage": "https://cdn-cyclingtips.pressidium.com/wp-content/uploads/2020/02/Coronavirus-and-cycling.jpg", "publishedAt": "2020-03-04T21:22:05Z", "content": "How is coronavirus affecting cycling? The news is moving fast. It feels like we’re posting a story every few hours on the subject, as national authorities, the UCI, teams, and race organizers respond. So we thought itd be handy to put it all in one place. \r\nT… [+4954 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Yasemin Saplakoglu", "title": "The government has the power to shut down entire cities. But would that stop coronavirus? - Livescience.com", "description": "The government has the power to shut down entire cities. But would that stop coronavirus? Livescience.com Coronavirus: What are the symptoms, how it spreads and how to protect yourself CNBC What Is Children's Level of Risk For Coronavirus? Here's What You Nee…", "url": "https://www.livescience.com/how-possible-government-shutdowns-coronavirus.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fGT2XtNUcZ73JicZg8k8Hg-1200-80.jpg", "publishedAt": "2020-03-04T21:33:00Z", "content": "A once-bustling city at the heart of China is now a ghost town, with few people on the streets and drones flying above. Wuhan, China, the epicenter of the new coronavirus\r\n outbreak, has been under an unprecedented lockdown for the past month.\r\nAs the coronav… [+9325 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Etan Vlessing", "title": "Why Liberty Media CEO Isn’t Concerned About Coronavirus’ Impact on Live Concerts", "description": "Greg Maffei, who has a controlling stake in Live Nation Entertainment, told an investors conference he thinks the COVID-19 outbreak will be \"shorter rather than longer.\"", "url": "https://www.billboard.com/articles/business/touring/9328408/liberty-media-coronavirus-live-concerts", "urlToImage": "https://static.billboard.com/files/2020/03/greg-maffei-2017-u-billboard-1548-1583357895-1024x677.jpg", "publishedAt": "2020-03-04T22:03:48Z", "content": "Liberty Global CEO Greg Maffei on Wednesday told an investors conference about the impact from the rapidly-growing coronavirus outbreak on his varied global businesses, including Live Nation Entertainment and the Formula One race car series.\r\n\"You know, I'm n… [+1664 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "News Editors", "title": "Were coronavirus samples destroyed by China to cover up the outbreak?", "description": "(Natural News) Since the outbreak of Coronavirus in Wuhan, the Chinese Communist Party has concealed the epidemic from the local government to the central government and shirked from its responsibility. Recently, Caixin, a Beijing-based media group published …", "url": "https://www.naturalnews.com/2020-03-04-were-coronavirus-samples-destroyed-by-china-to-cover-up-the-outbreak.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Coronavirus-Virus-China-Flag.jpg", "publishedAt": "2020-03-04T21:41:45Z", "content": null}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Bess Levin", "title": "Trump Waited A Whole Week Before Blaming the Coronavirus On Obama", "description": "Apparently it’s Barack Obama’s fault Trump’s response to the pandemic has been an utter joke.", "url": "https://www.vanityfair.com/news/2020/03/donald-trump-coronavirus-obama-fault", "urlToImage": "https://media.vanityfair.com/photos/5e6022abb639f40008e09675/16:9/w_1280,c_limit/donaldtrumpbarackobamacoronavirus.jpg", "publishedAt": "2020-03-04T21:56:00Z", "content": "In a life filled with uncertainty, there are a few things we can always count on. One, that death spares no one. Two, that Jared and Ivanka will find a way to profit off of their government positions while maintaining they sacrificed everything to join the ad… [+3474 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "I’M A FAN OF VITAMIN D, BUT I’M SKEPTICAL OF THESE RECOMMENDATIONS: Coronavirus update: Sun exposur…", "description": "I’M A FAN OF VITAMIN D, BUT I’M SKEPTICAL OF THESE RECOMMENDATIONS: Coronavirus update: Sun exposure can keep you safe, says Unicef.", "url": "https://pjmedia.com/instapundit/360313/", "urlToImage": null, "publishedAt": "2020-03-04T22:00:04Z", "content": "I’M A FAN OF VITAMIN D, BUT I’M SKEPTICAL OF THESE RECOMMENDATIONS: Coronavirus update: Sun exposure can keep you safe, says Unicef.\r\nPosted by Glenn Reynolds at 5:00 pm"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Dilantha De Silva", "title": "Carnival: Learn From Historical Market Routs And Buy", "description": "Amidst the spreading of the new coronavirus, travel sector stocks have received a beating.There's no question about this epidemic leading to lower-than-expected results in the first half of this year.A study of the dotcom bubble and the financial crisis gives…", "url": "https://seekingalpha.com/article/4329645-carnival-learn-from-historical-market-routs-and-buy", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/3/4/49736731-15833254163290274.png", "publishedAt": "2020-03-04T21:33:31Z", "content": "Source\r\nAfter considering a few starting lines for this analysis, I decided to let Peter Lynch do that for me. In his book One Up On Wall Street, Lynch said:\r\nAbsent a lot of surprises, stocks are relatively predictable over twenty years. As to whether they a… [+15008 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Astha Saxena", "title": "Disposable food containers to ludo and table tennis: Life at the ITBP facility", "description": "Being isolated for 14 days, the patient tends to get restless, so there is a facility for entertainment. From having a common area for watching TV to playing ludo and table tennis, the facility offers a host of activities.", "url": "https://indianexpress.com/article/cities/delhi/disposable-food-containers-to-ludo-and-table-tennis-life-at-the-itbp-facility-6299777/", "urlToImage": "https://images.indianexpress.com/2020/02/china-coronavirus-759.jpg?w=759", "publishedAt": "2020-03-04T21:23:29Z", "content": "Written by Astha Saxena\r\n | New Delhi | \r\nUpdated: March 5, 2020 2:54:22 am\r\nThe first confirmed case of novel coronavirus was reported from Delhi on Wednesday, with a 45-year-old man with a travel history to Italy testing positive for the virus. (File/AP)A t… [+2508 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Sky Palma", "title": "LAX medical screener tests positive for coronavirus: report", "description": "According to a report from NBC News, a medical professional in charge of passenger screenings at Los Angeles International airport has tested positive for the coronavirus on Tuesday night. A statement released from the Department of Homeland Security said the…", "url": "https://www.rawstory.com/2020/03/lax-medical-screener-tests-positive-for-coronavirus-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/shutterstock_1618125826.jpg", "publishedAt": "2020-03-04T21:40:54Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Georgia Slater", "title": "Pregnant Nikki Bella Shows Off Baby Bump Topless at 18 Weeks While Discussing Gray Hair and Skin Changes", "description": "Nikki Bella is getting candid about how her body is changing during pregnancy. The Total Bellas star, 36, shared a series of intimate photos and videos to her Instagram Story on Wednesday, showing off her growing baby bump at 18 weeks along and how other part…", "url": "https://people.com/parents/nikki-bella-pregnant-topless-baby-bump-18-weeks-hair-skin/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fscreen-shot-2020-03-04-at-10.23.42-am.jpg%3Fcrop%3D0px%2C300px%2C1080px%2C566px%26resize%3D1200%2C630", "publishedAt": "2020-03-04T22:01:13Z", "content": "Nikki Bella is getting candid about how her body is changing during pregnancy.\r\nThe Total Bellas star, 36, shared a series of intimate photos and videos to her Instagram Story on Wednesday, showing off her growing baby bump at 18 weeks along and how other par… [+3056 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Sophie Scott And Nick Sas", "title": "The 'outbreak kits' our aged care homes have ready for coronavirus", "description": "Aged care facilities across Australia are being told to look at quarantines and visitation bans as the threat of coronavirus against the country's most vulnerable intensifies.", "url": "https://www.abc.net.au/news/2020-03-05/aged-care-facilities-coronavius-covid19-infection-response/12024516", "urlToImage": "https://www.abc.net.au/news/image/12026400-16x9-700x394.jpg", "publishedAt": "2020-03-04T21:46:51Z", "content": "Updated \r\nMarch 05, 2020 09:01:23\r\nRon and Jan Hallett reckon they've never seen anything quite like it.\r\n\"This coronavirus certainly is a concern,\" Ron, 86, told the ABC. \r\n\"If the disease spreads any further, there'd need to be much more care taken for peop… [+4070 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ben Pearson", "title": "‘The New Mutants’ and ‘A Quiet Place Part II’ Officially Receive PG-13 Ratings", "description": "The lords and ladies of the mysterious MPAA have emerged from their castle on high to peer down and toss a pair of ratings to two upcoming movies. (I’m pretty sure that’s how the rating system works. Don’t fact check that.) 20th Century Studios’ long-delayed …", "url": "https://www.slashfilm.com/the-new-mutants-a-quiet-place-part-2-rating/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/The-New-Mutants-A-Quiet-Place-2-PG-13-Ratings.jpg", "publishedAt": "2020-03-04T22:00:34Z", "content": "The lords and ladies of the mysterious MPAA have emerged from their castle on high to peer down and toss a pair of ratings to two upcoming movies. (I’m pretty sure that’s how the rating system works. Don’t fact check that.) 20th Century Studios’ long-delayed … [+2641 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Monkey Miles", "title": "Best credit cards for coronavirus stockpiling – earn up to 7.5x", "description": "Best credit cards for coronavirus stockpiling - earn up to 7.5x The post Best credit cards for coronavirus stockpiling – earn up to 7.5x appeared first on Monkey Miles.", "url": "https://monkeymiles.boardingarea.com/best-credit-card-coronavirus-stockpiling/", "urlToImage": "https://monkeymiles.boardingarea.com/wp-content/uploads/2019/02/americanexpressgoldcard.png", "publishedAt": "2020-03-04T22:09:39Z", "content": "We may receive a commission when you use our links. Monkey Miles has partnered with CardRatings for our coverage of credit card products. Monkey Miles and CardRatings may receive a commission from card issuers. Opinions, reviews, analyses &amp; recommendation… [+5199 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "Alan Boyle", "title": "UW Medicine ramps up a new coronavirus lab test for up to 1,500 samples a day", "description": "The University of Washington School of Medicine is moving forward with a new clinical lab test for the COVID-19 coronavirus, and plans to be able to test up to 1,500 samples per day by the end of the week. Implementation of the test, which will be available o…", "url": "https://www.geekwire.com/2020/uw-medicine-ramps-new-coronavirus-lab-test-mass-distribution/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2020/03/200304-coronavirus2-1260x709.jpg", "publishedAt": "2020-03-04T21:16:25Z", "content": "A new lab test to detect the COVID-19 coronavirus is ready for prime time. (UW Medicine via YouTube)\r\nThe University of Washington School of Medicine is moving forward with a new clinical lab test for the COVID-19 coronavirus, and plans to be able to test up … [+3572 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Adam Silverstein", "title": "2020 Masters to proceed as scheduled while Augusta National monitors coronavirus outbreak", "description": "Augusta National Golf Club will continue monitoring coronavirus and take requisite precautions", "url": "https://www.cbssports.com/golf/news/2020-masters-to-proceed-as-scheduled-while-augusta-national-monitors-coronavirus-outbreak/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2019/04/14/f0dff41e-a4d1-4ac3-b25a-5dedd545f8fa/thumbnail/1200x675/ea0d89c64ce17c99c974fdcea0b3e78f/usatsi-12497278-hogan-bridge-2019-masters-practice-1400.jpg", "publishedAt": "2020-03-04T21:19:08Z", "content": "Augusta National Golf Club formally announced Wednesday that the 2020 Masters -- along with the Augusta National Women's Amateur and Drive, Chip and Putt National Finals -- will proceed as scheduled in the ensuing weeks following conversations with experts ab… [+1682 chars]"}, {"source": {"id": null, "name": "Golfdigest.com"}, "author": "Joel Beall", "title": "2020 Masters: Augusta National issues statement on coronavirus", "description": "Augusta National Golf Club issued a statement on Wednesday afternoon regarding its preparation for the 2020 Masters in the face of growing concerns of the coronavirus.", "url": "https://www.golfdigest.com/story/2020-masters-augusta-national-issues-statement-on-coronavirus", "urlToImage": "https://media.golfdigest.com/photos/5e601e5566c3660008d5f914/master/pass/GettyImages-1133663871.jpg", "publishedAt": "2020-03-04T21:34:19Z", "content": "Augusta National Golf Club issued a statement on Wednesday afternoon regarding its preparation for the 2020 Masters in the face of growing concerns of the coronavirus.\r\nWith the tournament five weeks away, Augusta National chairman Fred Ridley reassured fans … [+1901 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Number of Coronavirus Cases Outside China Reaches 12,668, WHO Says", "description": "Globally, coronavirus cases have been registered in at least 76 countries, with Italy, Iran, and South Korea affected the most by the new disease outside China.", "url": "https://sputniknews.com/world/202003041078477110-number-of-coronavirus-cases-outside-china-reaches-12668-who-says/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107847/70/1078477079.jpg", "publishedAt": "2020-03-04T21:38:40Z", "content": "Globally, coronavirus cases have been registered in at least 76 countries, with Italy, Iran, and South Korea affected the most by the new disease outside China.The number of people who have been infected with novel coronavirus (COVID-19) outside China has rea… [+1342 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "News Editors", "title": "Leftists angry at Trump donating salary to coronavirus fight", "description": "(Natural News) “Hitler Never Took A Salary” President Trump donated his fourth quarter salary to the Department of Health and Human Services this week in an effort to help fight the Coronavirus, but leftists are angry about it because… Orange man bad. (Articl…", "url": "https://www.naturalnews.com/2020-03-04-leftists-angry-at-trump-donating-salary-to-coronavirus-fight.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/03/Chemical-Research-Weapon-Lab-Medicine-Chemistry-Concept.jpg", "publishedAt": "2020-03-04T21:42:13Z", "content": null}, {"source": {"id": null, "name": "Healthcare-economist.com"}, "author": "Jason Shafrin", "title": "LA Declares State of Emergency", "description": "As COVID-19 spread, the city and county of Los Angeles have responded with a declaration of the state of emergency. NPR reports: Los Angeles declared a health emergency over the coronavirus Wednesday, citing the need to address the possibility of community tr…", "url": "https://www.healthcare-economist.com/2020/03/04/la-declares-state-of-emergency/", "urlToImage": null, "publishedAt": "2020-03-04T21:40:23Z", "content": "As COVID-19 spread, the city and county of Los Angeles have responded with a declaration of the state of emergency. NPR reports: Los Angeles declared a health emergency over the coronavirus Wednesday, citing the need to address the possibility of community tr… [+1446 chars]"}, {"source": {"id": null, "name": "Livejournal.com"}, "author": "crazyfirecrotch", "title": "Summer Walker Accused of 'Racist Propaganda' for Sharing Fake News About Coronavirus", "description": "Summer Walker Accused of 'Racist Propaganda' for Sharing Fake News About Coronavirus https://t.co/Su4J9sXrQM — AceShowbiz (@aceshowbiz) March 4, 2020 As the coronavirus spreads across the United States, the hate Asian Americans are getting is rising. R & B Si…", "url": "https://ohnotheydidnt.livejournal.com/117342167.html", "urlToImage": "https://l-files.livejournal.net/og_image/3616053/458367?v=1583357776", "publishedAt": "2020-03-04T21:36:15Z", "content": "Summer Walker Accused of 'Racist Propaganda' for Sharing Fake News About Coronavirus https://t.co/Su4J9sXrQM\r\n— AceShowbiz (@aceshowbiz) March 4, 2020\r\nAs the coronavirus spreads across the United States, the hate Asian Americans are getting is rising. R &amp… [+1596 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "GENE JOHNSON, RACHEL LA CORTE, MARTHA BELLISLE", "title": "US coronavirus death toll rises to 11 with California victim", "description": "The US death toll from the coronavirus climbed to 11 on Wednesday with a victim succumbing in California — the nation’s first reported fatality outside Washington state — as officials, schools, and businesses came under pressure to respond more aggressively t…", "url": "https://www.bostonglobe.com/2020/03/04/nation/us-virus-death-toll-rises-11-with-california-victim/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/Mecym0qOwG72wrCe_eF5Bc0a3hQ=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/KXNNNY5EABHMJKELKQUFYDBZLU.jpg", "publishedAt": "2020-03-04T21:43:39Z", "content": "SEATTLE (AP) The US death toll from the coronavirus climbed to 11 on Wednesday with a victim succumbing in California the nations first reported fatality outside Washington state as officials, schools, and businesses came under pressure to respond more aggres… [+4933 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Matt Posky", "title": "Hyundai Shares Its Prophecy With the World", "description": "While prophecies have a habit of coming true in films and books, they rarely come to pass here in reality. Sadly, this will probably be the case with Hyundai’s new concept EV — appropriately named the Prophecy. Responding to a voicemail left by the God of Ele…", "url": "https://www.thetruthaboutcars.com/2020/03/hyundai-shares-its-prophecy-with-the-world/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2020/03/Large-40359-ProphecyConceptEV-610x335.jpg", "publishedAt": "2020-03-04T21:45:27Z", "content": "While prophecies have a habit of coming true in films and books, they rarely come to pass here in reality. Sadly, this will probably be the case with Hyundai’s new concept EV â\u0080\u0094 appropriately named the Prophecy.\r\nResponding to a voicemail left by the God of … [+3257 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US House Passes $8.3 Billion Emergency Bill for Coronavirus Response", "description": "WASHINGTON (Sputnik) - The House of Representatives overwhelmingly passed an $8.3 billion emergency funding bill to help contain the novel coronavirus outbreak in the United States.", "url": "https://sputniknews.com/us/202003041078477269-us-house-passes-83-billion-emergency-bill-for-coronavirus-response/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107847/72/1078477284.jpg", "publishedAt": "2020-03-04T22:01:24Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US Lawmakers Reach Deal to Provide $7.8 Billion to Combat Coronavirus", "description": "WASHINGTON (Sputnik) - Congressional leaders have reached a deal to support a bipartisan bill that would provide $7.8 billion in emergency funds to combat the novel coronavirus outbreak in the United States, the text of the legislation revealed on Wednesday.", "url": "https://sputniknews.com/us/202003041078476976-us-lawmakers-reach-deal-to-provide-78-billion-to-combat-coronavirus/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107846/58/1078465807.jpg", "publishedAt": "2020-03-04T21:14:19Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "MICHAEL R. SISAK, JENNIFER PELTZ", "title": "9 people with ties to N.Y. patient test positive for coronavirus", "description": "Health officials seeking to prevent the spread of the new coronavirus in New York state focused Wednesday on a suburban community where nine people connected with a lawyer hospitalized with the disease have now tested positive.", "url": "https://www.bostonglobe.com/2020/03/04/nation/9-people-with-ties-ny-patient-test-positive-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/WlOmNjF1BfqZZ8XWIvFJSpji1s0=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/MWJGLRI3WJAKVOWBC6PPLLM5TE.jpg", "publishedAt": "2020-03-04T21:58:58Z", "content": "Cuomo said people who've come into contact with them will be tested and should sequester themselves in their homes. They include eight people who worked with the lawyer and his wife at their law firm and hospital workers who treated him, as well as the neighb… [+4724 chars]"}]