[{"source": {"id": "mashable", "name": "Mashable"}, "author": "Erica Bahrenburg", "title": "Airports around the world are empty because of coronavirus", "description": "The International Air Transport Association puts losses anywhere from $63 billion to $113 billion. Read more... More about Travel, Mashable Video, Airports, Health And Safety, and Coronavirus", "url": "https://mashable.com/video/empty-airports-because-of-coronavirus/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252F25%252F679139657ed9450ba25d10afffd29685.a5d85.png%252F1200x630.png?signature=JddC-PrDXCPqnZdMTUoSA8L316A=", "publishedAt": "2020-03-06T19:23:30Z", "content": null}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Erica Bahrenburg", "title": "Beware of cybercriminals who are taking advantage of coronavirus fears with fake websites and phishing schemes", "description": "The best way to protect yourself is to be wary of lookalike URLs and email addresses, and to not open attachments or download anything from an unfamiliar source. Read more... More about Mashable Video, Cybersecurity, Phishing, Cybercrime, and Coronavirus", "url": "https://mashable.com/video/cybercriminals-coronavirus-hacks/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252Ff7%252F840caedb2fa4444dbc267fed4e68ba5f.c04c8.png%252F1200x630.png?signature=s63C8_2aafg9bqwD2rwa_zaykTg=", "publishedAt": "2020-03-06T19:21:17Z", "content": null}, {"source": {"id": null, "name": "Blog.google"}, "author": "Sundar PichaiCEO of Google and Alphabet", "title": "Coronavirus: How we’re helping", "description": "Note: The following is based on an email to employees that Sundar sent earlier today. As COVID-19 makes its way across the globe, it’s affecting our communities in different ways. Many in Europe and the Americas are just now beginning to experience what peopl…", "url": "https://www.blog.google/inside-google/company-announcements/coronavirus-covid19-response/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+blogspot%2FMKuf+%28The+Keyword+%7C+Official+Google+Blog%29", "urlToImage": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/20200306_cv_header_autocomplete_grey.max-1300x1300.png", "publishedAt": "2020-03-06T20:05:00Z", "content": "Note: The following is based on an email to employees that Sundar sent earlier today.\r\nAs COVID-19 makes its way across the globe, its affecting our communities in different ways. Many in Europe and the Americas are just now beginning to experience what peopl… [+1799 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Tim Marcin", "title": "Congressman's viral tweet calls out House's double standard", "description": "Democratic Illinois Rep. Bobby Rush called out a double standard he saw on the House floor this week. Republican Rep. Matt Gaetz from Florida wore a gas mask on the House floor in some sort of coronavirus stunt. Rush took that opportunity to recall a time he …", "url": "https://mashable.com/article/viral-gas-mask-hoodie-tweet/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F06%252F5d%252F4d1eb621a195437dbbf7aa2c76376396.5ed58.jpg%252F1200x630.jpg?signature=P6Z8YWurf1MLYbeN_bnw6XSSrRI=", "publishedAt": "2020-03-06T19:12:10Z", "content": "Democratic Illinois Rep. Bobby Rush called out a double standard he saw on the House floor this week.\r\nRepublican Rep. Matt Gaetz from Florida wore a gas mask on the House floor in some sort of coronavirus stunt. Rush took that opportunity to recall a time he… [+2157 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Brad Heath", "title": "Americans divided on party lines over risk from coronavirus: Reuters/Ipsos poll", "description": "Americans who now find themselves politically divided over seemingly everything are now forming two very different views of another major issue: the dangers of the new coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-polarization-idUSKBN20T2O3", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499692855&w=1200&r=LYNXMPEG251UV", "publishedAt": "2020-03-06T19:24:38Z", "content": "WASHINGTON (Reuters) - Americans who now find themselves politically divided over seemingly everything are now forming two very different views of another major issue: the dangers of the new coronavirus. \r\nDemocrats are about twice as likely as Republicans to… [+5051 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Simon Little", "title": "B.C. premier, health officials to provide update on COVID-19 - Global News", "description": "B.C. premier, health officials to provide update on COVID-19 Global News U.S. refuses more than 100 people from Canada over COVID-19 concerns CBC News B.C. identifies 8 new COVID-19 infections, including a 'community case' CTV News Coronavirus outbreak: Canad…", "url": "http://globalnews.ca/news/6641644/b-c-coronavirus-covid-19-update/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/cpt13050375-1.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-06T19:28:25Z", "content": "B.C.’s premier and top health officials are scheduled to provide an update on the province’s preparations for COVID-19 on Friday.\r\nThe event is scheduled for noon. Global News will stream the event live.\r\nREAD MORE: \r\nB.C. identifies 8 new COVID-19 cases, one… [+771 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Olivia Bowden", "title": "Do you think you have coronavirus symptoms? Here’s who to call first - Global News", "description": "Do you think you have coronavirus symptoms? Here’s who to call first Global News Losing our touch? Some alternative greetings amid coronavirus fears Toronto Star 4 more positive cases of COVID-19 discovered in Ontario CBC.ca Three new cases of COVID-19 confir…", "url": "http://globalnews.ca/news/6640386/coronavirus-symptoms/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/covid-19-airport.png?w=720&h=379&crop=1", "publishedAt": "2020-03-06T19:24:50Z", "content": "As of March 6, a total of 45 confirmed cases of COVID-19 have been confirmed in Canada, with most occurring in Ontario and B.C.\r\nHealth officials are continuing to grapple with the new cases and are preparing for the possibility of an outbreak similar to the … [+6293 chars]"}, {"source": {"id": null, "name": "Taskandpurpose.com"}, "author": "pszoldra@businessinsider.com (Paul Szoldra), Paul Szoldra", "title": "A reunion for veterans of the battle of Iwo Jima has been canceled over coronavirus fears", "description": "Joe Rosenthal/AP A reunion of surviving veterans of the battle for Iwo Jima during World War II has been canceled over concerns about the spread of coronavirus. The event, which has taken place annually since 1980, has only been canceled once before, after a …", "url": "https://taskandpurpose.com/news/coronavirus-cancels-iwo-jima-reunion", "urlToImage": "https://i.insider.com/5c6c21612628985fcb2e9ac5?width=1200&format=jpeg", "publishedAt": "2020-03-06T19:17:06Z", "content": "The Marine Corps has canceled a reunion of surviving Iwo Jima veterans set to take place later this month on the small Japanese island over coronavirus fears, Task &amp; Purpose has learned.\r\nThe event marking the 75th anniversary of the 1945 Battle of Iwo Ji… [+3531 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Use This Website to Stop Touching Your Damn Face With Your Virus Hands", "description": "I love simple little utilities that help you change your behavior for the better—Pomodoro; all those apps that remind you to drink water; and, now, good ol’ “Do Not Touch Your Face” dot com. Read more...", "url": "https://lifehacker.com/use-this-website-to-stop-touching-your-damn-face-with-y-1842154454", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ysgtj1jqhnvgyrj3htu3.png", "publishedAt": "2020-03-06T20:00:00Z", "content": "I love simple little utilities that help you change your behavior for the betterPomodoro; all those apps that remind you to drink water; and, now, good ol Do Not Touch Your Face dot com.\r\nFor those who are terrified of the Coronavirus, or just want to practic… [+1664 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. excludes Chinese face masks, medical gear from tariffs as coronavirus spreads", "description": "The U.S. Trade Representative's office in recent days granted exclusions from import tariffs for dozens of medical products imported from China, including face masks, hand sanitizing wipes and examination gloves, filings with the agency showed on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-tariffs-idUSKBN20T2ON", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499695782&w=1200&r=LYNXMPEG251V1", "publishedAt": "2020-03-06T19:32:20Z", "content": "WASHINGTON (Reuters) - The U.S. Trade Representative’s office in recent days granted exclusions from import tariffs for dozens of medical products imported from China, including face masks, hand sanitizing wipes and examination gloves, filings with the agency… [+1269 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "eBay Bans Sales of Face Masks, Hand Sanitizer Amid Coronavirus Price Gouging", "description": "As the COVID-19 outbreak continues to spread in the US and other countries, demand for products like face masks and hand sanitizer has led to a spike in prices. To combat price gouging, online retailer eBay is banning some listings related to the coronavirus.…", "url": "https://slashdot.org/story/20/03/06/1926217/ebay-bans-sales-of-face-masks-hand-sanitizer-amid-coronavirus-price-gouging", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2020-03-06T19:50:00Z", "content": "The deal is that many states have declared an official state of emergency, so laws kick in regarding price gouging.\r\nIt's not that they care, it's just that eBay does not want to get rolled up into a potential lawsuit. Plus, eBay has already made most of the … [+126 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kathryn Krawczyk", "title": "China's coronavirus recovery is 'all fake,' whistleblowers and residents claim", "description": "China's claims of how it's handling coronavirus recovery should be taken with more than a few grains of salt.Even before COVID-19 became a global crisis, Chinese leaders had been criticized for their handling of the situation and lack of transparency about th…", "url": "https://news.yahoo.com/chinas-coronavirus-recovery-fake-whistleblowers-191300391.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Is4FW7ZWBsW8nTBPNWcG5w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/oi.9dwYqlaAiT333B6qnqg--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/f4f3e7d4de2129bba81c003b6a6e1250", "publishedAt": "2020-03-06T19:13:00Z", "content": "China's claims of how it's handling coronavirus recovery should be taken with more than a few grains of salt.\r\nEven before COVID-19 became a global crisis, Chinese leaders had been criticized for their handling of the situation and lack of transparency about … [+1757 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Which States Have Reported Cases of the Coronavirus?", "description": null, "url": "https://news.yahoo.com/states-reported-cases-coronavirus-192512514.html", "urlToImage": null, "publishedAt": "2020-03-06T19:25:12Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "In Canada, doctors broadened coronavirus testing, and made an unlikely save", "description": "Canada's official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to Iran before the scale…", "url": "https://news.yahoo.com/canada-doctors-broadened-coronavirus-testing-191448079.html", "urlToImage": null, "publishedAt": "2020-03-06T19:14:48Z", "content": null}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Amanda Maile, Mina Kaji, Mychael Schnell, Nathan Luna", "title": "Book the window seat: How to stay healthy when flying amid outbreak", "description": "U.S. airlines are taking steps to stop the spread of the new coronavirus by working to keep planes clean and experts have advice on how passengers can avoid getting sick.", "url": "https://abcnews.go.com/Politics/book-widow-seat-stay-healthy-flying-amid-coronavirus/story?id=69363272", "urlToImage": "https://s.abcnews.com/images/US/empty-plane-gty-ps-200305_hpMain_16x9_992.jpg", "publishedAt": "2020-03-06T19:40:13Z", "content": "As the new coronavirus outbreak continues, U.S. airlines are taking steps to stop the spread by working to keep planes clean and experts have advice for passengers on how to avoid getting sick.\r\nWhen booking your next trip, experts say, select the window seat… [+2990 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Apple proposes Cupertino employees work from home during coronavirus outbreak", "description": "Employees at Apple's California campuses are told to work from home as an &quot;extra precaution&quot; during the ongoing outbreak of the 2019 Novel Coronavirus.", "url": "https://appleinsider.com/articles/20/03/06/apple-proposes-cupertino-employees-work-from-home-during-coronavirus-outbreak", "urlToImage": "https://photos5.appleinsider.com/gallery/34804-63129-apppark-xl.jpg", "publishedAt": "2020-03-06T19:26:42Z", "content": "Employees at Apple's California campuses are told to work from home as an \"extra precaution\" during the ongoing outbreak of the 2019 Novel Coronavirus.Apple has begun encouraging it's Apple Park and Infinite Loop-based employees to work from home if possible,… [+1032 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Alex Norcia, Maxwell Strachan", "title": "Coronavirus Will Hit American Hourly Workers Extra Hard", "description": "The very things people need to do to stop the spread of COVID-19 could prove particularly difficult for the country's most vulnerable workers.", "url": "https://www.vice.com/en_us/article/k7exne/coronavirus-will-hit-american-hourly-workers-extra-hard", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e629b68da72d7009cc87f1c/lede/1583522711192-GettyImages-1134626900.jpeg?crop=1xw:0.8413xh;0xw,0.0026xh&resize=1200:*", "publishedAt": "2020-03-06T19:18:04Z", "content": "Americans everywhere are starting to panic about the recent outbreak of coronavirus, otherwise known as COVID-19. Families are hoarding food and other supplies. Companies are encouraging their employees to work for home. And people are wondering what life wil… [+3823 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sam Stein", "title": "Prominent Jewish Groups Cancel Israel Trips Over Coronavirus", "description": "Two prominent U.S.-based Israeli advocacy groups are scuttling planned trips to Israel amid concerns about the 2019 novel coronavirus. Both AIPAC and J Street had been set to send groups to Israel and the surrounding region in the coming weeks. But those plan…", "url": "https://news.yahoo.com/prominent-jewish-groups-cancel-israel-195347098.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Fi3R71PY3vFreyeHjmXkdA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/_Nj1OTLvugWIOXiDUuwL8g--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/d811d3075fbcf0fadff3aacb0d63d922", "publishedAt": "2020-03-06T19:53:47Z", "content": "Getty\r\nTwo prominent U.S.-based Israeli advocacy groups are scuttling planned trips to Israel amid concerns about the 2019 novel coronavirus. \r\nBoth AIPAC and J Street had been set to send groups to Israel and the surrounding region in the coming weeks. But t… [+2077 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Muhammad Jarir Kanji", "title": "Xiaomi's Mi 10 is slated for global launch on March 27", "description": "The event will be live streamed. What you need to know Xiaomi has finally revealed its plans for the global launch of the Mi 10 and Mi 10 Pro. The phones' launch was delayed due to the cancellation of MWC 2020. The launch event will now take place on March 27…", "url": "https://www.androidcentral.com/xiaomis-mi-10-slated-global-launch-march-27", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2020/02/xiaomi-mi-10-pro.jpg?itok=H3nU0RnX", "publishedAt": "2020-03-06T19:49:58Z", "content": "Owing to the growing severity of the coronavirus pandemic, the biggest mobile showcase of the year has been canceled. And as MWC 2020 went down in flames, so too did most phone makers' meticulously planned launches of their latest wares.\r\nAmong those affected… [+1230 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "This researcher learned how \"triangulation fraud\" works when she bought a used Nespresso machine", "description": "Nina Kollars is a professor at the Naval War College inside the Strategic and Operational Research Department. Here she is at DEF CON 27 explaining how she learned about triangulation fraud when she started buying Nespresso pods on eBay at a discount. Not onl…", "url": "https://boingboing.net/2020/03/06/this-researcher-learned-how.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/Screen-Shot-2020-03-06-at-11.12.02-AM.jpg?fit=700%2C385&ssl=1", "publishedAt": "2020-03-06T19:13:44Z", "content": "Criminals are tricking people who want to buy protective masks In the United Kingdom, vulnerable people who are afraid of coronavirus have lost more than 800,000 british pounds ($1 million in US dollars) to coronavirus scams in the last month.\r\nRather than pa… [+1700 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Zachary Boddy", "title": "The Forza Monthly live stream is cancelled because of the coronavirus", "description": "Another event bites the dust. What you need to know Forza holds a monthly livestream to talk about new seasonal events, updates, and more. This month, Forza is cancelling their live stream due to the recent coronavirus outbreak. The virus is now in Seattle, a…", "url": "https://www.windowscentral.com/marchs-forza-monthly-live-stream-event-cancelled-due-coronavirus", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2018/09/forza-horizon-4-release-5.jpg?itok=0NVvjP4G", "publishedAt": "2020-03-06T20:03:37Z", "content": "The coronavirus (COVID-19) is showing little intent to slow down, and companies far and wide are responding in kind by cancelling or postponing events. The Forza Monthly livestream is the latest to succumb, and will not be taking place this month. Forza cited… [+1204 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Charles Pulliam-Moore", "title": "Emerald City Comic Con Is Officially Delayed Due to Coronavirus Worries", "description": "As more and more people announced their plan to skip Emerald City Comic Con because of concerns regarding COVID-19, one of the biggest questions on everyone’s minds was whether the convention would actually go on as planned next week. While ECCC isn’t being c…", "url": "https://io9.gizmodo.com/emerald-city-comic-con-is-officially-delayed-due-to-cor-1842158458", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/kxtxezixkg9tehrhl6hp.png", "publishedAt": "2020-03-06T19:22:00Z", "content": "As more and more people announced their plans to skip Emerald City Comic Con because of concerns regarding COVID-19, one of the biggest questions on everyones minds was whether the convention would actually go on as planned next week. While ECCC isnt being ca… [+1922 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA tests telecommute plan amid coronavirus worries", "description": "NASA is testing a telework day for many employees today (March 6) to prepare for a scenario in which the coronavirus outbreak gets much worse.", "url": "https://www.space.com/nasa-coronavirus-work-from-home-protocol-test.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3fXhf5sMHpz3fPQ7kKr8cf-1200-80.jpg", "publishedAt": "2020-03-06T20:00:47Z", "content": "NASA is testing a telework day for many employees today (March 6) to prepare for a scenario in which the coronavirus outbreak gets much worse, the agency said on its website.\r\nNASA along with the U.S. Air Force, according to Politico\r\n is running the test as … [+3637 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Jacob Passy", "title": "Should I cancel my flight? Will recirculated air on a plane spread coronavirus? Here’s what you need to know before traveling", "description": "Travelers mull over plans in light of COVID-19. Some are going ahead, while others are staying home. ‘My trip is not as important as someone else’s health.’", "url": "http://www.marketwatch.com/story/should-i-cancel-my-flight-will-recirculated-air-on-a-plane-spread-coronavirus-heres-what-you-need-to-know-before-traveling-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB677_emptya_ZG_20200306141315.jpg", "publishedAt": "2020-03-06T19:50:34Z", "content": "Judi LiVigni was supposed to fly from New York to San Diego last week to visit her brother, who she usually sees only once a year. But the day of her flight, she chose to cancel her trip because of concerns regarding the coronavirus outbreak. LiVigni, a 51-ye… [+8959 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "Why Do Diseases Keep Coming Out Of China?", "description": "Why is China such a hotspot for epidemics? And was the coronavirus inevitable?", "url": "https://digg.com/video/why-do-diseases-keep-coming-out-of-china", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/03/06151300/Screen-Shot-2020-03-06-at-10.12.35-AM.jpg", "publishedAt": "2020-03-06T19:42:02Z", "content": "\"I had a bet against one of my good friends, D Wade, Milwaukee versus the Heat,\" the former NBA star explained. \"I said Milwaukee was gonna win by 20 and the Heat won. I said, 'Well, what do you want me to do, pay you?' And he said, 'Nah, you gotta let your h… [+14 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Áine Cain)", "title": "eBay is forbidding new listings of hand sanitizer and face masks over concerns of online price gouging due to the coronavirus", "description": "eBay will now \"block new listings and start to remove listings\" for N95 masks, N100 masks, surgical masks, hand sanitizer, and disinfecting wipes.", "url": "https://news.yahoo.com/ebay-forbidding-listings-hand-sanitizer-193830273.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5SOLB5AapqqFl7rkD_vdOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/x1OxHY1sebRIAUSnx_PVkw--~B/aD0xNjY1O3c9MjIyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/ab4a729217a934c0c54754230848c6bf", "publishedAt": "2020-03-06T19:38:30Z", "content": "\"We are making every effort to ensure that anyone who sells on our platform follows local laws and eBay policies,\" a company spokesperson said in a statement to Business Insider.\r\nCrystal Cox/Business Insider\r\n<ul><li>eBay is prohibiting sales of specialized … [+2669 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: Indiana, Pennsylvania confirm first cases as global total tops 100,000 - CNET", "description": "Here's the latest on the COVID-19 outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-indiana-pennsylvania-confirms-cases-as-global-total-tops-100000/", "urlToImage": "https://cnet3.cbsistatic.com/img/Ps4pNNwmdQEJ3WpUS-fEpRv9suU=/756x567/2020/03/03/d3e555ce-f996-491f-8f5a-303e9516ddb1/gettyimages-1203669279.jpg", "publishedAt": "2020-03-06T19:15:00Z", "content": "Coronavirus has spread across every continent, except Antarctica, in three months, leaving some cities empty and silent.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a coronavirus first detected in China in December, has rapidly spread across… [+25024 chars]"}, {"source": {"id": null, "name": "Technologyreview.com"}, "author": "Max S. Kim", "title": "South Korea is watching quarantined citizens with a smartphone app", "description": "Thousands in coronavirus lockdown will be monitored for symptoms—and tracked to make sure they stay at home and don’t become “super spreaders.”", "url": "https://www.technologyreview.com/s/615329/coronavirus-south-korea-smartphone-app-quarantine/", "urlToImage": "https://cdn.technologyreview.com/i/images/gettyimages-1210707156-web.jpg?cx=21&cy=311&cw=2979&ch=1677&sw1200", "publishedAt": "2020-03-06T19:56:17Z", "content": "With almost 6,300 cases and more than 40 reported deaths, South Korea has become home to the worlds largest coronavirus outbreak outside China. As a result, the government in Seoul has taken what it calls maximum action to contain the spread of the diseaseinc… [+5125 chars]"}, {"source": {"id": null, "name": "Calculatedriskblog.com"}, "author": "Calculated Risk", "title": "AAR: February Rail Carloads down 7.3% YoY, Intermodal Down 8.9% YoY", "description": "From the Association of American Railroads (AAR) Rail Time Indicators .  Graphs and excerpts reprinted with permission .   Total U.S. rail c...", "url": "https://www.calculatedriskblog.com/2020/03/aar-february-rail-carloads-down-73-yoy.html", "urlToImage": "https://3.bp.blogspot.com/-I2zCJEY51ro/XmKhfl58kTI/AAAAAAAA0Ig/_Bqve3dqbYgJ2lRcEkx5xg2OuI7R6OwDgCLcBGAsYHQ/w1200-h630-p-k-no-nu/AARCarloadsFeb2020.PNG", "publishedAt": "2020-03-06T19:19:00Z", "content": "From the Association of American Railroads (AAR) Rail Time Indicators. Graphs and excerpts reprinted with permission. \r\nTotal U.S. rail carloads fell 7.3% (73,058 carloads) in February 2020 from February 2019, their 13th\r\nstraight decline, but the decline dis… [+1901 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Reuters", "title": "U.N. says Chinese parts shortage caused $50 billion fall in February's global exports", "description": "Filed under: Earnings/Financials, Plants/Manufacturing, Parts and Accessories China's exports of vital parts and components for products ranging from automobiles to cellphones are estimated to have shrunk by an annualized 2% in February, costing other countri…", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/03/06/china-parts-shortage-global-exports-fall/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/4500x2531+0+45/resize/800x450!/format/jpg/quality/85/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/e1b2fc80-5fe3-11ea-9cfe-c95390cad238", "publishedAt": "2020-03-06T20:00:00Z", "content": "GENEVA China's exports of vital parts and components for products ranging from automobiles to cellphones are estimated to have shrunk by an annualized 2% in February, costing other countries and their industries $50 billion, a United Nations agency said on We… [+3060 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Coronavirus Scaring Jail Inmates Who Say Dirty Conditions Pose Risk", "description": "Coronavirus could explode in the nation's jails as inmates are squeezed in like sardines in filth. TMZ has contacted various jails, including L.A. County Men's Jail as well as jails in San Francisco and New York. They all say they are wiping down…", "url": "https://www.tmz.com/2020/03/06/coronavirus-scaring-inmates-who-say-disgusting-conditions-pose-risk/", "urlToImage": "https://imagez.tmz.com/image/0a/16by9/2020/03/06/0adca65e877a4e1b99d76393bb05c8dd_xl.jpg", "publishedAt": "2020-03-06T19:51:32Z", "content": "Coronavirus could explode in the nation's jails as inmates are squeezed in like sardines in filth.\r\nTMZ has contacted various jails, including L.A. County Men's Jail as well as jails in San Francisco and New York. They all say they are wiping down surfaces at… [+889 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Arnold Schwarzenegger Shows Inside Empty Fitness Expo Due to Coronavirus", "description": "Arnold Schwarzenegger's showing us his completely empty fitness expo venue -- shut down due to coronavirus fears, and it's a pretty eerie scene. Arnold joined us on \"TMZ Live\" Friday from inside the massive 750,000-square-foot convention space in…", "url": "https://www.tmz.com/2020/03/06/arnold-schwarzenegger-fitness-expo-empty-coronavirus/", "urlToImage": "https://imagez.tmz.com/image/4c/16by9/2020/03/06/4c07221ce8fa4ce99ef8a6f28f34bfa5_xl.jpg", "publishedAt": "2020-03-06T19:20:07Z", "content": "Arnold Schwarzenegger's showing us his completely empty fitness expo venue -- shut down due to coronavirus fears, and it's a pretty eerie scene.\r\nArnold joined us on \"TMZ Live\" Friday from inside the massive 750,000-square-foot convention space in Columbus, O… [+843 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "The Power of Hand-Washing to Prevent Coronavirus", "description": "Studies have shown that the vast majority of us are doing it wrong. Now, in the age of coronavirus, it's more important we do it right.", "url": "https://www.webmd.com/lung/news/20200306/power-of-hand-washing-to-prevent-coronavirus", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/close_up_washing_hands_other/650x350_close_up_washing_hands_other.jpg", "publishedAt": "2020-03-06T20:07:21Z", "content": "How? Well, first turn on the water. It doesnt matter if its hot or cold.\r\nWeve done research on water temperature, and what weve discovered is that water temperature doesnt really matter in terms of effectiveness, says Donald Schaffner, PhD, who studies predi… [+1955 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Planet Fitness Stock Gave Up 16% Last Month", "description": "Shares of the discount gym operator slipped on coronavirus fears and on weak guidance in its earnings report.", "url": "https://www.fool.com/investing/2020/03/06/why-planet-fitness-stock-gave-up-16-last-month.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561982/planet-fitness-slide-15-source-planet-fitness.jpg", "publishedAt": "2020-03-06T19:40:00Z", "content": "What happened\r\nShares of Planet Fitness (NYSE:PLNT) were looking fatigued last month as the discount gym chain got swept up in the coronavirus sell-off and posted an earnings report that included disappointing guidance. As a result, the stock fell 16%, accord… [+1787 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "States Seek to Ease Consumer Costs for Coronavirus Testing", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/states-seek-to-ease-consumer-costs-for-coronavirus-testing", "urlToImage": null, "publishedAt": "2020-03-06T19:55:19Z", "content": null}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "BoF Team", "title": "The BoF Podcast: A Fashion Month Unlike Any Other", "description": "As wildfires swept across Australia and the coronavirus spread across the globe, Imran Amed and Tim Blanks reflect on how the world’s uncertainties have informed the Autumn/Winter 2020 season.", "url": "https://www.businessoffashion.com/articles/podcasts/the-bof-podcast-a-fashion-month-unlike-any-other", "urlToImage": null, "publishedAt": "2020-03-06T19:24:35Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andrew Cuomo: 11 More New York Coronavirus Cases, Total Number Rises To 33 | NBC News - NBC News", "description": "Andrew Cuomo: 11 More New York Coronavirus Cases, Total Number Rises To 33 | NBC News NBC News NYC orders coronavirus testing for city educators, health care workers and first responders New York Daily News Coronavirus cases double — NYPD, public defenders sp…", "url": "https://www.youtube.com/watch?v=LwydSDMQVV0", "urlToImage": "https://i.ytimg.com/vi/LwydSDMQVV0/maxresdefault.jpg", "publishedAt": "2020-03-06T19:59:47Z", "content": null}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Gwynne Hogan, WNYC", "title": "Q&A With A CDC Disease Detective Investigating NYC's Coronavirus Cases", "description": "\"I think every New Yorker needs to be prepared and realize that we are probably going to see more cases of coronavirus in New York City.\" [ more › ]", "url": "https://gothamist.com/news/q-cdc-disease-detective-investigating-nycs-coronavirus-cases", "urlToImage": "https://cms.prod.nypr.digital/images/301772/fill-1200x650/", "publishedAt": "2020-03-06T19:45:07Z", "content": "As of Friday afternoon, five people have tested positive for COVID-19 in NYC, and an estimated 2,773 people are under quarantine citywide. In what is looking like a case of community spread, \"disease detectives,\" medically trained public health professionals,… [+9170 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Matt Wales", "title": "Mojang cancels real-world Minecraft Festival event over coronavirus concerns", "description": "It was only last week that Minecraft developer Mojang revealed it would be resurrecting its old MineCon live event format in September for one big real-world jamboree known as Minecraft Festival. Unfortunately, it's now opted to cancel this year's event over …", "url": "https://www.eurogamer.net/articles/2020-03-06-mojang-cancels-minecraft-festival-real-world-event-over-coronavirus-concerns", "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2020/articles/2020-03-06-19-57/mojang-cancels-just-announced-real-world-minecraft-festival-event-over-coronavirus-fears-1583524625371.jpg/EG11/resize/1200x-1/mojang-cancels-just-announced-real-world-minecraft-festival-event-over-coronavirus-fears-1583524625371.jpg", "publishedAt": "2020-03-06T19:43:00Z", "content": "It was only last week that Minecraft developer Mojang revealed it would be resurrecting its old MineCon live event format in September for one big real-world jamboree known as Minecraft Festival. Unfortunately, it's now opted to cancel this year's event as a … [+2918 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: second UK death as cases rise to 163, cases pass 100000 across world - Channel 4 News", "description": "Coronavirus: second UK death as cases rise to 163, cases pass 100000 across world Channel 4 News Coronavirus: U.S. Cases Rise; Alabamans Visiting Bethlehem Are Under Quarantine NPR Coronavirus milestone: more than 100,000 cases worldwide New York Daily News U…", "url": "https://www.youtube.com/watch?v=NxmJaXsl56g", "urlToImage": null, "publishedAt": "2020-03-06T19:31:11Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Matt Wilstein", "title": "Fox News Catches Kellyanne Conway Lying for Trump About Cutting Entitlements", "description": "“Oh, we’ll be cutting.” Those four words—spoken in response to a question about entitlements during a Fox News town hall on Thursday—are likely to haunt President Donald Trump for the rest of his re-election campaign. But don’t worry, Kellyanne Conway said Fr…", "url": "https://news.yahoo.com/fox-news-catches-kellyanne-conway-195710137.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HJZIq0mVfdi.lrnc.1rE_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/iHiIfPcFSPSZDj5ln3PIqg--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/d440403cfcb51cfc07577f09d5010060", "publishedAt": "2020-03-06T19:57:10Z", "content": "Oh, well be cutting. \r\nThose four wordsspoken in response to a question about entitlements during a Fox News town hall on Thursdayare likely to haunt President Donald Trump for the rest of his re-election campaign. \r\nBut dont worry, Kellyanne Conway said Frid… [+3078 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lori Aratani", "title": "The U.S. is screening travelers from China and Iran, but why not from Italy and South Korea? - The Washington Post", "description": "The U.S. is screening travelers from China and Iran, but why not from Italy and South Korea? The Washington Post WHO warns governments 'this is not a drill' as coronavirus infections near 100,000 worldwide CNN Why Chinese scientists say there's a second coron…", "url": "https://www.washingtonpost.com/transportation/2020/03/06/us-is-screening-travelers-china-iran-why-not-italy-south-korea/", "urlToImage": "https://www.washingtonpost.com/resizer/iGIBrmW5SzUOANeNXzdTN-yUSZ8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MPMZTVC67II6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-06T19:42:21Z", "content": "The Trump administration moved quickly to implement enhanced screening of travelers from China and Iran, funneling them through 11 U.S. airports. But with significant numbers of coronavirus cases now being diagnosed in Italy and South Korea, some have wondere… [+1790 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ted Knutson, Contributor, Ted Knutson, Contributor https://www.forbes.com/sites/tedknutson/", "title": "SEC Enforcement Unit On Lookout For Coronavirus Scams Says Division Co-Head Peikin", "description": "Already, the SEC has suspended trading on two microcap companies for coronavirus-related improprieties.", "url": "https://www.forbes.com/sites/tedknutson/2020/03/06/sec-enforcement-unit-on-lookout-for-coronavirus-scams-says-division-co-head-peikin/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e2b3d88f133f400076a9a16%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D4427%26cropY1%3D230%26cropY2%3D2719", "publishedAt": "2020-03-06T19:12:34Z", "content": "The Securities and Exchange Commission Enforcement Division is on the lookout for COVID-19 coronavirus scams, Division Co-Director Steve Peikin said today.\r\nHis statement came in response to a question from a reporter if Enforcement was on guard against fraud… [+1626 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Shieber and Alex Wilhelm", "title": "Facebook commits to paying 'contingent' workers affected by corporate coronavirus response", "description": "Last night, in a move that all companies should look to emulate, Microsoft announced that it would continue to pay hourly workers impacted by office closures as the company responds to the coronavirus outbreak in the U.S. Concerns about the COVID-19 have also…", "url": "https://finance.yahoo.com/news/facebook-commits-paying-contingent-workers-192902452.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ms4dNtW7bs.VKPmaV4R0bA--~B/aD0xMDY3O3c9MTYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/7c36843eaf7d7fda975c5f86dbac11fa", "publishedAt": "2020-03-06T19:29:02Z", "content": "Last night, in a move that all companies should look to emulate, Microsoft announced that it would continue to pay hourly workers impacted by office closures as the company responds to the coronavirus outbreak in the U.S.\r\nNow, Facebook appears to be followin… [+2346 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraq death toll by coronavirus rises to three: state news agency", "description": "Iraq reported a death by coronavirus in the city of Karbala, bringing total death count by coronavirus to three in the country, state news agency reported on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-iraq-death-idUSKBN20T2PM", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T19:51:48Z", "content": "CAIRO (Reuters) - Iraq reported a death by coronavirus in the city of Karbala, bringing total death count by coronavirus to three in the country, state news agency reported on Friday. \r\nEarlier on Friday, Iraq banned entry to travelers coming from France and … [+108 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "John Koetsier, Contributor, John Koetsier, Contributor https://www.forbes.com/sites/johnkoetsier/", "title": "Working At Home? Zoho Releases Free Productivity Suite For Remote Workers (That It Built Remotely)", "description": "A remote suite built remotely for remote workers in a week, so we can avoid Coronavirus.", "url": "https://www.forbes.com/sites/johnkoetsier/2020/03/06/working-at-home-zoho-releases-free-productivity-suite-for-remote-workers-that-it-built-remotely/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e62ac9244b78400068c33fb%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1000%26cropY1%3D52%26cropY2%3D614", "publishedAt": "2020-03-06T20:05:28Z", "content": "Hundreds of thousands of us are working remotely from our homes thanks to Coronavirus. But to work remotely, you need remote work tools for collaboration, communication, coordination, and more.\r\nSensing an opportunity, CRM and productivity apps maker Zoho bui… [+2022 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraq reports eight new coronavirus cases: state news agency", "description": "Iraq reported eight new coronavirus cases on Friday, 5 in Baghdad, 2 in Sulaimaniya and one case in Karbala, state news agency reported quoting health ministry.", "url": "https://www.reuters.com/article/us-health-coronavirus-iraq-idUSKBN20T2Q6", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499707456&w=1200&r=LYNXMPEG251WG", "publishedAt": "2020-03-06T20:06:32Z", "content": "CAIRO (Reuters) - Iraq reported eight new coronavirus cases on Friday, 5 in Baghdad, 2 in Sulaimaniya and one case in Karbala, state news agency reported quoting health ministry. \r\nReporting by Hesham Abdul Khalek"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Bernie Sanders: How much would his spending plans cost? - BBC News", "description": "Bernie Sanders: How much would his spending plans cost? BBC News Bernie Sanders' Medicare for All Would Likely Increase Wages, Create Jobs Newsweek N.J. coronavirus update: Legislation would ensure Medicaid and insurance coverage NJ.com Joe Biden’s Stock-Mark…", "url": "https://www.bbc.com/news/51662741", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/92D2/production/_111168573_gettyimages-1203473714.jpg", "publishedAt": "2020-03-06T19:32:31Z", "content": "Image copyrightGetty ImagesImage caption\r\n Bernie Sanders' spending pledges are under scrutiny\r\nDemocratic presidential contender Bernie Sanders is under pressure to explain how he would pay for his policy agenda, as his Democratic rivals say his sums don't a… [+5876 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "2 Jacksonville State University students exposed to coronavirus patient, school says - AL.com", "description": "Two Jacksonville State University students came into contact with someone diagnosed with COVID-19, the illness caused by coronavirus.", "url": "https://www.al.com/news/2020/03/2-jacksonville-state-university-students-exposed-to-coronavirus-patient-school-says.html", "urlToImage": "https://www.al.com/resizer/fuLqqm-yakd-dPxXLmRTn667xOM=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/57SOXMZQVJBTVGBK3ZOIUKHY6U.JPG", "publishedAt": "2020-03-06T19:35:28Z", "content": "Two Jacksonville State University students came into contact with someone diagnosed with COVID-19, the illness caused by coronavirus.\r\nIn a letter to students, faculty and staff, JSU acting president Dr. Don Killingsworth Jr. said there are no confirmed cases… [+1022 chars]"}, {"source": {"id": null, "name": "Fayobserver.com"}, "author": "Michael Futch", "title": "Coronavirus having some impact on businesses in Fayetteville area - The Fayetteville Observer", "description": "Coronavirus having some impact on businesses in Fayetteville area The Fayetteville Observer", "url": "https://www.fayobserver.com/article/20200306/BUSINESS/200309026", "urlToImage": "https://www.fayobserver.com/storyimage/NC/20200306/BUSINESS/200309026/AR/0/AR-200309026.jpg", "publishedAt": "2020-03-06T19:48:54Z", "content": "Local retailers are reporting selling out of face masks and hand sanitizer.\r\nFayetteville travel agent Shirley Berg said Thursday that she’s not really seeing much of an impact on client travel plans from the potential threat of the coronavirus that continues… [+5355 chars]"}, {"source": {"id": null, "name": "Loopinsight.com"}, "author": "Jim Dalrymple", "title": "∞ The Dalrymple Report: WWDC, iPhone and Apple Music", "description": "Coronavirus is affecting people around the world, but what does it mean for WWDC? Dave and I also talk about the possible affects on iPhone production, as well as switching Apple Music to other countries. Subscribe to this podcast", "url": "https://www.loopinsight.com/2020/03/06/the-dalrymple-report-wwdc-iphone-and-apple-music/", "urlToImage": null, "publishedAt": "2020-03-06T19:15:38Z", "content": "Coronavirus is affecting people around the world, but what does it mean for WWDC? Dave and I also talk about the possible affects on iPhone production, as well as switching Apple Music to other countries.\r\nSubscribe to this podcast"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Florida Governor DeSantis holds a coronavirus briefing - Fox News", "description": "Florida Governor DeSantis holds a coronavirus briefing Fox News Town Hall with President Trump | Part 1 Fox News New York Governor Cuomo makes an announcement Fox News View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=DWuFfOTbjbk", "urlToImage": "https://i.ytimg.com/vi/DWuFfOTbjbk/maxresdefault.jpg", "publishedAt": "2020-03-06T20:00:49Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Keating, Contributor, Dave Keating, Contributor https://www.forbes.com/sites/davekeating/", "title": "Germany Mulls Postponing Green Tax Over Coronavirus Aviation Fears", "description": "Germany should postpone the introduction of an aviation levy designed to lower emissions because the sector has already been dealt a blow by the coronavirus, Klaus-Peter Willsch, aviation expert of Angela Merkel's conservative CDU party, says.", "url": "https://www.forbes.com/sites/davekeating/2020/03/06/germany-mulls-postponing-green-tax-over-coronavirus-aviation-fears/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1201734783%2F0x0.jpg", "publishedAt": "2020-03-06T19:59:04Z", "content": "dpa/picture alliance via Getty Images\r\nAs European airlines reel from the impacts of Coronavirus fears, a leading lawmaker in German Chancellor Angela Merkels CDU party has called for the government to postpone the introduction of a planned aviation tax desig… [+2144 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "tedstew1", "title": "NBC News’ Richard Engel Covering The Coronavirus Outbreak: “You Want People To Take Precautions, But You Don’t Want To Induce Panic”", "description": "Amid confusion and even misinformation about the coronavirus, networks are stepping up their special coverage to the outbreak, often with the aim of sifting through facts and myths and what is known and what is unknown. On Sunday at 10 PM ET, MSNBC is devotin…", "url": "https://deadline.com/2020/03/coronavirus-richard-engel-nbc-news-msnbc-1202876150/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/02/coronavirus-2-1.jpg?w=1024", "publishedAt": "2020-03-06T19:48:07Z", "content": "Amid confusion and even misinformation about the coronavirus, networks are stepping up their special coverage to the outbreak, often with the aim of sifting through facts and myths and what is known and what is unknown.\r\nOn Sunday at 10 PM ET, MSNBC is devoti… [+7956 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Megan Rose Dickey", "title": "Senator urges Uber, Lyft, Instacart and others to offer gig workers financial security in light of COVID-19 concerns", "description": "While some gig economy companies have already taken steps to try to prevent the spread of COVID-19 among its workers, Sen. Mark Warner (VA) is encouraging them to go further and consider ensuring workers don't face financial consequences as a result of the vi…", "url": "https://finance.yahoo.com/news/senator-urges-uber-lyft-instacart-195630513.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/7f.RUxvrav78RgRjtpEUYQ--~B/aD05OTg7dz0xNTAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/d16369e04aa257c6feb64ae2b8d7aadd", "publishedAt": "2020-03-06T19:56:30Z", "content": "While some gig economy companies have already taken steps to try to prevent the spread of COVID-19 among its workers, Sen. Mark Warner (VA) is encouraging them to go further and consider ensuring workers don't face financial consequences as a result of the vi… [+1523 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Sophie Nieto-Munoz | NJ Advance Media for NJ.com", "title": "10 N.J. businesses warned to stop price gouging in response to coronavirus outbreak, AG says - NJ.com", "description": "Complaints of price gouging face masks and hand sanitizer are surging as New Jersey grapples with its second confirmed case of coronavirus.", "url": "https://www.nj.com/coronavirus/2020/03/coronavirus-outbreak-10-nj-businesses-warned-to-stop-price-gouging-attorney-general-says.html", "urlToImage": "https://www.nj.com/resizer/q7VZrlImQvt6pO8pa4hBBZmX9ko=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/UJB4OKOQ45FPXOZCAWTSMMDC5A.JPG", "publishedAt": "2020-03-06T19:42:02Z", "content": "Authorities are cracking down on illegal price gouging as New Jersey grapples with its second confirmed case of coronavirus, the virus ravaging the globe.\r\nAt least 10 retailers have received warnings from the Division of Consumer Affairs, state Attorney Gene… [+3001 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Helen Murphy", "title": "Ultra Music Festival in Miami Postponed to 2021 Due to Coronavirus Concerns", "description": "Another concert has been postponed amid the spread of the novel coronavirus (COVID-19) in the United States. On Friday, Ultra Music Festival organizers announced in a Twitter statement that officials with the event’s host city of Miami had decided to postpone…", "url": "https://people.com/music/ultra-music-festival-postponed-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fgettyimages-938603878.jpg%3Fcrop%3D0px%2C422px%2C3000px%2C1576px%26resize%3D1200%2C630", "publishedAt": "2020-03-06T19:35:58Z", "content": "Another concert has been postponed amid the spread of the novel coronavirus (COVID-19) in the United States.\r\nOn Friday, Ultra Music Festival organizers announced in a Twitter statement that officials with the event’s host city of Miami had decided to postpon… [+2514 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Cruises change passenger rules amid coronavirus outbreak", "description": "Due to the coronavirus, Royal Caribbean and Norwegian have lost about half their value since the start of the year. Yahoo Finance’s Emily McCormick join Seana Smith on The Ticker to discuss.", "url": "https://finance.yahoo.com/video/cruises-change-passenger-rules-amid-200141999.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/dxB2NbHfTbx4O74qpnDqCQ--~B/aD0yMzUyO3c9NDE4NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/06/5e62ac2869e6c51d61e110c1/5e62ac2869e6c51d61e110c2_o_U_v2.jpg", "publishedAt": "2020-03-06T20:01:41Z", "content": "Due to the coronavirus, Royal Caribbean and Norwegian have lost about half their value since the start of the year. Yahoo Finances Emily McCormick join Seana Smith on The Ticker to discuss."}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jennifer Calfas, Lucy Craymer", "title": "Coronavirus Cases Exceed 100,000 as Countries Struggle to Contain Spread - The Wall Street Journal", "description": "Coronavirus Cases Exceed 100,000 as Countries Struggle to Contain Spread The Wall Street Journal All you need to know about travelling during coronavirus outbreak Al Jazeera English As virus cases near 100,000, fear of ‘devastation’ for poor Los Angeles Times…", "url": "https://www.wsj.com/articles/coronavirus-cases-near-100-000-as-countries-struggle-to-contain-spread-11583493133", "urlToImage": "https://images.wsj.net/im-161500/social", "publishedAt": "2020-03-06T19:45:16Z", "content": "The number of confirmed coronavirus cases globally topped 100,000 on Friday, as infections spread to new parts of the U.S. where officials struggled to get the epidemic under control.\r\nLocal officials in the hardest-hit U.S. states warned vulnerable populatio… [+220 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Why Putting a Wet Wipe Into the Washing Machine Can Save You a Ton of Time and Nerves via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_498ea40bac01b61968cee683bc5bb718", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T20:10:21Z", "content": "Indiana, Indianapolis, Coronavirus, Medicine\r\nINDIANAPOLIS, Ind. Everyone is preparing for the new coronavirus: hospitals, airports and offices. To me, it's not a matter of if it comes but..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Susan Collins doesn't \"understand\" why voters turned on her. Did she forget her impeachment vote? via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_11681a4494a7b80cc97794deed7ae43e", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T20:10:21Z", "content": "Indiana, Indianapolis, Coronavirus, Medicine\r\nINDIANAPOLIS, Ind. Everyone is preparing for the new coronavirus: hospitals, airports and offices. To me, it's not a matter of if it comes but..."}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Eric Lutz", "title": "Does Trump Really Think He “Stopped” Coronavirus?", "description": "As the public health crisis continues, the president keeps praising his administration’s response.", "url": "https://www.vanityfair.com/news/2020/03/does-trump-really-think-he-stopped-coronavirus", "urlToImage": "https://media.vanityfair.com/photos/5e628647a62e1100087d135f/16:9/w_1280,c_limit/Trump3.6.jpg", "publishedAt": "2020-03-06T19:52:51Z", "content": "As he signed off on an $8.3 billion funding agreement to fight the coronavirus Friday, Donald Trump appeared to imply that the money was unnecessary because his administration already had the situation under control. I think were in great shape, the president… [+4384 chars]"}, {"source": {"id": null, "name": "Programmableweb.com"}, "author": "wsantos", "title": "APIs to Track Coronavirus COVID-19", "description": "Last December, in Wuhan, a city in China's Hubei Province, a new coronavirus disease, COVID-19, was first identified. Since that time, the World Health Organization reports that the virus has spread rapidly, infecting more than 95,000 people across 85 countri…", "url": "https://www.programmableweb.com/news/apis-to-track-coronavirus-covid-19/review/2020/03/06", "urlToImage": "https://www.programmableweb.com/sites/default/files/wuhan-coronavirus-apis-01-reliefweb.jpg", "publishedAt": "2020-03-06T19:18:30Z", "content": "Last December, in Wuhan, a city in China's Hubei Province, a new coronavirus disease, COVID-19, was first identified. Since that time, the World Health Organization reports that the virus has spread rapidly, infecting more than 95,000 people across 85 countri… [+3526 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Fourth case diagnosed in NI", "description": "The number of confirmed cases of coronavirus has risen to four, with a presumptive positive test being returned on Friday.", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-51777501", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/EF53/production/_97176216_breaking_news_bigger.png", "publishedAt": "2020-03-06T19:33:03Z", "content": "Another case of coronavirus has been diagnosed in Northern Ireland, bringing the total to four.\r\nThe latest person who has tested positive is an adult who recently returned from Italy - their diagnosis has been linked to a previous case.\r\nTheir test sample wi… [+354 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Sam Stein", "title": "Prominent Jewish Groups Cancel Israel Trips Over Coronavirus", "description": "Getty Two prominent U.S.-based Israeli advocacy groups are scuttling planned trips to Israel amid concerns about the 2019 novel coronavirus. Both AIPAC and J Street had been set to send groups to Israel and the surrounding region in the coming weeks. But thos…", "url": "https://www.thedailybeast.com/prominent-jewish-groups-cancel-israel-trips-over-coronavirus", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583524346/200306-stein-coronavirus-tease_cvthu9", "publishedAt": "2020-03-06T19:53:47Z", "content": "Two prominent U.S.-based Israeli advocacy groups are scuttling planned trips to Israel amid concerns about the 2019 novel coronavirus. \r\nBoth AIPAC and J Street had been set to send groups to Israel and the surrounding region in the coming weeks. But those pl… [+1837 chars]"}, {"source": {"id": null, "name": "Wgbh.org"}, "author": "Hannah Uebele", "title": "Andy Ihnatko: Tech Industry Conferences Canceled Due To Coronavirus - wgbh.org", "description": "Google and Facebook are among the companies canceling annual events over concerns about coronavirus.", "url": "https://www.wgbh.org/news/national-news/2020/03/06/andy-ihnatko-tech-industry-conferences-canceled-due-to-coronavirus", "urlToImage": "https://wgbh.brightspotcdn.com/dims4/default/4622072/2147483647/strip/true/crop/4344x2281+0+246/resize/1200x630!/quality/70/?url=https%3A%2F%2Fwgbh.brightspotcdn.com%2Fca%2Ffa%2Fe2267f8f4855aa1f0012ae5b76a9%2Fap-19289742043240.jpg", "publishedAt": "2020-03-06T19:41:25Z", "content": "Tech writer Andy Ihnatko joined Boston Public Radio on Friday to speak about why many tech companies are canceling their annual events due to coronavirus.\r\n\"This about the season when all these big companies meet to explain to programmers and developers who u… [+631 chars]"}, {"source": {"id": null, "name": "Coindesk.com"}, "author": "Nathaniel Whittemore", "title": "FluffyPony on Encryption, Clearview and How Coronavirus Could Impact Privacy", "description": "Welcome to the new frontiers of privacy. The former lead maintainer of Monero and co-founder of Tari speaks about the state of global privacy", "url": "https://www.coindesk.com/fluffypony-on-encryption-clearview-and-how-coronavirus-could-impact-privacy", "urlToImage": "https://www.coindesk.com/wp-content/uploads/2020/03/Breakdown3.6-3-1200x628.jpg", "publishedAt": "2020-03-06T20:00:00Z", "content": "The former lead maintainer of Monero and co-founder of Tari speaks about the state of global privacy \r\nFor more episodes and free early access before our regular 3 p.m. Eastern time releases, subscribe with Apple Podcasts, Spotify, Pocketcasts, Google Podcast… [+1235 chars]"}, {"source": {"id": null, "name": "Zacks.com"}, "author": "Zacks Investment Research", "title": "Coronavirus, Big Tech, Tesla & An ETF to Invest in Disruption - Zacks.com", "description": "Neena Mishra speaks with Gene Munster about the impact of coronavirus on tech stocks and a disruptive ETF.", "url": "https://www.zacks.com/stock/news/800538/coronavirus-big-tech-tesla-amp-an-etf-to-invest-in-disruption", "urlToImage": "https://staticx-tuner.zacks.com/images/articles/main/7e/2159.jpg", "publishedAt": "2020-03-06T19:40:58Z", "content": "<ul><li>(1:10) - Stock Market Correction Continues</li><li>(4:45) - Are Tech Stocks The Safe Investment During CoronaVirus Fears?</li><li>(10:50) - What Can Investors Expect From Tesla Going Forward?</li><li>(15:30) - Loup Frontier Tech ETF Overview: LOUP</li… [+1661 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "David Mikkelson", "title": "Coronavirus: Why People Are Panic Buying Toilet Paper", "description": "Social media has been flooded with images from across the world of shopping carts lined up at check outs, empty shelves, and crazed shoppers carrying six months’ worth of toilet paper.", "url": "https://www.snopes.com/news/2020/03/06/coronavirus-why-people-are-panic-buying-toilet-paper/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/empty_shelves.jpg?fit=997,545", "publishedAt": "2020-03-06T19:28:31Z", "content": "This article by Andy J. Yap is republished here with permission from The Conversation. This content is shared here because the topic may interest Snopes readers; it does not, however, represent the work of Snopes fact-checkers or editors.\r\nThe UK has found it… [+5046 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Leticia Miranda", "title": "Leading venture capital firm warns companies to 'prepare for the worst' amid epidemic", "description": "A major venture capital firm says companies should \"brace for turbulence” as coronavirus rocks the global economy, sounding the warning in a note released Thursday.", "url": "https://www.nbcnews.com/business/economy/leading-venture-capital-firm-warns-companies-prepare-worst-amid-epidemic-n1151686", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_10/3259226/200306-wall-street-new-york-ew-124p_5311d66f0ef246c75a6c15fdd273fdb4.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-06T19:36:01Z", "content": "A major venture capital firm says companies should \"brace for turbulence as the novel coronavirus rocks the global economy, sounding the warning in a note released Thursday.\r\nSequoia Capital, which has funded some of the countrys most recognizable businesses … [+2936 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "British government to meet with sports bodies about fan bans", "description": "British sports are stepping up preparations for events to take place without spectators as the coronavirus spreads", "url": "https://www.foxsports.com/soccer/story/british-government-to-meet-with-sports-bodies-about-fan-bans-030620", "urlToImage": "https://b.fssta.com/uploads/2020/03/6d742123bef04eddb8696d70c6cb44da-1.vresize.1200.630.high.24.jpg", "publishedAt": "2020-03-06T19:59:09Z", "content": "LONDON (AP) — British sports are stepping up preparations for events to take place without spectators as the coronavirus spreads, with the Premier League keen to find a way to complete the season as the country grapples to contain the outbreak.\r\nThe governmen… [+3314 chars]"}, {"source": {"id": null, "name": "Dailysignal.com"}, "author": "Neil Patel", "title": "The President’s Dangerous Coronavirus Position", "description": "It’s rare that President Donald Trump ever seems to misread a communications matter. From the earliest 2016 debates, it became clear that he is a... Read More The post The President’s Dangerous Coronavirus Position appeared first on The Daily Signal.", "url": "https://www.dailysignal.com/2020/03/06/the-presidents-dangerous-coronavirus-position/", "urlToImage": "https://www.dailysignal.com/wp-content/uploads/trump-again.jpg", "publishedAt": "2020-03-06T19:21:14Z", "content": "It’s rare that President Donald Trump ever seems to misread a communications matter. From the earliest 2016 debates, it became clear that he is a lot better at communicating with the American people than your standard-issue Republican politician. He’s also a … [+4512 chars]"}, {"source": {"id": null, "name": "Programmableweb.com"}, "author": "wsantos", "title": "New Coronavirus API Tracks Reported Case Data Worldwide", "description": "As the coronavirus outbreak continues to spread worldwide, APIs can help make information about it widely available. The GitHub repository under the name NovelCOVID has released an API that tracks data about the number of current cases of the virus. It is a s…", "url": "https://www.programmableweb.com/news/new-coronavirus-api-tracks-reported-case-data-worldwide/brief/2020/03/06", "urlToImage": "https://www.programmableweb.com/sites/default/files/pw-200-200.png", "publishedAt": "2020-03-06T19:33:13Z", "content": "The coronavirus (COVID-19) outbreak continues to spread in the US and worldwide, with nearly 100,000 reported cases globally. Good information is extremely valuable during times like these and APIs can help make such information widely available. We previousl… [+924 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Gavin Sheehan", "title": "Konami Announces TurboGrafx-16 Mini Delays Due To Coronavirus", "description": "So bad news from Konami this week as the coronavirus has delayed their release of the TurboGrafx-16 Mini to some parts of the world. The console, which has parts primarily manufactured in China, is set to receive delays due to the epidemic in the country. By …", "url": "https://www.bleedingcool.com/?p=1173705&preview=true&preview_id=1173705", "urlToImage": "https://mlpnk72yciwc.i.optimole.com/cqhiHA-y57ukG9R/w:auto/h:auto/q:90/https://www.bleedingcool.com/wp-content/uploads/2019/06/maxresdefault-200.jpg", "publishedAt": "2020-03-06T20:10:39Z", "content": "So bad news from Konami this week as the coronavirus has delayed their release of the TurboGrafx-16 Mini to some parts of the world. The console, which has parts primarily manufactured in China, is set to receive delays due to the epidemic in the country. By … [+1025 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Giancarlo Sopo", "title": "Liberals mocked President Trump for saying coronavirus mortality rate was lower than initially reported; now health official says he's right", "description": "Liberals, like the Daily Show's Trevor Noah, mocked President Donald Trump when he argued the coronavirus' mortality rate was likely lower than the 3.4% estimate offered by the World Health Organization. Film producer Andy Ostroy called the president a \"gasli…", "url": "https://www.theblaze.com/news/liberals_mocked_trump_coronavirus", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg1NTM1Ny9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNTkzODAxNn0.mapoetXN7HMJFPjdDHXUcSMRF78B_G4p7KXw1X-J7Xg/img.jpg?width=1200&coordinates=0%2C69%2C0%2C70&height=600", "publishedAt": "2020-03-06T20:03:46Z", "content": "Liberals, like the Daily Show's Trevor Noah, mocked President Donald Trump when he argued the coronavirus' mortality rate was likely lower than the 3.4% estimate offered by the World Health Organization. Film producer Andy Ostroy called the president a \"gasli… [+2224 chars]"}, {"source": {"id": null, "name": "Advocate.com"}, "author": "Trudy Ring", "title": "Coronavirus Is Punishment for 'LGBT Sin,' Says Far-Right Pastor", "description": "\"National disobedience of God's laws\" brings diseases such as the coronavirus, says wacko Steven Andrew.", "url": "https://www.advocate.com/religion/2020/3/06/coronavirus-punishment-lgbt-sin-says-far-right-pastor", "urlToImage": "https://www.advocate.com/sites/advocate.com/files/stevenandrew-x750.jpg", "publishedAt": "2020-03-06T19:48:56Z", "content": "LGBTQ people have been blamed for hurricanes, earthquakes, terrorist attacks, and other disasters and now theyre being blamed for the coronavirus outbreak.\r\nSteven Andrew, pastor of the USA Christian Church which appears to be a virtual, internet-based church… [+1789 chars]"}, {"source": {"id": null, "name": "Curbed.com"}, "author": "Jeff Andrews", "title": "How the coronavirus is impacting the housing market", "description": "Stocks are tanking as the illness spreads. Will housing follow?", "url": "https://www.curbed.com/2020/3/6/21163523/coronavirus-economic-impact-housing-market", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Vg8ngyMN4pxKnxkpzVLlNLrwzt4=/0x530:7360x4383/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19773427/GettyImages_543043696.jpg", "publishedAt": "2020-03-06T20:05:18Z", "content": "Getty Images Stocks are tanking as the illness spreads. Will housing follow? Few homes look their best in the dirty grays of late winter, which is, in part, why homebuying season coincides with the arrival of spring. This year, however, the crocuses that can … [+8580 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "W. E. Messamore", "title": "Hey Millennials, ‘Netflix and Chill’ Makes You Vulnerable to Coronavirus", "description": "Record STD outbreaks in the U.S. haven't stopped younger Americans from hooking up, but coronavirus makes \"Netflix and Chill\" riskier than ever. The post Hey Millennials, ‘Netflix and Chill’ Makes You Vulnerable to Coronavirus appeared first on CCN.com", "url": "https://www.ccn.com/hey-millennials-netflix-and-chill-makes-you-vulnerable-to-coronavirus/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/to-all-the-boys-netflix-chill-ap.jpg", "publishedAt": "2020-03-06T19:19:43Z", "content": "<ul><li>Millennials are the generation most worried about coronavirus.</li><li>Theyve stopped shopping in physical stores, while tech conferences and music festivals are canceling events.</li><li>But will millennials give up Netflix and Chill to avoid getting… [+3690 chars]"}, {"source": {"id": null, "name": "Thediplomat.com"}, "author": "Franz-Stefan Gady", "title": "Work Stopped at F-35A Facility in Japan Amid Coronavirus Outbreak", "description": "Lockheed Martin suspended assembly of the F-35A aircraft at a Mitsubishi Heavy Industries facility in Japan out of concern over the spread of the coronavirus.", "url": "https://thediplomat.com/2020/03/work-stopped-at-f-35a-facility-in-japan-amid-coronavirus-outbreak/", "urlToImage": "https://thediplomat.com/wp-content/uploads/2018/01/sizes/td-story-s-2/thediplomat-26992681_1579725438811046_6771942380551016136_n.jpg", "publishedAt": "2020-03-06T19:36:56Z", "content": "Advertisement\r\nU.S. defense contractor Lockheed Martin temporarily suspended the production of the fifth-generation Lightning II F-35A stealth fighter aircraft at Mitsubishi Heavy Industries F-35 Final Assembly and Check Out (FACO) facility in Nagoya, Japan, … [+2412 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "The New Qatar Airways Coronavirus Ticket Change Policy Is How It’s Done", "description": "We're well past where it makes sense to offer flexibility only to new ticket purchases. Qatar is not only extending their flexible change policy to existing, already-purchased tickets they're providing the option to take a travel voucher good for a year from …", "url": "https://viewfromthewing.com/the-new-qatar-airways-coronavirus-ticket-change-policy-is-how-its-done/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2017/03/qr3.png", "publishedAt": "2020-03-06T19:24:54Z", "content": null}, {"source": {"id": null, "name": "Liliputing.com"}, "author": "Brad Linder", "title": "Coronavirus delays the TurboGrafix-16 Mini retro console", "description": "The global coronavirus outbreak that originated in China has had a major impact on the global stage. Over 100,000 people have been infected, and more than 3,400 have died. Many major tech trade shows and other events have been canceled or scaled back, and a g…", "url": "https://liliputing.com/2020/03/coronavirus-delays-the-turbografix-16-mini-retro-console.html", "urlToImage": "https://i2.wp.com/liliputing.com/wp-content/uploads/2020/03/turbo_01.jpg?fit=900%2C559&ssl=1", "publishedAt": "2020-03-06T19:36:40Z", "content": "The global coronavirus outbreak that originated in China has had a major impact on the global stage. Over 100,000 people have been infected, and more than 3,400 have died. Many major tech trade shows and other events have been canceled or scaled back, and a g… [+2444 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Benjamin Rains", "title": "3 Cheap Tech Stocks Under $10 to Buy Despite Continued Coronavirus Volatility", "description": "Check out these three cheap tech stocks that investors might want to buy, or at least keep an eye on amid the coronavirus market volatility...", "url": "https://finance.yahoo.com/news/3-cheap-tech-stocks-under-194207779.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/DD.XX.2GvvOVxJT0epXw.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNzA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/9vI0KeiP4sJxULPkWojUuQ--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/597f942ef4b77595457a5b9d2de6f444", "publishedAt": "2020-03-06T19:42:07Z", "content": "Markets continued their volatile week Friday, with the Dow, the S&amp;P 500, and the Nasdaq all down around 2% through morning trading. The up and down week follows a lightning quick market correction that came as the coronavirus dents the Chinese economy and… [+6258 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Doug Whiteman", "title": "Mortgage Rates Are the Lowest Ever, Making Refinancing Even Sweeter", "description": "While the coronavirus has financial markets shuddering, rates on home loans have dropped to record lows. Procrastinating homeowners need to refi already.", "url": "https://finance.yahoo.com/news/mortgage-rates-lowest-ever-making-192442439.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/10pIPttKWeTzqvEt0H8MCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MDMuMjk2NzAzMjk2NzAzMw--/https://s.yimg.com/uu/api/res/1.2/N1rdltdEO2ObsGghkqRDqw--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/moneywise_327/f34e4b74d9eb5a7d69a8007759e1ebec", "publishedAt": "2020-03-06T19:24:42Z", "content": "Mortgage Rates Are the Lowest Ever, Making Refinancing Even Sweeter\r\nIt has finally happened: Borrowers are officially seeing the best mortgage rates in history.\r\nRates that had been falling further and further for weeks have now hit the lowest levels on reco… [+3685 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Emma Elsworthy", "title": "Can I leave the house, get supplies and walk the dog while in coronavirus quarantine?", "description": "Coronavirus infections and the number of people ordered to isolate themselves spiked in Australia this week. But what are the rules of self-quarantine? An expert weighs in.", "url": "https://www.abc.net.au/news/2020-03-07/coronavirus-how-to-quarantine-yourself/12031822", "urlToImage": "https://www.abc.net.au/news/image/12035942-16x9-700x394.jpg", "publishedAt": "2020-03-06T20:05:32Z", "content": "Updated \r\nMarch 07, 2020 14:58:01\r\nCan I walk my dog? Can I get food delivered? How does quarantine work?\r\nKey points:\r\n<ul><li>While in quarantine, wear a mask when you're around others</li><li>Try to maintain a routine, including exercise around the home</l… [+3987 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Guidance lacking from Trump administration for mass transit to combat outbreak", "description": "U.S. transit system operators have received little guidance from the Trump administration on issues ranging from cleaning trains, buses and ferries to combat the spread of coronavirus to what to do if a shutdown of their commuter networks is required.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-transit-idUSKBN20T2QA", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499707313&w=1200&r=LYNXMPEG251WF", "publishedAt": "2020-03-06T20:07:38Z", "content": "NEW YORK (Reuters) - U.S. transit system operators have received little guidance from the Trump administration on issues ranging from cleaning trains, buses and ferries to combat the spread of coronavirus to what to do if a shutdown of their commuter networks… [+1406 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Mike Moffitt, SFGATE", "title": "Stanford launches its own coronavirus test", "description": "Stanford University researchers have developed and deployed their own in-house diagnostic test for the novel coronavirus.", "url": "https://www.sfgate.com/bayarea/article/Stanford-University-coronavirus-test-COVID-19-15111328.php", "urlToImage": "https://s.hdnux.com/photos/01/11/00/43/19138791/3/rawImage.jpg", "publishedAt": "2020-03-06T20:09:52Z", "content": "<ul><li>This handout illustration image obtained Feb. 27, 2020, courtesy of the National Institutes of Health taken with a transmission electron microscope shows SARS-CoV-2, the virus that causes COVID-19, isolated from a patient in the United States. Virus p… [+3655 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Ed Scarce", "title": "Republican Governor Ridiculed For His 'Nearly 17' People Tested For Coronavirus", "description": "Missouri's Republican Governor Mike Parsons drew jeers yesterday with his 'specific' bullet points for Missouri's COVID-19 response, writing that 'nearly 17' people had already been tested. 'Nearly 17' quickly became an Internet meme. Source: Raw Story On Thu…", "url": "https://crooksandliars.com/2020/03/missouri-governor-ridiculed-his-nearly-17", "urlToImage": "https://crooksandliars.com/files/primary_image/20/03/gettyimages-1146875721.jpg", "publishedAt": "2020-03-06T19:54:11Z", "content": "Missouri specific:ZERO confirmed casesNearly 17 people have been testedTesting CAN be done in MissouriPrisons, nursing homes &amp; mental health facilities are a concern Schools are always a concern, but young people to not appear to be as prone #COVID19\r\n— G… [+47 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "'I'm a key man': The head of SoftBank's $100 billion Vision Fund, recently accused of blackmailing a rival, defends the company and himself in a new interview", "description": "Rajeev Misra, the manager of SoftBank's Vision Fund, espoused optimism for the future of the fund in the next 18 to 24 months, in a recent interview with CNBC. Misra and SoftBank have faced criticism after WeWork's failed attempt to go public and an explosive…", "url": "https://www.businessinsider.com/softbank-rajeev-misra-accused-of-blackmail-defends-himself-company-interview-2020-3", "urlToImage": "https://i.insider.com/5e56ce82fee23d311a451aa3?width=1200&format=jpeg", "publishedAt": "2020-03-06T19:59:00Z", "content": "SoftBank Vision Fund manager Rajeev Misra spoke optimistically about the future of the $100 billion Vision Fund despite mounting skepticism against SoftBank and recent criticism of the executive himself on Friday in an interview with CNBC.\r\nMisra is confident… [+2854 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Fin Gomez", "title": "White House tightens visitor rules over coronavirus concerns", "description": "For now, the White House will be requiring guests to disclose the countries they've visited recently, and other measures are also being considered.", "url": "https://www.cbsnews.com/news/coronavirus-white-house-visitor-rules/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/06/5cae7be1-6078-45e1-a23b-5328e1e3b2e2/thumbnail/1200x630/45b18567ff38ce208cbf7c1b8cfeffa0/gettyimages-943392432.jpg", "publishedAt": "2020-03-06T19:12:11Z", "content": "The White House is tightening its White House visitor rules over concerns about the spread of coronavirus, CBS News confirms, according to a senior White House official. Going forward, the White House will require all guests to disclose the countries they hav… [+1523 chars]"}, {"source": {"id": null, "name": "Prnewsonline.com"}, "author": "Seth Arenstein", "title": "Coronavirus Deserves Top-Flight Communications", "description": "In a PR crisis, consistent message is important. In communicating about a potential health crisis, consistent, factual messaging becomes paramount. The country's coronavirus situation is rapidly rising beyond politics. It is imperative for all communicators, …", "url": "https://www.prnewsonline.com/trump-communications-coronavirus/", "urlToImage": "https://www.prnewsonline.com/wp-content/uploads/2020/03/shutterstock_636139745.jpg", "publishedAt": "2020-03-06T20:02:34Z", "content": "Communicators know that one of the principles of PR crisis management is ensuring that you are delivering a consistent message. During a health-related crisis, consistency is paramount.\r\nVeteran health communicator, T. Garland Stansell, CCO at Childrens of Al… [+6072 chars]"}, {"source": {"id": null, "name": "Prnewsonline.com"}, "author": "Seth Arenstein", "title": "Coronavirus Deserves Top-Flight Communications", "description": "In a PR crisis, consistent message is important. In communicating about a potential health crisis, consistent, factual messaging becomes paramount. The country's coronavirus situation is rapidly rising beyond politics. It is imperative for all communicators, …", "url": "https://www.prnewsonline.com/Trump-communications-coronavirus", "urlToImage": "https://www.prnewsonline.com/wp-content/uploads/2020/03/shutterstock_636139745.jpg", "publishedAt": "2020-03-06T20:02:34Z", "content": "Communicators know that one of the principles of PR crisis management is ensuring that you are delivering a consistent message. Veteran health communicator, T. Garland Standsell, CCO at Childrens of Alabama, told PRNEWS in an interview that whatever platform … [+5821 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Kathryn Krawczyk", "title": "China's coronavirus recovery is 'all fake,' whistleblowers and residents claim", "description": "China's claims of how it's handling coronavirus recovery should be taken with more than a few grains of salt.\nEven before COVID-19 had become a global crisis, Chinese leaders had been criticized for their handling of the situation and lack of transparency abo…", "url": "https://theweek.com/speedreads/900488/chinas-coronavirus-recovery-all-fake-whistleblowers-residents-claim", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1204247173.jpg?itok=8o15JTQE", "publishedAt": "2020-03-06T19:13:15Z", "content": "China's claims of how it's handling coronavirus recovery should be taken with more than a few grains of salt.\r\nEven before COVID-19 had become a global crisis, Chinese leaders had been criticized for their handling of the situation and lack of transparency ab… [+1528 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "APhA Issues Preparedness and Prevention Guidance During Coronavirus Pandemic", "description": "If their medication supplies are low, patients should check their prescription benefit coverage with their health insurance and/or pharmacy benefit management companies to determine coverage for early refill or supply limits, prior to requesting refills from …", "url": "https://news.yahoo.com/apha-issues-preparedness-prevention-guidance-195100926.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/KUrMhaSIOyScwTRz263lVA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTMzOA--/https://s.yimg.com/uu/api/res/1.2/YzeEx4z0sw01fyF40WvYiA--~B/aD0xNjk7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/usnewswire.com/d02930d4a78209fba452433e61fe871d", "publishedAt": "2020-03-06T19:51:00Z", "content": "APhA Issues Preparedness and Prevention Guidance During Coronavirus Pandemic\r\nPR Newswire\r\nWASHINGTON, March 6, 2020\r\nWASHINGTON, March 6, 2020 /PRNewswire/ -- The American Pharmacists Association (APhA) recommends that patients and/or caregivers ensure that … [+3006 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nathaniel Whittemore", "title": "FluffyPony on Encryption, Clearview and How Coronavirus Could Impact Privacy", "description": "The former lead maintainer of Monero and co-founder of Tari speaks about the state of global privacy", "url": "https://finance.yahoo.com/news/fluffypony-encryption-clearview-coronavirus-could-200000042.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.s6Q6Sj4WaBjv9wgLQeipA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MjUuNg--/https://s.yimg.com/uu/api/res/1.2/9bWeODhGsmMU0w0Shf7K2g--~B/aD05MTY7dz0xNDIwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/coindesk_75/3bf175f15a6542b6ddc8eda785968268", "publishedAt": "2020-03-06T20:00:00Z", "content": "The former lead maintainer of Monero and co-founder of Tari speaks about the state of global privacy\r\nFor more episodes and free early access before our regular 3 p.m. Eastern time releases, subscribe with Apple Podcasts, Spotify, Pocketcasts, Google Podcasts… [+1019 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Jenni Avins", "title": "Byredo’s $35 hand sanitizer is 2020’s must-have luxury accessory", "description": "If you're going to get price-gouged on hand sanitizer, it might as well smell nice.", "url": "https://qz.com/1814074/thanks-to-coronavirus-byredos-35-hand-sanitizer-is-selling-out/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/byredo-rinse-free-hand-sanitizer_colorcorrected-e1583517052872.jpeg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-06T19:35:20Z", "content": "With fall 2020 Fashion Weeks now in the rearview, a champion accessory has emerged. It is not Jacquemus most miniature micro-bag, Bottega Venetas mushy pouch, or Marine Serrés full-skirted baseball cap. No, if you must leave the house for a fashion show, prem… [+1845 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aditya Anand", "title": "Foreign tourists turned away by hotels in Rajasthan, Punjab, Uttar Pradesh", "description": "Travel operators seek urgent help from authorities over COVID-19 fallout", "url": "https://www.thehindu.com/news/national/other-states/foreign-tourists-turned-away-by-hotels-in-rajasthan-punjab-uttar-pradesh/article31004197.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/6bjj4j/article31004196.ece/ALTERNATES/LANDSCAPE_615/DE06-TOURIST", "publishedAt": "2020-03-06T20:08:31Z", "content": "Amidst the COVID-19 outbreak, travel operators on Friday sent an SOS to the government after hotels in Rajasthan, Punjab and Uttar Pradesh started turning away or demanding medical certificates from tourists hailing from Italy, South Korea, Japan etc. despite… [+2209 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rhania Kamel", "title": "Flying soon? How to minimize coronavirus risk on a plane", "description": "The COVID-19 outbreak has prompted many people to cancel or postpone their travel plans. But what if you have to fly?", "url": "https://news.yahoo.com/flying-soon-minimize-coronavirus-risk-191600938.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CUYb0SPwbdgJCnyta.7wxQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02NDA-/https://s.yimg.com/uu/api/res/1.2/UZrsg9AUe4wVbpu53NP1fg--~B/aD0xMjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/nbc_today_217/f45f3dc5d2d978481cd14387e82a6dff", "publishedAt": "2020-03-06T19:16:00Z", "content": "With spring break travel season in full bloom, the coronavirus outbreak has people wondering if they should put their upcoming plans on hold.\r\nThe U.S. Centers for Disease Control and Prevention has been regularly updating its site to share the latest informa… [+4701 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Eric Ting", "title": "These companies are asking Bay Area employees to work from home due to coronavirus", "description": "As fears grow over a widespread coronavirus outbreak in the San Francisco Bay Area, a number of companies have asked their Bay Area employees to work from home.", "url": "https://www.sfgate.com/bayarea/article/coronavirus-Bay-Area-companies-work-from-home-news-15111144.php", "urlToImage": "https://s.hdnux.com/photos/01/10/47/14/19034920/5/rawImage.jpg", "publishedAt": "2020-03-06T19:35:56Z", "content": "<ul><li>FILE - In this March 29, 2018 file photo shows the logo for Facebook at the Nasdaq MarketSite, in New York's Times Square. The social media company is one of many who are allowing their employees to work from home in the wake of coronavirus cases spro… [+3391 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Myra P. Saefong", "title": "Commodities Corner: OPEC+ oil-deal failure may lead to $30 oil prices", "description": "An effort by the Organization of the Petroleum Exporting Countries to stabilize the oil market ended in failure on Friday, with Russia rejecting a plan for addition output cuts and sending prices for the commodity plummeting to their lowest levels in roughly …", "url": "http://www.marketwatch.com/story/opec-oil-deal-failure-may-lead-to-30-oil-prices-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB680_opec_v_ZG_20200306143957.jpg", "publishedAt": "2020-03-06T20:05:29Z", "content": "An effort by the Organization of the Petroleum Exporting Countries to stabilize the oil market ended in failure on Friday, with Russia rejecting a plan for addition output cuts and sending prices for the commodity plummeting to their lowest levels in roughly … [+5746 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Danny Vena)", "title": "Twitter Expands Its Hate Speech Policy", "description": "The company has long struggled to rein in incendiary rhetoric and harassment on its platform.", "url": "https://www.fool.com/investing/2020/03/06/twitter-expands-its-hate-speech-policy.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562013/hand-of-man-typing-text-on-mobile-smartphone-with-chat-icon-appearing-above-phone.jpg", "publishedAt": "2020-03-06T20:10:00Z", "content": "Twitter(NYSE:TWTR) announced this week that it is expanding rules designed to curb \"hateful conduct\" on its social media platform. In a blog post Thursday, the company said that it will no longer tolerate Tweets that denigrate other users based on age, disabi… [+1637 chars]"}]