[{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jenna Portnoy", "title": "Coronavirus in the DMV: What you need to know - The Washington Post", "description": "Coronavirus in the DMV: What you need to know The Washington Post Gov. Hogan: Patients with coronavirus had ‘concerning’ public interactions WTOP Governor: Maryland coronavirus cases linked to Egyptian cruise and Texas cases USA TODAY Three more coronavirus i…", "url": "https://www.washingtonpost.com/dc-md-va/2020/03/07/maryland-virginia-dc-coronavirus/", "urlToImage": "https://www.washingtonpost.com/resizer/himFlqqW1ttIMErLBMWuH4CiBeU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4MAPRNDABYI6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-08T03:03:59Z", "content": "Hospitals and health agencies are stocking up on protective equipment and testing kits, public transit systems are adding new cleaning protocols, and officers and school systems are making plans to operate remotely if necessary. Here are answers to frequently… [+4877 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Associated Press", "title": "US health officials wanted to recommend that elderly Americans avoid flying amid the coronavirus crisis. The White House overruled them.", "description": "Associated Press/Manuel Balce Ceneta Health officials wanted to recommend that elderly Americans avoid flying on commercial airlines due to coronavirus concerns, but White House officials overruled them, one federal official said. The Centers for Disease Cont…", "url": "https://www.businessinsider.com/white-house-coronavirus-health-recommendation-seniors-2020-3", "urlToImage": "https://i.insider.com/5e645edcfee23d2e102f2ad2?width=1200&format=jpeg", "publishedAt": "2020-03-08T03:06:38Z", "content": "NEW YORK (AP) — The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the new coronavirus, a federal official told The Associated Press.\r\nThe Ce… [+5161 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Jiraporn Kuhakan", "title": "Transgender queen crowned in Thailand as coronavirus limits crowd", "description": "After temperature checks for contestants and with a smaller crowd than last year because of coronavirus fears, Mexico's Valentina Fluchaire was crowned in Thailand as winner of what is billed as the world's biggest transgender pageant on Saturday. Although Mi…", "url": "https://news.yahoo.com/transgender-queen-crowned-thailand-coronavirus-021223627.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/h4TWPSe1YJZkLQUL7AV0xQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjUuNg--/https://s.yimg.com/uu/api/res/1.2/D_MWECFokeDM3utcW_qWzw--~B/aD01NDE7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/f78dc7a7c3019490e556e318e6756c55", "publishedAt": "2020-03-08T02:12:23Z", "content": "By Jiraporn Kuhakan\r\nPATTAYA (Reuters) - After temperature checks for contestants and with a smaller crowd than last year because of coronavirus fears, Mexico's Valentina Fluchaire was crowned in Thailand as winner of what is billed as the world's biggest tra… [+1740 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "People at centre of China's virus outbreak say time to end lockdown", "description": "For days now, several cities at the heart of China's deadly coronavirus epidemic have not recorded any new infections -- so residents such as factory worker Tang Wushan have a message for the authorities: it's time to lift their quarantine. Tang lives in cent…", "url": "https://news.yahoo.com/people-centre-chinas-virus-outbreak-time-end-lockdown-030128402.html", "urlToImage": null, "publishedAt": "2020-03-08T03:01:28Z", "content": null}, {"source": {"id": null, "name": "Ksl.com"}, "author": null, "title": "Health officials working to identify Utahns who interacted with coronavirus patient - KSL.com", "description": "Health officials working to identify Utahns who interacted with coronavirus patient KSL.com Utah's governor declares a state of emergency because of novel coronavirus FOX 13 News Utah First coronavirus case diagnosed in Utah hours after governor declares stat…", "url": "https://www.ksl.com/article/46727035/health-officials-working-to-identify-utahns-who-interacted-with-coronavirus-patient", "urlToImage": null, "publishedAt": "2020-03-08T02:11:48Z", "content": null}, {"source": {"id": null, "name": "Kmph.com"}, "author": "Marie Edinger", "title": "Coronavirus reaches Central Valley - KMPH Fox 26", "description": "Coronavirus reaches Central Valley KMPH Fox 26 First coronavirus case hits Fresno County after travelers return from cruise Sacramento Bee First case of COVID-19 confirmed in Fresno County Los Angeles Times Health officials confirm first case of Coronavirus i…", "url": "http://kmph.com/news/local/coronavirus-reaches-central-valley", "urlToImage": "http://static-11.sinclairstoryline.com/resources/media/9341d351-4bfc-4861-ba82-938353ccc925-large16x9_BREAKINGNEWS.png?1583635994027", "publishedAt": "2020-03-08T02:54:51Z", "content": null}, {"source": {"id": null, "name": "Wkyt.com"}, "author": "Grace Finerman", "title": "How to avoid COVID-19 and what to do if you start showing symptoms - WKYT", "description": "How to avoid COVID-19 and what to do if you start showing symptoms WKYT A flu shot won't prevent coronavirus, but it could help our response to the outbreak Livescience.com 'This isn't a drill', says WHO to governments over COVID-19 outbreak WION Coronavirus …", "url": "https://www.wkyt.com/content/news/Kentucky-doctor-shares-how-to-avoid-COVID-19-and-what-to-do-if-you-start-showing-symptoms-568600041.html", "urlToImage": "https://media.graytvinc.com/images/GRACE+WEB8.jpg", "publishedAt": "2020-03-08T02:41:29Z", "content": "NICHOLASVILLE, Ky. (WKYT) - Doctors say there are a lot of similarities between COVID-19 and the common flu.\r\nSo, if you are having symptoms, how do you know if you have the coronavirus...the flu...or even just a cold? How can you keep yourself healthy?\r\nYest… [+1837 chars]"}, {"source": {"id": null, "name": "Sacbee.com"}, "author": null, "title": "Elk Grove Unified, largest district in N. California, cancels all classes over coronavirus - Sacramento Bee", "description": "Elk Grove Unified, largest district in N. California, cancels all classes over coronavirus Sacramento Bee Elk Grove Unified cancels events due to the coronavirus. What it means for Sheldon boys Sacramento Bee Hmong American runs for Elk Grove Unified board to…", "url": "https://www.sacbee.com/community/elk-grove/article240994046.html", "urlToImage": null, "publishedAt": "2020-03-08T02:55:59Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "Coronavirus jump | Italy poised to lock down Lombardy", "description": "The new rules include telling people not to enter or leave Lombardy, which is home to some 10 million people, as well as 11 provinces in four of Italy's 19 other regions, according to a draft decree seen by Reuters.", "url": "https://www.thehindu.com/news/international/coronavirus-jump-italy-poised-to-lock-down-lombardy/article31014138.ece", "urlToImage": "https://www.thehindu.com/news/international/rha4uy/article31014137.ece/ALTERNATES/LANDSCAPE_615/LOMBARDY", "publishedAt": "2020-03-08T02:53:38Z", "content": "Italy is set to impose a virtual lockdown on its wealthiest and most populous region, which includes the financial capital Milan, as part of tough new measures to try to contain the coronavirus outbreak.\r\nThe new rules include telling people not to enter or l… [+3559 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "SE Cupp: This is why we're panicked about coronavirus - CNN", "description": "SE Cupp: This is why we're panicked about coronavirus CNN Trump ‘didn’t know people died from the flu.’ It killed his grandfather. The Washington Post Inside Trump Administration, Debate Raged Over What to Tell Public The New York Times The Coronavirus Is Com…", "url": "https://www.youtube.com/watch?v=s_ypH6Bk-oY", "urlToImage": "https://i.ytimg.com/vi/s_ypH6Bk-oY/maxresdefault.jpg", "publishedAt": "2020-03-08T02:28:53Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nightly News Full Broadcast (March 7th) - NBC News", "description": "The latest on the coronavirus outbreak as 3,500 passengers on a quarantined cruise ship are still stranded at sea, Bernie Sanders and Joe Biden set for a Mic...", "url": "https://www.youtube.com/watch?v=t79JyT_OkbU", "urlToImage": "https://i.ytimg.com/vi/t79JyT_OkbU/maxresdefault.jpg", "publishedAt": "2020-03-08T02:19:35Z", "content": "The latest on the coronavirus outbreak as 3,500 passengers on a quarantined cruise ship are still stranded at sea, Bernie Sanders and Joe Biden set for a Michigan showdown, and Harry and Meghan are in London for final royal events."}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Arctic Winter Games canceled because of coronavirus concerns", "description": "The Arctic Winter Games have been canceled because of concerns about the coronavirus outbreak", "url": "https://www.foxsports.com/other/story/arctic-winter-games-canceled-because-of-coronavirus-concerns-030720", "urlToImage": "https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png", "publishedAt": "2020-03-08T02:15:32Z", "content": "WHITEHORSE, Yukon (AP) — The Arctic Winter Games have been canceled because of concerns about the coronavirus outbreak.\r\nThe games, which celebrate northern sports and culture from around the circumpolar world, were schedule to begin March 16 in Whitehorse.\r\n… [+207 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Boing Boing's Shop", "title": "Rad Power ebikes might be the future of commuting", "description": "Back in 2007, high schooler Mike Radenbaugh got tired of pumping his old bicycle back and forth to campus every day. Instead, he pulled together some parts, attached an electric motor to his bike — and his first e-bike was born. It wouldn’t be his last. 13 ye…", "url": "https://boingboing.net/2020/03/07/rad-power-ebikes-might-be-the.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/03/DSCF8079-scaled.jpeg?fit=1200%2C800&ssl=1", "publishedAt": "2020-03-08T03:00:43Z", "content": "Back in 2007, high schooler Mike Radenbaugh got tired of pumping his old bicycle back and forth to campus every day. Instead, he pulled together some parts, attached an electric motor to his bike and his first e-bike was born.\r\nIt wouldnt be his last. 13 year… [+4153 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": null, "title": "From canceled conferences to supply woes: The coronavirus' impact on the tech sector - Rappler", "description": "How has the coronavirus changed the technology sector in recent weeks? Here's a rundown of just what's happened.", "url": "https://www.rappler.com/technology/features/253728-coronavirus-impact-tech-sector", "urlToImage": "https://assets.rappler.com/1AACD3EEC09D42A78FC665D7532A59C8/img/731E1117FADE447FA16EA28D06CBFB56/afp-coronavirus-technology-000_1OQ8TS-20200307.jpg", "publishedAt": "2020-03-08T03:00:00Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Michael M. Phillips", "title": "Washington, D.C., Confirms First Case of Coronavirus - Wall Street Journal", "description": "Washington, D.C., Confirms First Case of Coronavirus Wall Street Journal Trump 'not concerned' as first coronavirus case confirmed in Washington, D.C. POLITICO First presumptive positive case of coronavirus in DC has been confirmed WTOP Officials confirm firs…", "url": "https://www.wsj.com/articles/washington-d-c-confirms-first-case-of-coronavirus-11583635572", "urlToImage": "https://images.wsj.net/im-161967/social", "publishedAt": "2020-03-08T02:52:00Z", "content": "WASHINGTONThe nations capital confirmed its first case of coronavirus on Saturday, while a pair of prominent advocacy groups reported that three people tested positive for the virus after attending conferences around Washington, D.C.\r\nWashington Mayor Muriel … [+217 chars]"}, {"source": {"id": null, "name": "Columbian.com"}, "author": null, "title": "First COVID-19 case confirmed in Clark County - The Columbian", "description": "First COVID-19 case confirmed in Clark County The Columbian Clark County first responders under voluntary quarantine after being exposed to COVID-19 KGW News Health officials confirm first case of COVID-19 in Clark Co. KPTV.com 3 Washington counties see first…", "url": "https://www.columbian.com/news/2020/mar/07/first-covid-19-case-confirmed-in-clark-county/", "urlToImage": "https://pcdn.columbian.com/wp-content/uploads/2020/02/China_Virus_11980.jpg-47cd1.jpg", "publishedAt": "2020-03-08T03:11:30Z", "content": "“We expect to get through the backlog soon,” Koenig said in her email.\r\nKoenig said she can’t share the number of pending tests causing the backlog. Melnick said he hopes to have more test results soon, but said Public Health hasn’t gotten a definitive timeli… [+1137 chars]"}, {"source": {"id": null, "name": "Datascience.community"}, "author": "Ryan Swanstrom", "title": "Cloud Data Science 10", "description": "Lots of happenings this week. The Cloud Data Science world is keeping busy. Also, the coronavirus is affecting many upcoming conferences, so just be aware of that. News Honeywell has … The post Cloud Data Science 10 appeared first on Data Science 101.", "url": "https://101.datascience.community/2020/03/07/cloud-data-science-10/", "urlToImage": "https://101.datascience.community/wp-content/uploads/2020/03/cloud-data-science-thumb.jpg", "publishedAt": "2020-03-08T03:05:54Z", "content": null}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Michael Idato", "title": "Business as usual say networks as coronavirus shutters key TV market - The Age", "description": "Taking a bigger hit will be small- to medium-sized Australian content producers who lose a key platform to source foreign investment in local content.", "url": "https://www.smh.com.au/culture/tv-and-radio/business-as-usual-say-networks-as-coronavirus-shutters-key-tv-market-20200306-p547qb.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.26264880952380953%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_198/t_crop_custom/q_86%2Cf_auto/e9c9c766a87a416e1adacf008089c7f4d5363f8f", "publishedAt": "2020-03-08T02:36:16Z", "content": "Foxtel's director of content Ross Crowley said all international events like MipTV would \"be subject to scrutiny in the short term, and [content] rights trading will go online for a period until we can all meet safely again\".\r\nAfter losing key participants su… [+3111 chars]"}, {"source": {"id": null, "name": "Nst.com.my"}, "author": "AFP", "title": "Tech lifestyles enable 'safe escape' from Covid-19 - New Straits Times", "description": "SAN FRANCISCO: For people hunkering down due to the Covid-19 coronavirus epidemic, the tech sector has become their new best friend with an array of lifestyle solutions making “social distancing” easier.", "url": "https://www.nst.com.my/lifestyle/bots/2020/03/572731/tech-lifestyles-enable-safe-escape-covid-19", "urlToImage": "https://assets.nst.com.my/images/articles/Techlife-MS0803_NSTfield_image_socialmedia.var_1583635045.jpg", "publishedAt": "2020-03-08T02:39:11Z", "content": "SAN FRANCISCO: For people hunkering down due to the Covid-19 coronavirus epidemic, the tech sector has become their new best friend with an array of lifestyle solutions making social distancing easier.\r\nThose wanting to avoid crowds can have meals delivered f… [+4055 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus Coverage Isn’t Alarmist; It’s One Thing Mainstream Media Gets Right - CCN.com", "description": "Coronavirus Coverage Isn’t Alarmist; It’s One Thing Mainstream Media Gets Right CCN.com Coronavirus: Will consuming alcohol protect you? - Drinking alcohol will not protect you from COVID-19: WHO Economic Times Coronavirus follows a century of epidemics, dati…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vd3d3LmNjbi5jb20vY29yb25hdmlydXMtY292ZXJhZ2UtaXNudC1hbGFybWlzdC1pdHMtb25lLXRoaW5nLW1haW5zdHJlYW0tbWVkaWEtZ2V0cy1yaWdodC_SAWFodHRwczovL3d3dy5jY24uY29tL2Nvcm9uYXZpcnVzLWNvdmVyYWdlLWlzbnQtYWxhcm1pc3QtaXRzLW9uZS10aGluZy1tYWluc3RyZWFtLW1lZGlhLWdldHMtcmlnaHQv?oc=5", "urlToImage": null, "publishedAt": "2020-03-08T02:57:00Z", "content": null}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "Over 1 lakh confirmed cases of coronavirus reported globally: WHO - All India Radio", "description": "Over 1 lakh confirmed cases of coronavirus reported globally: WHO All India Radio Coronavirus: Will consuming alcohol protect you? - Drinking alcohol will not protect you from COVID-19: WHO Economic Times Answer Bank: Will the novel coronavirus disappear in s…", "url": "http://newsonair.com/News?title=Over-1-lakh-confirmed-cases-of-coronavirus-reported-globally:-WHO&id=382593", "urlToImage": "http://www.newsonair.com/writereaddata/News_Pictures/INT/2020/Mar/NPIC-20203875719.jpg", "publishedAt": "2020-03-08T03:01:14Z", "content": "World Health Organisation has said that More than one lakh confirmed cases of the novel coronavirus have been reported globally.WHO spokesperson Tarik Jasarevic said, out of one lakh one thousand 827 confirmed cases, 3,484 patients have died world over.\r\nOn F… [+305 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Curtis Tate and Antonio Fins and Morgan Hines, USA TODAY", "title": "Princess says passenger brought coronavirus on ship; cruise companies to change boarding protocols", "description": "Princess Cruises said Saturday that a California man who died on Wednesday was likely infected with the coronavirus before he boarded a ship.", "url": "https://news.yahoo.com/princess-says-passenger-brought-coronavirus-020754438.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/i4c1spYeyUIZa26HXq0xDw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MTEuNzMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/fYTAAHh6_XXFlH7f9wOmJw--~B/aD0yNTM4O3c9NDAwMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_travel_320/d97265c8038b7e47443869f0ebb27cc6", "publishedAt": "2020-03-08T02:28:30Z", "content": "Vice President Michael Pence gives a speech during the 55th Munich Security Conference on Feb. 16, 2019, in Munich, Germany.\r\nCruise companies will change how they board passengers after Princess Cruises said Saturday that a California man who died on Wednesd… [+5060 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Jeanine Pirro argues coronavirus may be less deadly than the flu in latest Fox News conspiracy theory", "description": "Supporters of President Donald Trump continue to downplay the severity of the coronavirus epidemic as criticism grows over the White House’s bungled response. Fox News personality Jeanine Pirro on Saturday argued that the flu could actually have a higher mort…", "url": "https://www.rawstory.com/2020/03/jeanine-pirro-argues-coronavirus-may-be-less-deadly-than-the-flu-in-latest-fox-news-conspiracy-theory/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/03/Jeanine-Pirro.jpg", "publishedAt": "2020-03-08T02:40:00Z", "content": "Politico on Saturday published a new report titled, \"How Trumps haphazard management style made the coronavirus crisis worse: Current and former administration officials blame the president for creating a no-bad-news atmosphere that stifled attempts to combat… [+511 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Drinking alcohol will not protect you from Covid-19, says WHO - India Today", "description": "Drinking alcohol will not protect you from Covid-19, says WHO India Today Coronavirus Outbreak: Six burning FAQs about COVID-19 which will help you prevent the deadly disease Jagran English Answer Bank: Will the novel coronavirus disappear in summer? CGTN Cor…", "url": "https://www.indiatoday.in/world/story/drinking-alcohol-will-not-protect-you-from-covid-19-says-who-1653555-2020-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202003/2020-02-24T124928Z_30711830_RC-647x363.png?zl9_c3vL0MHxSVcTgizQRlZnTHSY.0Qt", "publishedAt": "2020-03-08T02:39:31Z", "content": "With 31 individuals diagnosed with the deadly novel coronavirus (COVID-19) in India, everyone seems to be going into a state of panic.\r\nAnd as a fallout, people are believing just about anything and everything they are coming across on the internet. Among sev… [+1297 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Uber says it will compensate drivers diagnosed with coronavirus", "description": "Bloomberg earlier reported Uber's move to pay drivers exposed to the coronavirus in the United States, and said it had already compensated five quarantined but ultimately non-infected drivers in Britain and Mexico. Uber has repeatedly said that its drivers ar…", "url": "https://finance.yahoo.com/news/uber-says-compensate-drivers-diagnosed-022959695.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/4KU6yxE0YD6nwqO.pxY9hA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/R2TD8TcB5.3SplqPoMX5Tg--~B/aD00NTA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e9ec41c4803001b44f1ca1a01d04fbe1", "publishedAt": "2020-03-08T02:29:59Z", "content": "(Reuters) - Uber Technologies Inc said on Saturday it will offer compensation to drivers and delivery people diagnosed with the coronavirus or placed in quarantine for up to 14 days.\r\nThe company has already started compensating drivers in some markets and is… [+675 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "19 Dead From Coronavirus In US, New York Declares State Of Emergency - NDTV News", "description": "19 Dead From Coronavirus In US, New York Declares State Of Emergency NDTV News Coronavirus: US deaths rise to 19 as New York declares state of emergency The Guardian Coronavirus: New York governor declares state of emergency as 400 now infected nationwide The…", "url": "https://www.ndtv.com/world-news/coronavirus-outbreak-19-dead-in-united-states-from-coronavirus-new-york-declares-state-of-emergency-2191706", "urlToImage": "https://c.ndtvimg.com/2020-03/7rmn8ago_us-coronavirus650_625x300_08_March_20.jpg", "publishedAt": "2020-03-08T02:50:06Z", "content": "The two latest deaths were in Washington's King County, the hardest hit area in the US. (Reuters)\r\nTwo more people succumbed to the novel coronavirus in Washington state, officials said on Saturday, bringing the nationwide total to 19, while the number of con… [+5967 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "MICHAEL BALSAMO and DARLENE SUPERVILLE", "title": "Officials confirm first coronavirus case in nation's capital", "description": "A man in his 50s tested positive for coronavirus — the first presumptively confirmed case in the nation’s capital — and another person who traveled through the city has also tested positive in Maryland, officials said. District of Columbia Mayor Muriel Bowser…", "url": "https://news.yahoo.com/officials-confirm-first-coronavirus-case-025701866.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/vlfK9M3Oshca0Bkqigb_SA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/47xR_DiJ5BJwDcD8ckCfTQ--~B/aD0zNDM4O3c9NTE1NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/2d748630f4fb23754dfef569d5209d2c", "publishedAt": "2020-03-08T02:57:01Z", "content": "WASHINGTON (AP) A man in his 50s tested positive for coronavirus the first presumptively confirmed case in the nations capital and another person who traveled through the city has also tested positive in Maryland, officials said.\r\nDistrict of Columbia Mayor M… [+3828 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus update: Tech lifestyles enable 'safe escape' from the deadly virus COVID-19 - Livemint", "description": "The latest tech-inspired lifestyle solutions are gaining traction as more people are advised to work from home, and many conferences and gatherings are cancelled.Anyone with an internet connection can use Amazon or e-commerce rivals to deliver provisions from…", "url": "https://www.livemint.com/news/world/coronavirus-update-tech-lifestyles-enable-safe-escape-from-deadly-virus-covid-19-11583632956438.html", "urlToImage": "https://images.livemint.com/img/2020/03/08/600x338/PTI04-03-2020_000202B_1583405426640_1583633361203.jpg", "publishedAt": "2020-03-08T02:11:41Z", "content": "For people hunkering down due to the coronavirus epidemic, the tech sector has become their new best friend with an array of lifestyle solutions making \"social distancing\" easier.Those wanting to avoid crowds can have meals delivered from restaurants, stream … [+4107 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Phillip Nieto", "title": "EBay Bans Sales Of All Face Masks And Hand Sanitizers Amid Coronavirus Outbreak", "description": "EBay has banned the sale of hand sanitizers and face masks due to price gauging by sellers amidst the Coronavirus outbreak, CNBC reported Friday.", "url": "https://dailycaller.com/2020/03/07/ebay-bans-face-masks-and-hand-sanitizers/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/03/GettyImages-1197056221-e1583632919981.jpg", "publishedAt": "2020-03-08T02:13:41Z", "content": "EBay has banned the sale of hand sanitizers and face masks due to price gauging by sellers amidst the Coronavirus outbreak, CNBC reported Friday.\r\n“Our first priority is to ensure the safety of our employees and customers around the world,” a spokesperson for… [+1589 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "MICHAEL BALSAMO, DARLENE SUPERVILLE", "title": "Officials confirm first coronavirus case in Washington, D.C.", "description": "President Trump said he wasn't concerned “at all” about the coronavirus getting closer to the White House after the first Washington case was confirmed and officials said an attendee of a recent political conference in the capital where Trump himself had spok…", "url": "https://www.bostonglobe.com/2020/03/08/nation/officials-confirm-first-coronavirus-case-washington-dc/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/LhmCgFAzL_mV2xU7AyL6rfMxI5M=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/TC7K4FVI3ZEFDNJ2HQJH6GZY3U.jpg", "publishedAt": "2020-03-08T03:02:36Z", "content": "WASHINGTON A man in his 50s tested positive Saturday for coronavirus the first presumptively confirmed case in the nations capital and another person who traveled through the city has also tested positive in Maryland, officials said.\r\nDistrict of Columbia May… [+3763 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "​ Our Correspondent, Salman Siddiqui, Our Correspondent, Our Correspondents, News Desk, ​ Our Correspondent, AFP, News Desk, Social Desk", "title": "Turmoil in global markets weighs on PSX", "description": "KSE-100 index increases 236 points amid growing cases of coronavirus The post Turmoil in global markets weighs on PSX appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2171501/2-turmoil-global-markets-weighs-psx/", "urlToImage": "https://c.tribune.com.pk/2020/03/2171501-image-1583607735-837-640x480.jpg", "publishedAt": "2020-03-08T02:57:47Z", "content": "KARACHI:  \r\nAfter a brutal hammering seen in the past week, the stock market finished the outgoing week 236 points up to settle at 38,220 points – a figure which does not aptly reflect the volatility that marred the Pakistan Stock Exchange.\r\nWith the total nu… [+4276 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump's mismanagement helped fuel coronavirus crisis (Dan Diamond/Politico)", "description": "Dan Diamond / Politico : Trump's mismanagement helped fuel coronavirus crisis — On Friday, as coronavirus infections rapidly multiplied aboard a cruise ship marooned off the coast of California, health department officials and Vice President Mike Pence came u…", "url": "https://www.memeorandum.com/200307/p88", "urlToImage": "https://static.politico.com/7f/b4/61e6ae6f4fefa8d7974d2d75b150/200307-trump-cdc-2-ap-773.jpg", "publishedAt": "2020-03-08T02:40:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "TOM HUNT", "title": "What we know about the five New Zealand coronavirus patients", "description": "Five New Zealanders have been confirmed as having coronavirus. Here is what we know about them.", "url": "https://www.stuff.co.nz/dominion-post/news/120105345/coronavirus-what-we-know-about-the-five-new-zealand-coronavirus-patients", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/i/1/3/5/image.related.StuffLandscapeSixteenByNine.1420x800.1zi9vl.png/1583634667373.jpg", "publishedAt": "2020-03-08T02:31:04Z", "content": "As of Sunday afternoon, New Zealand had five confirmed cases on the novel coronavirus covid19.\r\n Some of these patients have travelled overseas, others have caught the virus off family members. Some have isolated themselves quickly, while others have taken fl… [+7259 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "CPAC attendee tested positive for coronavirus (Greg Clary/CNN)", "description": "Greg Clary / CNN : CPAC attendee tested positive for coronavirus — (CNN)The American Conservative Union announced on Saturday that one of the attendees at last week's Conservative Political Action Conference in National Harbor, Maryland, has tested positive f…", "url": "https://www.memeorandum.com/200307/p90", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200305221748-cpac-sign-super-tease.jpg", "publishedAt": "2020-03-08T02:55:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "The Coronavirus Is Coming for Trump's Presidency (Ross Douthat/New York Times)", "description": "Ross Douthat / New York Times : The Coronavirus Is Coming for Trump's Presidency — Will a nationalist president be undone by his underreaction to a foreign threat? — On Jan. 31, over a month ago, the Trump administration made an excellent decision: In an effo…", "url": "https://www.memeorandum.com/200307/p89", "urlToImage": "https://static01.nyt.com/images/2020/03/08/opinion/sunday/08douthat/08douthat-facebookJumbo.jpg", "publishedAt": "2020-03-08T02:55:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "The Latest: US state of Missouri reports first virus case", "description": "BEIJING (AP) — The Latest on the coronavirus outbreak (all times local):", "url": "https://www.bostonherald.com/2020/03/07/the-latest-us-state-of-missouri-reports-first-virus-case/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/Virus_Outbreak_China_01179-1-1.jpg?w=1024&h=683", "publishedAt": "2020-03-08T02:41:25Z", "content": "BEIJING (AP) The Latest on the coronavirus outbreak (all times local):\r\n10:20 a.m.\r\nA St. Louis-area woman who recently traveled to Italy is the U.S. state of Missouris first confirmed coronavirus case.\r\nSt. Louis County Executive Sam Page said Saturday that … [+19211 chars]"}, {"source": {"id": null, "name": "Wattsupwiththat.com"}, "author": "Eric Worrall", "title": "Times: Coronavirus will Kill All the Old Climate Skeptics", "description": "Guest essay by Eric Worrall h/t Dr Willie Soon, h/t Liberty Sentinel; what kind of sick person publicly celebrates the possibility that all their political opponents will die a horrible death? The answer is a journalist who works for mainstream British media,…", "url": "https://wattsupwiththat.com/2020/03/07/times-coronavirus-will-kill-all-the-old-climate-skeptics/", "urlToImage": "https://i1.wp.com/wattsupwiththat.com/wp-content/uploads/2020/03/Times-Ed-Conway.jpg?fit=300%2C300&ssl=1", "publishedAt": "2020-03-08T02:42:12Z", "content": "Guest essay by Eric Worrall\r\nh/t Dr Willie Soon, h/t Liberty Sentinel; what kind of sick person publicly celebrates the possibility that all their political opponents will die a horrible death? The answer is a journalist who works for mainstream British media… [+1396 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "LA resident who attended AIPAC diagnosed with coronavirus", "description": "Third person who attended AIPAC Conference in Washington, DC, diagnosed with coronavirus.", "url": "http://www.israelnationalnews.com/News/News.aspx/276967", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/941/941125.jpg", "publishedAt": "2020-03-08T02:25:00Z", "content": "A third person who attended the AIPAC Conference in Washington, DC, has been diagnosed with coronavirus, NBC Los Angeles reported on Saturday night.\r\nLA County health officials said that the person who was infected is a resident of the county who recently ret… [+859 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Uber says it will compensate drivers diagnosed with coronavirus", "description": "Uber Technologies Inc said on Saturday it will offer compensation to drivers and delivery people diagnosed with the coronavirus or placed in quarantine for up to 14 days.", "url": "https://www.channelnewsasia.com/news/world/uber-says-it-will-compensate-drivers-diagnosed-with-coronavirus-12513860", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12513858/16x9/991/557/160854626fc5d80274eb6588f737e2fa/jn/a-screen-displays-the-company-logo-for-uber-technologies-inc--on-the-day-of-it-s-ipo-at-the-nyse-in-new-york-2.jpg", "publishedAt": "2020-03-08T02:42:49Z", "content": "REUTERS: Uber Technologies Inc said on Saturday it will offer compensation to drivers and delivery people diagnosed with the coronavirus or placed in quarantine for up to 14 days.\r\nThe company has already started compensating drivers in some markets and is pl… [+702 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "White House overruled health officials who had urgent coronavirus warning for America’s seniors: report", "description": "The Associated Press issued a bombshell report on Saturday evening that the White House overruled medical experts who had sought to issue a warning to America’s seniors. “The White House overruled health officials who wanted to recommend that elderly and phys…", "url": "https://www.rawstory.com/2020/03/white-house-overruled-health-officials-who-had-urgent-coronavirus-warning-for-americas-seniors-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/10/trump-afp-6.jpg", "publishedAt": "2020-03-08T03:05:23Z", "content": "The Associated Press issued a bombshell report on Saturday evening that the White House overruled medical experts who had sought to issue a warning to America’s seniors.\r\n“The White House overruled health officials who wanted to recommend that elderly and phy… [+1247 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "New report details how Trump personally made America’s coronavirus response worse", "description": "Politico on Saturday published a new report titled, “How Trump’s haphazard management style made the coronavirus crisis worse: Current and former administration officials blame the president for creating a no-bad-news atmosphere that stifled attempts to comba…", "url": "https://www.rawstory.com/2020/03/new-report-details-how-trump-personally-made-americas-coronavirus-response-worse/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2019/11/trump-afp-5.jpg", "publishedAt": "2020-03-08T02:21:51Z", "content": "Politico on Saturday published a new report titled, “How Trumps haphazard management style made the coronavirus crisis worse: Current and former administration officials blame the president for creating a no-bad-news atmosphere that stifled attempts to combat… [+2880 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "Salman Siddiqui, Our Correspondent, Our Correspondents, News Desk, ​ Our Correspondent, AFP, News Desk, Social Desk", "title": "Reeling from coronavirus: Foreigners pull out over $73 million from PSX", "description": "Analyst expects selling to continue even if virus-affected global economy recovers The post Reeling from coronavirus: Foreigners pull out over $73 million from PSX appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2171507/2-reeling-coronavirus-foreigners-pull-73-million-psx/", "urlToImage": "https://c.tribune.com.pk/2020/03/2171507-image-1583607943-180-640x480.jpg", "publishedAt": "2020-03-08T02:56:28Z", "content": "Low interest rate encourages people to take bets at the stock market in a bid to earn comparatively higher profit, it was learnt. PHOTO: INP \r\nKARACHI: After a gap of around four-years, foreign investors gradually staged a comeback at the Pakistan Stock Excha… [+3664 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "Stuff", "title": "Coronavirus: Italy to lock down Milan and northern provinces", "description": "Italy is to quarantine more than 10 million people restricting travel in and out of the region worst hit by coronavirus.", "url": "https://www.stuff.co.nz/world/europe/120107598/coronavirus-italy-to-lock-down-milan-and-northern-provinces", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/f/6/b/r/image.related.StuffLandscapeSixteenByNine.1420x800.1zibm6.png/1583636837048.jpg", "publishedAt": "2020-03-08T03:06:43Z", "content": "Italy is to quarantine more than 10 million people, with a lockdown in the region of Lombardy  - which has Milan as its capital - and a dozen northern provinces.\r\n The decree which has now been signed off. Italian Prime Minister Giuseppe Conte announced that … [+1279 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "US, Japan women's soccer teams keep focus on games as coronavirus fears swirl", "description": "The U.S. and Japan women's national soccer teams said on Saturday they were laser-focused on preparing for the upcoming Olympics, even as a global coronavirus outbreak threatens the postponement or cancellation of the Tokyo Games.", "url": "https://www.channelnewsasia.com/news/sport/us--japan-women-s-soccer-teams-keep-focus-on-games-as-coronavirus-fears-swirl-12514426", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12514424/16x9/991/557/699b1e118194d2dbb3c017e17b4c877e/ZM/vlatko-andonovski-speaks-during-a-news-conference-to-announce-his-appointment-as-the-new-head-coach-of-u-s--women-s-national-soccer-team-in-new-york-1.jpg", "publishedAt": "2020-03-08T03:10:38Z", "content": "Harrison, NEW JERSEY: The U.S. and Japan women's national soccer teams said on Saturday they were laser-focused on preparing for the upcoming Olympics, even as a global coronavirus outbreak threatens the postponement or cancellation of the Tokyo Games.\r\nThe t… [+2303 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "How one New York school switched to online learning during coronavirus closure", "description": "SAR High School is at the center of the outbreak in New York City, which has spread to more than a dozen people in and around the Orthodox community of Westchester County", "url": "https://www.timesofisrael.com/how-one-new-york-school-switched-to-online-learning-during-coronavirus-closure/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/88037313_1821182578012389_1837767856863838208_o-1024x640.jpg", "publishedAt": "2020-03-08T03:00:46Z", "content": "NEW YORK (JTA) Tobie Brandriss and Bob Goodman, who chair the science department at SAR High School in the Bronx, believe, in Brandriss words, that kids learn science by doing science.\r\nSo it was a challenge for the two biology teachers and married couple whe… [+6335 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Cruise ships seek safe harbour as world takes drastic steps to halt COVID-19", "description": "Cruise ships are looking for safe harbour on four continents amid fears they are spreading the new coronavirus that has infected more than 100,000 people worldwide.", "url": "https://news.sky.com/story/coronavirus-cruises-seek-safe-harbour-as-world-takes-drastic-steps-to-halt-covid-19-11952575", "urlToImage": "https://e3.365dm.com/20/03/1600x900/skynews-carnival-parnorama_4941650.jpg?20200308030451", "publishedAt": "2020-03-08T02:39:00Z", "content": null}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "White House Overruled CDC on Seniors Flying", "description": "\"The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the new coronavirus,\" the AP reports.\"The Centers for Disease Control and Prevention subm…", "url": "https://politicalwire.com/2020/03/07/white-house-overruled-cdc-on-seniors-flying/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-03-08T03:00:16Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Official: White House didn't want to tell seniors not to fly (Mike Stobbe/Associated Press)", "description": "Mike Stobbe / Associated Press : Official: White House didn't want to tell seniors not to fly — NEW YORK (AP) — The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercia…", "url": "https://www.memeorandum.com/200307/p87", "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5d0dc834831412b8339164a103ab417/3000.jpeg", "publishedAt": "2020-03-08T02:30:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "David Goodman", "title": "Central Banks Search for Answers to Virus Impact: Eco Week", "description": "(Bloomberg) -- Global central bankers enter a new week under fresh pressure to outline the next steps in their battle to address the impact of the coronavirus outbreak.Policy makers got a wake up call last week as the Federal Reserve’s emergency interest rate…", "url": "https://finance.yahoo.com/news/central-banks-search-answers-virus-030000414.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/YKDzuB3OQ2Lvg2Dm6OPrjw--~B/aD0xMjk2O3c9MTI5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/f5552be047810b54c80b70a3d14f6677", "publishedAt": "2020-03-08T03:00:00Z", "content": "(Bloomberg) -- Global central bankers enter a new week under fresh pressure to outline the next steps in their battle to address the impact of the coronavirus outbreak.\r\nPolicy makers got a wake up call last week as the Federal Reserves emergency interest rat… [+4836 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "none@none.com (Ikram Junaidi)", "title": "Mild, moderate COVID-19 cases would be isolated in homes under new govt plan", "description": "ISLAMABAD: The government has developed a plan on how to accommodate patients in the event of a sudden outbreak of COVID-19, the disease caused by the novel coronavirus, in the country under which mild to moderate patients will be isolated in homes and critic…", "url": "https://www.dawn.com/news/1539282", "urlToImage": "https://i.dawn.com/large/2020/03/5e6465b56477f.png", "publishedAt": "2020-03-08T02:46:50Z", "content": "ISLAMABAD: The government has developed a plan on how to accommodate patients in the event of a sudden outbreak of COVID-19, the disease caused by the novel coronavirus, in the country under which mild to moderate patients will be isolated in homes and critic… [+3473 chars]"}, {"source": {"id": null, "name": "Gktoday.in"}, "author": "Subhasini Rajendran", "title": "Top Current Affairs Today’s News Headlines-8 March 2020", "description": "Here are Top Current Affairs Today’s News Headlines for 8 March, 2020 INDIA PM launches She Inspires Us campaign., to hand over his social media accounts “to women whose life, work inspire us” Coronavirus: Civilian visitors prohibited at BSF, BGB (Border Guar…", "url": "https://currentaffairs.gktoday.in/news-headlines/top-current-affairs-todays-news-headlines-8-march-2020", "urlToImage": "https://currentaffairs.gktoday.in/wp-content/uploads/2020/01/newspapers.png", "publishedAt": "2020-03-08T02:44:59Z", "content": null}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Business Standard", "title": "China reports 27 new coronavirus deaths, but lowest rise in cases since Jan", "description": "Only three cases, all imported from abroad, were reported outside of Hubei province, of which Wuhan is the capital, in Beijing and the northwest province of Gansu", "url": "https://www.business-standard.com/article/pti-stories/china-reports-27-new-virus-deaths-lowest-rise-in-cases-since-january-120030800097_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-03/06/full/1583504225-9148.jpg", "publishedAt": "2020-03-08T02:40:00Z", "content": "China on Sunday reported its lowest number of new coronavirus infections since January, with nearly all the 44 new cases in the outbreak epicentre Wuhan.\r\nThere were 27 new deaths from the virus, all in Wuhan and the lowest in more than a month, bringing the … [+1037 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Market Week Ahead: 10 key factors that will keep traders busy - Moneycontrol.com", "description": "Market Week Ahead: 10 key factors that will keep traders busy Moneycontrol.com Yes Bank customers scramble for cash at branches as most ATMs run dry Livemint EXCLUSIVE: RBI likely to offer Rs 8,000-10,000 crore special liquidity window for Yes Bank Moneycontr…", "url": "https://www.moneycontrol.com/news/business/markets/market-week-ahead-10-key-factors-that-will-keep-traders-busy-10-5013371.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/03/trader-stock-market-nse-bse-market-bull-bear-770x433.jpg", "publishedAt": "2020-03-08T02:57:00Z", "content": "The market witnessed a bear attack for another week that ended on March 6.\r\nThe situation was volatile since the beginning of the week, amid rapid spreading of the novel coronavirus outbreak outside China. The market tried to recover, but the surprise Yes Ban… [+10434 chars]"}, {"source": {"id": null, "name": "Brobible.com"}, "author": "paulsacca", "title": "PSA: Tito’s Vodka Wants You To Know That Booze As A Hand Sanitizer Won’t Stop The Spread Of Coronavirus", "description": "Everything from toilet paper to canned beans to doomsday prepper…", "url": "https://brobible.com/culture/article/titos-vodka-hand-sanitizer-coronavirus-remedy/", "urlToImage": "https://brobible.files.wordpress.com/2020/03/gettyimages-528777258.jpg?quality=90&w=650", "publishedAt": "2020-03-08T02:23:24Z", "content": "Getty Image / Robin Marchant / Stringer\r\nEverything from toilet paper to canned beans to doomsday prepper kits have been flying off the shelves since the coronavirus outbreak has steadily spread across the world and the United States. One of the most in-deman… [+3568 chars]"}, {"source": {"id": null, "name": "Realgm.com"}, "author": null, "title": "NBA Wants Teams To Have Contingency Plan For Coronavirus By Tuesday", "description": "The NBA delivered a memo giving teams a Tuesday deadline to deliver several precautionary measures for the coronavirus. The league will conduct a conference all with team doctors and trainers on Monday night. The NBA wants teams to have an infectious disease …", "url": "https://basketball.realgm.com/wiretap/257463/NBA-Wants-Teams-To-Have-Contingency-Plan-For-Coronavirus-By-Tuesday", "urlToImage": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg", "publishedAt": "2020-03-08T02:48:54Z", "content": "The NBA delivered a memo giving teams a Tuesday deadline to deliver several precautionary measures for the coronavirus.\r\nThe league will conduct a conference all with team doctors and trainers on Monday night.\r\nThe NBA wants teams to have an infectious diseas… [+218 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Richard Read", "title": "Seattle-area nursing home deaths jump to 13 with COVID-19 and 11 of unknown causes", "description": "A spokesman for Life Care Center of Kirkland said Saturday that 13 residents who have died tested positive for COVID-19. Eleven more residents died, he said, but autopsy results are not yet available to determine whether they had coronavirus.", "url": "https://www.latimes.com/world-nation/story/2020-03-07/nursing-home-coronavirus-deaths", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/91b8a99/2147483647/strip/true/crop/3600x1890+0+255/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F61%2F1f%2F92dc4568403d9c8d74d378caaefb%2Fgettyimages-1205707834.jpg", "publishedAt": "2020-03-08T02:41:29Z", "content": "Thirteen residents of a Seattle-area nursing home who died amid a coronavirus outbreak tested positive for COVID-19, three more than announced previously, according to a spokesman who described conditions Saturday at the facility as far more dire than had bee… [+5154 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus: Live updates | China reports more deaths; Italy hardest hit in Europe", "description": "In India, the total number of COVID-19 cases has increased to 34.", "url": "https://www.thehindu.com/news/national/coronavirus-live-updates-march-8-2020/article31014067.ece", "urlToImage": "https://www.thehindu.com/news/national/9p2ht6/article31014167.ece/ALTERNATES/LANDSCAPE_615/Coronavirus-Nurse1", "publishedAt": "2020-03-08T02:45:41Z", "content": "The number of COVID-19 cases has risen worldwide to more than 1,00,000, with 3,500 dead across 95 nations and territories.\r\nInteractive graphic shows the spread of coronavirus Reuters\r\nChina's new confirmed case count of the coronavirus cases fell by roughly … [+6264 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Jeff Zillgitt, USA TODAY", "title": "NBA continues to ramp up preparation for coronavirus spread", "description": "In an internal memo Saturday, the NBA instructed teams to have an arrangement with an infectious disease specialist among other new preparations.", "url": "https://www.usatoday.com/story/sports/nba/2020/03/07/nba-ramps-up-preparation-coronavirus-spread/4990908002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/08/USAT/c9a5782d-b07f-410d-92a5-678f499a3d25-NBA_basketball1.jpg?crop=3872,2178,x619,y904&width=3200&height=1680&fit=bounds", "publishedAt": "2020-03-08T02:17:55Z", "content": "SportsPulse: Founder, CEO and President of United Entertainment Group, Jarrod Moses, spoke with USA TODAY Sports about the possibility of sports arenas and stadiums being empty with growing fears surrounding the coronavirus.\r\nUSA TODAY\r\nThe NBA in an internal… [+2245 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Reuters, Reuters", "title": "South Korea to ration face masks as coronavirus cases rise", "description": "The number of new coronavirus cases in South Korea rose again on Sunday, albeit at a slightly lower rate than previous days, as officials called for the public to cooperate in new rationing policies for face masks.The Korea Centres for Disease Control and Pre…", "url": "https://www.scmp.com/news/asia/east-asia/article/3074118/south-korea-ration-face-masks-coronavirus-cases-rise", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/08/a1811538-60e3-11ea-be3e-43af5536d789_image_hires_103813.jpg?itok=T4eqFo_X&v=1583635099", "publishedAt": "2020-03-08T02:38:21Z", "content": "Published: 10:38am, 8 Mar, 2020\r\nUpdated: 10:38am, 8 Mar, 2020"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Maeve Sheehan, Cormac McQuinn, Niamh Horan, Ralph Riegel and Wayne O’Connor", "title": "Virus: faster sick pay is on the cards", "description": "Workers will be entitled to illness benefit immediately if they are forced to self-isolate due to coronavirus, under measures to be considered by a Cabinet sub-committee.", "url": "https://www.independent.ie/world-news/coronavirus/virus-faster-sick-pay-is-on-the-cards-39024626.html", "urlToImage": "https://www.independent.ie/incoming/7bf1c/39022477.ece/AUTOCROP/w1240h700/I-GM-Covid-Govt-002.jpg", "publishedAt": "2020-03-08T02:30:00Z", "content": "Workers will be entitled to illness benefit immediately if they are forced to self-isolate due to coronavirus, under measures to be considered by a Cabinet sub-committee.At present, they do not get state sick pay for the first six days, but moves to slash tha… [+5249 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Maeve Sheehan", "title": "Coronavirus: A week when sick list grew and grew", "description": "Day One: Covid-19 cases: 1, All Ireland: 2. Sunday morning in Dublin. A schoolboy is in isolation in a city hospital, the morning after he was confirmed as the first confirmed case of the coronavirus in the Republic of Ireland.", "url": "https://www.independent.ie/world-news/coronavirus/coronavirus-a-week-when-sick-list-grew-and-grew-39024689.html", "urlToImage": "https://www.independent.ie/incoming/2bfac/39024600.ece/AUTOCROP/w1240h700/S01-Read-Only%204%202.jpg", "publishedAt": "2020-03-08T02:30:00Z", "content": "Day One: Covid-19 cases: 1, All Ireland: 2. Sunday morning in Dublin. A schoolboy is in isolation in a city hospital, the morning after he was confirmed as the first confirmed case of the coronavirus in the Republic of Ireland.\r\nHe had returned from a trip to… [+9855 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "AP Domestic, AP", "title": "AP Top Stories arch 7 P", "description": "Here are the top stories for Saturday, March 7th: US Coronavirus death toll goes up; Thousands confined to cruise ship off San Francisco coast; Greek police fires tear gas to stop border migrants; Most famous sled dog race is underway in Alaska.", "url": "https://www.usatoday.com/videos/news/nation/2020/03/08/ap-top-stories-arch-7-p/644023000/", "urlToImage": "https://www.gannett-cdn.com/authoring/video-thumbnails/18a50dbd-e555-475b-884b-fc87fa801048_poster.jpg?quality=10", "publishedAt": "2020-03-08T02:15:52Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "John Aidan Byrne", "title": "Coronavirus may force NYC office staffers to work remotely", "description": "Batten down the hatches — New York City is lurching closer to a lockdown.", "url": "https://nypost.com/2020/03/07/coronavirus-may-force-nyc-office-staffers-to-work-remotely/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/shutterstock_615508904.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-08T02:56:45Z", "content": "Batten down the hatches New York City is lurching closer to a lockdown.\r\nWith the largest white-collar workforce of any US city, hundreds of thousands of New Yorks mobile tech-equipped workers can be dispatched rapidly to work remotely from home and alternati… [+3776 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Uber says it will compensate drivers diagnosed with coronavirus", "description": "Uber Technologies Inc said on Saturday it will offer compensation to drivers and delivery people diagnosed with the coronavirus or placed in quarantine for up to 14 days.", "url": "https://in.reuters.com/article/health-coronavirus-uber-idINKBN20V03D", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500214657&w=1200&r=LYNXMPEG2702M", "publishedAt": "2020-03-08T02:29:59Z", "content": "(Reuters) - Uber Technologies Inc said on Saturday it will offer compensation to drivers and delivery people diagnosed with the coronavirus or placed in quarantine for up to 14 days. \r\nThe company has already started compensating drivers in some markets and i… [+677 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Watch: Women Fight Over Toilet Paper In Australia Amid Coronavirus Fears", "description": "Australian state police on Sunday charged two Sydney women involved in a violent brawl over toilet rolls as major grocers in the country restrict supplies to one pack per person amid panic buying by residents.", "url": "https://www.ndtv.com/world-news/watch-women-fight-over-toilet-paper-at-australia-supermarket-amid-coronavirus-fears-2191709", "urlToImage": "https://c.ndtvimg.com/2020-03/jl83g8hg_australia-toilet-paper_625x300_08_March_20.jpg", "publishedAt": "2020-03-08T02:59:50Z", "content": "A woman, in possession of a toilet paper-filled trolley, denied even one roll to another woman in need.\r\nSYDNEY: Australian state police on Sunday charged two Sydney women involved in a violent brawl over toilet rolls as major grocers in the country restrict … [+1411 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Egypt says cruise ship quarantined over new virus cluster", "description": "A cruise ship on Egypt's Nile River with over 150 tourists and local crew was in quarantine Saturday in the southern city of Luxor, as 45 people on board tested positive for the new coronavirus, authorities said.", "url": "https://economictimes.indiatimes.com/news/international/world-news/egypt-says-cruise-ship-quarantined-over-new-virus-cluster/articleshow/74533601.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74533641,width-1070,height-580,imgsize-543680,overlay-economictimes/photo.jpg", "publishedAt": "2020-03-08T02:40:11Z", "content": "LUXOR, Egypt : A cruise ship on Egypt's Nile River with over 150 tourists and local crew was in quarantine Saturday in the southern city of Luxor, as 45 people on board tested positive for the new coronavirus, authorities said.\r\nA Taiwanese-American tourist w… [+5560 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "DAVID LONG", "title": "New Zealand tennis can dream big after Davis Cup win over Venezuela", "description": "A glamour Davis Cup tie beckons for NZ after the win over Venezuela", "url": "https://www.stuff.co.nz/sport/tennis/120107874/new-zealand-tennis-can-dream-big-after-davis-cup-win-over-venezuela", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/i/5/j/g/image.related.StuffLandscapeSixteenByNine.1420x800.1zibtu.png/1583635817859.jpg", "publishedAt": "2020-03-08T02:50:15Z", "content": "A win over Venezuela in the Davis Cup isn't that much of a victory in itself, but the reward it brings is big for New Zealand tennis.\r\n The Alistair Hunt led team defeated the South American country 3-1 at the ASB Tennis Arena in Auckland this weekend and it … [+3189 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "LA resident who attended AIPAC diagnosed with coronavirus", "description": null, "url": "http://www.israelnationalnews.com/News/Flash.aspx/490529", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/799/799624.jpg", "publishedAt": "2020-03-08T02:29:00Z", "content": "A third person who attended the AIPAC Conference in Washington, DC, has been diagnosed with coronavirus, NBC Los Angeles reported on Saturday night.\r\nLA County health officials said that the person who was infected is a resident of the county who recently ret… [+31 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Mary Papenfuss", "title": "CPAC Attendee Tests Positive For Coronavirus, Didn’t Have Contact With Trump", "description": "The affected individual had no contact with the president, according to the American Conservative Union, which has been in touch with the White House.", "url": "https://www.huffpost.com/entry/coronavirus-cpac-trump-pence_n_5e643381c5b68d6164555902", "urlToImage": "https://img.huffingtonpost.com/asset/5e644326230000841839cf2f.jpeg?cache=E2YihMpyoo&ops=1200_630", "publishedAt": "2020-03-08T02:27:51Z", "content": "An individual who attended the Conservative Political Action Conference where President Donald Trumpwas the featured speaker last month has tested positive for the new coronavirus, announced the American Conservative Union, which organized the event.\r\nA state… [+3267 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "No Author, No Author", "title": "China reports 27 new coronavirus deaths in lowest rise since January", "description": "China on Sunday reported its lowest number of new coronavirus infections since January, with nearly all the 44 new cases in the outbreak epicenter Wuhan.There...", "url": "https://www.japantimes.co.jp/news/2020/03/08/asia-pacific/science-health-asia-pacific/china-coronavirus-4/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/03/f-chinavirus-a-20200309-870x580.jpg", "publishedAt": "2020-03-08T02:23:24Z", "content": "BEIJING – China on Sunday reported its lowest number of new coronavirus infections since January, with nearly all the 44 new cases in the outbreak epicenter Wuhan.\r\nThere were 27 new deaths from the virus, all in Wuhan and the lowest in more than a month, bri… [+1050 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Five nations seal Davis Cup Finals debuts", "description": "Five nations sealed their Davis Cup Finals debuts in the weekend's qualifiers while heavyweights Germany, Australia, United States and Croatia also booked their places in Madrid.", "url": "https://www.reuters.com/article/us-tennis-daviscup-idUSKBN20V02T", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T02:12:00Z", "content": "LONDON (Reuters) - Five nations sealed their Davis Cup Finals debuts in the weekend’s qualifiers while heavyweights Germany, Australia, United States and Croatia also booked their places in Madrid. \r\nEcuador, Sweden, Hungary, Czech Republic and Austria will a… [+2764 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "newsfeeds@nzherald.co.nz", "title": "Coronavirus: Italy seals off 10 million people in Lombardy region", "description": "Italy will reportedly seal off an entire region of 10 million people in a desperate attempt to contain its coronavirus outbreak, with 1200 new cases and 50 deaths in the nation in 24 hours.Elsewhere, a cruise ship on Egypt's Nile...", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12314882", "urlToImage": "https://www.nzherald.co.nz/resizer/5y1owT7LrDiRXfo0_2xgWhqQgzY=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/FTAWQDFY2VCKPDKFVLSWQUYURA.jpg", "publishedAt": "2020-03-08T02:25:11Z", "content": "Italy has sealed off around 16 million people in the region of Lombardy and 14 other provinces in a desperate attempt to contain its coronavirus outbreak, with 1200 new cases and 50 deaths in the nation in 24 hours.\r\n Elsewhere, a cruise ship on Egypt's Nile … [+8106 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Australian Associated Press", "title": "Hotel staffer SKIPS coronavirus quarantine and works shifts at a Hobart hotel", "description": "The student, aged in his 20s, arrived in Hobart on February 26 after travelling from Nepal and Singapore and suffered cold-like symptoms in the days following.", "url": "https://www.dailymail.co.uk/news/article-8087725/Hotel-staffer-SKIPS-coronavirus-quarantine-works-shifts-Hobart-hotel.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/08/03/25681198-0-image-a-7_1583636920116.jpg", "publishedAt": "2020-03-08T03:08:48Z", "content": "A young man in Hobart who has tested positive to coronavirus ignored health advice to self-isolate and worked at a major hotel in the city.\r\nThe student, aged in his 20s, arrived in Hobart on February 26 after travelling from Nepal and Singapore and suffered … [+1148 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "newsfeeds@nzherald.co.nz", "title": "Trump dismisses fears he was exposed to coronavirus after man at rally tests positive", "description": "President Donald Trump says he isn't concerned \"at all\" about the coronavirus getting closer to the White House after the nation's capital reported its first case Saturday. Maryland officials warned Saturday that a person who attended...", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12314896", "urlToImage": "https://www.nzherald.co.nz/resizer/k-WDspJK70xL9JtPGX3RtfF6K_A=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/3JQQQLLV2ZCUPGNTKVFHRUK4AI.jpg", "publishedAt": "2020-03-08T03:07:00Z", "content": "President Donald Trump says he isn't concerned \"at all\" about the coronavirus getting closer to the White House after the nation's capital reported its first case Saturday.\r\n Maryland officials warned Saturday that a person who attended the recent Conservativ… [+1587 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Sharp For Dailymail.com", "title": "4,000 passengers stranded on board ANOTHER cruise ship as one person is tested for coronavirus", "description": "The Carnival Panorama cruise ship (pictured) has been docked in Long Beach, California, and passengers are being ordered to stay on the boat while the woman is tested for the deadly disease.", "url": "https://www.dailymail.co.uk/news/article-8087579/4-000-passengers-stranded-board-cruise-ship-one-person-tested-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/08/02/25681018-0-image-a-35_1583636080601.jpg", "publishedAt": "2020-03-08T03:05:43Z", "content": "Up to 4,000 passengers are stranded on board another cruise ship off the coast of California while they wait for the outcome of a coronavirus test on one sick passenger.\r\nThe Carnival Panorama cruise ship has been docked in Long Beach and passengers are being… [+8397 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shreya Chauhan", "title": "Yoga, Gau Mutra And Gobar Will Cure Coronavirus: 5 False Claims Spread By 'Influential' People", "description": "Click here to to find out how personalities like Yogi Adityanath and Donald Trump are spreading misinformation about coronavirus.", "url": "https://www.indiatimes.com/trending/social-relevance/coronavirus-misinfornation-yoga-gau-mutra-april-heat-yogi-adityanath-donald-trump-507715.html", "urlToImage": "https://im.indiatimes.in/content/2020/Mar/7-FBImage_5e5f971c6ba88.jpg", "publishedAt": "2020-03-08T03:10:00Z", "content": "Coronavirus has led to a world-wide panic. But it has also spread an infodemic. A lot of misinformation about how it spreads and how it can be cured is doing rounds on social media, spreading further, unnecessary panic. Playing a massive role in spreading mis… [+5653 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Yereth Rosen", "title": "Iditarod race starts with pageantry and focus on preventing disease spread", "description": "With snow falling lightly and crowds of spectators packed along the sidewalks of downtown Anchorage, 57 mushers and their dog teams started the 48th Iditarod Trail Sled Dog Race on Saturday.", "url": "https://www.reuters.com/article/us-alaska-race-idUSKBN20V03X", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500224164&w=1200&r=LYNXMPEG2704J", "publishedAt": "2020-03-08T03:02:43Z", "content": "ANCHORAGE (Reuters) - With snow falling lightly and crowds of spectators packed along the sidewalks of downtown Anchorage, 57 mushers and their dog teams started the 48th Iditarod Trail Sled Dog Race on Saturday. \r\nThe 11-mile trot through Alaska’s biggest ci… [+3221 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Dr Ciara Kelly", "title": "Contagion risk means it's time to back the collective good over individualism", "description": "Not unexpectedly, the cases of Covid-19 have climbed to 19 on this island at time of going to print - and I have no doubt they will rise further in the coming week.", "url": "https://www.independent.ie/opinion/comment/contagion-risk-means-its-time-to-back-the-collective-good-over-individualism-39024674.html", "urlToImage": "https://www.independent.ie/incoming/46c57/39024596.ece/AUTOCROP/w1240h700/virus1-b-Read-Only.jpg", "publishedAt": "2020-03-08T02:30:00Z", "content": "Not unexpectedly, the cases of Covid-19 have climbed to 19 on this island at time of going to print - and I have no doubt they will rise further in the coming week. \r\nCovid-19 is relatively easily transmissible - more so than SARS, less so than measles. We ca… [+5710 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Liam Collins", "title": "Let politicos just talk - doctor knows best", "description": "So what is the great haste about getting a new government? The commentariat are tearing their hair out in despair that, as we slip perilously closer to an epidemic nobody really understands, there isn't a government in session shouting insults and jeering at …", "url": "https://www.independent.ie/irish-news/politics/let-politicos-just-talk-doctor-knows-best-39024703.html", "urlToImage": "https://www.independent.ie/business/0162c/36681831.ece/AUTOCROP/w1240h700/2017-01-05_bus_27539970_I1.JPG", "publishedAt": "2020-03-08T02:30:00Z", "content": "So what is the great haste about getting a new government? The commentariat are tearing their hair out in despair that, as we slip perilously closer to an epidemic nobody really understands, there isn't a government in session shouting insults and jeering at … [+2780 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Italy to quarantine Milan, Venice and other regions: Media", "description": "Italy will quarantine the entire Lombardy region around Milan to limit the spread of the coronavirus as well as areas around and including Venice and the cities of Parma and Rimini, Italian media reported Saturday.", "url": "https://economictimes.indiatimes.com/news/international/world-news/italy-to-quarantine-milan-venice-and-other-regions-media/articleshow/74533581.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74533585,width-1070,height-580,imgsize-479125,overlay-economictimes/photo.jpg", "publishedAt": "2020-03-08T02:19:11Z", "content": "ROME: Italy will quarantine the entire Lombardy region around Milan to limit the spread of the coronavirus as well as areas around and including Venice and the cities of Parma and Rimini, Italian media reported Saturday.\r\nA draft of a government resolution ob… [+2245 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "Nextrush Free", "title": "Nextrush Unplugged: Weekend Version Business Rules...Coronavirus In Italy Now Worse Than..", "description": "Well here we are on the weekend when clocks move forward one hour for those of us in the USA that's Sunday morning at 2 am. A set of songs here the beautiful Mac Davis song \"I Believe In Music\" as done by Gallery followed by the man who wrote \"Snowbird\" singi…", "url": "https://www.freerepublic.com/focus/f-bloggers/3822720/posts", "urlToImage": null, "publishedAt": "2020-03-08T02:55:45Z", "content": "Skip to comments.\r\nNextrush Unplugged: Weekend Version Business Rules...Coronavirus In Italy Now Worse Than..Nextrush Free ^\r\n | 3/7/2020\r\n | Nextrush/Self\r\nPosted on 03/07/2020 6:55:45 PM PST by Nextrush\r\nWell here we are on the weekend when clocks move forw… [+4108 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "J. Edward Moreno", "title": "US Marine contracts coronavirus in Virginia, the first case in the state", "description": "A U.S. marine in Fort Belvoir, Va. tested positive for the COVID-19 coronavirus,...", "url": "https://thehill.com/policy/healthcare/486474-us-marine-contracts-coronavirus-in-virginia-the-first-case-in-the-state", "urlToImage": "https://thehill.com/sites/default/files/coronavirus_030520getty_0.jpg", "publishedAt": "2020-03-08T02:41:46Z", "content": "A U.S. marine in Fort Belvoir, Va. tested positive for the COVID-19 coronavirus, Virginia health officials announced Saturday.\r\nAccording to Department of Defense spokesperson Jonathan Hoffman, the patient is currently being treated at Fort Belvoir Community … [+1783 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "Stuff", "title": "Coronavirus: Italy to lock down Milan and northern proivinces", "description": "Italy is to quarantine more than 10 million people restricting travel in and out of the region worst hit by coronavirus.", "url": "https://www.stuff.co.nz/world/europe/120107598/coronavirus-italy-to-lock-down-milan-and-northern-proivinces", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/f/6/b/r/image.related.StuffLandscapeSixteenByNine.1420x800.1zibm6.png/1583635648219.jpg", "publishedAt": "2020-03-08T02:42:57Z", "content": "Italy is to quarantine more than 10 million people, with a lockdown in the region of Lombardy  - which has Milan as its capital - and a dozen northern provinces.\r\n The decree which has now been signed off. Italian Prime Minister Giuseppe Conte announced that … [+787 chars]"}, {"source": {"id": null, "name": "Zerohedge.com"}, "author": "Tyler Durden", "title": "Elon Musk Says Panic About Coronavirus, Which Has Killed Over 3,400, Is \"Dumb\"", "description": "Elon Musk Says Panic About Coronavirus, Which Has Killed Over 3,400, Is \"Dumb\" It probably wouldn't be a global news item if the world's greatest genius-cum subsidy addict-cum securities fraudster didn't weigh in with his two cents about it on Twitter. Such w…", "url": "https://www.zerohedge.com/health/elon-musk-says-panic-about-coronavirus-which-has-killed-over-3400-people-dumb", "urlToImage": "https://www.zerohedge.com/s3/files/styles/max_650x650/public/2020-03/this%20guy.png?itok=Yq4aBqH9", "publishedAt": "2020-03-08T02:40:22Z", "content": "It probably wouldn't be a global news item if the world's greatest genius-cum subsidy addict-cum securities fraudster didn't weigh in with his two cents about it on Twitter. Such was the case with Elon Musk and the ongoing coronavirus saga Friday. Musk, perha… [+3239 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Bloomberg, Bloomberg", "title": "Apple’s 5G iPhone launch may see coronavirus delay, analysts say", "description": "Apple extended its recent sell-off, as analysts continue to see uncertainty over how the coronavirus outbreak will affect the iPhone maker’s sales and supply chain.The US technology giant’s highly anticipated 5G iPhone could see its fall release delayed by a …", "url": "https://www.scmp.com/tech/big-tech/article/3074120/apples-5g-iphone-launch-may-see-coronavirus-delay-analysts-say", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/08/49db72b0-60e8-11ea-be3e-43af5536d789_image_hires_111016.jpg?itok=d11PPbu9&v=1583637022", "publishedAt": "2020-03-08T03:10:24Z", "content": "Published: 11:10am, 8 Mar, 2020\r\nUpdated: 11:10am, 8 Mar, 2020"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "NBCNews.com", "title": "D.C. Mayor: First coronavirus case has 'no history of international travel'", "description": "Washington D.C. Mayor Muriel Bowser discusses the details behind the first COVID-19 coronavirus case in the nation's capital.", "url": "https://www.nbcnews.com/video/washington-d-c-mayor-details-first-covid-19-coronavirus-case-in-nation-s-capital-80253509789", "urlToImage": "https://media14.s-nbcnews.com/j/MSNBC/Components/Video/202003/Virus_Outbreak_Washington_15206.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-08T02:21:11Z", "content": null}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "JENNY NOYES", "title": "Coronavirus: Charges laid over toilet paper fight at Australian supermarket", "description": "Australian police have charged two women with affray over an alleged assault sparked by toilet paper panic-buying at a Sydney Woolworths.", "url": "https://www.stuff.co.nz/world/australia/120107408/coronavirus-charges-laid-over-toilet-paper-fight-at-australian-supermarket", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/i/4/1/i/image.related.StuffLandscapeSixteenByNine.1420x800.1zibgw.png/1583634787824.jpg", "publishedAt": "2020-03-08T02:33:07Z", "content": "The furore over toilet paper panic-buying has escalated with two women charged in Australia following an alleged assault at a supermarket that was captured on video.\r\n The women, aged 23 and 60, have been charged with affray over the alleged fight at a Sydney… [+2780 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Michael Levenson - The New York Times", "title": "CPAC attendee has the coronavirus, officials say", "description": "The organizer, the American Conservative Union, said the attendee was exposed to the virus before the four-day event and tested positive for it Saturday.", "url": "https://www.thestar.com/news/world/2020/03/07/cpac-attendee-has-the-coronavirus-officials-say.html", "urlToImage": "https://images.thestar.com/smoIkKKlvQHMd5XGJZ6WzBcn_kY=/1200x800/smart/filters:cb(1583636492554)/https://www.thestar.com/content/dam/thestar/news/world/2020/03/07/cpac-attendee-has-the-coronavirus-officials-say/cpac.jpg", "publishedAt": "2020-03-08T03:01:31Z", "content": "An attendee of a conservative conference where President Donald Trump and Vice President Mike Pence spoke last week has tested positive for the coronavirus, according to the event’s organizer.\r\nThe organizer, the American Conservative Union, which hosts the a… [+4127 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "nCoV: Aircraft cockpits to be disinfected too now", "description": "While aircraft passenger cabins are cleaned and disinfected according to laid-down procedures to combat the spread of coronavirus, there were no procedures in place to disinfect the flight deck used by pilots, till Saturday evening. Late in the evening, follo…", "url": "https://timesofindia.indiatimes.com/city/mumbai/coronavirus-scare-aircraft-cockpits-to-be-disinfected-too-now/articleshow/74533704.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74533721,width-1070,height-580,imgsize-905714,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-08T02:31:01Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Michael Balsamo And Darlene Superville - The Associated Press", "title": "Officials confirm first coronavirus case in nation’s capital", "description": "WASHINGTON - A man in his 50s tested positive Saturday for coronavirus — the first presumptively confirmed case in the nation’s capital — and another ...", "url": "https://www.thestar.com/news/world/us/2020/03/07/officials-confirm-first-coronavirus-case-in-nations-capital.html", "urlToImage": "https://images.thestar.com/X-3A8hGYO7e8QXqiPkNeD2Afw5U=/1280x1024/smart/filters:cb(1583636447706)/https://www.thestar.com/content/dam/thestar/news/world/us/2020/03/07/officials-confirm-first-coronavirus-case-in-nations-capital/DCPS105-38_2020_011847.jpg", "publishedAt": "2020-03-08T02:58:09Z", "content": "WASHINGTON - A man in his 50s tested positive Saturday for coronavirus the first presumptively confirmed case in the nations capital and another person who travelled through the city has also tested positive in Maryland, officials said.\r\nDistrict of Columbia … [+4034 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Sean Pollock", "title": "Musgrave contacts key suppliers over coronavirus fears", "description": "Musgrave, the retail group behind grocery chains SuperValu and Centra, has contacted suppliers asking for information on the predicted effect of coronavirus on their supply chains.", "url": "https://www.independent.ie/business/irish/musgrave-contacts-key-suppliers-over-coronavirus-fears-39023906.html", "urlToImage": "https://www.independent.ie/incoming/7b398/39023921.ece/AUTOCROP/w1240h700/app-supervalu.jpg", "publishedAt": "2020-03-08T02:30:00Z", "content": "Musgrave, the retail group behind grocery chains SuperValu and Centra, has contacted suppliers asking for information on the predicted effect of coronavirus on their supply chains.In an email, seen by the Sunday Independent, suppliers have been asked whether … [+2071 chars]"}, {"source": {"id": null, "name": "10tv.com"}, "author": null, "title": "Official: White House didn’t want to tell seniors not to fly", "description": "NEW YORK (AP) — The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the new coronavirus, a federal official told The Associated Press. The Cen…", "url": "https://www.10tv.com/article/official-white-house-didnt-want-tell-seniors-not-fly-2020-mar", "urlToImage": "https://www.10tv.com/sites/default/files/styles/article_image/public/2020/03/07/mikepencevirus.jpg?itok=ZUerUBOm", "publishedAt": "2020-03-08T02:46:20Z", "content": "NEW YORK (AP) The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the new coronavirus, a federal official told The Associated Press.\r\nThe Cent… [+4338 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Cormac McQuinn", "title": "Trump's party gets $12k from SF backer", "description": "A major Sinn Fein supporter in the United States has donated thousands of dollars to Donald Trump's Republican Party.", "url": "https://www.independent.ie/irish-news/politics/trumps-party-gets-12k-from-sf-backer-39024685.html", "urlToImage": "https://www.independent.ie/irish-news/756e1/36002260.ece/AUTOCROP/w1240h700/PANews_5fae5902-f385-4835-810a-db42bc9057e2_I1.jpg", "publishedAt": "2020-03-08T02:30:00Z", "content": "A major Sinn Fein supporter in the United States has donated thousands of dollars to Donald Trump's Republican Party.\r\nMary Lou McDonald has been highly critical of Mr Trump, but one of Sinn Fein's biggest Irish-American backers, retired construction tycoon P… [+2079 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MICHAEL BALSAMO and DARLENE SUPERVILLE Associated Press", "title": "Officials confirm first coronavirus case in nation's capital", "description": "WASHINGTON (AP) — A man in his 50s tested positive Saturday for coronavirus — the first presumptively confirmed case in the nation’s capital — and another person who traveled through the city has also tested positive in Maryland, officials said.", "url": "https://apnews.com/6e76e3cd7d70182d38a33d6b69a5ae99", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/1/0c/10cc9b06-f4a2-51fc-aeb4-45760966d1c5/5e64600a53fd5.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-03-08T03:05:32Z", "content": "WASHINGTON (AP) A man in his 50s tested positive Saturday for coronavirus the first presumptively confirmed case in the nations capital and another person who traveled through the city has also tested positive in Maryland, officials said.\r\nDistrict of Columbi… [+3976 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Ben Steverman", "title": "Heirs of the ultra-wealthy can profit even as markets plunge due to coronavirus fears", "description": "The worldwide worry over coronavirus creates a glimmer of good news for at least one segment of the US population: the top 0.1pc.", "url": "https://www.independent.ie/business/world/heirs-of-the-ultra-wealthy-can-profit-even-as-markets-plunge-due-to-coronavirus-fears-39023900.html", "urlToImage": "https://www.independent.ie/business/f03ba/39023899.ece/AUTOCROP/w1240h700/2020-03-08_bus_57511842_I1.JPG", "publishedAt": "2020-03-08T02:30:00Z", "content": "The worldwide worry over coronavirus creates a glimmer of good news for at least one segment of the US population: the top 0.1pc.\r\nThe super-wealthy can deploy sophisticated strategies to pass on billions of dollars to their descendants tax-free. Plunging int… [+4003 chars]"}, {"source": {"id": null, "name": "Startribune.com"}, "author": "MICHAEL BALSAMO and DARLENE SUPERVILLE", "title": "Officials confirm first coronavirus case in nation's capital", "description": "A man in his 50s tested positive Saturday for coronavirus — the first presumptively confirmed case in the nation's capital — and another person who traveled through the city has also tested positive in Maryland, officials said.", "url": "http://www.startribune.com/officials-confirm-first-coronavirus-case-in-nation-s-capital/568600302/", "urlToImage": "http://assets.startribune.com/static/img/branding/logos/strib-social-card.png?d=1583264200", "publishedAt": "2020-03-08T03:00:18Z", "content": "WASHINGTON A man in his 50s tested positive Saturday for coronavirus the first presumptively confirmed case in the nation's capital and another person who traveled through the city has also tested positive in Maryland, officials said.\r\nDistrict of Columbia Ma… [+3720 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Arctic Winter Games canceled because of coronavirus concerns", "description": "WHITEHORSE, Yukon (AP) — The Arctic Winter Games have been canceled because of concerns about the coronavirus outbreak.", "url": "https://apnews.com/d3c058db06eadf47ecd560f9da087af3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-03-08T02:15:32Z", "content": "WHITEHORSE, Yukon (AP) The Arctic Winter Games have been canceled because of concerns about the coronavirus outbreak.\r\nThe games, which celebrate northern sports and culture from around the circumpolar world, were schedule to begin March 16 in Whitehorse.\r\nTh… [+358 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Sean Pollock", "title": "Combilift sale of vehicles in China delayed due to coronavirus", "description": "Combilift, the Co Monaghan-based forklift manufacturer, has had to delay the sale of 10 vehicles to a client in China after choosing not to invite Chinese authorities to test its factory due to the coronavirus outbreak.", "url": "https://www.independent.ie/business/irish/combilift-sale-of-vehicles-in-china-delayed-due-to-coronavirus-39023908.html", "urlToImage": "https://www.independent.ie/business/irish/59434/39023907.ece/AUTOCROP/w1240h700/2020-03-08_bus_57513626_I1.JPG", "publishedAt": "2020-03-08T02:30:00Z", "content": "Combilift, the Co Monaghan-based forklift manufacturer, has had to delay the sale of 10 vehicles to a client in China after choosing not to invite Chinese authorities to test its factory due to the coronavirus outbreak.\r\nThe sale of the vehicles - which are i… [+1111 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "No Author, No Author", "title": "Chinese hotel used to observe virus contacts collapses", "description": "Dozens of people remained trapped Sunday in a collapsed hotel in southeastern China that was being used for medical observation of people who had contact...", "url": "https://www.japantimes.co.jp/news/2020/03/08/asia-pacific/science-health-asia-pacific/chinese-hotel-collapses/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/03/f-chinahotel-a-20200309-870x579.jpg", "publishedAt": "2020-03-08T02:23:24Z", "content": "BEIJING – Dozens of people remained trapped Sunday in a collapsed hotel in southeastern China that was being used for medical observation of people who had contact with coronavirus patients.\r\nForty-three people had been pulled from the rubble of the Xinjia Ex… [+1259 chars]"}, {"source": {"id": null, "name": "Thestar.com.my"}, "author": "Yereth Rosen", "title": "Iditarod race starts with pageantry and focus on preventing disease spread", "description": "ANCHORAGE (Reuters) - With snow falling lightly and crowds of spectators packed along the sidewalks of downtown Anchorage, 57 mushers and their dog teams started the 48th Iditarod Trail Sled Dog Race on Saturday.", "url": "https://www.thestar.com.my/news/world/2020/03/08/iditarod-race-starts-with-pageantry-and-focus-on-preventing-disease-spread", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2020/03/08/595727.JPG", "publishedAt": "2020-03-08T02:49:00Z", "content": "ANCHORAGE (Reuters) - With snow falling lightly and crowds of spectators packed along the sidewalks of downtown Anchorage, 57 mushers and their dog teams started the 48th Iditarod Trail Sled Dog Race on Saturday.\r\nThe 11-mile trot through Alaska's biggest cit… [+3205 chars]"}]