[{"source": {"id": "engadget", "name": "Engadget"}, "author": "Marc DeAngelis", "title": "Konami’s TurboGrafx-16 mini has been delayed due to coronavirus", "description": "The TurboGrafx-16 is the latest system from the late '80s and early '90s to get a mini console revival and join the likes of the Nintendo NES Classic Edition and Sega Genesis Mini. Fans will have to wait, though, as production has been delayed indefinitely fo…", "url": "https://www.engadget.com/2020/03/06/turbografx-16-mini-delayed-coronavirus/", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2020-03%252Fae2f9090-5fba-11ea-afbf-55fb7ddb354c%26client%3Da1acac3e1b3290917d92%26signature%3D553e59b96f107cc95677eb83c4ca9a427ff8b9be&client=amp-blogside-v2&signature=4bf0e595df9d0e65ec0d2b997d96384362d370b3", "publishedAt": "2020-03-06T15:14:00Z", "content": "Konami said in a statement on Twitter that \"the manufacturing and shipping facilities in China have encountered an unavoidable suspension due to the current coronavirus (COVID-19) outbreak. As a result, the delivery of all PC Engine Core Grafx mini products, … [+1025 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Taylor Lyles", "title": "TurboGrafx-16 Mini delayed after coronavirus shuts down production", "description": "Konami announced today that the TurboGrafx-16 Mini, a retro revival of the classic Japanese gaming console set to release on March 19th has been delayed indefinitely due to the coronavirus outbreak.", "url": "https://www.theverge.com/2020/3/6/21167774/turbografx-16-mini-delayed-coronavirus-konami-production", "urlToImage": "https://cdn.vox-cdn.com/thumbor/915-9X3U7mVlbbF_yS80YLHaG4w=/0x138:1000x662/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18306282/turbografx_16.jpg", "publishedAt": "2020-03-06T15:37:41Z", "content": "A new release date has yet to be announced\r\nImage: Konami\r\nThe TurboGrafx-16 Mini, a retro revival of the classic Japanese gaming console originally set to be released on March 19th, has been delayed due to the coronavirus outbreak, Konami announced today. \r\n… [+902 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: Trump's dangerous freelancing on coronavirus", "description": "On Friday morning, amid questions of why President Donald Trump had canceled a planned trip to Atlanta to visit the Centers for Disease Control and Prevention, the White House released this statement:", "url": "https://www.cnn.com/2020/03/06/politics/trump-cdc-trip-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306094614-03-trump-coronavirus-bill-0306-super-tease.jpg", "publishedAt": "2020-03-06T16:11:15Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "Most U.S. States Have Conducted Fewer Than 50 Coronavirus Tests", "description": "President Trump’s coronavirus task force promised earlier this week that 1 million tests for the virus would be distributed to states by the end of the week, with Vice President Mike Pence insisting on Tuesday that “any American can be tested.” It’s Friday, a…", "url": "https://gizmodo.com/coronavirus-usa-update-number-of-covid-19-cases-tests-1842128180", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jgzhgsjxoojtxitmofm0.jpg", "publishedAt": "2020-03-06T15:39:00Z", "content": "President Trumps coronavirus task force promised earlier this week that 1 million tests for the virus would be distributed to states by the end of the week, with Vice President Mike Pence insisting on Tuesday that any American can be tested. Its Friday, and i… [+16223 chars]"}, {"source": {"id": null, "name": "Wgal.com"}, "author": null, "title": "Coronavirus: Two 'presumed' cases now in Pennsylvania - WGAL Susquehanna Valley Pa.", "description": "Coronavirus: Two 'presumed' cases now in Pennsylvania WGAL Susquehanna Valley Pa. Presumed coronavirus case confirmed in Delaware County; Central Bucks School District closes 5 schools The Philadelphia Inquirer 2 presumed positive coronavirus cases in Pa., in…", "url": "https://www.wgal.com/article/pennsylvania-coronavirus-update-governor-covid-19/31260024", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/wolf-news-conference-1583506088.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-03-06T15:27:00Z", "content": "HARRISBURG, Pa. —There are two \"presumed\" cases of coronavirus in Pennsylvania, according to Gov. Tom Wolf.\r\nWolf made the announcement at a Friday morning news conference. He said the cases are \"presumed\" because while they tested positive with the state, th… [+5381 chars]"}, {"source": {"id": null, "name": "Wxii12.com"}, "author": null, "title": "Here's a list of disinfectants you can use against coronavirus - WXII The Triad", "description": "Here's a list of disinfectants you can use against coronavirus WXII The Triad List Of Disinfectants You Can Use Against Coronavirus CBS Miami Coronavirus: EPA list of disinfectants you can use against COVID-19 AL.com EPA releases list of approved cleaning pro…", "url": "https://www.wxii12.com/article/here-s-a-list-of-disinfectants-you-can-use-against-coronavirus/31250157", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/coronavirus-disinfectant-1583509194.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*", "publishedAt": "2020-03-06T15:48:00Z", "content": "The U.S. Environmental Protection Agency is arming consumers with a list of disinfectants that people can use to protect themselves from the novel coronavirus.\r\nThe federal agency released a five-page list of chemicals and products Thursday that it says are s… [+2217 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Dow Jones Snaps Back After Plunging Nearly 900 Points, As Coronavirus Stock Market Correction Intensifies - Investor's Business Daily", "description": "Dow Jones Snaps Back After Plunging Nearly 900 Points, As Coronavirus Stock Market Correction Intensifies Investor's Business Daily Fear grips Wall Street: Dow tumbles again CNN Stocks nosedive as coronavirus overshadows strong jobs report Fox Business Corona…", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-coronavirus-stock-market-correction-worsens-apple-stock/", "urlToImage": "https://www.investors.com/wp-content/uploads/2018/11/stock-bear-wave-04-adobe.jpg", "publishedAt": "2020-03-06T16:07:03Z", "content": "The Dow Jones Industrial Average crumbled as much as 895 points early Friday before strongly rebounding off its lows as the coronavirus stock market correction intensified. The 10-year Treasury yield plunged below 0.7% an all-time low as investors flocked to … [+5184 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Google, Facebook, Amazon Ask Employees to Stay Away From HQs as They Bunker Down Against Coronavirus", "description": "Tech giants including Facebook, Amazon, and Google have asked employees to work from home amid the novel coronavirus outbreak.", "url": "https://www.businessinsider.com/facebook-google-amazon-twitter-microsoft-headquarters-close-coronavirus-2020-3#facebook-instructed-employees-at-its-me", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20200306152945-facebook-hero.jpeg", "publishedAt": "2020-03-06T15:50:14Z", "content": "This story originally appeared on Business InsiderSilicon Valley is bracing itself for the coronavirus.\r\nThrough February and March, tech companies have banned non-essential travel, cancelled appearances at highly anticipated conferences like SXSW, and suspen… [+4688 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Joe Rossignol", "title": "'Today at Apple' Sessions Suspended in Italy Amid Coronavirus Outbreak", "description": "\"Today at Apple\" sessions have been suspended at all Apple Stores in Italy through at least March 19, as noted by setteBIT and iMore, presumably as a precautionary measure due to the ongoing COVID-19 coronavirus outbreak. Italy has been hit particularly bad b…", "url": "https://www.macrumors.com/2020/03/06/today-at-apple-canceled-italy-coronavirus/", "urlToImage": "https://images.macrumors.com/article-new/2020/03/today-at-apple-banner.jpg", "publishedAt": "2020-03-06T16:09:00Z", "content": "\"Today at Apple\" sessions have been suspended at all Apple Stores in Italy through at least March 19, as noted by setteBIT and iMore, presumably as a precautionary measure due to the ongoing COVID-19 coronavirus outbreak.\r\nItaly has been hit particularly bad … [+621 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Rahul Gandhi Screened For Coronavirus, Says Congress After BJP's Swipe - NDTV News", "description": "Congress leader Rahul Gandhi was screened for coronavirus infection at Delhi airport on his return from Italy on February 29, the party said today, responding to caustic digs from two parliamentarians, including the BJP's Ramesh Bidhuri", "url": "https://www.ndtv.com/india-news/coronavirus-outbreak-after-bjps-swipe-congress-says-rahul-gandhi-screened-for-virus-2191225", "urlToImage": "https://i.ndtvimg.com/i/2018-01/rahul-gandhi-at-meghalaya-rock-concert_650x400_71517379211.jpg", "publishedAt": "2020-03-06T15:13:00Z", "content": "Rahul Gandhi thanked medical staff who briefed him on COVID-19 symptoms (File)\r\nNew Delhi: Congress leader Rahul Gandhi was screened for coronavirus infection at Delhi airport on his return from Italy on February 29, the party said today. The confirmation cam… [+3346 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Trump approves $8.3 billion to fight coronavirus, cancels visit to CDC", "description": "U.S. President Donald Trump called off a visit to the Centers for Disease Control and Prevention in Atlanta on Friday, saying he did not want to \"interfere\" as the agency races to stem the coronavirus that has infected more than 100,000 people globally.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-idUSKBN20T235", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499603146&w=1200&r=LYNXMPEG251F5", "publishedAt": "2020-03-06T15:21:00Z", "content": "(Reuters) - U.S. President Donald Trump called off a visit to the Centers for Disease Control and Prevention in Atlanta on Friday, saying he did not want to “interfere” as the agency races to stem the coronavirus that has infected more than 100,000 people glo… [+3846 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Trump says U.S. Fed should cut rates, stimulate economy", "description": "President Donald Trump said on Friday the Federal Reserve should cut U.S. interest rates and stimulate the economy, three days after the central bank slashed interest rates by half a percentage point in an emergency bid to blunt the economic effects of the co…", "url": "https://www.reuters.com/article/us-usa-fed-trump-rates-idUSKBN20T239", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499601471&w=1200&r=LYNXMPEG251F6", "publishedAt": "2020-03-06T15:16:30Z", "content": "WASHINGTON (Reuters) - President Donald Trump said on Friday the Federal Reserve should cut U.S. interest rates and stimulate the economy, three days after the central bank slashed interest rates by half a percentage point in an emergency bid to blunt the eco… [+105 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashley Collman", "title": "Shocking video shows a New York City subway rider spraying an Asian man and yelling at him to 'move'", "description": "Two videos posted to Facebook on Wednesday show a New York City subway rider yelling at an Asian man, telling him to \"move\" out of his way, and eventually spraying him with a can of what appears to be Febreeze. The NYPD is investigated the incident recorded i…", "url": "https://www.businessinsider.com/nyc-subway-rider-sprays-asian-man-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e6268fafee23d0823686282?width=1200&format=jpeg", "publishedAt": "2020-03-06T15:53:53Z", "content": "As Asian-Americans see more incidents of racism amid the coronavirus outbreak, a worrying video surfaced Wednesday showing an Asian man being harassed on the New York City subway and being sprayed with a can of what appears to be Febreeze.\r\nTwo videos showing… [+1074 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "David Canellis", "title": "‘Coronavirus is the black swan of 2020,’ warns Sequoia Capital", "description": "Sequoia Capital, the seminal Silicon Valley venture fund, has urged its startups question every assumption about their businesses in order to survive the coronavirus threat. “Coronavirus is the black swan of 2020,” said Sequoia in a letter to founders and CEO…", "url": "https://thenextweb.com/hardfork/2020/03/06/sequoia-capital-coronavirus-black-swan-event-2020/", "urlToImage": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F03%2FWall_Street_-_New_York_Stock_Exchange.jpg&signature=9ba2fb521be543cf02c0abdff69a27a3", "publishedAt": "2020-03-06T16:05:40Z", "content": "Sequoia Capital, the seminal Silicon Valley venture fund, has urged its startups question every assumption about their businesses in order to survive the coronavirus threat.\r\nCoronavirus is the black swan of 2020, said Sequoia in a letter to founders and CEOs… [+2664 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Anna Medaris Miller", "title": "A pharmacy tried to help people make their own hand sanitizer because of coronavirus-related shortages, but posted the wrong recipe", "description": "In the wake of increasing novel coronavirus cases, pharmacies and drugstores are selling out of hand-sanitizer, prompting one New York City pharmacy to try to help customers make their own. But the recipe the pharmacy posted appeared to be inverted, instructi…", "url": "https://www.businessinsider.com/pharmacy-posted-wrong-recipe-how-to-make-hand-sanitizer-2020-3", "urlToImage": "https://i.insider.com/5e617b42fee23d03377c6e08?width=1200&format=jpeg", "publishedAt": "2020-03-06T15:30:00Z", "content": "Just a few days ago, New York City's Hudson Square Pharmacy stocked a now-coveted item: Purell hand-sanitizer. It sold out in 45 minutes. \r\n\"At lunch time, everyone comes down and comes out and it's just a little crazy,\" pharmacist Alan Solman, who limited th… [+2629 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Mike Pence’s ‘High Risk’ Coronavirus Response Will Impact His Political Future—and American Lives", "description": "The outbreak of the COVID-19 virus presents Vice President Mike Pence with the test of his career. In less than two weeks, he has had to learn about a fast-spreading, complicated viral outbreak and take control of the entire federal government response to it.…", "url": "https://time.com/5797572/mike-pence-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/GettyImages-1205263297.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-06T16:08:01Z", "content": "The outbreak of the COVID-19 virus presents Vice President Mike Pence with the test of his career. In less than two weeks, he has had to learn about a fast-spreading, complicated viral outbreak and take control of the entire federal government response to it.… [+7691 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "The Collision tech conference has been delayed until next year over coronavirus concerns, becoming the latest major event to be canceled as the virus continues to spread", "description": "The Toronto-based Collision conference has been canceled over coronavirus concerns, coming after other tech events like Google I/O, Facebook F8, and Mobile World Congress have been canceled. The conference will instead be held virtually this year, while the i…", "url": "https://www.businessinsider.com/coronavirus-concerns-cause-collision-tech-conference-canceled-2020-3", "urlToImage": "https://i.insider.com/5e627305fee23d281f3cc3b7?width=1200&format=jpeg", "publishedAt": "2020-03-06T15:51:44Z", "content": "The Toronto-based Collision tech conference has been delayed until next year over coronavirus-related fears, becoming the latest major conference cancellation to occur over the past several weeks. The conference, which takes place from June 22-25, will occur … [+2120 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Patrick Strudwick", "title": "There's A Nationwide Shortage Of The Pneumonia Vaccine Putting Vulnerable Patients At Risk", "description": "Exclusive: The PP23 jab, which would help ensure patients in high risk groups are not more vulnerable to infections like coronavirus, is out of stock in doctors' surgeries and private chemists. View Entire Post ›", "url": "https://www.buzzfeed.com/patrickstrudwick/shortage-of-pneumonia-vaccine-pp23-coronavirus", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/6/15/campaign_images/9dce4847575f/the-uk-government-has-admitted-there-is-a-shortag-2-998-1583508713-0_dblbig.jpg", "publishedAt": "2020-03-06T15:36:32Z", "content": "Britain is suffering a nationwide shortage of one of the two main vaccines PPV23 that helps prevent pneumonia, BuzzFeed News can reveal.\r\nSome GP surgeries, which provide the pneumococcal jab, have run out completely and have not been informed when suppliers … [+4584 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "9to5Mac Daily: March 06, 2020 – Coronavirus app rejections, more", "description": "Listen to a recap of the top stories of the day from 9to5Mac. 9to5Mac Daily is available on iTunes and Apple’s Podcasts app, Stitcher, TuneIn, Google Play, or through our dedicated RSS feed for Overcast and other podcast players. Sponsored by MacStadium : Get…", "url": "https://9to5mac.com/2020/03/06/9to5mac-daily-march-06-2020/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2018/08/9to5Mac-Daily-art-lead.jpg?resize=1024,576", "publishedAt": "2020-03-06T16:08:08Z", "content": "Listen to a recap of the top stories of the day from 9to5Mac. 9to5Mac Daily is available on iTunes and Apples Podcasts app, Stitcher, TuneIn, Google Play, or through our dedicated RSS feed for Overcast and other podcast players.\r\nSponsored by MacStadium: Get … [+914 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "acollman@businessinsider.com (Ashley Collman)", "title": "Shocking video shows a New York City subway rider spraying an Asian man and yelling at him to move", "description": "As the coronavirus that originated in China spreads throughout the US, Asian Americans say there's been an uptick in discrimination incidents.", "url": "https://news.yahoo.com/shocking-video-shows-york-city-155353433.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xMQyehdlCRBPoUeDH2gOWQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/MpEQmmBEQwwpoBmWJLbaXw--~B/aD0xNTAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/3c488ce186bc03452c649c27ffbaa067", "publishedAt": "2020-03-06T15:53:53Z", "content": "The videos of the encounter went viral this week.\r\nDoris Au/Facebook\r\n<ul><li>Two videos posted on Facebook on Wednesday showed a New York City subway rider yelling at an Asian man, telling him to move out of his way, and eventually spraying a can of what app… [+1819 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Claudia Assis", "title": "Airline stocks slammed by coronavirus fears, but experts say reaction may be overdone", "description": "U.S. airline stocks have been slammed as companies cancel all but urgent travel and avoid regions with high numbers of cases of the coronavirus COVID-19, but investors say the reaction may be overdone.", "url": "http://www.marketwatch.com/story/airline-stocks-slammed-by-coronavirus-fears-but-experts-say-reaction-may-be-overdone-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB606_emptya_ZG_20200305175424.jpg", "publishedAt": "2020-03-06T15:45:58Z", "content": "U.S. airline stocks have been slammed as companies cancel all but urgent travel and avoid regions with high numbers of cases of the coronavirus COVID-19, but investors say the reaction may be overdone.The selloff is purely motivated by fear, said Michael Mato… [+5283 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "iPhone build numbers still greater than 2019, despite coronavirus", "description": "Timothy Arcuri from UBS is seeing some short-term struggles for Apple and the iPhone between production problems and temporary demand decreases, but sees restoration of iPhone production and sales in 2020.", "url": "https://appleinsider.com/articles/20/03/06/iphone-build-numbers-still-greater-than-2019-despite-coronavirus", "urlToImage": "https://photos5.appleinsider.com/gallery/34277-61604-49025879392_ec9c4cbd11_k-xl.jpg", "publishedAt": "2020-03-06T15:13:06Z", "content": "Timothy Arcuri from UBS is seeing some short-term struggles for Apple and the iPhone between production problems and temporary demand decreases, but sees restoration of iPhone production and sales in 2020.In a research note seen by AppleInsider, Arcuri report… [+2354 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Coronavirus Delays TurboGrafx-16 Mini Release", "description": "The TurboGrafx-16 Mini has been pushed back due to production delays in China. This is the latest piece of the games industry to be impacted by the outbreak of COVID-19, also known as coronavirus. Konami, which is distributing the mini-console, said that it i…", "url": "https://www.gamespot.com/articles/coronavirus-delays-turbografx-16-mini-release/1100-6474484/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1585/15855271/3641991-3559550-3546821-screen%20shot%202019-06-12%20at%209.51.40%20am.png", "publishedAt": "2020-03-06T15:57:00Z", "content": "The TurboGrafx-16 Mini has been pushed back due to production delays in China. This is the latest piece of the games industry to be impacted by the outbreak of COVID-19, also known as coronavirus. Konami, which is distributing the mini-console, said that it i… [+3277 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "bpietsch@businessinsider.com (Bryan Pietsch)", "title": "25 scientists were sent to China to research the coronavirus. Here's what they found.", "description": "The 25 scientists found that children are less likely to get the virus, and that fatigue is a more common symptom than respiratory problems.", "url": "https://news.yahoo.com/25-scientists-were-sent-china-145719837.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.UkxWzZQ1OXZu_54XLH4Mg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/tDh04MDNH_9NR3YzrURCow--~B/aD0zMDAwO3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/94673c13fac3d1f31182803aafb6effb", "publishedAt": "2020-03-06T15:36:33Z", "content": "<ul><li>The World Health Organization (WHO) sent 25 scientists to China to research the coronavirus. \r\n</li><li>In a report, the scientists describe their findings about how the disease spreads and who is most likely to be impacted. \r\n</li><li>Children are le… [+3221 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Paul Kunert", "title": "Morrisons puts non-essential tech changes on ice as panic-stricken shoppers strip stores", "description": "It's like Christmas all over again, source tells us Exclusive Morrisons has slowed the conveyor belt for tech changes to avoid any IT crashes as British shoppers continue a coronavirus-inspired panic-buying spree.…", "url": "https://www.theregister.co.uk/2020/03/06/morrisons_technology_change_freeze_coronavirus_panic/", "urlToImage": "https://regmedia.co.uk/2020/03/06/morrisonstrolley.jpg", "publishedAt": "2020-03-06T15:56:13Z", "content": "Exclusive Morrisons has slowed the conveyor belt for tech changes to avoid any IT crashes as British shoppers continue a coronavirus-inspired panic-buying spree.\r\nAmid the worldwide outbreak of the Wuhan coronavirus, the UK supermarket giant yesterday froze n… [+2258 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Rebecca Jennings", "title": "The macabre comfort of coronavirus stockpiling videos", "description": "Coronavirus stockpile preparation videos are everywhere, and I can’t stop watching them.", "url": "https://www.vox.com/the-goods/2020/3/6/21167041/coronavirus-stockpile-prepare-video-tiktok", "urlToImage": "https://cdn.vox-cdn.com/thumbor/z-D-6t-04-fLxzXHTK_bWTRwdAo=/0x102:2122x1213/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19772459/GettyImages_482142025.jpg", "publishedAt": "2020-03-06T15:30:00Z", "content": "I can’t stop watching people’s huge coronavirus hauls. | Getty Images People are panicking, and when we panic, we spend. It happens every time something terrible seems to be imminent. People panic and buy stuff that will hopefully help ward off the bad thing,… [+6247 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Philip van Doorn", "title": "Top Ten: Weekend reads: What corporate insiders are doing as the coronavirus spreads and the stock market tanks", "description": "Also, stocks to buy low, a limit for mortgage rates and a problem for Meghan and Harry.", "url": "http://www.marketwatch.com/story/weekend-reads-what-corporate-insiders-are-doing-as-the-coronavirus-spreads-and-the-stock-market-tanks-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB648_Delta__ZG_20200306103602.jpg", "publishedAt": "2020-03-06T16:07:43Z", "content": "As the coronavirus continues to spread, investors have been on a volatile ride. You might expect corporate insiders the officers, directors and largest shareholders with the best position to see how their companies are faring amid turmoil in global consumer, … [+2965 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Reid McCarter on News, shared by Reid McCarter to The A.V. Club", "title": "Tito's Vodka forced to tell people not to use it as hand sanitizer ingredient", "description": "With the continuing spread of coronavirus, people are buying up supplies of hand sanitizer in an attempt to prevent contracting or spreading the illness. And now, because some jerks have filled their cupboards with enough of the product to melt the very flesh…", "url": "https://news.avclub.com/titos-vodka-forced-to-tell-people-not-to-use-it-as-hand-1842151195", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hsl6pz1mkgr6hes02hot.jpg", "publishedAt": "2020-03-06T15:52:00Z", "content": "With the continuing spread of coronavirus, people are buying up supplies of hand sanitizer in an attempt to prevent contracting or spreading the illness. And now, because some jerks have filled their cupboards with enough of the product to melt the very flesh… [+1558 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "David Tracy", "title": "Here's How GM Plans To Dominate The Electric Car Market", "description": "A look into GM’s electric vehicle onslaught, PSA and FCA need to figure out China, Tesla is allegedly not reporting workplace injuries properly, coronavirus is having serious effects on Jaguar Land Rover, there’s a possibility of a government takeover of the …", "url": "https://jalopnik.com/heres-how-gm-plans-to-dominate-the-electric-car-market-1842147451", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dx4fdmgaosjkqpmht2e1.png", "publishedAt": "2020-03-06T15:32:00Z", "content": "A look into GMs electric vehicle onslaught, PSA and FCA need to figure out China, Tesla is allegedly not reporting workplace injuries properly, coronavirus is having serious effects on Jaguar Land Rover, theres a possibility of a government takeover of the UA… [+11987 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Palestine declares state of emergency over coronavirus", "description": "The move comes after seven people in the occupied West Bank test positive, prompting the Israeli army to seal off Bethlehem.", "url": "https://www.aljazeera.com/news/2020/03/palestine-declares-state-emergency-coronavirus-200306152947868.html", "urlToImage": "https://www.aljazeera.com/mritems/images/2020/3/6/image-20200306152950600.jpg", "publishedAt": "2020-03-06T15:29:47Z", "content": "The Palestinian Authority has declared a state of emergency in the occupied West Bank over the coronavirus epidemic after seven people tested positive.\r\nThe Israeli army has sealed off the city of Bethlehem and Palestinian officials have ordered the Church of… [+86 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Donna Fuscaldo)", "title": "Apple Steps Up Policing of App Store Amid Coronavirus", "description": "Apple isn't approving apps related to coronavirus if they aren't coming from an official source.", "url": "https://www.fool.com/investing/2020/03/06/apple-steps-up-policing-of-app-store-amid-coronavi.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561930/apple-app-store-coronavirus-mf_bofYSuL.jpg", "publishedAt": "2020-03-06T15:53:00Z", "content": "In the wake of the novel-coronavirus outbreak, Apple(NASDAQ:AAPL) is taking steps to monitor its App Store. \r\niPhone app developers told CNBC Apple is removing apps focused on coronavirus if they aren't coming from a reputable source. Four app developers said… [+1007 chars]"}, {"source": {"id": null, "name": "Inquirer.com"}, "author": "Tom Avril, Justine McDaniel", "title": "Coronavirus cases identified in Pennsylvania in Delaware and Wayne Counties - The Philadelphia Inquirer", "description": "Coronavirus cases identified in Pennsylvania in Delaware and Wayne Counties The Philadelphia Inquirer 2 presumed positive coronavirus cases in Pa., including Delaware County WPVI-TV Coronavirus: Two 'presumed' cases now in Pennsylvania WGAL Susquehanna Valley…", "url": "https://www.inquirer.com/health/coronavirus/coronavirus-covid-19-pennsylvania-first-confirmed-cases-20200306.html", "urlToImage": "https://www.inquirer.com/resizer/wHQ1a87_rs9YtRFkXfyZih9su04=/1200x0/center/middle/www.inquirer.com/resizer/40TkWUy9oVwUsypNMKx9Cw4pKB0=/1200x0/center/middle/arc-anglerfish-arc2-prod-pmn.s3.amazonaws.com/public/UHY26PPK6FC4DBQNY3CL5NNO3M.jpg", "publishedAt": "2020-03-06T15:22:49Z", "content": "Gov. Tom Wolf announced Friday that two people in Pennsylvania have tested positive for coronavirus, including one in Delaware County and one in Wayne County, near where President Trump held a rally Thursday night.\r\nThe cases are considered presumptive, meani… [+2390 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Italy scrambles to contain coronavirus outbreak - CBS News", "description": "Italy scrambles to contain coronavirus outbreak CBS News Coronavirus outbreak: Quarantine stories go viral online Al Jazeera English Precautions to take at work during the coronavirus outbreak ABC News This robot can help protect healthcare workers from coron…", "url": "https://www.youtube.com/watch?v=XZVj8dEq5UA", "urlToImage": "https://i.ytimg.com/vi/XZVj8dEq5UA/maxresdefault.jpg", "publishedAt": "2020-03-06T15:51:14Z", "content": "Italy was the first first European country to ban flights from China, but that didn't stop the coronavirus from spreading there. CBS News foreign correspondent Charlie D'Agata joined CBSN from Rome with how Italy is responding to the outbreak.\r\nSubscribe to t… [+1119 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "tmohamed@businessinsider.com (Theron Mohamed), Theron Mohamed", "title": "A Brazilian insurer falsely claimed Warren Buffett's Berkshire Hathaway was one of its investors, and quickly paid the price", "description": "Paul Morigi/Getty Images for Fortune/Time Inc The bosses of a Brazilian reinsurance giant falsely claimed Warren Buffett's Berkshire Hathaway was one of its investors. IRB-Brasil Resseguros CEO Jose Carlos Cardoso and CFO Fernando Passos also said they were c…", "url": "https://markets.businessinsider.com/news/stocks/brazilian-reinsurer-irb-falsely-claimed-warren-buffett-berkshire-hathaway-investors-2020-3-1028972503", "urlToImage": "https://images.markets.businessinsider.com/image/5dad82db4af9095ec773df32-2400/gettyimages-492446672.jpg", "publishedAt": "2020-03-06T16:04:00Z", "content": "Paul Morigi/Getty Images for Fortune/Time Inc\r\n<ul><li>The bosses of a Brazilian reinsurance giant falsely claimed Warren Buffett's Berkshire Hathaway was one of its investors.</li><li>IRB-Brasil Resseguros CEO Jose Carlos Cardoso and CFO Fernando Passos also… [+2835 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Demitrios Kalogeropoulos)", "title": "Costco Confirms a Huge Coronavirus Sale Boost", "description": "Demand for cleaning supplies and non-perishable grocery items surged late last month.", "url": "https://www.fool.com/investing/2020/03/06/costco-confirms-a-huge-coronavirus-sale-boost.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561919/bulk-shopping.jpg", "publishedAt": "2020-03-06T15:34:00Z", "content": "Costco Wholesale Corporation (NASDAQ:COST) has seen customer traffic surge as Americans stock up on supplies ahead of a potential coronavirus outbreak. On Thursday evening the warehouse retailer reported quarterly earnings results that also included sales tre… [+1093 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Gap Closes NYC Office After Employee Contracts Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/gap-closes-new-york-office-after-employee-contracts-coronavirus", "urlToImage": null, "publishedAt": "2020-03-06T15:51:59Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus to Leave Mark on Financial Reports (Radio)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-06/coronavirus-to-leave-mark-on-financial-reports-radio", "urlToImage": null, "publishedAt": "2020-03-06T16:00:19Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Cases Jump in Egypt as Nile Cruise Passengers Quarantined", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/virus-cases-jump-in-egypt-as-nile-cruise-passengers-quarantined", "urlToImage": null, "publishedAt": "2020-03-06T15:49:47Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "ZipRecruiter CEO Says Coronavirus Could Impact Hiring (Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-03-06/ziprecruiter-ceo-says-coronavirus-could-impact-hiring-podcast", "urlToImage": null, "publishedAt": "2020-03-06T16:07:04Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Makes a Bleak Year for Shale Country Even Worse", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/coronavirus-is-making-bleak-year-for-shale-country-even-worse", "urlToImage": null, "publishedAt": "2020-03-06T15:50:35Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "London Heathrow Baggage Handlers Test Positive for Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/london-heathrow-baggage-handlers-test-positive-for-virus", "urlToImage": null, "publishedAt": "2020-03-06T15:14:21Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "EU Warns of 'Rapid Increase' in Coronavirus Cases", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-06/eu-warns-of-rapid-increase-in-coronavirus-cases-video", "urlToImage": null, "publishedAt": "2020-03-06T15:32:28Z", "content": null}, {"source": {"id": null, "name": "Pennlive.com"}, "author": "Matt Miller | mmiller@pennlive.com", "title": "2 people with presumed coronavirus in Pa. recently traveled to places with infection: state officials - PennLive", "description": "2 people with presumed coronavirus in Pa. recently traveled to places with infection: state officials PennLive First Cases of Coronavirus in Philadelphia Suburbs Recorded NBC 10 Philadelphia Coronavirus news: 2 presumptive positive cases in Pennsylvania, incl…", "url": "https://www.pennlive.com/news/2020/03/2-presumed-coronavirus-case-detected-in-pa.html", "urlToImage": "https://www.pennlive.com/resizer/c5GhJaXhcgn2JxAJDWCRaOreaq8=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/45YUTLLI6JHB5AAZ3PMIMGAN7Y.jpg", "publishedAt": "2020-03-06T15:59:34Z", "content": "Two presumed cases of coronavirus have been identified in Pennsylvania, Gov. Tom Wolf said Friday morning.\r\nThe results have not yet been verified by the Centers for Disease Control and Prevention.\r\nHealth Secretary Rachel Levine didnt give details concerning… [+2513 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Noah Buhayar, Jon Dominick Querolo", "title": "Coronavirus Motel Ignites Clash at Epicenter of Seattle Outbreak...", "description": "Coronavirus Motel Ignites Clash at Epicenter of Seattle Outbreak... (First column, 5th story, link ) Related stories: Robots fighting virus by disinfecting hospitals, taking temps, preparing meals... Containment 'Unlikely Outcome' as Spread Grows World-Wide..…", "url": "https://www.bloombergquint.com/onweb/coronavirus-motel-ignites-clash-at-epicenter-of-seattle-outbreak", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-03-06T15:22:36Z", "content": "(Bloomberg) -- What started as a bold plan to slow the spread of the coronavirus in the Seattle area is quickly devolving into a Nimby battle."}, {"source": {"id": null, "name": "Wdrb.com"}, "author": "", "title": "WATCH LIVE | Indiana confirms first case of coronavirus - WDRB", "description": "WATCH LIVE | Indiana confirms first case of coronavirus WDRB Marion County resident tests positive for coronavirus in state’s first case Fox 59 Indiana officials confirm first case of coronavirus in the state WLKY Louisville First confirmed coronavirus case i…", "url": "https://www.wdrb.com/news/indiana-confirms-case-of-coronavirus-declares-public-health-emergency/article_92834a1e-5fbd-11ea-b311-b7179ddb59bd.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wdrb.com/content/tncms/assets/v3/editorial/2/eb/2eb05620-5e5b-11ea-9fd8-37cdd9bf8775/5e6016f840702.image.jpg?resize=750%2C413", "publishedAt": "2020-03-06T16:00:00Z", "content": "LOUISVILLE, Ky. (WDRB) -- Indiana Gov. Eric Holcomb said Friday the state has confirmed its first case of the novel coronavirus, COVID-19, and he declared a public health emergency.\r\nThe patient, a man who lives in Marion County, had recently traveled to Bost… [+3140 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Prosper Junior Bakiny)", "title": "Amid the Coronavirus Frenzy, Novavax Remains a Risky Bet", "description": "Despite its attempt to develop a vaccine for COVID-19, Novavax's prospects aren't particularly attractive.", "url": "https://www.fool.com/investing/2020/03/06/amid-the-coronavirus-frenzy-novavax-remains-a-risk.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561512/gettyimages-1201170570.jpg", "publishedAt": "2020-03-06T15:45:00Z", "content": "The COVID-19 outbreak continues to get worse. More than 70 countries have now seen confirmed cases of the disease. In the U.S., more than a dozen states have had confirmed cases of COVID-19, and more than 10 people have died from it. While many still believe … [+4271 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Mustafa Abu Ganeyeh", "title": "Bethlehem deserted after Palestinians declare coronavirus emergency", "description": "The streets of Bethlehem were near-empty on Friday as Palestinian police wearing masks patrolled the traditional birthplace of Jesus, hit hard by a state of emergency declared over coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-palestinians-touri-idUSKBN20T23Z", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499605254&w=1200&r=LYNXMPEG251FM", "publishedAt": "2020-03-06T15:26:09Z", "content": "BETHLEHEM, West Bank (Reuters) - The streets of Bethlehem were near-empty on Friday as Palestinian police wearing masks patrolled the traditional birthplace of Jesus, hit hard by a state of emergency declared over coronavirus. \r\nPalestinian President Mahmoud … [+2894 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Wendy L. Patrick, JD, Ph.D.", "title": "Common False Coronavirus Claims: Don't Be Fooled", "description": "Empty store shelves drive consumers online—where “new” products may make outrageous claims, often with expensive price tags. How do you know what to believe?", "url": "https://www.psychologytoday.com/us/blog/why-bad-looks-good/202003/common-false-coronavirus-claims-dont-be-fooled", "urlToImage": null, "publishedAt": "2020-03-06T15:42:36Z", "content": null}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Wendy L. Patrick, JD, Ph.D.", "title": "Common False Coronavirus Claims: Don't Be Fooled", "description": "Empty store shelves drive consumers online—where “new” products may make outrageous claims, often with expensive price tags. How do you know what to believe?", "url": "https://www.psychologytoday.com/ca/blog/why-bad-looks-good/202003/common-false-coronavirus-claims-dont-be-fooled", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/mask-4890117_1920.jpg?itok=7EW-Ruy3", "publishedAt": "2020-03-06T15:42:36Z", "content": "There is nothing that raises the panic meter in quite the same way as staring at empty store shelves where hand sanitizer, surgical masks, and even paper goods used to be. Many consumers immediately whip out their iPhones to order onlineonly to discover empty… [+5314 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Andreas Wiseman", "title": "Cannes Claims 9% Increase In Accreditation Despite Coronavirus Fears", "description": "Cannes is claiming a 9% year-on-year increase in accreditation, despite global anxiety over the coronavirus. “Accreditations continue at an intensive pace as we count so far an increase of 9%,” the festival said today in an email to industry confirming the lo…", "url": "https://deadline.com/2020/03/coronavirus-cannes-claims-9-percent-increase-accreditation-1202876010/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/01/cannes-beach-tents.jpg?w=1024", "publishedAt": "2020-03-06T15:16:52Z", "content": "Cannes is claiming a 9% year-on-year increase in accreditation, despite global anxiety over the coronavirus.\r\n“Accreditations continue at an intensive pace as we count so far an increase of 9%,” the festival said today in an email to industry confirming the l… [+639 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Lufthansa Slices Schedule in Half on Drastic Coronavirus Hit to Sales", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-06/lufthansa-slices-schedule-in-half-on-drastic-virus-hit-to-sales", "urlToImage": null, "publishedAt": "2020-03-06T15:35:16Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Margot Harris", "title": "People are turning to Reddit to try to get coronavirus diagnoses amid test shortages", "description": "As anxieties surrounding the spread of the novel coronavirus worsen, some people are turning to Reddit for medical information. Redditors are posting across subreddits and listing their symptoms in an attempt to crowd-source diagnoses of COVID-19, the illness…", "url": "https://www.businessinsider.com/coronavirus-diagnoses-on-reddit-amid-test-shortage-2020-3", "urlToImage": "https://i.insider.com/5e625370fee23d6d99538d33?width=1200&format=jpeg", "publishedAt": "2020-03-06T15:39:26Z", "content": "As the novel coronavirus continues to spread, some concerned individuals are trying to ease their health anxieties by consulting Reddit. \r\nA general search for \"coronavirus\" on the site reveals 36 posts from worried Redditors posting across a variety of subre… [+6844 chars]"}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Laurent Giret", "title": "Recap: Microsoft put its employees first with Coronavirus actions this week", "description": "Microsoft, along with many other big tech companies, is taking the ongoing coronavirus outbreak very seriously.", "url": "https://www.onmsft.com/news/recap-microsoft-put-its-employees-first-with-coronavirus-actions-this-week", "urlToImage": "https://i1.wp.com/www.onmsft.com/wp-content/uploads/2020/03/mccampus.jpg?fit=1024%2C597&ssl=1", "publishedAt": "2020-03-06T15:34:55Z", "content": "Microsoft, along with many other big tech companies, is taking the ongoing coronavirus outbreak very seriously. The software company is currently encouraging employees to work from home, and this measure seems really appropriate now that that the company conf… [+2738 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "CNN.com Wire Service", "title": "Coronavirus shopping: Crowd angry over shortages brings cops to California Costco - The Mercury News", "description": "Coronavirus shopping: Crowd angry over shortages brings cops to California Costco The Mercury News ‘It’s been nuts’: Costco’s sales spike amid coronavirus panic-buying of bottled water, hand sanitizer and toilet paper The Washington Post Cops called to Costco…", "url": "https://www.mercurynews.com/coronavirus-shopping-crowd-angry-over-shortages-brings-cops-to-california-costco", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/03/costco.jpg?w=1024&h=612", "publishedAt": "2020-03-06T15:37:55Z", "content": "Sheriff’s deputies were called to a Costco in Southern California after shoppers reportedly became angry over the lack of certain items sought amid coronavirus concerns.\r\nSomeone in the store in Chino Hills called to report a disturbance, saying that a large … [+501 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Wendy L. Patrick, JD, Ph.D.", "title": "How to Avoid Falling for False Coronavirus Claims", "description": "Empty store shelves drive consumers online—where “new” products may make outrageous claims, often with expensive price tags. How do you know what to believe?", "url": "https://www.psychologytoday.com/ca/blog/why-bad-looks-good/202003/how-avoid-falling-false-coronavirus-claims", "urlToImage": null, "publishedAt": "2020-03-06T15:42:36Z", "content": null}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Robert Schroeder", "title": "Election: Sanders attacks Biden on trade, Social Security as Democrats’ battle moves to Michigan and beyond", "description": "Bernie Sanders is attacking Joe Biden over Social Security and trade policy as the two Democratic presidential hopefuls face the next round of primaries on Tuesday, with Michigan the big delegate prize of the day.", "url": "http://www.marketwatch.com/story/sanders-attacks-biden-on-trade-social-security-as-democrats-battle-moves-to-michigan-and-beyond-2020-03-06", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB233_sander_ZG_20200302094656.jpg", "publishedAt": "2020-03-06T15:45:39Z", "content": "Bernie Sanders is attacking Joe Biden over Social Security and trade policy as the two Democratic presidential hopefuls face the next round of primaries on Tuesday, with Michigan the big delegate prize of the day. Biden led in a WDIV/Detroit News poll of Mich… [+2408 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Leslie Scism", "title": "U.S. Businesses Gear Up for Legal Disputes With Insurers Over Coronavirus Claims - The Wall Street Journal", "description": "U.S. Businesses Gear Up for Legal Disputes With Insurers Over Coronavirus Claims The Wall Street Journal", "url": "https://www.wsj.com/articles/u-s-businesses-gear-up-for-legal-disputes-with-insurers-over-coronavirus-claims-11583465668", "urlToImage": "https://images.wsj.net/im-161294/social", "publishedAt": "2020-03-06T15:57:46Z", "content": "Many U.S. companies think their insurance policies cover lost revenue from the coronavirus outbreak. But that may be up to the courts to decide.\r\nCorporations already have had claims rejected for payments under a popular type of coverage called business-inter… [+251 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Thomas Barrabi", "title": "Despite coronavirus, LA Marathon to proceed as scheduled on Sunday - Fox Business", "description": "Despite coronavirus, LA Marathon to proceed as scheduled on Sunday Fox Business", "url": "https://www.foxbusiness.com/sports/coronavirus-los-angeles-marathon-other-races-canceled", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/03/0/0/Los-Angeles-Marathon-iStock.jpg?ve=1&tl=1", "publishedAt": "2020-03-06T15:11:48Z", "content": "The Los Angeles Marathon will proceed as scheduled on Sunday, even after the new coronavirus outbreak prompted California Gov. Gavin Newsom to declare a statewide emergency and race officials in other impacted areas to cancel similar events.\r\n“All Los Angeles… [+2174 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Dan Caplinger)", "title": "3 Reasons Coronavirus Could Make This the Last Good Jobs Report for a While", "description": "Despite strong numbers in February, investors should expect disruptions going forward.", "url": "https://www.fool.com/investing/2020/03/06/3-reasons-coronavirus-could-make-this-the-last-goo.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561934/older-worker-gettyimages-168763215.jpg", "publishedAt": "2020-03-06T15:48:00Z", "content": "Coronavirus fears continued to punish the stock market on Friday, even though the latest data on the employment situation in the U.S. painted a rosier picture of the national economy than many had expected. Despite strong job creation in February, however, th… [+3742 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Mark Travers, Contributor, Mark Travers, Contributor https://www.forbes.com/sites/traversmark/", "title": "The Hysteria Of Coronavirus And How To Avoid It", "description": "It’s impossible to predict how the virus will spread, but one thing is for sure: panic is not the answer.", "url": "https://www.forbes.com/sites/traversmark/2020/03/06/the-hysteria-of-coronavirus-and-how-to-avoid-it/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1202240324%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D4000%26cropY1%3D791%26cropY2%3D2667", "publishedAt": "2020-03-06T15:40:36Z", "content": "QUEZON, PHILIPPINES - FEBRUARY 21: A man riding a bus wears a facemask on February 21, 2020 in ... [+] Quezon city, Metro Manila, Philippines. The first COVID-19 death outside of China was reported in the Philippines last February 2, while the country has rep… [+4577 chars]"}, {"source": {"id": null, "name": "Kickstarter.com"}, "author": null, "title": "How Kickstarter creators are coping with the coronavirus", "description": "Creators making everything from electronic devices to tarot cards are putting health and safety first as they update backers on how the outbreak is affecting their projects.Kickstarter brings together creators and backers from all seven conti&hellip;", "url": "https://www.kickstarter.com/blog/how-kickstarter-creators-are-coping-with-the-coronavirus", "urlToImage": "https://ksr-ugc.imgix.net/assets/028/336/965/959ced5e6f5514a961195e4a9557b122_original.jpg?ixlib=rb-2.1.0&w=1200&fit=max&v=1583443658&auto=format&frame=1&q=92&s=77121d68b236007c50ac313744dc164a", "publishedAt": "2020-03-06T15:21:00Z", "content": "Peak Design's Travel Tripods at the factory Creators making everything from electronic devices to tarot cards are putting health and safety first as they update backers on how the outbreak is affecting their projects. Kickstarter brings together creators and … [+10485 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ellen R. Wald, Contributor, Ellen R. Wald, Contributor https://www.forbes.com/sites/ellenrwald/", "title": "Russia Controls The Oil Market At OPEC Today", "description": "Russia now holds a veto power over OPEC as the cartel wants to stabilize the oil markets in the face of Coronavirus.", "url": "https://www.forbes.com/sites/ellenrwald/2020/03/06/russia-controls-the-oil-market-at-opec-today/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1205430087%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D3638%26cropY1%3D0%26cropY2%3D2046", "publishedAt": "2020-03-06T15:39:07Z", "content": "The Organization of Petroleum Exporting Countries (OPEC) met yesterday, and today the cartel is meeting with its broader partners known as OPEC+. OPEC was united in its desire to cut oil production by an additional 1.5 million barrels per day. The hope is tha… [+1763 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Jonathan Noble", "title": "Brawn: F1 not taking unnecessary risks by holding Australian GP", "description": "Formula 1 insists it is not taking any 'unnecessary risks' by holding the season-opening Australian Grand Prix, as it is unwilling to shut the season down over coronavirus concerns", "url": "https://www.autosport.com/f1/news/148567/brawn-australian-gp-goahead-not-unnecessary-risk", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/1.67/dir/bcf/image/bcfe805037bc05a66dc512c3c1458a13.jpg", "publishedAt": "2020-03-06T15:28:00Z", "content": "Formula 1 insists it is not taking any 'unnecessary risks' by holding the season-opening Australian Grand Prix, as it is unwilling to shut the season down over coronavirus concerns.\r\nThe 2020 campaign is due to start in Australia next weekend despite recent u… [+2420 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Nutanix Stock Lost 27% Last Month", "description": "Shares of the cloud-based hyperconvergence specialist tumbled on a guidance cut in its earnings report.", "url": "https://www.fool.com/investing/2020/03/06/why-nutanix-stock-lost-27-last-month.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561918/digital-software-image.jpg", "publishedAt": "2020-03-06T15:22:00Z", "content": "What happened\r\nShares of Nutanix (NASDAQ:NTNX) tumbled last month after the maker of hyperconvergence infrastructure -- which handles computing, storage, and networking needs -- offered underwhelming guidance in its second quarter, blaming the COVID-19 corona… [+2382 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Shelley E. Kohan, Contributor, Shelley E. Kohan, Contributor https://www.forbes.com/sites/shelleykohan/", "title": "A Change In Consumer Behavior From Coronavirus Fears May Drive U.S. E-Commerce Sales Beyond Projections Of 12% Of Total Retail Sales In 2020", "description": "As the coronavirus continues to gain traction in the U.S., there have been signs of changing consumer behavior. The digital side of the retail business may be stepped up at a faster rate than previous projections.", "url": "https://www.forbes.com/sites/shelleykohan/2020/03/06/a-change-in-consumer-behavior-from-coronavirus-fears-may-drive-us-e-commerce-sales-beyond-projections-of-12-of-total-retail-sales-in-2020/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e626efde1e6170007590443%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D5689%26cropY1%3D292%26cropY2%3D3492", "publishedAt": "2020-03-06T16:04:28Z", "content": "As the coronavirus continues to gain traction in the U.S., there have been signs of changing consumer behavior. Self-quarantines and emerging consumer worry about public places will provide opportunities for the e-commerce business to thrive over the next few… [+4406 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Airlines are burning thousands of gallons of jet fuel flying empty 'ghost' planes so they can keep their flight slots during the... via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_b00abbefdc239b73184dd0559f5c4049", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T15:40:10Z", "content": "Colorado, Coronavirus, Jared Polis\r\nColorado Gov. Jared Polis announced Thursday afternoon that he learned of the first 'presumptive' positive case of COVID-19, coronavirus, case in Colorado."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Rupee dives 54 paise to 73.87 against dollar", "description": "The Indian unit had clocked its first gain after falling for five sessions on Thursday.", "url": "https://economictimes.indiatimes.com/markets/forex/rupee-dives-54-paise-to-73-87-against-dollar/articleshow/74517528.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74517513,width-1070,height-580,imgsize-73678,overlay-etmarkets/photo.jpg", "publishedAt": "2020-03-06T16:02:58Z", "content": "Mumbai: The Indian rupee resumed its downward journey after a day's hiatus on Friday, plummeting by 54 paise to 73.87 against the US dollar as coronavirus-panicked investors assessed deteriorating financial markets.\r\nAt the interbank foreign exchange, the dom… [+1679 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The Invisible City: How a Homeless Man Built a Life Underground via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_2017f82e7ed0c0b3c8c550f8991ec4cf", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T15:40:10Z", "content": "Colorado, Coronavirus, Jared Polis\r\nColorado Gov. Jared Polis announced Thursday afternoon that he learned of the first 'presumptive' positive case of COVID-19, coronavirus, case in Colorado."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " This Website Yells at You Every Time You Touch Your Stupid Face via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_a779a5cb3307922935e8a176afd40a20", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-06T15:40:10Z", "content": "Colorado, Coronavirus, Jared Polis\r\nColorado Gov. Jared Polis announced Thursday afternoon that he learned of the first 'presumptive' positive case of COVID-19, coronavirus, case in Colorado."}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "As coronavirus spreads, suppliers are rationing face masks", "description": "Medical suppliers are working overtime to make and distribute masks and gloves as demand skyrockets.", "url": "https://www.cnn.com/videos/business/2020/03/05/medical-supply-shortage-coronavirus-quest-means-business.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306090751-dealmed-face-mask-super-tease.jpg", "publishedAt": "2020-03-06T15:56:30Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Kevin Chen", "title": "If coronavirus disrupts staple crop production the impact on food security could be grave", "description": "The novel coronavirus pneumonia (Covid-19) outbreak that began in Wuhan, in Hubei province, China has quickly spread to at least 75 other countries, causing more than 3,000 deaths.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-disrupts-staple-crop-production-impact-food-security1/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/05/TELEMMGLPICT000227007266-xlarge_trans_NvBQzQNjv4BqMdYdPu_9-tJRUiuuV6k4Mi2dmClwgbjjulYfPTELibA.jpeg?imwidth=1200", "publishedAt": "2020-03-06T15:31:20Z", "content": "First, based on learnings from previous pandemics and the current situation in China, to prevent any major setback to  food and nutrition security, it will be important to continue to closely monitor food prices and strengthen market supervision, particularly… [+2117 chars]"}, {"source": {"id": null, "name": "Wxii12.com"}, "author": "WXII12.com Web Staff", "title": "North Carolina health officials identify second case of coronavirus - WXII12 Winston-Salem", "description": "North Carolina health officials identify second case of coronavirus WXII12 Winston-Salem Public health officials: Flu is still the top priority WCPO 9 Coronavirus sickens second person in NC WRAL.com North Carolina identifies second case of coronavirus WGHP F…", "url": "https://www.wxii12.com/article/north-carolina-health-officials-confirm-coronavirus-italy/31261087", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/coronavirus-1579720400.jpg?crop=0.817xw:0.817xh;0,0&resize=1200:*", "publishedAt": "2020-03-06T16:07:00Z", "content": "CHATHAM COUNTY, N.C. —A second North Carolina man tested positive with coronavirus Thursday night.\r\nHealth officials said the man resides in Chatham County and recently returned home from visiting an area in Italy that now has a COVID-19 outbreak.\r\nThe test, … [+2358 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Edward Russell", "title": "Alaska Airlines strikes back in Seattle with route to Delta focus city", "description": "Alaska Airlines is striking back in Seattle with a new route to Delta Air Lines focus city in Cincinnati, as battle for Seattle between the rivals appears to be heating up again. Alaska will add Cincinnati (CVG) to its map with a daily flight from its Seattle…", "url": "http://thepointsguy.com/news/alaska-airlines-strikes-back-in-seattle-with-route-to-delta-focus-city/", "urlToImage": "https://i2.wp.com/thepointsguy.com/wp-content/uploads/2020/02/1_ALB_5459.jpg?fit=2000%2C1333px&ssl=1", "publishedAt": "2020-03-06T16:10:35Z", "content": "Alaska Airlines is striking back in Seattle with a new route to Delta Air Lines focus city in Cincinnati, as battle for Seattle between the rivals appears to be heating up again.\r\nAlaska will add Cincinnati (CVG) to its map with a daily flight from its Seattl… [+2503 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Katie Bain", "title": "Ultra Officially ‘Postponed’ Until 2021 Due to Coronavirus: ‘We Must Defer to the Authorities’", "description": "Today (March 6) Miami Mayor Francis Suarez announced that Ultra Music Festival Miami will not take place in 2020 due to the coronavirus.", "url": "https://www.billboard.com/articles/news/dance/9329484/ultra-officially-postponed-2021", "urlToImage": "https://static.billboard.com/files/media/Ultra-Music-Festival-2018-crowd-a-billboard-1548.jpg", "publishedAt": "2020-03-06T15:34:01Z", "content": "In a press conference held this morning (March 6), Miami Mayor Francis Suarez announced that Ultra Music Festival 2020 is officially postponed due to the coronavirus.\r\n\"We're emphasizing to the public that this decision is not a cause for alarm or panic, but … [+1853 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "At Sea: Passengers Off California Await Virus Test Results", "description": "Passengers on a cruise ship off the California coast were instructed to stay in their cabins as they awaited test results Friday that could show whether the coronavirus is circulating among the more than 3,500 people aboard.", "url": "https://www.snopes.com/ap/2020/03/06/at-sea-passengers-off-california-await-virus-test-results/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/AP-Virus-Outbreak-Cruise-Ship.jpg?fit=1200,800", "publishedAt": "2020-03-06T15:19:33Z", "content": "SAN FRANCISCO (AP) Passengers on a cruise ship off the California coast were instructed to stay in their cabins as they awaited test results Friday that could show whether the coronavirus is circulating among the more than 3,500 people aboard.\r\nA military hel… [+6539 chars]"}, {"source": {"id": null, "name": "Brooklynvegan.com"}, "author": "Amanda Hatfield", "title": "Ultra Music Festival 2020 officially postponed until 2021 due to coronavirus", "description": "”Due to the Florida Governor’s declaration of a public health emergency and Centers of Disease Control and Prevention’s Interim Guidance for COVID-19, it is impossible for the City to provide access to Bayfront Park at this time,” Ultra Music Festival organiz…", "url": "http://www.brooklynvegan.com/ultra-music-festival-2020-officially-postponed-until-2021-due-to-coronavirus/", "urlToImage": "http://www.brooklynvegan.com/files/2018/11/ultramusicfestival-2018.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2020-03-06T15:26:19Z", "content": "photo via Ultra Music Festival\r\nAfter reports of cancellation or indefinite postponement circulated following a Wednesday (3/4) meeting between Miami elected officials and festival representatives, Ultra Music Festival officially announced the postponement of… [+1839 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Three Biogen employees test positive for coronavirus", "description": "U.S. drugmaker Biogen Inc said on Friday three of its employees tested positive for the coronavirus after attending a meeting in Boston last week, and that their condition was improving under medical care.", "url": "https://www.reuters.com/article/us-health-coronavirus-biogen-idUSKBN20T24N", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499607457&w=1200&r=LYNXMPEG251GC", "publishedAt": "2020-03-06T15:31:11Z", "content": "(Reuters) - U.S. drugmaker Biogen Inc said on Friday three of its employees tested positive for the coronavirus after attending a meeting in Boston last week, and that their condition was improving under medical care. \r\nA few other attendees of the internal c… [+853 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Italy scrambles to contain coronavirus outbreak", "description": "Italy was the first first European country to ban flights from China, but that didn't stop the coronavirus from spreading there. CBS News foreign correspondent Charlie D'Agata joined CBSN from Rome with how Italy is responding to the outbreak.", "url": "https://www.cbsnews.com/video/italy-scrambles-to-contain-coronavirus-outbreak/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/06/befd06d6-e5f3-4114-aa8e-a1a299260437/thumbnail/1200x630/4c159428d3a918b57154608284b64929/0306-cbsn-italyscrambles-2042643-640x360.jpg", "publishedAt": "2020-03-06T15:41:46Z", "content": null}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Rich Johnston", "title": "\"More People Probably Died Of Bee Stings This Week Than Coronavirus \" – Wizard World Cleveland Still On This Weekend", "description": "There are many calls on Reed POP to cancel ECCC in a week's time over coronavirus fears – often it seems from people who would like to be able to apply for refunds on their tickets, vendor fees, hotels and travel as a result. Many companies and guests have no…", "url": "https://www.bleedingcool.com/2020/03/06/more-people-probably-died-of-bee-stings-this-week-than-coronavirus-wizard-world-cleveland-still-on-this-weekend/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/stechende_biene_12a-1200x628.jpg", "publishedAt": "2020-03-06T15:30:43Z", "content": "There are many calls on Reed POP to cancel ECCC in a week's time over coronavirus fears – often it seems from people who would like to be able to apply for refunds on their tickets, vendor fees, hotels and travel as a result. Many companies and guests have no… [+1763 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus stock plunge nears $4 trillion loss", "description": "Investors are worried the economic damage from the virus outbreak will be worse than previously thought.", "url": "https://www.cbsnews.com/news/coronavirus-stock-plunge-nears-4-trillion-spoiling-bull-markets-11th-birthday/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2015/10/12/d04c3a1d-b3a0-4255-bd3d-b42780a014d5/thumbnail/1200x630/c85254f28dff24e7cae1940c0496debf/bull-market.jpg", "publishedAt": "2020-03-06T15:49:53Z", "content": "The coronavirus stock market plunge could spoil a major party for Wall Street: The bull market's 11th birthday. Monday, March 9, would the 11-year anniversary of the end of the market's financial crisis meltdown. Stocks began rising in March 2009 — well befor… [+3560 chars]"}, {"source": {"id": null, "name": "Bradford-delong.com"}, "author": "J. Bradford DeLong", "title": null, "description": "The Federal Reserve appears to be not just the first but the only instrumentality of the federal government to actually do something significant in response to the coronovirus. Since this is overwhelmingly not a monetary policy but a public health problem, th…", "url": "https://www.bradford-delong.com/2020/03/the-federal-reserve-appears-to-be-not-just-the-first-but-the-only-instrumentality-of-the-federal-government-to-actually-do-so.html", "urlToImage": null, "publishedAt": "2020-03-06T15:56:22Z", "content": "The Federal Reserve appears to be not just the first but the only instrumentality of the federal government to actually do something significant in response to the coronovirus. Since this is overwhelmingly not a monetary policy but a public health problem, th… [+1755 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Thomas Seymat", "title": "Coronavirus: Vietnamese COVID-19 video goes viral as prevention message proves popular", "description": "Government public information videos are not meant to be this popular.", "url": "https://www.euronews.com/2020/03/06/coronavirus-vietnamese-covid-19-video-goes-viral-as-prevention-message-proves-popular", "urlToImage": "https://static.euronews.com/articles/stories/04/54/41/52/1000x563_cmsv2_dc7e306d-52c2-5679-a9f7-1b39efe65aae-4544152.jpg", "publishedAt": "2020-03-06T15:34:37Z", "content": "Rarely has a government's public information message been so popular. \r\nA video by authorities in Vietnam about how to prevent COVID-19 coronavirus was so catchy it went viral. \r\nThe pop song, a collaboration between musicians and Vietnam's health ministry, h… [+2625 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Moumita C. Chattopadhyay", "title": "Coronavirus-Led Mass Cancellations Hit Hotel REITs Hard", "description": "Lodging REITs have been particularly affected due to massive cancellations by both businesses and vacationers amid the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/coronavirus-led-mass-cancellations-hit-160404363.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Rg20_MpjzB.gVqtDrtPqvw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNzA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/ulS8wALi9XeSY_CZIfuLdQ--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/456245190f41b628a32296965b31a6ec", "publishedAt": "2020-03-06T16:04:04Z", "content": "Coronavirus is already emerging as a pandemic, wreaking havoc across the globe. The number of infected patients in the United States continues to rise, while the spread outside of mainland China from South Korea to Italy continues.\r\nMarkedly, massive cancella… [+4210 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Katey Rich", "title": "Katy Perry and Orlando Bloom’s Destination Wedding Foiled by Coronavirus", "description": "A reminder, as wedding season looms, that refundable airline tickets are always in style.", "url": "https://www.vanityfair.com/style/2020/03/katy-perry-orlando-bloom-wedding-coronavirus", "urlToImage": "https://media.vanityfair.com/photos/5e626ea124008c0008036c4a/16:9/w_1280,c_limit/katy-perry-orlando-bloom-wedding.jpg", "publishedAt": "2020-03-06T15:46:22Z", "content": "Katy Perry loves a destination wedding. In 2010, kicking off what would turn out to be 14 months of marriage, she and Russell Brand were married in a massive ceremony near a tiger sanctuary in northern Indiathere were elephants and a Bollywood-themed rehearsa… [+2099 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Aubrey Hansen", "title": "It’s Not Crazy to Say Trump Critics Are ‘Rooting for Coronavirus’", "description": "It's been touted by the conservative media that the left is effectively \"rooting\" for the coronavirus. Here's why that's not all that crazy. The post It’s Not Crazy to Say Trump Critics Are ‘Rooting for Coronavirus’ appeared first on CCN.com", "url": "https://www.ccn.com/its-not-crazy-to-say-trump-critics-are-rooting-for-coronavirus/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/donald-trump-g7-glare-ap.jpg", "publishedAt": "2020-03-06T15:18:15Z", "content": "<ul><li>Conservative media in the U.S. have been attacking Democrats and media outlets such as CNN and the New York Times for using the coronavirus to bring down President Trump.</li><li>Peter Hegseth of Fox &amp; Friends Weekends claims that theyre rooting f… [+3080 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Gabrielle Korn, written by Gabrielle Korn", "title": "Paris Fashion Week Was Surreal, & So Were The Trends", "description": "There was something intensely surreal about being in Paris last week; about leaving Milan on the heels of the news that public schools there would be shutting down because of coronavirus. It was hard to explain to friends in the U.S. — all still comfortably o…", "url": "https://www.refinery29.com/en-ca/2020/03/9518674/paris-fashion-week-trends-fall-winter-2020", "urlToImage": "https://www.refinery29.com/images/9514649.jpg?crop=40%3A21", "publishedAt": "2020-03-06T15:13:49Z", "content": "Skip navigation!\r\nNow ReadingThese Paris Fashion Week Trends Were Surreal\r\nThere was something intensely surreal about being in Paris last week; about leaving Milan on the heels of the news that public schools there would be shutting down because of coronavir… [+1488 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Frances Langum", "title": "Trump Supporter Tells CNN She 'Doesn't Believe C-Virus Exists'", "description": "It's not nice to make fun of the mentally infirm, no matter what the delusion. And this delusion is a doozy. A Trump supporter, at a rally in North Carolina, telling CNN that she \"doesn't believe the Coronavirus exists.\" REPORTER: You don’t believe coronaviru…", "url": "https://crooksandliars.com/2020/03/trump-supporter-tells-cnn-she-doesnt", "urlToImage": "https://crooksandliars.com/files/mediaposters/2020/03/44499.jpg", "publishedAt": "2020-03-06T15:58:03Z", "content": "It's not nice to make fun of the mentally infirm, no matter what the delusion. \r\nAnd this delusion is a doozy. A Trump supporter, at a rally in North Carolina, telling CNN that she \"doesn't believe the Coronavirus exists.\" \r\nREPORTER: You dont believe coronav… [+716 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Olivia Messer", "title": "Coronavirus Deaths Hit 14 and Shows New Signs of New York Spread", "description": "Photo by JASON REDMOND/AFP via Getty Images The death toll for the 2019 novel coronavirus spiked in the United States on Friday to a total of 14, with 13 deaths in Washington state and another in California. Meanwhile, the deadly disease showed new signs of s…", "url": "https://www.thedailybeast.com/coronavirus-deaths-hit-14-and-shows-new-signs-of-ny-spread", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2024,w_3600,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583509388/GettyImages-1205351647_zdaisp", "publishedAt": "2020-03-06T15:46:45Z", "content": "The death toll for the 2019 novel coronavirus spiked in the United States on Friday to a total of 14, with 13 deaths in Washington state and another in California.\r\nMeanwhile, the deadly disease showed new signs of spreading widely across the country, in New … [+5090 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus: Checkout the latest developments worldwide", "description": "The United Nations says lockdowns, quarantines and other such measures \"should always be carried out in strict accordance with human rights standards\".", "url": "https://www.moneycontrol.com/news/world/coronavirus-checkout-the-latest-developments-worldwide-5012021.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/Coronavirus-research-Reuters-770x433.jpg", "publishedAt": "2020-03-06T15:20:06Z", "content": "With new tolls and key developments, here is the latest in the coronavirus crisis.\r\n3,404 dead\r\nAcross the world, 3,404 people have died from the virus. There have been 99,464 infections in 89 countries and territories, according to AFP's latest toll based on… [+2404 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Simon Calder, Simon Calder", "title": "Lufthansa and Qatar Airways offer 'coronavirus compassion' by allowing passengers to postpone flight dates", "description": "Two giant airlines have unveiled their \"coronavirus compassion\" policies – which offer more flexibility than those already published by British Airways and Virgin Atlantic.", "url": "https://www.independent.co.uk/travel/news-and-advice/lufthansa-qatar-airways-coronavirus-flight-delay-change-refund-compensation-a9382956.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/02/10/lufthansaaircraftfrankfurt.jpg", "publishedAt": "2020-03-06T15:56:01Z", "content": "Two giant airlines have unveiled their coronavirus compassion policies which offer more flexibility than those already published by British Airways and Virgin Atlantic.\r\nUp until now, most airlines facing a slump in bookings because of fears about the spread … [+3209 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Joan Summers", "title": "Wendy Williams Has Stepped in Some Shit Again Over Ashley Graham's Diaper Pic", "description": "Wendy Williams would probably be much less famous if she stopped haranguing Instagram influencers and random passersby. She would have never had the influence on radio that she had if she wasn’t regularly insulting guests to their faces—remember that Whitney …", "url": "https://jezebel.com/wendy-williams-has-stepped-in-some-shit-again-over-ashl-1842151068", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/acg7gafyihywa239dwnj.png", "publishedAt": "2020-03-06T15:45:00Z", "content": "Wendy Williams would probably be much less famous if she stopped haranguing Instagram influencers and random passersby. She would have never had the influence on radio that she had if she wasnt regularly insulting guests to their facesremember that WhitneyHou… [+2825 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Chinese province reports 17 new coronavirus infections imported from Iran", "description": "The northwestern Chinese province of Gansu has confirmed 17 new coronavirus cases imported from Iran, bringing the total imported cases to 28, the province's health authorities said late on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-china-gansu-idUSKBN20T28J", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200306&t=2&i=1499621071&w=1200&r=LYNXMPEG251K2", "publishedAt": "2020-03-06T16:08:09Z", "content": "BEIJING (Reuters) - The northwestern Chinese province of Gansu has confirmed 17 new coronavirus cases imported from Iran, bringing the total imported cases to 28, the province’s health authorities said late on Friday. \r\nThe 17 new patients were among quaranti… [+589 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Swiss report 210 diagnosed cases of coronavirus, one death", "description": "The number of people diagnosed with the new coronavirus in Switzerland has risen to 210, Daniel Koch, head of infectious diseases at the national public health agency, told a news conference in Bern.", "url": "https://www.reuters.com/article/us-health-coronavirus-swiss-toll-idUSKBN20T24J", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T15:28:42Z", "content": "ZURICH (Reuters) - The number of people diagnosed with the new coronavirus in Switzerland has risen to 210, Daniel Koch, head of infectious diseases at the national public health agency, told a news conference in Bern. \r\nHe put the number of deaths at one, as… [+99 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Coronavirus outbreak: Shooting World Cup in New Delhi postponed - Hindustan Times", "description": "Coronavirus outbreak: Shooting World Cup in New Delhi postponed Hindustan Times Coronavirus: Shooting New Delhi World Cup postponed; Tokyo Test event likely to be cancelled The Tribune India Coronavirus strikes shooting World Cup Times of India ISSF New Delhi…", "url": "https://www.hindustantimes.com/other-sports/coronavirus-outbreak-shotting-world-cup-in-new-delhi-postponed-report/story-6KpcJNLNo51MfTonF2vRiI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/01/12/Pictures/practice-rifle-pistol-world-cup_5e0a89f0-3515-11ea-a5da-81b27965305c.jpg", "publishedAt": "2020-03-06T15:48:17Z", "content": "The surge in novel coronavirus cases in India has led to the postponement of the shooting World Cup and has also put the India Open badminton in jeopardy. Both events were scheduled to be held in Delhi this month. The National Rifle Association of India (NRAI… [+3717 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Cruise ship passengers stranded off California coast over coronavirus concerns", "description": "In the United States, there are now at least 230 confirmed cases of coronavirus across 21 states. This comes as officials are testing cruise ship passengers stranded 70 miles off the coast of San Francisco. CBS News' Naomi Ruchim joined CBSN AM with more.", "url": "https://www.cbsnews.com/video/cruise-ship-passengers-stranded-off-california-coast-over-coronavirus-concerns/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/06/6a7dbbb8-7bf4-4512-b513-d5dff03df720/thumbnail/1200x630/81739b6d1e9546390da0873beaa49379/0306-cbsnam-cruiseshippassengers-2042636-640x360.jpg", "publishedAt": "2020-03-06T15:42:31Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Retailers accused of price gouging amid coronavirus outbreak", "description": "Cleaning and sanitizing supplies are vanishing from store shelves amid the coronavirus fears, and some retailers are vastly increasing prices of goods. CBS News consumer investigative correspondent Anna Werner joined CBSN AM with more.", "url": "https://www.cbsnews.com/video/retailers-stand-accused-of-price-gouging-as-supplies-vanish-from-shelves-amid-coronavirus-outbreak/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/06/4f2dda7f-65e4-4c2b-a030-ac6eff345f77/thumbnail/1200x630/a32644b64d2ab9fa082e88c11ce5a7e7/cbsn-fusion-retailers-stand-accused-of-price-gouging-as-supplies-vanish-from-shelves-amid-coronavirus-outbreak.jpg", "publishedAt": "2020-03-06T15:34:34Z", "content": null}, {"source": {"id": null, "name": "Metafilter.com"}, "author": "Homo neanderthalensis", "title": "How the coronavirus rumor mill can thrive in private group chats", "description": "Social media platforms work to fight coronavirus myths, but they may not be able to win against your DMs. With the Covid-19 coronavirus outbreak still so new, fear of the death and disruption it could cause rapidly mounting, and treatments for it still a big …", "url": "https://www.metafilter.com/185943/How-the-coronavirus-rumor-mill-can-thrive-in-private-group-chats", "urlToImage": "http://cdn.mefi.us/images/mefi/apple-touch-icon.png", "publishedAt": "2020-03-06T16:04:10Z", "content": null}, {"source": {"id": null, "name": "Thedailymash.co.uk"}, "author": "The Daily Mash", "title": "Middle-class families panic-buying board games", "description": "MIDDLE-CLASS families have cleared the shelves of cerebral board games as the coronavirus panic continues.", "url": "https://www.thedailymash.co.uk/news/lifestyle/middle-class-families-panic-buying-board-games-20200306194229", "urlToImage": "https://cdn.thedailymash.co.uk/wp-content/uploads/20200306141647/dreamstime_s_163323387.jpg", "publishedAt": "2020-03-06T15:56:06Z", "content": "A WOMAN is spending the whole weekend watching what friends and acquaintances are doing this weekend, via her phone. \r\nEleanor Shaw began monitoring the weekend activities of others on Friday evening and will continue doing so until late on Sunday, while upda… [+790 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Czechs returning from Italian breaks to be quarantined", "description": "Thousands of Czechs returning from holidays in Italy will have to go into quarantine for two weeks or face fines as part of efforts to curb the coronavirus, health officials said on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-czech-italy-idUSKBN20T27Q", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-06T16:01:46Z", "content": "PRAGUE (Reuters) - Thousands of Czechs returning from holidays in Italy will have to go into quarantine for two weeks or face fines as part of efforts to curb the coronavirus, health officials said on Friday. \r\nEighteen cases have been reported in the Czech R… [+1325 chars]"}, {"source": {"id": null, "name": "Thurrott.com"}, "author": "Brad Sams", "title": "First Ring Daily 783: Inconvenient Timing", "description": "On this episode of First Ring Daily, Microsoft has a Coronavirus, used cars can be expensive, and Microsoft 365 assistant may be a thing. The post First Ring Daily 783: Inconvenient Timing appeared first on Thurrott.com.", "url": "https://www.thurrott.com/podcasts/231534/first-ring-daily-783-inconvenient-timing", "urlToImage": "https://www.thurrott.com/wp-content/uploads/sites/2/2020/03/PremiereElementsEditor_2020-03-06_09-57-07.jpg", "publishedAt": "2020-03-06T15:26:25Z", "content": "You're not here for the ads. We understand. But ads help us keep the lights on. And you can support our journalism by taking advantage of one of these options:\r\nSign-up for a free Thurrott.com account below and you can ad-block to your heart's content. Or, if… [+113 chars]"}]