[{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "South African president orders repatriation of citizens in Wuhan over coronavirus", "description": "South Africa's President Cyril Ramaphosa on Thursday ordered the repatriation of his nearly two hundred citizens from the central Chinese city of Wuhan, epicenter of the coronavirus outbreak, his office said in a statement.", "url": "https://www.reuters.com/article/us-health-coronavirus-safrica-idUSKCN20L2XT", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T20:05:18Z", "content": "JOHANNESBURG (Reuters) - South Africa’s President Cyril Ramaphosa on Thursday ordered the repatriation of his nearly two hundred citizens from the central Chinese city of Wuhan, epicenter of the coronavirus outbreak, his office said in a statement. \r\nRadical … [+813 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "How Is the U.S. Going to Fight the Conoravirus?", "description": "This week, the other shoe dropped for people living in the U.S. worried about the spread of the new coronavirus. Officials have reported the first local cases of the respiratory illness, COVID-19, in California. The virus is here—and has probably been here fo…", "url": "https://gizmodo.com/how-is-the-u-s-going-to-fight-the-conoravirus-1841956559", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hkzfcfe4x21yfei9s1x8.jpg", "publishedAt": "2020-02-27T19:30:00Z", "content": "This week, the other shoe dropped for people living in the U.S. worried about the spread of the new coronavirus. Officials have reported the first local cases of the respiratory illness, COVID-19, in California. The virus is hereand has probably been here for… [+7720 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "Trump held up a map showing the US is the best prepared country in the world for a pandemic, but only for the rich, influential, and fully insured", "description": "President Trump held up a map Wednesday night that ranks the US world-best in epidemic preparedness. The map comes from the 2019 \"Global Health Security Index\" ranking, which measures how well-prepared 195 countries are to tackle a major infectious disease ou…", "url": "https://www.businessinsider.com/trump-us-ranked-top-epidemic-preparedness-but-only-for-rich-2020-2", "urlToImage": "https://i.insider.com/5e57f14cfee23d6e4c7ceeb2?width=1200&format=jpeg", "publishedAt": "2020-02-27T19:53:00Z", "content": "President Trump wants the world to know that the US is number one, even when it comes to fighting off the novel coronavirus.\r\n\"We're rated number one for being prepared,\" the president said at the White House on Wednesday, as he announced he was putting Vice … [+5634 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Arne Delfs and Patrick Donahue", "title": "Germany Mulls Stimulus Measures to Offset Coronavirus Impact", "description": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world threatened by trade wars. Sign up here. Germany is looking at a range of measures ...", "url": "https://news.yahoo.com/germany-mulls-stimulus-measures-offset-191927293.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-27T19:19:27Z", "content": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world threatened by trade wars. Sign up here. \r\nGermany is looking at a range of measures to address economic damage from the spread of the coronavirus and protect its key export sector from… [+2336 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Bettina Makalintal, Hilary Pollack", "title": "Coronavirus Merch Is Here, But Who's Buying It?", "description": "\"I started listing them on my shop when coronavirus wasn’t so much of a concern,\" said one Etsy seller of coronavirus shirts.", "url": "https://www.vice.com/en_us/article/4ag7wg/coronavirus-merch-is-here-but-whos-buying-it", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e5815992e0d32009bf2798a/lede/1582831768860-coronavirus-themed-meme-shirts-etsy.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-02-27T19:46:25Z", "content": "With cases of coronavirus spreading to at least 37 locations internationally per the CDC, it was inevitable that enterprising sellers would quickly capitalize on the growing collective anxiety by jacking up the price on N95 face masks and marketing \"pandemic … [+4585 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andrew Dunn", "title": "How the buzzy biotech upstart Moderna sped past Big Pharma to develop the first potential coronavirus vaccine in just 42 days", "description": "In the sprint to develop vaccines for the coronavirus outbreak, the world's largest drugmakers have been lapped by a startup biotech. It took 42 days for Moderna to turn the genomic sequence of the virus into a vaccine candidate and ship it to US health offic…", "url": "https://www.businessinsider.com/moderna-coronavirus-mrna-vaccine-candidate-development-timeline-2020-2", "urlToImage": "https://i.insider.com/5e581f99fee23d1b3b4934c8?width=1200&format=jpeg", "publishedAt": "2020-02-27T19:59:00Z", "content": "Scrambling to respond to the growing coronavirus outbreak, some of the world's largest drugmakers have begun researching vaccines to prevent the deadly virus.\r\nBut a small, startup biotech has sped past them, becoming the first company to produce a potential … [+8863 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Carli Velocci", "title": "Here are all the companies that have pulled out of GDC", "description": "News is happening fast. Here's a rundown of all the companies that have decided not to attend. It seems like every day now, a new company announces it's pulling out of the Game Developers Conference (GDC) in San Francisco due to health concerns surrounding th…", "url": "https://www.androidcentral.com/here-are-all-companies-have-pulled-out-gdc-2020-coronavirus-concerns", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/03/gdc-2019-hero.jpg?itok=g1FQXogt", "publishedAt": "2020-02-27T19:48:18Z", "content": "It seems like every day now, a new company announces it's pulling out of the Game Developers Conference (GDC) in San Francisco due to health concerns surrounding the coronavirus (COVID-19). It makes sense since the outbreak is hitting the tech industry at lar… [+4768 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashley Stewart", "title": "Microsoft analysts refuse to flinch after the company's surprise coronavirus sales miss, but investors don't seem so brave (MSFT)", "description": "Microsoft announced it will miss a sales forecast for the upcoming quarter due to supply chain constraint caused by the Wuhan coronavirus. The affected part of its business is the segment that includes in its PC licensing and Surface hardware businesses. Reve…", "url": "https://www.businessinsider.com/wall-street-analysts-unfazed-by-microsoft-sales-shortfall-2020-2", "urlToImage": "https://i.insider.com/5e581340fee23d139926efa4?width=1200&format=jpeg", "publishedAt": "2020-02-27T20:01:03Z", "content": "Microsoft said Wednesday that it won't hit its revenue forecast this quarter as disruptions from the coronavirus outbreak take a toll on its businesses licensing Windows software to PC makers and its in-house Surface hardware division.\r\nWhile the news spooked… [+3225 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Hannah Smothers, Katie Way, Casey Johnston, Amy Rose Spiegel", "title": "Here’s What You, Personally, Should Do About Coronavirus", "description": "If someone coughs near you, do they have coronavirus? Should you buy a mask? Go outside? Stockpile food? Here’s everything you need to know.", "url": "https://www.vice.com/en_us/article/akw4gp/how-to-prepare-for-coronavirus", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e580d54be0f7a009c5ad0e5/lede/1582832165356-ARC_Getty_177764313_Surgeon_holding_shotgun_backlit_VICE_RF.jpeg?crop=1xw:0.7504xh;0xw,0.0337xh&resize=1200:*", "publishedAt": "2020-02-27T19:37:25Z", "content": "The CDC announced Tuesday that it considers widespread coronavirus in the U.S. more of a when than an if situation, and people have, unsurprisingly, been freaking out. Theres plenty of cause for concern: As of this writing, more than 82,000 cases of coronavir… [+9508 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Samuel Tolbert", "title": "Epic Games is the latest in a long line of companies to pull out of GDC", "description": "To approximately no one's surprise at this point, another big company is pulling out of GDC 2020. What you need to know GDC (Game Developers Conference) 2020 is scheduled to begin on March 16. Due to concerns over the Coronavirus outbreak, multiple companies …", "url": "https://www.windowscentral.com/epic-games-pulls-out-gdc-2020", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/02/fortnite-chapter-2-season-2-battle-pass.jpg?itok=46NEJ7Hy", "publishedAt": "2020-02-27T19:26:11Z", "content": "As GDC 2020 gets closer and closer, more and more companies are rapidly pulling out due to fears regarding the ongoing Coronavirus outbreak. The latest in this ever-growing list is Epic Games, who announced today on Twitter that it will no longer be attending… [+647 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Alissa McAloon", "title": "Facebook cancels F8 dev event over coronavirus worries", "description": "Facebook has called off the on-location portion of its annual F8 developer conference, citing growing concerns over theÂ COVID-19 coronavirus as the reason for the decision....", "url": "https://www.gamasutra.com/view/news/358862/Facebook_cancels_F8_dev_event_over_coronavirus_worries.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29", "urlToImage": "http://www.gamasutra.com/db_area/images/news/2020/Feb/358862/facebook208.jpg", "publishedAt": "2020-02-27T19:12:00Z", "content": "Facebook has called off the on-location portion of its annual F8 developer conference, citing growing concerns over the COVID-19 coronavirusâ\u0080\u008b outbreak as the reason for the decision.\r\n“This was a tough call to make,” explains a post form Facebook dev platfo… [+534 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple CEO Tim Cook: 'It Feels to Me China is Getting Coronavirus Under Control'", "description": "Apple CEO Tim Cook is in Birmingham, Alabama today, where he spoke at an event for EdFarm, which will offer Apple's Everyone Can Code curriculum alongside civil rights education conducted through augmented reality. Following his EdFarm speech, Cook did an int…", "url": "https://www.macrumors.com/2020/02/27/apple-tim-cook-china-coronavirus/", "urlToImage": "https://images.macrumors.com/article-new/2020/02/timcookcoronaviruschina.jpg", "publishedAt": "2020-02-27T19:27:59Z", "content": "Apple CEO Tim Cook is in Birmingham, Alabama today, where he spoke at an event for EdFarm, which will offer Apple's Everyone Can Code curriculum alongside civil rights education conducted through augmented reality.\r\nFollowing his EdFarm speech, Cook did an in… [+1514 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Carli Velocci", "title": "Here are all the companies that have pulled out of GDC", "description": "News is happening fast. Here's a rundown of all the companies that have decided not to attend. It seems like every day now, a new company announces it's pulling out of the Game Developers Conference (GDC) in San Francisco due to health concerns surrounding th…", "url": "https://www.windowscentral.com/here-are-all-companies-have-pulled-out-gdc-2020-coronavirus-concerns", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/02/gdc-2019-hero.jpg?itok=2R7sQqZg", "publishedAt": "2020-02-27T19:47:54Z", "content": "It seems like every day now, a new company announces it's pulling out of the Game Developers Conference (GDC) in San Francisco due to health concerns surrounding the coronavirus (COVID-19). It makes sense since the outbreak is hitting the tech industry at lar… [+3745 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Ethan Millman", "title": "SXSW Notes ‘Handful’ of Cancellations Amid Coronavirus Scare", "description": "\"Safety is a top priority for SXSW, and we work closely with local, state, and federal agencies year-round to plan for a safe event,\" organizers say", "url": "https://www.rollingstone.com/music/music-news/coronavirus-sxsw-959006/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/02/CoronaVirus.jpg", "publishedAt": "2020-02-27T19:47:21Z", "content": "While the ongoing coronavirus pandemic has begun to rock the global live music scene, causing tour and festival postpones around the world, all is still steady — mostly — for South by Southwest, which will commence in Austin in March.\r\nThat’s not without a fe… [+2191 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Elizabeth Gulino, written by Elizabeth Gulino", "title": "Will The Olympics Be Cancelled Because Of The Coronavirus?", "description": "The 2020 Olympics don’t kick off until July 24. But officials are already voicing concerns that the coronavirus outbreak may affect the Games, which are scheduled to be held in Tokyo this year. Coronavirus, which refers to a family of viruses that include eve…", "url": "https://www.refinery29.com/en-ca/2020/02/9480462/coronavirus-impact-on-2020-olympics", "urlToImage": "https://www.refinery29.com/images/9460710.jpg?crop=40%3A21", "publishedAt": "2020-02-27T19:38:24Z", "content": "Skip navigation!\r\nNow ReadingWill The Coronavirus Get The Olympics Cancelled?\r\nCoronavirus, which refers to a family of viruses that include everything from the common cold to MERS and SARS, has been huge news since the most recent outbreak began in Wuhan, Ch… [+2670 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Molly Longman, written by Molly Longman", "title": "Prince George & Princess Charlotte’s School Is Having A Coronavirus Scare", "description": "Mandatory Credit: Photo by Shutterstock (10401782ae) Princess Charlotte arrives for her first day of school, with her brother Prince George and her parents the Duke and Catherine Duchess of Cambridge, at Thomas’s Battersea in London. Princess Charlotte’s firs…", "url": "https://www.refinery29.com/en-ca/2020/02/9480608/prince-george-coronavirus", "urlToImage": "https://www.refinery29.com/images/9478408.jpg?crop=40%3A21", "publishedAt": "2020-02-27T19:54:02Z", "content": "Skip navigation!\r\nNow ReadingCoronavirus Scare Hits Prince George's School\r\n\"We currently have a very small number of pupils who have been tested and these individuals are currently, as per government advice, remaining at home pending the receipt of their tes… [+1701 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Answers to 3 air travel questions during the coronavirus outbreak - Washington Post", "description": "Answers to 3 air travel questions during the coronavirus outbreak Washington Post Coronavirus outbreak hits arts and entertainment industries Al Jazeera English Timeline of coronavirus as world scrambles to respond Reuters Coronavirus outbreak slashes China's…", "url": "https://www.youtube.com/watch?v=-daSkwEeXPU", "urlToImage": "https://i.ytimg.com/vi/-daSkwEeXPU/maxresdefault.jpg", "publishedAt": "2020-02-27T19:14:01Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Mac Greer)", "title": "The Non-Linearity of Supply Chain Disruptions", "description": "We have some updates on the coronavirus and how it is causing worldwide disruptions.", "url": "https://www.fool.com/investing/2020/02/27/the-non-linearity-of-supply-chain-disruptions.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560271/cover_mf.jpg", "publishedAt": "2020-02-27T19:49:00Z", "content": "On today's episode of Market Foolery, Mac Greer is joined by Motley Fool analysts Bill Mann and Emily Flippen to go over some of today's headlines.\r\n<ul><li>Bob Iger is stepping down in 2021 as CEO of Disney (NYSE:DIS), and his successor, Bob Chapek, has caug… [+19606 chars]"}, {"source": {"id": null, "name": "Fox10phoenix.com"}, "author": "FOX TV Digital Team", "title": "8,400 people being monitored for coronavirus in California amid 28 confirmed COVID-19 cases, governor says - FOX 10 News Phoenix", "description": "8,400 people being monitored for coronavirus in California amid 28 confirmed COVID-19 cases, governor says FOX 10 News Phoenix California is monitoring at least 8,400 people for the coronavirus CNBC Coronavirus Diagnosis in California Highlights Testing Flaws…", "url": "https://www.fox10phoenix.com/news/8400-people-being-monitored-for-coronavirus-in-california-amid-28-confirmed-covid-19-cases-governor-says", "urlToImage": "https://images.foxtv.com/static.fox10phoenix.com/www.fox10phoenix.com/content/uploads/2020/02/724/407/GettyImages-1207490643.jpg?ve=1&tl=1", "publishedAt": "2020-02-27T19:39:08Z", "content": "SACRAMENTO, Calif. - A day after the first case of person-to-person coronavirus was reported in Northern California, Gov. Gavin Newsom on Thursday held a news conference on the state's response to the illness, known as COVID-19.\r\n\"We are not overreacting but … [+7247 chars]"}, {"source": {"id": null, "name": "Sacbee.com"}, "author": null, "title": "Will coronavirus wreck your spring or summer travel plans? 5 things to know - Sacramento Bee", "description": "Will coronavirus wreck your spring or summer travel plans? 5 things to know Sacramento Bee Coronavirus live updates: New coronavirus case may be 1st sign of \"community spread\" in U.S. CBS News Chinese activists confront censorship, violence to expose truth ab…", "url": "https://www.sacbee.com/news/nation-world/national/article240698841.html", "urlToImage": null, "publishedAt": "2020-02-27T20:10:00Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Taylor Carmichael)", "title": "Vir Biotechnology and WuXi Biologics to Collaborate on COVID-19 Treatment", "description": "News that the two biotechs are working together on monoclonal antibody treatments for the coronavirus has excited investors.", "url": "https://www.fool.com/investing/2020/02/27/vir-biotechnology-wuxi-biologics-covid-19-antibody.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560336/gettyimages-1201634413.jpg", "publishedAt": "2020-02-27T19:54:00Z", "content": "Vir Biotechnology (NASDAQ:VIR) is one of several biotech companies pushing rapidly to develop potential treatments for COVID-19, a viral illness that is threatening to become a worldwide pandemic. Just two weeks ago, the company announced that its researchers… [+1478 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "New York Is Preparing for Possible Coronavirus Outbreak", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-02-27/new-york-is-preparing-for-possible-coronavirus-outbreak-video", "urlToImage": null, "publishedAt": "2020-02-27T20:01:34Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "A coronavirus patient and Diamond Princess cruise ship passenger being treated in a San Francisco hospital says he feels perfectly fine", "description": "The Diamond Princess cruise ship passenger tested positive for the virus but said he isn't experiencing the usual symptoms.", "url": "https://news.yahoo.com/coronavirus-patient-diamond-princess-cruise-192110556.html", "urlToImage": null, "publishedAt": "2020-02-27T19:21:10Z", "content": null}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Evan Selleck", "title": "Facebook has canceled its upcoming F8 developers conference due to coronavirus concerns", "description": "Facebook has decided to cancel its annual F8 developers conference, which was scheduled for early May, due to coronavirus concerns.", "url": "https://www.idownloadblog.com/2020/02/27/facebook-cancels-f8-dev-conference/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2019/08/FAcebook-DarK-Mode-hero-001.png", "publishedAt": "2020-02-27T19:19:01Z", "content": "Major conferences are being canceled due to the coronavirus outbreak, and now Facebook is just one more.\r\nToday, Facebook has announced that it has canceled its annual F8 developers conference, which was originally scheduled to take place in May. The reason? … [+1983 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will coronavirus wreck your spring or summer travel plans? 5 things to know - Sacramento Bee", "description": "Will coronavirus wreck your spring or summer travel plans? 5 things to know Sacramento Bee Live updates: Coronavirus COVID-19 Medical News Today Why Coronavirus Spread Across the Globe: Mobile Population and Mild Symptoms msnNOW Coronavirus panic is growing. …", "url": "https://news.google.com/__i/rss/rd/articles/CBMiR2h0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9uYXRpb24td29ybGQvbmF0aW9uYWwvYXJ0aWNsZTI0MDY5ODg0MS5odG1s0gFHaHR0cHM6Ly9hbXAuc2FjYmVlLmNvbS9uZXdzL25hdGlvbi13b3JsZC9uYXRpb25hbC9hcnRpY2xlMjQwNjk4ODQxLmh0bWw?oc=5", "urlToImage": null, "publishedAt": "2020-02-27T20:10:00Z", "content": null}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "NPR's no-nonsense guide to preparing your home for Covid-19", "description": "It's seems likely that Covid-19 will be a pandemic, maybe on the order of the 1918 Spanish Flu (listen to this podcast episode of The New York Times ' The Daily for a persuasive argument as to why). It might be a good time to prepare your home for an outbreak…", "url": "https://boingboing.net/2020/02/27/nprs-no-nonsense-guide-to-pr.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2020/02/canning-469216_1280.jpg?fit=700%2C465&ssl=1", "publishedAt": "2020-02-27T20:07:20Z", "content": "Washington College professor of archeology and anthropology Bill Schindler demonstrates some nifty fire-starting-from-scratch techniques. “Even though you may never find yourself in a survival situation,” he tells Wired, “I firmly believe that learning and pr… [+1779 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mask shortage in Sacramento as coronavirus fears grip California. What protection is available - Sacramento Bee", "description": "Mask shortage in Sacramento as coronavirus fears grip California. What protection is available Sacramento Bee California is monitoring at least 8,400 people for the coronavirus CNBC New US coronavirus case puts officials on high alert l ABC News ABC News Coro…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA2OTM3MTEuaHRtbNIBS2h0dHBzOi8vYW1wLnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA2OTM3MTEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-02-27T19:15:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Philip Pullella", "title": "Vatican closes Italy's catacombs due to coronavirus", "description": "The Vatican has closed all of Italy's ancient catacombs normally open to the public because of the country's coronavirus outbreak.", "url": "https://www.reuters.com/article/us-china-health-vatican-catacombs-idUSKCN20L2UE", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496118836&w=1200&r=LYNXNPEG1Q1SI", "publishedAt": "2020-02-27T19:19:56Z", "content": "VATICAN CITY (Reuters) - The Vatican has closed all of Italy’s ancient catacombs normally open to the public because of the country’s coronavirus outbreak. \r\nVatican official Monsignor Pasquale Iacobone said the decision was taken to protect guides who work i… [+1024 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Chase Purdy", "title": "Coronavirus forced Chinese food delivery to evolve. Will it do the same in the US?", "description": "Right now US companies don't have a specific game plan for a pandemic.", "url": "https://qz.com/1809381/will-grubhub-and-uber-eats-learn-from-meituans-coronavirus-plan/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/02/AP_840116117523-e1582818244313.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-02-27T19:29:37Z", "content": "Matt Maloney says he wipes down his airplane seat with disinfectant every time he flies these days.\r\nMaloney, the CEO of food delivery company GrubHub, is exercising the same brand of caution as he watches Covid-19, the disease caused by a novel coronavirus, … [+3915 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Jeremy Warner", "title": "There is nothing irrational about the coronavirus panic – it will change the world as we know it", "description": "By coincidence, I happened to be reading John Kelly&rsquo;s The Great Mortality:", "url": "https://www.telegraph.co.uk/news/2020/02/27/nothing-irrational-coronavirus-panic-will-change-world-know/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/02/24/TELEMMGLPICT000225853508-xlarge_trans_NvBQzQNjv4Bqulmngyk1nEPNRM5Qu5tZfjlaTMTxUhlzF8Rkw038U-A.jpeg?imwidth=1200", "publishedAt": "2020-02-27T20:00:00Z", "content": "By coincidence, I happened to be reading John Kellys The Great Mortality: an intimate history of the Black Death, when news of the coronavirus outbreak first broke in the British press. It is remarkable what an enduring hold this devastating historical event … [+1009 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "California monitoring 8,400 people for coronavirus, awaiting test kits", "description": "California Governor Gavin Newsom said on Thursday that health officials are monitoring 8,400 people for coronavirus symptoms after they arrived in the state from domestic commercial flights.", "url": "https://www.reuters.com/article/us-china-health-california-idUSKCN20L2US", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496120137&w=1200&r=LYNXNPEG1Q1SP", "publishedAt": "2020-02-27T19:22:47Z", "content": "(Reuters) - California Governor Gavin Newsom said on Thursday that health officials are monitoring 8,400 people for coronavirus symptoms after they arrived in the state from domestic commercial flights. \r\nThe state currently has only about 200 test kits, an “… [+216 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Eric Abent", "title": "Coronavirus costs GDC 2020 another major exhibitor", "description": "With the current coronavirus outbreak – COVID-19 – big trade shows have been losing exhibitors. Before the show was cancelled entirely, a number of big-name companies dropped out of Mobile World Congress 2020, and now we’re seeing the same thing happen with t…", "url": "https://www.slashgear.com/coronavirus-costs-gdc-2020-another-major-exhibitor-27611489/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/02/Unity-logo-slashgear1.jpg", "publishedAt": "2020-02-27T19:48:12Z", "content": "With the current coronavirus outbreak – COVID-19 – big trade shows have been losing exhibitors. Before the show was cancelled entirely, a number of big-name companies dropped out of Mobile World Congress 2020, and now we’re seeing the same thing happen with t… [+1726 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Pandemic potential': How to counter Coronavirus outbreak? - FRANCE 24 English", "description": "'Pandemic potential': How to counter Coronavirus outbreak? FRANCE 24 English Coronavirus: Myths that have gained traction The Irish Times What you need to know about COVID-19 WFAA View Full Coverage on Google News", "url": "https://www.youtube.com/watch?v=gltRRVT4WoE", "urlToImage": "https://i.ytimg.com/vi/gltRRVT4WoE/hqdefault.jpg", "publishedAt": "2020-02-27T19:48:40Z", "content": null}, {"source": {"id": null, "name": "Pahomepage.com"}, "author": "Andy Mehalshick", "title": "Coronavirus concerns affecting local businesses - PAHomePage.com", "description": "Coronavirus concerns affecting local businesses PAHomePage.com", "url": "https://www.pahomepage.com/top-stories/coronavirus-concerns-affecting-local-businesses/", "urlToImage": "https://www.pahomepage.com/wp-content/uploads/sites/91/2020/02/IMG_4571.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-02-27T19:57:00Z", "content": "HAZLETON, LUZERNE COUNTY (WBRE/WYOU-TV) — There are growing concerns over the spread of the coronavirus.\r\nWorld health officials are still measuring how widespread it might be and what threats it may pose moving forward.\r\nThe uncertainty of the coronavirus is… [+2514 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Andrew Restuccia, Stephanie Armour", "title": "White House to control message...", "description": "White House to control message... (Second column, 10th story, link ) Related stories: Vexed by how to contain virus, countries take tough steps... Schools shut, travel curbed... Could hit 80% of Brits in 'worst case scenario'... Infects Iranian Vice President…", "url": "https://www.wsj.com/articles/white-house-wants-signoff-on-coronavirus-messaging-11582832832", "urlToImage": "https://images.wsj.net/im-158564/social", "publishedAt": "2020-02-27T20:04:44Z", "content": "WASHINGTONThe White House is taking steps to better coordinate messaging on the coronavirus outbreak, instructing senior officials to seek approval from Vice President Mike Pences office before speaking publicly about the epidemic, according to people familia… [+264 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Sacramento", "title": "How Daily Life Could Change in USA...", "description": "How Daily Life Could Change in USA... (Top headline, 9th story, link ) Related stories: First case of UNKNOWN ORIGIN confirmed in Northern California... WAS NOT TESTED FOR DAYS... Medical staff exposed? Experts: Should be prepared to see overnight boom... REP…", "url": "https://sacramento.cbslocal.com/2020/02/27/coronavirus-us-spread-daily-life-effects/", "urlToImage": "https://sacramento.cbslocal.com/wp-content/uploads/sites/15909776/2020/02/GettyImages-1203669884.jpg?w=1280", "publishedAt": "2020-02-27T19:37:36Z", "content": "(CBS13/CNN) — Officials at the US Centers for Disease Control and Prevention have warned that it’s not a question of if, but when the novel coronavirus will spread in the United States — and communities are urged to prepare for the virus that has already kill… [+9165 chars]"}, {"source": {"id": null, "name": "Sacbee.com"}, "author": null, "title": "Sacramento businesses hunker down as coronavirus spread hits home. Here’s the impact - Sacramento Bee", "description": "Sacramento businesses hunker down as coronavirus spread hits home. Here’s the impact Sacramento Bee", "url": "https://www.sacbee.com/news/business/article240696681.html", "urlToImage": null, "publishedAt": "2020-02-27T19:47:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Stephen Dash, Contributor, Stephen Dash, Contributor https://www.forbes.com/sites/stephendash/", "title": "Coronavirus Could Send Student Loan Rates Plunging To Record Lows", "description": "Worries about the economic impact of the coronavirus have sent many investors fleeing to bonds — which could push rates on federal student loans to record lows. Lower rates could save the average student $473 to $1,963 in interest charges on loans taken out d…", "url": "https://www.forbes.com/sites/stephendash/2020/02/27/coronavirus-could-send-student-loan-rates-plunging-to-record-lows/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1198655387%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D6496%26cropY1%3D334%26cropY2%3D3989", "publishedAt": "2020-02-27T19:27:38Z", "content": "Worries about the economic impact of the coronavirus have sent stocks tumbling and many investors fleeing to bonds which could push rates on federal student loans to record lows.&amp;nbsp;How does that work? Once you take out a federal student loan, the inter… [+13525 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "Discovery Says Financial Hit To Eurosport Subsid Minimal If Coronavirus Tanks Olympics", "description": "As cornavirus fears shutter big events left and right, Discovery executives reassured Wall Street Thursday that all systems were still a go for the Tokyo Olympics at its pan-European broadcast subsidiary Eurosport but that the financial impact of an eventual …", "url": "https://deadline.com/2020/02/discovery-financial-hit-eurosport-minimal-if-olympics-canceled-1202869980/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/04/discovery-logo-.jpg?w=1024", "publishedAt": "2020-02-27T19:50:09Z", "content": "As cornavirus fears shutter big events left and right, Discovery executives reassured Wall Street  Thursday that all systems were still a go for the Tokyo Olympics at its pan-European broadcast subsidiary Eurosport but that the financial impact of an eventual… [+1046 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pfizer warns of hit to financial results on continued coronavirus outbreak", "description": "Pfizer Inc on Thursday warned that the continued spread of the coronavirus globally could have an adverse impact on its financial results.", "url": "https://www.reuters.com/article/us-china-health-pfizer-idUSKCN20L2XB", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496129086&w=1200&r=LYNXNPEG1Q1TY", "publishedAt": "2020-02-27T19:48:45Z", "content": "(Reuters) - Pfizer Inc (PFE.N) on Thursday warned that the continued spread of the coronavirus globally could have an adverse impact on its financial results. \r\nThe drugmaker said the outbreak could have an impact on its business, including its manufacturing,… [+134 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Robert Schroeder", "title": "Capitol Report: South Carolina primary could ‘change the narrative’ for Biden ahead of Super Tuesday", "description": "Joe Biden on Tuesday night bluntly predicted he’ll win South Carolina’s Democratic presidential primary this weekend. He’ll need to, analysts say, if he’s going to be the leading moderate challenger to a surging Bernie Sanders.", "url": "https://www.marketwatch.com/story/south-carolina-primary-could-change-the-narrative-for-biden-ahead-of-super-tuesday-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HY382_biden0_ZG_20200114222928.jpg", "publishedAt": "2020-02-27T19:50:44Z", "content": "Joe Biden leads in South Carolina polls, and could re-define himself with a strong performance in Saturdays primary, analysts say.\r\nJoe Biden on Tuesday night bluntly predicted hell win South Carolinas Democratic presidential primary this weekend. Hell need t… [+3148 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jason Hall)", "title": "Oil Stocks are Getting Crushed Today as Crude Prices Plummet", "description": "A double-digit drop in crude prices over the past week continues, and investors are fleeing the oil and gas sector.", "url": "https://www.fool.com/investing/2020/02/27/oil-stocks-are-getting-crushed-today-as-crude-pric.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560343/oil-pumpjacks-sunset-1500.jpg", "publishedAt": "2020-02-27T19:56:00Z", "content": "What happened\r\nThe oil and gas industry sell-off intensified on Feb. 27, as fears over the global spread of coronavirus accelerated. Crude prices are down another 2% today, adding to a sell-off that's seen both Brent and West Texas futures fall 12% over the p… [+3153 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will Northern California schools close, cancel trips in response to Sacramento coronavirus case? - Sacramento Bee", "description": "Will Northern California schools close, cancel trips in response to Sacramento coronavirus case? Sacramento Bee Coronavirus: CDC didn't immediately test coronavirus case NBC News California monitoring 8,400 people for coronavirus | TheHill The Hill Message to…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiQWh0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9sb2NhbC9lZHVjYXRpb24vYXJ0aWNsZTI0MDY5NjI1MS5odG1s0gFBaHR0cHM6Ly9hbXAuc2FjYmVlLmNvbS9uZXdzL2xvY2FsL2VkdWNhdGlvbi9hcnRpY2xlMjQwNjk2MjUxLmh0bWw?oc=5", "urlToImage": null, "publishedAt": "2020-02-27T19:47:00Z", "content": null}, {"source": {"id": null, "name": "Qns.com"}, "author": "By Carlotta Mohamed", "title": "Queens lawmaker urges Cuomo to extend funding for businesses impacted by coronavirus scare - QNS.com", "description": "State Assemblyman Ron Kim is encouraging Gov. Andrew Cuomo and State Assembly Speaker Carl Heastie to extend emergency funding or creation of a separate fund that will provide relief grants for small businesses impacted by the novel coronavirus or (COVID-19).…", "url": "https://qns.com/story/2020/02/27/queens-lawmaker-urges-cuomo-to-extend-funding-for-businesses-impacted-by-coronavirus-scare/", "urlToImage": "https://qns.com/wp-content/uploads/2020/02/unnamed-3-1024x745.jpg", "publishedAt": "2020-02-27T19:30:00Z", "content": "State Assemblyman Ron Kim is encouraging Gov. Andrew Cuomo and State Assembly Speaker Carl Heastie to extend emergency funding or creation of a separate fund that will provide relief grants for small businesses impacted by the novel coronavirus or (COVID-19).… [+3563 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Melody Hahm", "title": "Coronavirus-canceled events: A rolling list of scrapped plans amid the outbreak", "description": "Here's a rolling list of events that are being canceled around the world in light of the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/coronavirus-cancelled-events-around-the-world-194840035.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T19:48:40Z", "content": "As coronavirus concerns spread across the world, which the Centers for Disease Control and Prevention calls an emerging, rapidly evolving situation, businesses are scrambling to take precautions to curb the spread of the disease. Heres an up-to-date list of e… [+2861 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "Jay Bonggolto", "title": "Microsoft, Unity pull out of GDC 2020 over coronavirus concerns", "description": "Microsoft and Unity have announced in separate blog posts that they will no longer be attending this year's Game Developers Conference in San Francisco over concerns related to the novel coronavirus. Read more...", "url": "https://www.neowin.net/news/microsoft-unity-pull-out-of-gdc-2020-over-coronavirus-concerns/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2015/03/1_img_0359_story.jpg", "publishedAt": "2020-02-27T19:16:01Z", "content": "After major tech firms pulled out of Mobile World Congress 2020 (now officially canceled) earlier this month due to coronavirus concerns, major game developers have also now canceled their attendance at the upcoming Game Developers Conference (GDC) 2020, set … [+1228 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "João Carrasqueira", "title": "Facebook's F8 developer event has been cancelled because of coronavirus", "description": "Facebook has announced that, in light of the development of the Covid-19 outbreak, it won't be hosting its annual developer event, which would have taken place at the beginning of March. Read more...", "url": "https://www.neowin.net/news/facebooks-f8-developer-event-has-been-cancelled-because-of-coronavirus/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2019/03/1551843930_facebook_stock_photo_story.jpg", "publishedAt": "2020-02-27T20:00:01Z", "content": "The Covid-19 outbreak continues to put a hamper on many businesses and events. Hot on the heels of the cancellation of Microsoft's presence at this year's GDC, Facebook has announced that it's cancelling the in-person component of the F8 developer conference … [+1318 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Northern Ireland diagnoses first coronavirus case", "description": "Authorities diagnose the country's first case of coronavirus, taking the UK's total number to 16.", "url": "https://www.bbc.co.uk/news/uk-51667483", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0236/production/_111066500_chinaresearch_epa.jpg.jpg", "publishedAt": "2020-02-27T19:19:51Z", "content": "Image copyrightEPA\r\nNorthern Ireland has diagnosed its first case of coronavirus, bringing the UK's total to 16.\r\nChief medical officer Dr Michael McBride said the patient had come from northern Italy via Dublin.\r\nDr McBride said the case had showed a presump… [+648 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Olga Cotaga", "title": "Blowout fear for forex markets as coronavirus stirs dormant volatility trades", "description": "With this week's coronavirus-driven rout having shaken awake previously slumbering euro-dollar markets, the spotlight is back on the \"short volatility\" trades that some regulators fear could trigger a blowup on world markets.", "url": "https://www.reuters.com/article/us-global-forex-volatility-analysis-idUSKCN20L2SN", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496110333&w=1200&r=LYNXNPEG1Q1QV", "publishedAt": "2020-02-27T20:00:16Z", "content": "LONDON (Reuters) - With this week’s coronavirus-driven rout having shaken awake previously slumbering euro-dollar markets, the spotlight is back on the “short volatility” trades that some regulators fear could trigger a blowup on world markets. \r\nThe world’s … [+5471 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "David Pierini", "title": "Apple CEO Cook ‘optimistic’ China getting handle on coronavirus", "description": "Apple CEO Tim Cook said he is “optimistic” that China is starting to contain the coronavirus outbreak. Cook also said device production stalled by quarantines and travels restrictions are now in “ramp mode.” Cook’s comments came during an interview Wednesday …", "url": "https://www.cultofmac.com/687899/apple-ceo-cook-optimistic-china-getting-handle-on-coronavirus/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2020/02/cookviafoxbiz.jpg", "publishedAt": "2020-02-27T19:24:03Z", "content": "Apple CEO Tim Cook said he is optimistic that China is starting to contain the coronavirus outbreak.\r\nCook also said device production stalled by quarantines and travels restrictions are now in ramp mode.\r\nCooks comments came during an interview Wednesday wit… [+974 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Audrey Conklin", "title": "Apple CEO Tim Cook: China getting coronavirus under control - Fox Business", "description": "Apple CEO Tim Cook told FOX Business' Susa Li Thursday that he is \"optimistic\" about China managing the coronavirus outbreak, which has slowed production at the tech giant's suppliers.", "url": "https://www.foxbusiness.com/technology/apple-tim-cook-china-coronavirus", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/11/0/0/Tim-Cook-Reuters.jpg?ve=1&tl=1", "publishedAt": "2020-02-27T19:17:37Z", "content": "Programming note: Tune in to Fox Business Network Friday at noon and 3 p.m. ET to watch Susan Li's exclusive interview with Tim Cook.\r\nApple CEO Tim Cook told FOX Business' Susan Li Thursday that he is \"optimistic\" about China managing the coronavirus outbrea… [+4041 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "California monitoring over 8K people for Covid-19: Newsom", "description": "Salt Financial President Alfred Eskander and Federated Hermes Client Portfolio Manager Jordan Stuart joins Yahoo Finance’s Seana Smith to discuss the market action amid coronavirus fear on The Ticker.", "url": "https://finance.yahoo.com/video/california-monitoring-over-8k-people-193343859.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/U.VP5LQG5hp5eDFtomfZPw--~B/aD0yMjQ3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/27/5e58199d2d85403b50d4b258/5e58199d2d85403b50d4b259_o_U_v2.jpg", "publishedAt": "2020-02-27T19:33:43Z", "content": "Salt Financial President Alfred Eskander and Federated Hermes Client Portfolio Manager Jordan Stuart joins Yahoo Finances Seana Smith to discuss the market action amid coronavirus fear on The Ticker."}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Zachary Evans, Zachary Evans", "title": "California Monitoring 8,400 People for Coronavirus, 33 Have Tested Positive", "description": "California is monitoring 8,400 people who arrived on domestic commercial flights for the Wuhan coronavirus, Governor Gavin Newsom announced on Thursday.", "url": "https://www.nationalreview.com/news/california-monitoring-8400-people-for-coronavirus-33-have-tested-positive/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/08/gavin-newsome-california-democratic-party.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-02-27T19:54:57Z", "content": null}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Beth Stoneburner", "title": "Mike Pence is Handling the Spread of Coronavirus and That’s Terrifying", "description": "Someone who rejects science shouldn't be running damage control for a pandemic.", "url": "https://friendlyatheist.patheos.com/2020/02/27/mike-pence-is-handling-the-spread-of-coronavirus-and-thats-terrifying/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/02/PenceCoronavirus-768x431.png", "publishedAt": "2020-02-27T19:59:28Z", "content": "As the deadly strain of coronavirus continues to make appearances around the world, the United States is (supposedly) taking precautions to keep people safe. But Democrat presidential candidate Bernie Sanders is unimpressed with Vice President Mike Pence‘s ha… [+2975 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Jenni Lada", "title": "Microsoft GDC 2020 Plans Canceled Due to the Coronavirus", "description": "The coronavirus has waylaid the Microsoft GDC 2020 plans, and the company will hold online events March 16-18, 2020 instead. The post Microsoft GDC 2020 Plans Canceled Due to the Coronavirus appeared first on Siliconera.", "url": "https://www.siliconera.com/microsoft-gdc-2020-plans-canceled-due-to-the-coronavirus/", "urlToImage": "https://www.siliconera.com/wp-content/uploads/2020/02/microsoft-gdc-2020-coronavirus.jpg", "publishedAt": "2020-02-27T19:30:57Z", "content": "All of the Microsoft GDC 2020 plans have been changed. The company announced it will not be attending the events as expected. In its statement, it specifically cited the coronavirus as the reason for its decision to avoid participating.\r\nHere is the Microsoft… [+1760 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "A coronavirus patient and Diamond Princess cruise ship passenger being treated in a San Francisco hospital says he feels perfectly fine", "description": "A Diamond Princess cruise ship passenger who tested positive for the coronavirus disease is being treated at a San Francisco hospital. He said he feels perfectly fine and isn't experiencing any of the typical symptoms of the virus. He eats three meals a day, …", "url": "https://www.businessinsider.com/coronavirus-san-francisco-diamond-princess-cruise-ship-2020-2", "urlToImage": "https://i.insider.com/5e580e46fee23d1332509fb4?width=1200&format=jpeg", "publishedAt": "2020-02-27T19:21:10Z", "content": "An evacuee from the Diamond Princess cruise ship has tested positive for the coronavirus disease, known as COVID-19, and is being treated in a San Francisco hospital.\r\nBut the patient, 62-year-old Rick Wright, told the San Francisco Chronicle that he feels pe… [+1060 chars]"}, {"source": {"id": null, "name": "Pocket-lint.com"}, "author": "Maggie Tillman", "title": "Facebook cancels F8 2020 developer conference over coronavirus concerns", "description": "Facebook has canceled the in-person aspect of F8, its annual developer conference. The reason? The COVID-19 coronavirus, of course.F8 2020 was originally", "url": "https://www.pocket-lint.com/apps/news/facebook/151246-facebook-cancels-f8-developer-conference-over-coronavirus-concerns", "urlToImage": "https://cdn.pocket-lint.com/r/s/1200x630/assets/images/151246-news-f8-image1-k58rzqljow.png", "publishedAt": "2020-02-27T19:36:56Z", "content": "Facebook has canceled the in-person aspect of F8, its annual developer conference. The reason? The COVID-19 coronavirus, of course.\r\nF8 2020 was originally supposed to be a two-day event that kicks off 5 May. Normally, developers and media around the globe wi… [+1533 chars]"}, {"source": {"id": null, "name": "Facebook-tech-stocks-coronavirus"}, "author": "Jacob Sonenshine", "title": "Has Coronavirus Created Buying Opportunities in Facebook? - TheStreet", "description": "Facebook has almost no exposure to the negative economic impact and neither do these three tech stocks.", "url": "http://facebook-tech-stocks-coronavirus", "urlToImage": "https://www.thestreet.com/.image/t_share/MTcwNzY1NTgzODk2MjkwOTY3/facebook.jpg", "publishedAt": "2020-02-27T19:46:00Z", "content": "The U.S. market enter correction territory Thursday as the coronavirus outbreak continued to spook investors, causing not only exposed stocks to sell-off, but also impacted tech stocks that are largely unexposed to the economic impact. \r\nFacebook (FB) - Get R… [+1190 chars]"}, {"source": {"id": null, "name": "Wwd.com"}, "author": "Luisa Zargani", "title": "Italy Seeking Normality Coming to Terms With Coronavirus", "description": "The government is touting measures taken as the Italian virus strain has been isolated.", "url": "https://wwd.com/business-news/government-trade/italy-seeking-normality-coming-to-terms-with-coronavirus-1203513887/", "urlToImage": "https://pmcwwd.files.wordpress.com/2020/02/shutterstock_editorial_10565916b.jpg?w=640&h=415&crop=1", "publishedAt": "2020-02-27T20:09:02Z", "content": "MILAN — In the words of Italy’s Prime Minister Giuseppe Conte, “Let’s tone it down. Italy can’t be paralyzed.”\r\nItaly, and the city of Milan in particular, are working to return to some form of normality after the sudden coronavirus outbreak last week."}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (James Brumley)", "title": "Crocs' Quarter Proves Foam Clogs Are Cool Again", "description": "The company's hot-and-cold saga appears to be leveling off at a sustainable lukewarm.", "url": "https://www.fool.com/investing/2020/02/27/crocs-quarter-proves-foam-clogs-are-cool-again.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560354/crocs-foam-shoe-clog.jpg", "publishedAt": "2020-02-27T19:22:00Z", "content": "Crocs(NASDAQ:CROX), the maker of funky foam shoes that were all the rage in 2007, is back in a big way. Riding a wave of rekindled love for the ultra-comfortable footwear, the company has improved its fourth-quarter top line to the tune of 22%, reaching a rec… [+1323 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Andrew Hay and Hilary Russ", "title": "California monitoring 8,400 people for possible coronavirus", "description": "California has only 200 test kits, but has appealed for testing protocols to be expanded to include Americans who may catch the virus as it spreads through U.S. communities, Newsom told a news briefing in Sacramento, the state capital. Newsom said the U.S. Ce…", "url": "https://news.yahoo.com/california-monitoring-8-400-people-192247331.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/17MUtMIa4e2Ql5LOjVBT_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/oUe4aOOJIJszfTB5Rk3DBA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/b51f0e12a7b7631d348ab7095db5f895", "publishedAt": "2020-02-27T19:22:47Z", "content": "By Andrew Hay and Hilary Russ\r\n(Reuters) - California is monitoring more than 8,400 people who arrived on commercial flights for coronavirus symptoms from \"points of concern,\" but the state lacks test kits and has been held back by federal testing rules, Gove… [+3793 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Holly Secon)", "title": "People can get the coronavirus more than once, experts warn — recovering does not necessarily make you immune", "description": "People who have gotten the coronavirus before could still get it again. This happened to a tour guide in Japan.", "url": "https://news.yahoo.com/people-could-novel-coronavirus-more-001000781.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/FLp9Li3rIL_lHRJ4sIDc2Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/5jQ8J5Kiqlqgs26L0vTQ3A--~B/aD0xMzg3O3c9MTg0OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/f5ddb7657b317ab06612554674012315", "publishedAt": "2020-02-27T19:51:00Z", "content": "Nurses in protective gear talk to people in the reception area of the First People's Hospital in Yueyang, Hunan Province, China, January 28, 2020.\r\nReuters/Thomas Peter\r\nPeople who have gotten the new coronavirus and recovered can get it again in the future, … [+3168 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: House Foreign Affairs, CDC speak on COVID-19 response | LIVE - Global News", "description": "Coronavirus outbreak: House Foreign Affairs, CDC speak on COVID-19 response | LIVE Global News Why the WHO Won't Call the Coronavirus a Pandemic Bloomberg Not if but when: How the CDC is preparing for the spread of the coronavirus KOAA 5 Paso Robles woman awa…", "url": "https://www.youtube.com/watch?v=kX5bFqgD3Cs", "urlToImage": null, "publishedAt": "2020-02-27T19:58:06Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "John Lee, CFA", "title": "Billionaire Eric Sprott Recently Shared His Secrets Of Success + His 3 Mining Stock Investments Benefiting From Coronavirus Spread And Gold's 7 Year Breakout", "description": "Mining Billionaire Eric Sprott Recently Shared His Secrets of Success in an Interview.Gold broke out of 7-year high of $1,600/oz on Tuesday as investors piled into bullion to mitigate risk of global coronavirus pandemic.Eric’s top 3 mining stocks could reap  …", "url": "https://seekingalpha.com/article/4327833-billionaire-eric-sprott-recently-shared-secrets-of-success-3-mining-stock-investments", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/2/23/25307363-15825180361060326.jpg", "publishedAt": "2020-02-27T19:37:11Z", "content": "A/P Photo\r\nFull Disclosure: I am a Chartered Financial Analyst, an independent money manager, and the chairman of Prophecy Development. The article represents my personal view. \r\nMining Billionaire Eric Sprotts Gem Quotes from a recent interview with Financia… [+7159 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Pfizer warns of hit to financial results on continued coronavirus outbreak", "description": "The outbreak could have an impact on the company's manufacturing, supply chain and clinical trial operations, Pfizer said under the risk factors section of a regulatory filing. The outbreak that began in Wuhan at the end of last year has killed over 2,700 in …", "url": "https://finance.yahoo.com/news/pfizer-warns-hit-financial-results-194845904.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T19:48:45Z", "content": "(Reuters) - Pfizer Inc &lt;PFE.N&gt; on Thursday warned that the continued spread of the coronavirus globally could have an adverse impact on its business and financial results.\r\nThe outbreak could have an impact on the company's manufacturing, supply chain a… [+1036 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "British region of Northern Ireland confirms first coronavirus case", "description": "Northern Ireland authorities on Thursday confirmed their first case of coronavirus, with the British region's chief medical officer Michael McBride telling journalists that the patient had traveled from Italy via Dublin.", "url": "https://www.reuters.com/article/us-china-health-britain-nireland-idUSKCN20L2UY", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T19:24:59Z", "content": "BELFAST (Reuters) - Northern Ireland authorities on Thursday confirmed their first case of coronavirus, with the British region’s chief medical officer Michael McBride telling journalists that the patient had traveled from Italy via Dublin. \r\nThe case is in a… [+204 chars]"}, {"source": {"id": null, "name": "Thestreet.com"}, "author": null, "title": "Here's when you should buy stocks again The Street - msnNOW", "description": "Here's when you should buy stocks again The Street msnNOW Dow Jones and S&P 500 Reach Correction Levels on Coronavirus Fears Bloomberg Markets and Finance JPMorgan says buy the dip, bank on Fed 'insurance' cuts CNBC S&P 500 racing to quickest correction since…", "url": "https://www.thestreet.com/investing/heres-when-you-should-buy-stocks-again", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA85FKU.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=1532&y=631", "publishedAt": "2020-02-27T19:50:00Z", "content": "Video by CNBCWell, the bull market was fun while it lasted. Or maybe it isn't over at all.\r\nLoad Error\r\nStocks are in free fall this week as investors are spooked by the coronavirus. \r\nThe S&amp;P 500 kicked off the week Monday by gapping down 2.4%, the worst… [+3645 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Facebook adds fuel to coronavirus panic by CANCELING 'in-person' part of developer conference", "description": "A developer conference hosted by Facebook is the latest victim of growing international alarm over the spread of coronavirus, with the tech giant calling off the ‘in-person’ part of the event a month before it is to take place. Read Full Article at RT.com", "url": "https://www.rt.com/usa/481852-facebook-cancels-part-f8-event-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e5811c085f54064e5492cca.JPG", "publishedAt": "2020-02-27T19:11:38Z", "content": "The F8 Facebook Developer Conference is scheduled to run on May 5 and 6 in San Jose, California.\r\n“This was a tough call to make,” Facebook’s director of developer platforms and programs Konstantinos Papamiltiadis said in a company blog post on Thursday. “But… [+981 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "ANDREW TAYLOR", "title": "Congress eyes billions in funding to fight coronavirus", "description": "Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill that's double or even triple the $2.5 billion plan requested by President Donald Trump just days ago. Both the Democratic-controlled House and GOP-…", "url": "https://news.yahoo.com/congress-eyes-billions-funding-fight-192855145.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1MJoH1xUtyQDdl0RdeGYZg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/kCSx7wvQ0Bu7YeO601fAUw--~B/aD0yNzM3O3c9NDEwNTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/5da873f3a3dace0a48921c025c39bc2c", "publishedAt": "2020-02-27T19:28:55Z", "content": "WASHINGTON (AP) Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill that's double or even triple the $2.5 billion plan requested by President Donald Trump just days ago.\r\nLawmakers and aides involved… [+3512 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Number of cases of coronavirus double in France, tally at 38", "description": "The number of confirmed cases of coronavirus in France has more than doubled in 24 hours, the French Health minister said on Thursday, with the tally now at 38 from 18 on Wednesday.", "url": "https://www.reuters.com/article/us-china-health-france-idUSKCN20L2VL", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496122967&w=1200&r=LYNXNPEG1Q1T0", "publishedAt": "2020-02-27T19:29:52Z", "content": "PARIS (Reuters) - The number of confirmed cases of coronavirus in France has more than doubled in 24 hours, the French Health minister said on Thursday, with the tally now at 38 from 18 on Wednesday. \r\nDuring a press conference, Olivier Veran said this “sharp… [+424 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "Fairfield-Suisun school district advised to prepare for potential coronavirus outbreak", "description": "After a Solano County resident tested positive for COVID-19, federal officials told the Fairfield-Suisun School Unified School District to prepare school sites for a potential outbreak of the pneumonia-like virus.", "url": "https://www.sfgate.com/bayarea/article/Fairfield-Suisun-school-district-coronavirus-CDC-15089649.php", "urlToImage": "https://s.hdnux.com/photos/01/10/66/50/19098169/8/rawImage.png", "publishedAt": "2020-02-27T19:25:23Z", "content": "<ul><li>The sign for the City of Fairfield on Texas Street in Fairfield, Calif. in Solano County.\r\nThe sign for the City of Fairfield on Texas Street in Fairfield, Calif. in Solano County.\r\n Photo: Google Maps\r\n</li></ul>\r\nThe sign for the City of Fairfield o… [+3643 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Siobhan Ball", "title": "CDC graphic warns most facial hair isn’t compatible with coronavirus protection measures", "description": "It might be time to shave. The post CDC graphic warns most facial hair isn’t compatible with coronavirus protection measures appeared first on The Daily Dot.", "url": "https://www.dailydot.com/unclick/cdc-infographic-facial-hair-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/02/Facial-hair-with-mask-CDC-guide-1024x512.jpg", "publishedAt": "2020-02-27T19:31:32Z", "content": "As the coronavirus spreads, it is coming to affect all sorts of things we never realized were of concern during a pandemic. Possibly the weirdest of these? Facial hair.\r\nThe CDC released an infographic explaining which facial hairstyles are compatible with th… [+3143 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "W. E. Messamore", "title": "Trump Is Setting up Mike Pence to Be The Fall Guy for the Coronavirus", "description": "Obviously Mike Pence won't really be in charge of the coronavirus response. He's just a figurehead so Trump has a fall guy if things get bad. Let's hope it never comes to that. The post Trump Is Setting up Mike Pence to Be The Fall Guy for the Coronavirus app…", "url": "https://www.ccn.com/trump-is-setting-up-mike-pence-to-be-the-fall-guy-for-coronavirus/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/Pence-Trump.jpg", "publishedAt": "2020-02-27T19:32:29Z", "content": "<ul><li>Government analysts were puzzled over Donald Trumps decision to place Vice President Mike Pence in charge of the coronavirus response on Wednesday.</li><li>While Pence has no medical expertise, he does have a history of mishandling a health crisis and… [+3690 chars]"}, {"source": {"id": null, "name": "Hellenicshippingnews.com"}, "author": "hellenicshippingnews.", "title": "Coronavirus will harm world economy: EU economy chief - Hellenic Shipping News Worldwide", "description": "Coronavirus will harm world economy: EU economy chief Hellenic Shipping News Worldwide 12 Myths About Coronavirus, According to the World Health Organization msnNOW Coronavirus updates LIVE: WHO warns of 'fatal mistake' amid outbreak The Age COVID-19: WHO dir…", "url": "https://www.hellenicshippingnews.com/coronavirus-will-harm-world-economy-eu-economy-chief/", "urlToImage": null, "publishedAt": "2020-02-27T20:00:21Z", "content": "The coronavirus epidemic is bound to dent global economic growth, the European Union’s Economy Commissioner Paolo Gentiloni said as the outbreak continued to spread to more countries, wiping trillions of dollars off world financial markets.\r\n“The only certain… [+1216 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sarah Lynch Baldwin", "title": "How deadly is coronavirus and what are the symptoms?", "description": "The CDC says COVID-19 symptoms can appear in as little as two days or as long as two weeks after initial exposure.", "url": "https://www.cbsnews.com/news/coronavirus-symptoms-mortality-rate/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/27/5ca3a351-43c4-43ea-a7ef-653a013271ed/thumbnail/1200x630/5aa4c5cd3d4418a5c215c0d2fde4e3cf/cbsn-fusion-fact-fiction-debunking-myths-about-coronavirus-thumbnail-450945-640x360.jpg", "publishedAt": "2020-02-27T19:28:45Z", "content": "The new coronavirus that originated in China and spread to dozens of countries around the world has prompted a warning from health officials for Americans to prepare for the possibility of a domestic outbreak. So far, there are only a handful of cases in the … [+5144 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Brendan Morrow", "title": "California monitors more than 8,000 people for coronavirus", "description": "More than 8,000 people are being monitored for the coronavirus in California, and 33 people have tested positive, the state's governor says.In a news conference on Thursday, Gov. Gavin Newsom (D) provided these new numbers, saying that at least 8,400 people a…", "url": "https://news.yahoo.com/california-monitors-more-8-000-194300426.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/K7A6V8wFueJDt7RrZj_Pog--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/VEs1xeqo.XtzUDjNBww_0g--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/33d9d4b637a247bb73e1cf16c44698e2", "publishedAt": "2020-02-27T19:43:00Z", "content": "More than 8,000 people are being monitored for the coronavirus in California, and 33 people have tested positive, the state's governor says.\r\nIn a news conference on Thursday, Gov. Gavin Newsom (D) provided these new numbers, saying that at least 8,400 people… [+1115 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Zachary Evans", "title": "California Monitoring 8,400 People for Coronavirus, 33 Have Tested Positive", "description": "California is monitoring 8,400 people who arrived in the state on domestic commercial flights for the Wuhan coronavirus, Governor Gavin Newsom announced on Thursday.33 individuals have already tested positive for the virus, five of whom have been moved out of…", "url": "https://news.yahoo.com/california-monitoring-8-400-people-195457311.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7zQW5HKrpdkm3RC0rrUEAA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuOTc5NDcyMTQwNzYyNQ--/https://s.yimg.com/uu/api/res/1.2/6_vIzY_teYqsYS.68ZK6ew--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/bf4f5a35824f0fdcee744d8874c136bb", "publishedAt": "2020-02-27T19:54:57Z", "content": "California is monitoring 8,400 people who arrived in the state on domestic commercial flights for the Wuhan coronavirus, Governor Gavin Newsom announced on Thursday.\r\n33 individuals have already tested positive for the virus, five of whom have been moved out … [+1249 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Brad Ryan And Sophie Scott", "title": "Doctors warn of holes in Government's coronavirus emergency plan", "description": "Special \"fever clinics\" could soon be established, retired doctors asked to return to work, and non-urgent surgeries cancelled as the Federal Government shifts into the next phase of its response to the coronavirus outbreak.", "url": "https://www.abc.net.au/news/2020-02-28/coronavirus-pandemic-emergency-plan-for-covid-19-outbreak/12006960", "urlToImage": "https://www.abc.net.au/news/image/12008852-16x9-700x394.jpg", "publishedAt": "2020-02-27T19:33:52Z", "content": "Posted \r\nFebruary 28, 2020 06:33:52\r\nSpecial \"fever clinics\" could soon be established, retired doctors asked to return to work, and non-urgent surgeries cancelled as the Federal Government shifts into the next phase of its response to the coronavirus outbrea… [+6820 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Agence France-Presse", "title": "Facebook nixes developers conference due to coronavirus", "description": "Facebook on Thursday canceled its annual F8 developers conference, the biggest annual event for the US tech giant, over fears about the possible spread of the novel coronavirus. The gathering in the Silicon Valley city of San Jose — which had been set for ear…", "url": "https://www.rawstory.com/2020/02/facebook-nixes-developers-conference-due-to-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2018/11/Facebook-Logo.jpg", "publishedAt": "2020-02-27T19:36:40Z", "content": "Facebook on Thursday canceled its annual F8 developers conference, the biggest annual event for the US tech giant, over fears about the possible spread of the novel coronavirus.\r\nThe gathering in the Silicon Valley city of San Jose — which had been set for ea… [+2138 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Coronavirus Statistics from Clearly Identified People on the Cruise Ship", "description": "There are currently at least 705 confirmed cases of coronavirus that stemmed from the Diamond Princess cruise ship. Four Diamond Princess passengers have died. There were 3700 passengers on the ship.... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2020/02/coronavirus-statistics-from-clearly-identified-people-on-the-cruise-ship.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2020/02/diamond-princess-death-virus.jpg", "publishedAt": "2020-02-27T19:23:57Z", "content": "There are currently at least 705 confirmed cases of coronavirus that stemmed from the Diamond Princess cruise ship.\r\nFour Diamond Princess passengers have died.\r\nThere were 3700 passengers on the ship. We know everyone who was on the ship and mostly know who … [+3109 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Fred Imbert", "title": "Here's what happened to the stock market on Thursday", "description": "Rising fears of a rapid coronavirus spread sent the major averages tumbling into correction territory.", "url": "https://www.cnbc.com/2020/02/27/what-happened-to-the-stock-market-thursday-stocks-sink-into-correction.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106237238-1573477205370rts2sbbh.jpg?v=1573477287", "publishedAt": "2020-02-27T20:09:23Z", "content": "Traders on the floor of the New York Stock Exchange.\r\nDow Jones Industrial Average drops 1,190 points\r\nThe Dow tumbled 1,190.9 points, or 4.42%, to 25,766.64 The S&amp;P 500 slid 4.42% to 2,978.76. The Nasdaq Composite dropped 4.61% to close at 8,566.48. Risi… [+1105 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Marlo Safi", "title": "California Governor Gavin Newsom Says State Is Monitoring 8,400 Coronavirus Cases", "description": "Democratic California Governor Gavin Newsom said Thursday the state is monitoring at least 8,400 people for Coronavirus, CNBC reported.", "url": "https://dailycaller.com/2020/02/27/california-monitoring-8400-cases-coronavirus/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/biohazard-e1581373764148.jpg", "publishedAt": "2020-02-27T19:45:26Z", "content": "Democratic California Governor Gavin Newsom said Thursday the state is monitoring at least 8,400 people for Coronavirus, CNBC reported.\r\n“This is a fluid situation right now and I want to emphasize the risk to the American public remains low,” said Dr. Sonia … [+1480 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "‘Defund racist border wall!’ Warren’s ‘solution’ to coronavirus crisis causes mass eye-rolling on Twitter", "description": "Senator Elizabeth Warren announced a bill that would use funding for President Donald Trump’s “racist border wall” to combat the coronavirus outbreak – a plan that is earning plenty of eye rolls on social media. Read Full Article at RT.com", "url": "https://www.rt.com/usa/481846-warren-coronavirus-border-wall/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e580abd2030271812075e6e.JPG", "publishedAt": "2020-02-27T19:15:44Z", "content": "Warren is not letting the coronavirus crisis go to waste. The Massachusetts senator tweeted on Thursday a bill that would move funding from construction of the southern border wall in the US to the Department of Health and Human Services and US Aid to fight t… [+2651 chars]"}, {"source": {"id": null, "name": "Acs.org"}, "author": "nobody@acs.org(\"Ryan Cross\"), Ryan Cross", "title": "Gilead and Moderna lead on coronavirus treatments", "description": "Gilead has a head start on an antiviral, while Moderna is pursuing a novel mRNA vaccine", "url": "https://cen.acs.org/pharmaceuticals/vaccines/Gilead-Moderna-lead-coronavirus-treatments/98/web/2020/02?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+cen_latestnews+%28Chemical+%26+Engineering+News%3A+Latest+News%29", "urlToImage": "https://acs-h.assetsadobe.com/is/image//content/dam/cen/98/web/2/WEB/20200227lnp5-moderna.jpg/?$responsive$&wid=700&qlt=90,0&resMode=sharp2", "publishedAt": "2020-02-27T20:11:21Z", "content": "Since the new coronavirus was first identified in Wuhan, China, on Jan. 7, companies and academic groups around the world have been working at breakneck pace to develop new therapies for the virus, now called SARS-CoV-2. This week, two US biotech firms, Moder… [+6235 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "bwinck@businessinsider.com (Ben Winck)", "title": "Microsoft saw $62 billion of market value erased after it said coronavirus will hit profits this year. Here are 6 other companies that have issued similar warnings — and how much they've lost", "description": "United Airlines and Royal Caribbean slashed revenue expectations on canceled travel routes, while Apple cited slowed iPhone production for its cut.", "url": "https://news.yahoo.com/microsoft-saw-62-billion-market-195523467.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/S6miIa0lv5nBczj6Qaqh5g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/wpQwCrWzrbT9aI.rFVq4oQ--~B/aD0zODQwO3c9NTEyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/350e42a55917bf65bd550e816bcae515", "publishedAt": "2020-02-27T19:55:23Z", "content": "FILE - In this Feb. 24, 2020, file photo trader Michael Milano works on the floor of the New York Stock Exchange. The U.S. stock market opens at 9:30 a.m. EST on Thursday, Feb. 27. (AP Photo/Richard Drew, File)\r\nAssociated Press\r\n<ul><li>Several companies hav… [+6715 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Denise Whitaker, KOMO News reporter", "title": "Superintendent explains closing Bothell High School amid coronavirus fear - KOMO News", "description": "Bothell, Wash. -- There was a deep cleaning going on at Bothell High School on Thursday, hours after the superintendent cancelled all classes because of fears linked to coronavirus. Dr. Michelle Reid, superintendent at the Northshore School District, says the…", "url": "http://komonews.com/news/local/superintendent-explains-closing-bothell-hs-amid-coronavirus-fear", "urlToImage": "http://static-35.sinclairstoryline.com/resources/media/b2d63107-c016-4918-8350-01d109c8f8a2-large16x9_botheldrreid.jpg?1582831331392", "publishedAt": "2020-02-27T20:00:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Delhi Confidential: Filling In", "description": "As the packed auditorium kept waiting, the organisers tried to fill in the gap with a speech by former Union minister and former Uttar Pradesh Governor Ram Naik.", "url": "https://indianexpress.com/article/delhi-confidential/home-minister-amit-shah-v-d-savarkar-event-ram-naik-nitin-gadkari-6290260/", "urlToImage": "https://images.indianexpress.com/2020/02/ram-naik.jpg?w=759", "publishedAt": "2020-02-27T19:30:28Z", "content": "Former Uttar Pradesh Governor Ram Naik.Home Minister Amit Shah was supposed to be the chief guest at an event on V D Savarkar on Thursday but cancelled his scheduled visit at the last minute due to an urgent meeting at North Block. As the packed auditorium ke… [+1813 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "Nirmala Sitharaman on growth: Lot of efforts by govt, RBI … mood is changing", "description": "She conceded that some indicators may have weakened in recent months after showing signs of an uptick but added that they, too, will revive soon.", "url": "https://indianexpress.com/article/business/banking-and-finance/fm-nirmala-sitharaman-lot-of-efforts-by-govt-rbi-mood-is-gradually-changing/", "urlToImage": "https://images.indianexpress.com/2020/02/nirmala-sitharaman-8.jpg?w=759", "publishedAt": "2020-02-27T19:30:30Z", "content": "Finance Minister Nirmala Sitharaman at a press conference in Guwahati, Thursday. (PTI)A day after prodding state-run banks to shun unreasonable risk aversion and boost lending, Finance Minister Nirmala Sitharaman Thursday insisted that green shoots of a recov… [+2268 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Gareth Hutchens", "title": "Coronavirus isn't the only contributor to Australia's weakening dollar", "description": "Australia's dollar fell to an 11-year low this week, hitting 65.43 US cents. While global fears about the coronavirus spreading outside China are contributing to its decline, they're not the only reason, writes Gareth Hutchens.", "url": "https://www.abc.net.au/news/2020-02-28/why-did-australian-dollar-dip-to-11-year-low/12008616", "urlToImage": "https://www.abc.net.au/news/image/2829160-16x9-700x394.jpg", "publishedAt": "2020-02-27T19:13:06Z", "content": "Posted \r\nFebruary 28, 2020 06:13:06\r\nAustralia's dollar fell to an 11-year low this week, hitting 65.43 US cents on Thursday.\r\nGlobal fears about the coronavirus spreading outside China have contributed to its decline, but they're not the only reason.\r\nWhat's… [+5263 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Michael McHugh", "title": "MCHUGH: Democrats’ Tone Deafness At The South Carolina Debate", "description": "As the coronavirus spreads and economic disruptions become more likely, the Democrats still focus on taxing the wealthy and slowing economic growth.", "url": "https://dailycaller.com/2020/02/27/mchugh-democrats-tone-deafness-at-the-south-carolina-debate/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/GettyImages-1208701111-e1582830631384.jpg", "publishedAt": "2020-02-27T19:47:02Z", "content": "There is a common saying, “don’t catch a falling knife.” Well, it appears Democrats in Tuesday night’s presidential primary debate did just that politically speaking. Despite the fact that 61% of Americans say they are better off than three years ago, the deb… [+4667 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Associated Press", "title": "Dominican Republic turns back cruise ship amid virus fears", "description": "The Dominican Republic turned back a cruise ship carrying 1,500 people on Thursday because eight of those aboard showed potential symptoms of coronavirus.", "url": "https://www.bostonglobe.com/2020/02/27/world/dominican-republic-turns-back-cruise-ship-amid-virus-fears/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/jeoEflR0NTPXJmDGBMp5EBTSuLk=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/JMG4EBZLTNC2ND32OMCDD4B5RI.jpg", "publishedAt": "2020-02-27T19:42:51Z", "content": "SANTO DOMINGO, Dominican Republic (AP) The Dominican Republic turned back a cruise ship carrying 1,500 people on Thursday because eight of those aboard showed potential symptoms of the Covid-19 virus, officials announced.\r\nA joint statement by the Public Heal… [+2614 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "ANDREW TAYLOR", "title": "Congress eyes billions in funding to fight coronavirus", "description": "WASHINGTON (AP) — Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill that’s double or even triple the $2.5 billion plan requested by President Donald Trump just days ago. Lawmakers and aides involve…", "url": "https://www.seattletimes.com/nation-world/nation-politics/congress-eyes-billions-in-funding-to-fight-coronavirus/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/urn-publicid-ap-org-c3b49aaa207f10607f4affcc821d42d4Senate_Democrats_64119-1200x630.jpg", "publishedAt": "2020-02-27T19:28:57Z", "content": "WASHINGTON (AP) Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill that’s double or even triple the $2.5 billion plan requested by President Donald Trump just days ago.\r\nLawmakers and aides involved… [+2280 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Coronavirus updates: Hamburg confirms first case as US, European markets tumble", "description": "More countries across Europe have confirmed cases of COVID-19, but EU countries said borders will remain open. Hamburg confirmed its first case — a hospital staffer in the pediatric ward. All the latest updates here.", "url": "https://www.dw.com/en/coronavirus-updates-hamburg-confirms-first-case-as-us-european-markets-tumble/a-52549401", "urlToImage": "https://www.dw.com/image/52544587_304.jpg", "publishedAt": "2020-02-27T19:39:00Z", "content": "<ul><li>At least 82,500 people have now been infected globally, with over 2,800 dead.</li><li>Infections have doubled in the last 24 hours in Germany and France</li><li>Germany's health minister says the country is facing a \"coronavirus epidemic,\" although EU… [+27036 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Pfizer warns of hit to financial results on continued coronavirus outbreak", "description": "The outbreak could have an impact on the company's manufacturing, supply chain and clinical trial operations, Pfizer said under the risk factors section of a regulatory filing. The outbreak that began in Wuhan at the end of last year has killed over 2,700 in …", "url": "https://finance.yahoo.com/news/pfizer-warns-hit-financial-results-194845690.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0DbmlI9nQJaKjbcXmeqpaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/EyZhZnqM_iZwJahT16Wr4A--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/8ce00909185da69acabcc519c0128d35", "publishedAt": "2020-02-27T19:48:45Z", "content": "(Reuters) - Pfizer Inc &lt;PFE.N&gt; on Thursday warned that the continued spread of the coronavirus globally could have an adverse impact on its business and financial results.\r\nThe outbreak could have an impact on the company's manufacturing, supply chain a… [+1036 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Guggenheim’s Scott Minerd Says Coronavirus May Be Worst Event in His Career", "description": "(Bloomberg) -- Scott Minerd, who oversees about $215 billion for Guggenheim Investments, said the coronavirus is “possibly the worst event of in my career” as a money manager because of its potential to spread globally and the fact that the Federal Reserve ha…", "url": "https://finance.yahoo.com/news/guggenheim-scott-minerd-says-coronavirus-193502465.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/T6aEPhWS6.eHG6JaUSv5Tw--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/d691844b5309faa35e04d96e693c374d", "publishedAt": "2020-02-27T19:55:52Z", "content": "(Bloomberg) -- Scott Minerd, who oversees about $215 billion for Guggenheim Investments, said the coronavirus is possibly the worst event of in my career as a money manager because of its potential to spread globally and the fact that the Federal Reserve has … [+1098 chars]"}, {"source": {"id": null, "name": "Thereporter.com"}, "author": "Lisa Krieger", "title": "Coronavirus: Infected Solano County patient wasn’t tested for 11 days - Vacaville Reporter", "description": "Coronavirus: Infected Solano County patient wasn’t tested for 11 days Vacaville Reporter California Woman with Coronavirus from Unknown Source Is In ‘Serious Condition’ PEOPLE Great Ideas California low on test kits and face masks in its battle against corona…", "url": "https://www.thereporter.com/coronavirus-want-a-test-to-see-if-you-have-it-youll-have-to-wait", "urlToImage": "https://www.thereporter.com/wp-content/uploads/2020/02/coronavirus-generic-graphic.png?w=720&h=405", "publishedAt": "2020-02-27T19:28:50Z", "content": "A Solano County woman now critically ill with coronavirus was hospitalized for 11 days before her infection was revealed to healthcare workers, raising the potential of broader community exposure to the dangerous respiratory disease.\r\nSuffering from flu-like … [+5557 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "ANDREW TAYLOR", "title": "Congress eyes billions in funding to fight coronavirus", "description": "Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill that’s double or even triple the $2.5 billion plan requested by President Trump just days ago.", "url": "https://www.bostonglobe.com/2020/02/27/nation/congress-eyes-billions-funding-fight-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/7adcG-4MfWFrr-dnaXvdan0C9IY=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/XZ3ZW62YOJE7TB4SUWRCDCZC6I.jpg", "publishedAt": "2020-02-27T19:47:52Z", "content": "WASHINGTON (AP) Capitol Hill negotiations on emergency spending to combat the coronavirus outbreak are likely to produce a bill thats double or even triple the $2.5 billion plan requested by President Trump just days ago.\r\nLawmakers and aides involved in the … [+2266 chars]"}, {"source": {"id": null, "name": "Chinalawblog.com"}, "author": "Dan Harris", "title": "Force Majeure in the Time of Coronavirus", "description": "Way back in the pre-coronavirus days — October 30-2019 — in Do Not Let Force Majeure be a Major Force In Your China Contract, we did a post warning of force majeure provisions in contracts with Chinese companies. That post began with the following warning/jok…", "url": "https://www.chinalawblog.com/2020/02/force-majeure-in-the-time-of-coronavirus.html", "urlToImage": "https://chinalawblog.lexblogplatform.com/wp-content/uploads/sites/110/2020/02/Force_Majeure1-656x454.jpg", "publishedAt": "2020-02-27T19:42:32Z", "content": "Force Majeure: The band\r\nWay back in the pre-coronavirus days — October 30-2019 — in Do Not Let Force Majeure be a Major Force In Your China Contract, we did a post warning of force majeure provisions in contracts with Chinese companies. That post began with … [+8111 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Great Quarter For Tankers Coincides With Stock-Market Rout", "description": "\"It has actually felt like a bit of a horror movie at times, to be honest,\" said Frontline (NYSE: FRO) CEO Robert Macleod during a conference call with analysts on Thursday.  Two of the largest publicly listed tanker owners have just reported results for the …", "url": "https://finance.yahoo.com/news/great-quarter-tankers-coincides-stock-194712261.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T19:47:12Z", "content": "Pity the public tanker owners. After years of suffering through terrible freight markets, they finally have a breakout quarter to boast about and just as they do so, the broader stock market is crashing around them on coronavirus fears.\r\n\"It has actually felt… [+4549 chars]"}, {"source": {"id": null, "name": "Golfdigest.com"}, "author": "Joel Beall", "title": "PGA of America \"monitoring situation\" of San Francisco, host of 2020 PGA Championship, after city declares state of emergency", "description": "Days after San Francisco's mayor declared a state of emergency over coronavirus concerns, the PGA of America—set to host its PGA Championship in the city in May—acknowledged the organization is keeping tabs on the matter.", "url": "https://www.golfdigest.com/story/pga-of-america-monitoring-situation-of-san-francisco-host-of-2020-pga-championship-after-city-declares-state-of-emergency", "urlToImage": "https://media.golfdigest.com/photos/5e5811c1c77e4f00096bfcda/master/pass/GettyImages-1139358049.jpg", "publishedAt": "2020-02-27T19:21:21Z", "content": "Days after San Francisco's mayor declared a state of emergency over coronavirus concerns, the PGA of Americaset to host its PGA Championship in the city in Mayacknowledged the organization is keeping tabs on the matter.\r\nWe are carefully monitoring the situat… [+1831 chars]"}]