[{"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "Your travel insurance might now cover coronavirus", "description": "Concerns about coronavirus are causing a lot of people to rethink their travel plans.", "url": "https://www.cnn.com/2020/03/10/success/travel-insurance-claims-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309114011-02-travel-coronavirus-airport-super-tease.jpg", "publishedAt": "2020-03-10T17:22:58Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "New York State Setting Up 1-Mile Coronavirus Containment Zone With National Guard", "description": "The state of New York is setting up a special coronavirus containment zone in the city of New Rochelle in Westchester County with the help of the National Guard, according to a press conference with state officials on Tuesday afternoon. Read more...", "url": "https://gizmodo.com/new-york-to-set-up-coronavirus-containment-zone-in-new-1842241803", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/n7dfkneeywbwa31hdfb1.png", "publishedAt": "2020-03-10T18:08:00Z", "content": "The state of New York is setting up a special coronavirus containment zone in the city of New Rochelle in Westchester County with the help of the National Guard, according to a press conference with state officials on Tuesday afternoon. \r\nWestchester, which c… [+3486 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Julia Naftulin), Julia Naftulin", "title": "What to do if you get the coronavirus, from transportation to ordering food", "description": "Crystal Cox/Business Insider As the number of coronavirus cases tops 100,000, more and more people are wondering how they should self-quarantine. According to the CDC, if you have to self-quarantine, stay away from your friends and family and stop sharing ute…", "url": "https://www.businessinsider.com/coronavirus-outbreak-what-to-do-test-positive-for-covid-19-2020-3", "urlToImage": "https://i.insider.com/5e66741ffee23d15582d9134?width=1200&format=jpeg", "publishedAt": "2020-03-10T17:49:00Z", "content": "As the coronavirus continues to spread, new cases are being confirmed daily.\r\nSo far, more than 111,000 people have been infected with the novel coronavirus and an estimated 3,900 have died, Business Insider previously reported.\r\nIn the United States, more th… [+1000 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Harrison Weber", "title": "Read this if you plan to use Airbnb during the coronavirus outbreak", "description": "Airbnb revealed a new policy for “times of uncertainty.” The coronavirus outbreak is absolutely pummeling the travel industry. To blunt the edges for travelers and hosts alike, Airbnb announced a new policy today for “times of uncertainty.” Read Full Story", "url": "https://www.fastcompany.com/90475724/read-this-if-you-plan-to-use-airbnb-during-the-coronavirus-outbreak", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-coronavirus-airbnb.jpg", "publishedAt": "2020-03-10T17:46:21Z", "content": "The coronavirus outbreak is absolutely pummeling the travel industry. To blunt the edges for travelers and hosts alike, Airbnb announced a new policy today for “times of uncertainty.”For would-be travelers wondering if they should book a stay (or cancel their… [+1197 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "San Francisco is spending $5 million to deep-clean homeless shelters and SROs as the coronavirus outbreak threatens the city's most vulnerable residents", "description": "San Francisco is spending $5 million to protect members of its homeless population amid a coronavirus outbreak in the city. The funding will be used to hire cleaning crews that will sanitize homeless shelters, supportive housing buildings, and SROs daily. San…", "url": "https://www.businessinsider.com/san-francisco-coronavirus-outbreak-homeless-population-2020-3", "urlToImage": "https://i.insider.com/5e67ce6b54f25c5530673b59?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:11:13Z", "content": "The city of San Francisco is funneling $5 million into protecting the 25,000 people living in the city's homeless shelters and in single-room occupancy (SRO) hotels amid a coronavirus outbreak in the city.\r\nSan Francisco Mayor London Breed announced Monday th… [+1679 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "US Pledges More Testing as Trump Hints at Aid For Workers", "description": "Warning that the number of coronavirus cases in the United States was expected to grow, the Trump administration on Monday evening said that testing for the virus would ramp up quickly in the coming weeks while declining to estimate how many Americans had alr…", "url": "https://science.slashdot.org/story/20/03/10/1652257/us-pledges-more-testing-as-trump-hints-at-aid-for-workers", "urlToImage": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now", "publishedAt": "2020-03-10T18:00:00Z", "content": "How about guaranteeing the wages (up to a certain amount) of anyone who, responsibly, stays home sick?\r\nUh oh, but there’s that dirty “S” word..."}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Morrell", "title": "A Barclays employee at the bank's New York City headquarters tested positive for coronavirus last week", "description": "A Barclays employee at its NYC headquarters tested positive for the coronavirus last week. The employee has been self-quarantined since March. The bank has conducted ongoing deep cleanings since learning of the case, and it has asked colleagues that worked wi…", "url": "https://www.businessinsider.com/barclays-employee-in-new-york-city-has-coronavirus-2020-3", "urlToImage": "https://i.insider.com/58d5933d112f7047028b6d8c?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:08:42Z", "content": "An employee at Barclays' New York City headquarters tested positive for the Covid-19 coronavirus and has been self-quarantined since last week, when the staffer learned they'd been potentially exposed to the virus. \r\nBarclays staff at its 745 7th Avenue offic… [+1390 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Alex Gold", "title": "Coronavirus and a Looming Recession: How to Raise Capital in Uncertain Times", "description": "Here's how to raise capital when things get challenging.", "url": "https://www.entrepreneur.com/article/346885", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20200309200312-GettyImages-495625568.jpeg", "publishedAt": "2020-03-10T18:00:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nFor the past decade, we have been in the midst of the biggest economic expansion in American history with unemployment at a historic low of 3.6%. \r\nNaturally, during periods of economic expansion… [+6835 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Cassandra Szklarski", "title": "Coronavirus: B.C. senior’s death raises questions about isolation risk at nursing homes - Global News", "description": "Coronavirus: B.C. senior’s death raises questions about isolation risk at nursing homes Global News Appointments needed to access Nova Scotia COVID-19 assessment sites CBC.ca COVID-19 death prompts new control measures for Canada's seniors' homes CP24 Toronto…", "url": "http://globalnews.ca/news/6655662/seniors-nursing-homes-coronvirus/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/22885557.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-10T17:37:04Z", "content": "Public health officials are urging people take extra infection control steps around older Canadians most at risk of developing COVID-19 complications, with the death of a Vancouver senior providing fresh imperative for vigilance in long-term care facilities.\r… [+4955 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Erin Schumaker", "title": "Coronavirus map: Tracking the spread in the US and around the world", "description": "The novel coronavirus outbreak began in China in late December, and has since sickened more than 110,000 people worldwide, including hundreds in the US.", "url": "https://abcnews.go.com/Health/coronavirus-map-tracking-spread-us-world/story?id=69415591", "urlToImage": "https://s.abcnews.com/images/Health/coronavirus-gty-jt-_hpMain_16x9_992.jpg", "publishedAt": "2020-03-10T17:21:57Z", "content": "By Tuesday, the novel coronavirus outbreak in the United States had grown to at least 760 cases, with clusters in New York, Washington state and California, according to Johns Hopkins University, which is tracking reports and confirming them with local health… [+2466 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shira Feder", "title": "Coins carry viruses better than paper money, experts say as China begins sterilizing cash", "description": "The novel coronavirus travels through respiratory droplets that are produced when an infected person coughs or sneezes. Some areas, like the hard surface of a coin or a credit card, serve as better homes for those droplets than others. The porous surface of a…", "url": "https://www.businessinsider.com/coronavirus-coins-carry-viruses-better-than-paper-money-experts-say-2020-3", "urlToImage": "https://i.insider.com/5e66a7aee4f9fe0e506181b4?width=1200&format=jpeg", "publishedAt": "2020-03-10T17:28:00Z", "content": "The new coronavirus spreads through respiratory droplets. That means when an infected person coughs, infected droplets can land on items people will later touch, spreading the infection further. But depending on temperature and humidity, some surfaces, like c… [+3483 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "John T Bennett", "title": "Coronavirus is a ‘gut punch’ to Trump’s re-election, GOP strategist admits", "description": "The coronavirus outbreak has placed Donald Trump at a crossroads in his presidency as he tries to push an economic stimulus measure through a divided Congress and calm public fears.The president began Monday as he has so many other days, lashing out a politic…", "url": "https://news.yahoo.com/coronavirus-trumps-top-election-message-171556926.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/fvjNxbtgjVSEsGmqhM.SaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03ODg-/https://s.yimg.com/uu/api/res/1.2/mKSuGpN.mesIaTV_f9ZjTw--~B/aD0zOTQ7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/6ac4f84fc6159cd1f3b23aa90f8e8da3", "publishedAt": "2020-03-10T17:15:00Z", "content": "Trump speaking at the Coronavirus Task Force press conference: Barcroft Media via Getty Images\r\nThe coronavirus outbreak has placed Donald Trump at a crossroads in his presidency as he tries to push an economic stimulus measure through a divided Congress and … [+5914 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Marina Villeneuve / AP", "title": "NY Governor Announces ‘Containment Area’ in Suburb Home to Biggest Cluster of U.S. Coronavirus Cases", "description": "Schools, houses of worship and large gathering places will be shuttered for two weeks in a “containment area” centered in New Rochelle, NY.", "url": "https://time.com/5800346/new-rochelle-ny-containment-area-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/new-rochelle-ny-containment-area-coronavirus.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-10T18:06:24Z", "content": "(ALBANY, N.Y.) — Schools, houses of worship and large gathering places will be shuttered for two weeks in a “containment area” centered in suburban New Rochelle, the heart of what appears to be the nation’s biggest cluster of cases of the coronavirus, Gov. An… [+1753 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Postmates reveals plans to cover medical costs for couriers as part of COVID-19 response", "description": "Postmates said that it will be creating a fund to cover the costs for doctor appointments and medical expenses related to the COVID-19 outbreak for its delivery fleet and for merchants, Postmates will waive commission fees for stores in impacted markets. The …", "url": "http://techcrunch.com/2020/03/10/postmates-reveals-plans-to-cover-medical-costs-for-couriers-as-part-of-covid-19-response/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/GettyImages-860314240.jpg?w=600", "publishedAt": "2020-03-10T17:36:52Z", "content": "Postmates said that it will be creating a fund to cover the costs for doctor appointments and medical expenses related to the COVID-19 outbreak for its delivery fleet and for merchants, Postmates will waive commission fees for stores in impacted markets.\r\nThe… [+2646 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Aaron Gordon, Jason Koelber", "title": "Coronavirus May Have a Lasting Impact on Public Transit Funding", "description": "Ridership is likely going to plummet, which will make it harder on local transit agencies", "url": "https://www.vice.com/en_us/article/939gx5/coronavirus-public-transit-ridership-numbers-plummet-funding", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e67cd83b92b2c04c9e82dff/lede/1583861368417-GettyImages-1206288208.jpeg?crop=1xw:0.8432xh;0xw,0.0405xh&resize=1200:*", "publishedAt": "2020-03-10T17:33:22Z", "content": "Coronavirus is beginning to upend American life. The stock market is crashing, universities are cancelling classes or moving them online, conferences are being canceled, and airlines are struggling. Unsurprisingly, public transportation is also going to be gr… [+4557 chars]"}, {"source": {"id": null, "name": "Dezeen.com"}, "author": "Marcus Fairs", "title": "Designers \"preparing for a worsening situation and supply problems\" due to coronavirus", "description": "Designers are preparing for significant disruption to their businesses and supply chains as coronavirus spreads around the world. Industry sectors including lighting, fashion, sportswear and automotive have been hit by the shutdown of factories in China, with…", "url": "http://www.dezeen.com/2020/03/10/designers-preparing-for-a-worsening-situation-and-supply-problems-due-to-coronavirus/", "urlToImage": "https://static.dezeen.com/uploads/2020/03/china-coronavirus-supply-chains_dezeen_2364_hero_1-1024x576.jpg", "publishedAt": "2020-03-10T17:27:49Z", "content": "Designers are preparing for significant disruption to their businesses and supply chains as coronavirus spreads around the world.\r\nIndustry sectors including lighting, fashion, sportswear and automotive have been hit by the shutdown of factories in China, wit… [+6170 chars]"}, {"source": {"id": null, "name": "Kitchenertoday.com"}, "author": "KitchenerToday Staff", "title": "True North Festival cancelled due to concerns about COVID-19 - KitchenerToday.com", "description": "True North Festival cancelled due to concerns about COVID-19 KitchenerToday.com View Full coverage on Google News", "url": "https://www.kitchenertoday.com/local-news/true-north-festival-cancelled-due-to-concerns-about-covid-19-2152218", "urlToImage": "https://www.vmcdn.ca/f/files/kitchenertoday/images/events/true-north-logo-(new).png;w=830;h=1101;mode=crop", "publishedAt": "2020-03-10T17:45:00Z", "content": "Movers and shakers in the tech industry will not be coming to Waterloo Region for the True North Festival.\r\nIn light of the COVID-19 outbreak, Communitech has decided to cancel the annual event for 2020.\r\n\"The health and safety of our visitors, members, staff… [+568 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Joey D'Urso, Hannah Al-Othman", "title": "This Is How UK Media Organisations Are Getting Ready For Coronavirus", "description": "\"From the end of Friday this week, all domestic and international business travel will be halted,\" staff at the Sun, the Times and the Sunday Times have been told. View Entire Post ›", "url": "https://www.buzzfeed.com/joeydurso/coronavirus-how-uk-media-organisations-preparing", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/10/17/enhanced/cd960939ff51/original-4646-1583860466-2.jpg?crop=1244:651;0,89", "publishedAt": "2020-03-10T17:50:41Z", "content": "UK newsrooms are taking radical steps to combat the spread of coronavirus, such as banning business travel and requiring external visitors to declare themselves fit, according to internal emails at several media organisations seen by BuzzFeed News.\r\nThe Times… [+3244 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Mack Lamoureux, Josh Visser", "title": "Coronavirus Will Make This a Very Hard Year for Sports Fans", "description": "Teams are playing in front of empty stadiums in Europe. What does that mean for the NBA, MLB, NHL, and other major sports leagues and events?", "url": "https://www.vice.com/en_us/article/wxe7m4/coronavirus-will-make-this-a-very-hard-year-for-nba-nhl-nfl-mlb-soccer-sports-fans", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e67b5ee9f5ab505d55751fc/lede/1583855087759-22888453.jpeg?crop=0.9513888888888888xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-03-10T17:57:43Z", "content": "This article originally appeared on VICE Canada.\r\nOn Sunday, soccer superstar Christian Ronaldo lost control of a cross at the top of the six-yard box that teammate Aaron Ramsey picked up and swiftly buried into the goal, sealing Juventus' victory 2-0 over In… [+8846 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Karl Bode, Emanuel Maiberg", "title": "The Coronavirus Will Shine a Bright Light On Crappy US Broadband", "description": "Much like the US healthcare system, US telecom infrastructure isn’t ready for what’s coming.", "url": "https://www.vice.com/en_us/article/k7exma/the-coronavirus-will-shine-a-bright-light-on-crappy-us-broadband", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e67ceee13259600b75a0ecf/lede/1583862137071-555.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*", "publishedAt": "2020-03-10T17:49:50Z", "content": "In the weeks and months to come, a growing number of US citizens are going to be forced to work from home in a bid to slow the spread of the novel coronavirus. In the process theyre going to run face-first into a US broadband market that has consistently fail… [+4365 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Anne Gaviola, Manisha Krishan, Sarah Berman, Natasha Grzincic", "title": "Should I Book a Cheap Flight? And More Coronavirus Money Questions Answered", "description": "What the COVID-19 outbreak means if you’re flying, thinking of booking a vacation, investing in stocks, or buying a home.", "url": "https://www.vice.com/en_us/article/akwy9g/should-i-book-a-cheap-flight-and-more-coronavirus-money-questions-answered", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e66b39ee701f90188e61036/lede/1583857138384-Should-I-cancel-my-trip-and-other-coronavirus-questions-answerred.jpeg?crop=0.9977xw:0.3736xh;0.0023xw,0.224xh&resize=1200:*", "publishedAt": "2020-03-10T17:36:04Z", "content": "This article originally appeared on VICE Canada.\r\nPanic about the spread of coronavirus (COVID-19) and what it will do to the economy caused stock markets in North America to crash Monday. The TSX, Canadas main stock market, lost more than 10 percent in its w… [+7366 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Google Maps can tell you which businesses are impacted by coronavirus - CNET", "description": "Businesses can provide customers with updates through their Google My Business profiles.", "url": "https://www.cnet.com/news/google-maps-can-tell-you-which-businesses-are-impacted-by-coronavirus/", "urlToImage": "https://cnet2.cbsistatic.com/img/bF3-_bB53JH0tQC-75B9FueeqkQ=/756x567/2019/12/24/320f96fc-4d12-43e1-9419-becbe2e611c0/google-maps-logo-4443.jpg", "publishedAt": "2020-03-10T17:57:00Z", "content": "Angela Lang/CNET\r\nIn the midst of the outbreak of COVID-19 -- the new coronavirus that originated in China and has claimed more than 4,000 lives in the past three months -- Google Maps is providing businesses with a way to keep customers updated on any change… [+682 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "'People are paranoid' - Life on lockdown in Italy", "description": "Confusion and anxiety for Italy's residents as restrictions to combat virus spread take effect.", "url": "https://www.bbc.co.uk/news/world-europe-51818718", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/155CD/production/_111210578_fd92acf9-08d0-4024-a8b1-ba45a0cf0633.jpg", "publishedAt": "2020-03-10T17:28:01Z", "content": "Image copyrightAFPImage caption\r\n Vendors have still been out on the streets in Naples\r\nThere is anxiety and confusion on the ground as Italy implements its most restrictive measures since World War Two in its battle against the coronavirus.\r\nPrime Minister G… [+4586 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Britt Hayes on News, shared by Britt Hayes to The A.V. Club", "title": "SXSW and Ultra Music Festival will not issue refunds to attendees following cancellations", "description": "As concerns over the coronavirus continue to mount, the recent (and unprecedented) cancellations of two major festivals have given way to another potential problem: Neither SXSW nor Ultra Music Festival will issue refunds to ticket and badge-holders, though C…", "url": "https://news.avclub.com/sxsw-and-ultra-music-festival-will-not-issue-refunds-to-1842243114", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jnlqafca9vkivipwzfs7.jpg", "publishedAt": "2020-03-10T17:39:00Z", "content": "As concerns over the coronavirus continue to mount, the recent (and unprecedented) cancellations of two major festivals have given way to another potential problem: Neither SXSW nor Ultra Music Festival will issue refunds to ticket and badge-holders, though C… [+2974 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Matthew Strauss", "title": "Hole’s Courtney Love and Melissa Auf der Maur Reunion Show Postponed Due to Coronavirus Concerns", "description": "The Feminist Institute and Planned Parenthood’s benefit concert was scheduled to take place this weekend", "url": "https://pitchfork.com/news/hole-courtney-love-and-melissa-auf-der-maur-reunion-show-postponed-due-to-coronavirus-concerns/", "urlToImage": "https://media.pitchfork.com/photos/5e67c9595efdff0008ac7525/2:1/w_790/Hole.jpg", "publishedAt": "2020-03-10T17:35:54Z", "content": "The Feminist Institute and Planned Parenthood of Greater New York have postponed the benefit concert that was set to feature a reunion of Holes Courtney Love and Melissa Auf der Maur. The concert, called Bans Off My Body, was set to take place this Saturday, … [+657 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Engineer Who Attended Cybersecurity Event Contracts Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/engineer-who-attended-cybersecurity-event-contracts-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T18:04:41Z", "content": null}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Andrew Paul on News, shared by Andrew Paul to The A.V. Club", "title": "People are swiping right on Tinder to get coronavirus news from Wuhan", "description": "Perhaps not shockingly, dealing with a pandemic that originated in an authoritarian country with a robust misinformation infrastructure can be a serious pain in the ass. That said, we’re beginning to wonder if we should just stick with whatever the hell they’…", "url": "https://news.avclub.com/people-are-swiping-right-on-tinder-to-get-coronavirus-n-1842242007", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/rxuqrybwo34egv9bc2hj.jpg", "publishedAt": "2020-03-10T17:24:00Z", "content": "Perhaps not shockingly, dealing with a pandemic that originated in an authoritarian country with a robust misinformation infrastructure can be a serious pain in the ass. That said, were beginning to wonder if we should just stick with whatever the hell theyre… [+1377 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "James Rettig", "title": "SXSW And Ultra Are Not Offering Refunds After Coronavirus Cancellations", "description": "Austin's SXSW and Miami's Ultra Music Festival are among the events that have been cancelled due to the concerns over the spread of coronavirus. It appears that neither festival will be offering refunds for those that have already purchased badges.  In an ema…", "url": "https://www.stereogum.com/2076338/sxsw-ultra-music-festival-refunds-coronavirus/news/", "urlToImage": "https://static.stereogum.com/uploads/2020/03/sxsw-refunds-1583860524-608x406.jpg", "publishedAt": "2020-03-10T17:17:28Z", "content": "Austin’s SXSW and Miami’s Ultra Music Festival are among the events that have been cancelled due to the concerns over the spread of coronavirus. It appears that neither festival will be offering refunds for those that have already purchased badges. \r\nIn an em… [+1157 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Hasit Shah", "title": "The world’s richest university is shutting down because of coronavirus", "description": "A major challenge is what to do with vulnerable students - some from low-income backgrounds, others from overseas - who may not be able to leave campus easily.", "url": "https://qz.com/1815829/harvard-university-is-shutting-down-because-of-coronavirus/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/09/JohnHarvardStatue.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-10T18:07:47Z", "content": "Harvard University, the oldest, wealthiest and most famous institution of higher education in the United States, has told students to leave campus, and is moving to online education for the foreseeable future. The university had already cancelled all events a… [+2514 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "COVID-19: door-to-door survey to begin in State today", "description": "The State government will conduct a two-day door-to-door survey starting Wednesday to identify the persons who had recently been to novel coronavirus (COVID-19) affected countries.The ground level sur", "url": "https://www.thehindu.com/news/national/andhra-pradesh/covid-19-door-to-door-survey-to-begin-in-state-today/article31034077.ece", "urlToImage": "https://www.thehindu.com/news/national/andhra-pradesh/gpj4fj/article31034076.ece/ALTERNATES/LANDSCAPE_615/11VJPAGEVIRUS", "publishedAt": "2020-03-10T17:28:16Z", "content": "The State government will conduct a two-day door-to-door survey starting Wednesday to identify the persons who had recently been to novel coronavirus (COVID-19) affected countries.\r\nThe ground level survey is to reach out to the persons who have not undergone… [+1431 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Apple Stock Jumped Today", "description": "The coronavirus is driving extreme market volatility, helping the iPhone maker bounce back from yesterday's sell-off.", "url": "https://www.fool.com/investing/2020/03/10/why-apple-stock-jumped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562568/watchs3-launch-orchardroad-singapore-instore-tryon.jpg", "publishedAt": "2020-03-10T17:48:14Z", "content": "What happened\r\nShares of Apple (NASDAQ:AAPL) have jumped today, up by 4% as of 12:15 p.m. EDT, amid ongoing market volatility driven by the novel coronavirus. Here's all the recent outbreak-related news.\r\nSo what\r\niPhone sales in China plunged by over 60% to … [+1698 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Prosper Junior Bakiny)", "title": "Citron Research Goes After Inovio Pharmaceuticals", "description": "The activist short-seller is highly skeptical about the biotech's claims regarding its ongoing development of a coronavirus vaccine.", "url": "https://www.fool.com/investing/2020/03/10/citron-research-goes-after-inovio-pharmaceuticals.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562530/gettyimages-831493404.jpg", "publishedAt": "2020-03-10T18:03:00Z", "content": "The COVID-19 epidemic looks increasingly likely to become a pandemic, but a number of biotech companies are racing to develop vaccines that can protect people against SARS-CoV-2, the coronavirus that causes it. One of these companies is Inovio Pharmaceuticals… [+1566 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Quint Forgey", "title": "CDC director breaks with Trump on claim that border wall will help stop coronavirus", "description": "The director made his remarks while appearing before House lawmakers to testify about the public health crisis and the White House’s budget request for his agency.", "url": "https://www.politico.com/news/2020/03/10/cdc-director-border-wall-coronavirus-125007", "urlToImage": "https://static.politico.com/4b/db/5630cf924623b1d5a62ff01fdebb/200310-robert-redfield-gty-773.jpg", "publishedAt": "2020-03-10T17:45:19Z", "content": "As the federal government has struggled to mount a cohesive response to the coronavirus threat over the past few weeks, Trump has repeatedly promoted the administrations move\r\n in late January to bar entry from foreign nationals who had recently been in China… [+1835 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Nicole Gaudiano", "title": "Coronavirus quarantines could rob poor, rural students of access to education", "description": "Nearly 12 million children live in homes lacking a broadband connection.", "url": "https://www.politico.com/news/2020/03/10/coronavirus-quarantines-rural-students-125048", "urlToImage": "https://static.politico.com/ca/7e/670c0ec1416ea12cb0da110df744/200310-jessica-rosenworcel-getty-773.jpg", "publishedAt": "2020-03-10T17:49:23Z", "content": "Plenty of schools in Florida likely will be able to cleanly shift to online learning, but there are pockets where the transition will be a struggle, said Vanessa Dennen, a professor of Instructional Systems and Learning Technologies at Florida State Universit… [+6795 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Emily McNutt", "title": "Europe OKs suspension of strict ‘use-it or lose-it’ slot rules amid coronavirus outbreak", "description": "The European Commission has agreed to suspend strict requirements regarding airport slots in the light of the coronavirus outbreak. European Commission Chief Ursula von der Leyen said on Tuesday that the institution agreed that it would suspend the rule that …", "url": "http://thepointsguy.com/news/ec-suspend-slot-rules-coronavirus/", "urlToImage": "https://i0.wp.com/thepointsguy.com/wp-content/uploads/2020/03/GettyImages-477570988-1.jpg?fit=1024%2C683px&ssl=1", "publishedAt": "2020-03-10T18:00:38Z", "content": "The European Commission has agreed to suspend strict requirements regarding airport slots in the light of the coronavirus outbreak. European Commission Chief Ursula von der Leyen said on Tuesday that the institution agreed that it would suspend the rule that … [+3124 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump travels to Capitol Hill to meet with Senate Republicans on coronavirus economic plan - Washington Post", "description": "Trump travels to Capitol Hill to meet with Senate Republicans on coronavirus economic plan Washington Post McConnell on coronavirus: 'This is not a time for fear' | TheHill The Hill 'This is not a time for fear': McConnell downplays coronavirus threat Washing…", "url": "https://www.youtube.com/watch?v=quupa1-ELTw", "urlToImage": null, "publishedAt": "2020-03-10T18:10:26Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Coronavirus: Top US universities move classes online", "description": "The US government has refrained from imposing an official ban so the often privately run institutions are each grappling with how best to deal with the fast-moving outbreak.", "url": "https://economictimes.indiatimes.com/news/international/world-news/coronavirus-top-us-universities-move-classes-online/articleshow/74567029.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74567078,width-1070,height-580,imgsize-400844,overlay-economictimes/photo.jpg", "publishedAt": "2020-03-10T17:21:39Z", "content": "NEW YORK: Major American universities -- including Harvard, Princeton and Columbia -- have been forced to cancel classes because of the coronavirus and move lessons online, affecting tens of thousands of students. The US government has refrained from imposing… [+1742 chars]"}, {"source": {"id": null, "name": "Gq.com"}, "author": "Luke Darby", "title": "Conservatives Keeping Calling COVID-19 the “China Virus”", "description": "Despite warnings from the World Health Organization, American conservatives keep calling the coronavirus the \"China virus.\"", "url": "https://www.gq.com/story/coronavirus-is-not-chinese", "urlToImage": "https://media.gq.com/photos/5e67c94386f82a0009bd16ee/16:9/w_1280,c_limit/GettyImages-1210172252.jpg", "publishedAt": "2020-03-10T17:34:07Z", "content": "As the spread of the latest coronavirus starts to slow in China and South Korea, the disease is making its way into elite circles in the U.S. Rick Cotton, the head of the Port Authority in New York and New Jersey announced Monday that he had contracted it. Ne… [+3658 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Morgan Marietta Ph.D.", "title": "Dueling Viruses", "description": "Is the coronavirus threat understated or exaggerated? Politics may be part of the answer.", "url": "https://www.psychologytoday.com/ca/blog/inconvenient-facts/202003/dueling-viruses", "urlToImage": null, "publishedAt": "2020-03-10T17:33:28Z", "content": null}, {"source": {"id": null, "name": "Theintercept.com"}, "author": "Sharon Lerner", "title": "Federal Coronavirus Contract Requests Show the U.S. in a Desperate Scramble to Catch Up", "description": "A survey of federal contracts and requests for proposals related to the Covid-19 epidemic is not reassuring. The post Federal Coronavirus Contract Requests Show the U.S. in a Desperate Scramble to Catch Up appeared first on The Intercept.", "url": "https://theintercept.com/2020/03/10/coronavirus-covid-19-government-federal-contracts/", "urlToImage": "https://theintercept.imgix.net/wp-uploads/sites/1/2020/03/GettyImages-1208651402-medical-masks-1583857296-e1583857394730.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800", "publishedAt": "2020-03-10T17:55:14Z", "content": "First the good news:\r\n The U.S. Department of Health and Human Services just put out a request for contracts for 500 million face masks. Now the bad news: The U.S. Department of Health and Human Services just issued its request on Wednesday for contracts for … [+7375 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "KOMO News Staff", "title": "Inslee: Up to 64000 coronavirus cases in Wash. by May 'if we don't take action' - KOMO News", "description": "Inslee: Up to 64000 coronavirus cases in Wash. by May 'if we don't take action' KOMO News Coronavirus cases could reach 64,000 in Washington state by May, governor says CNBC Washington's coronavirus response as of March 10th KING 5 Coronavirus death toll reac…", "url": "http://komonews.com/news/coronavirus/inslee-up-to-64000-coronavirus-cases-in-wash-by-may-if-we-dont-take-action", "urlToImage": "http://static-34.sinclairstoryline.com/resources/media/07908966-2d1c-4e6f-b537-2265cc681c8e-large16x9_inslee_presser.jpg?1583863335158", "publishedAt": "2020-03-10T17:16:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: U.S. House Homeland Subcommittee hearing on COVID-19 | LIVE - Global News", "description": "Coronavirus outbreak: U.S. House Homeland Subcommittee hearing on COVID-19 | LIVE Global News When to contact a doctor: Coronavirus (COVID-19) symptoms SILive.com Allergy and flu symptoms: knowing the difference KTIV Coronavirus outbreak: Is COVID-19 worse th…", "url": "https://www.youtube.com/watch?v=1DmYTEAdysk", "urlToImage": null, "publishedAt": "2020-03-10T18:09:26Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Next Avenue, Contributor, Next Avenue, Contributor https://www.forbes.com/sites/nextavenue/people/nextavenue/", "title": "Coronavirus: Protection In Long-Term Care", "description": "The recent news of multiple deaths at a nursing home near Seattle due to the coronavirus has many family members anxious.", "url": "https://www.forbes.com/sites/nextavenue/2020/03/10/coronavirus-protection-in-long-term-care/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1152308861%2F0x0.jpg", "publishedAt": "2020-03-10T17:18:17Z", "content": "By Liz Seegert, Next Avenue Contributor\r\nGetty\r\nAs confirmed cases of the coronavirus (COVID-19) continue to spread across the U.S., concern for our own health and our loved ones health is understandably high. Its especially worrisome for older adults, who ar… [+7910 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Slovenia to close border with Italy over coronavirus: PM", "description": "Slovenia plans to close its border with Italy to prevent the spread of coronavirus, Prime Minister Marjan Sarec said on Twitter on Tuesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-slovenia-italy-idUSKBN20X2LU", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501336180&w=1200&r=LYNXMPEG291MX", "publishedAt": "2020-03-10T17:29:35Z", "content": "LJUBLJANA (Reuters) - Slovenia plans to close its border with Italy to prevent the spread of coronavirus, Prime Minister Marjan Sarec said on Twitter on Tuesday. \r\nHe did not say when the decision would take effect, or give further details. But the national n… [+214 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Betsy McKay", "title": "Coronavirus vs. Flu: Which Virus is Deadlier? - Wall Street Journal", "description": "Coronavirus vs. Flu: Which Virus is Deadlier? Wall Street Journal If Trump doesn’t like the coronavirus news now, he’ll hate what comes next The Washington Post Jim Talent: Coronavirus outbreak fears can be put into perspective with this rational line of thin…", "url": "https://www.wsj.com/articles/coronavirus-vs-flu-which-virus-is-deadlier-11583856879", "urlToImage": "https://images.wsj.net/im-162716/social", "publishedAt": "2020-03-10T17:49:00Z", "content": "The new coronavirus and the seasonal flu are similar in many ways. Both are respiratory diseases that spread through droplets of fluid from the mouth and nose of someone who is infected. Both are contagious, produce similar symptoms and can be deadly.\r\nBut th… [+270 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italian daily coronavirus deaths jump 36% to 631", "description": "The death toll from an outbreak of coronavirus in Italy has jumped by 168 to 631, an increase of 36%, the Civil Protection Agency said on Tuesday, the largest rise in absolute numbers since the contagion came to light on Feb. 21.", "url": "https://www.reuters.com/article/us-healthcare-coronavirus-italy-tally-idUSKBN20X2L6", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501333174&w=1200&r=LYNXMPEG291MH", "publishedAt": "2020-03-10T17:23:17Z", "content": "ROME (Reuters) - The death toll from an outbreak of coronavirus in Italy has jumped by 168 to 631, an increase of 36%, the Civil Protection Agency said on Tuesday, the largest rise in absolute numbers since the contagion came to light on Feb. 21. \r\nThe total … [+383 chars]"}, {"source": {"id": null, "name": "Pocketnow.com"}, "author": "Lee Kelly", "title": "Apple delays iPhone 9 aka iPhone SE 2 launch over coronavirus situation: Report", "description": "Apple cancelled iPhone 9 aka iPhone SE 2’s launch not because of production issues, but due to bleak demand prospects and market volatility. The post Apple delays iPhone 9 aka iPhone SE 2 launch over coronavirus situation: Report appeared first on Pocketnow.", "url": "https://pocketnow.com/apple-delays-iphone-9-aka-iphone-se-2-launch-over-coronavirus-situation-report", "urlToImage": "https://pocketnow.com/wp/../files/2020/01/2020-iPhone-SE-2-4.7-LCD-display-scaled-1-1280x720.jpg", "publishedAt": "2020-03-10T17:24:46Z", "content": "So, the analysts were right after all. Apple has pushed back the launch of iPhone 9 aka iPhone SE 2 over the ongoing coronavirus situation, reports Jon Prosser of FrontPageTech citing multiple sources from Apples supply chain and from within the company itsel… [+549 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Padraic Halpin", "title": "Ireland's Fianna Fail, Fine Gael to open government talks", "description": "Ireland's Fianna Fail and Fine Gael parties decided on Tuesday to open formal coalition negotiations after an inconclusive Feb. 8 election, saying they were acutely aware of the enormous challenges brought by the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-ireland-politics-idUSKBN20X2NA", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T17:41:11Z", "content": "DUBLIN (Reuters) - Ireland’s Fianna Fail and Fine Gael parties decided on Tuesday to open formal coalition negotiations after an inconclusive Feb. 8 election, saying they were acutely aware of the enormous challenges brought by the coronavirus outbreak. \r\nFia… [+2396 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Budget airline easyJet cancels all Italian flights", "description": "European budget airline easyJet said on Tuesday it will cancel all its scheduled flights to and from Italy between March 10 and April 3 after the entire country was placed under lockdown until next month to tackle coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-easyjet-idUSKBN20X2OL", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501345397&w=1200&r=LYNXMPEG291OO", "publishedAt": "2020-03-10T17:55:46Z", "content": "LONDON (Reuters) - European budget airline easyJet said on Tuesday it will cancel all its scheduled flights to and from Italy between March 10 and April 3 after the entire country was placed under lockdown until next month to tackle coronavirus. \r\n“We will be… [+377 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Timothy Green)", "title": "Dow Jones News: Microsoft Top Cloud Pick; Caterpillar Could Suffer From Oil Market Chaos", "description": "An analyst reiterated a bullish view on Microsoft, and trouble in the oil industry could hurt Caterpillar's earnings.", "url": "https://www.fool.com/investing/2020/03/10/dow-jones-news-microsoft-top-cloud-pick-caterpilla.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562574/cloud-computing-blue-background.jpg", "publishedAt": "2020-03-10T18:00:00Z", "content": "The Dow Jones Industrial Average (DJINDICES:^DJI) rallied hard Tuesday morning, attempting to stage a recovery after a brutal decline on Monday. That rally faded quickly, and at one point the Dow was in the red. At 12:35 p.m. EDT, the Dow had bounced back a b… [+3085 chars]"}, {"source": {"id": null, "name": "Techdirt.com"}, "author": "Mike Masnick", "title": "Content Moderation At Scale Is Impossible; Naughty Kids In Wuhan Edition", "description": "I keep trying to point out that content moderation at scale is impossible to do well for a whole variety of reasons, including the fact that sooner or later some people -- or some large groups of people -- may try to game the system in totally unexpected ways…", "url": "https://www.techdirt.com/articles/20200308/22180044058/content-moderation-scale-is-impossible-naughty-kids-wuhan-edition.shtml", "urlToImage": "https://ii.techdirt.com/s/t/i/td_icon_300.png", "publishedAt": "2020-03-10T17:46:50Z", "content": "from the masnick's-impossibility-theorem dept\r\nI keep trying to point out that content moderation at scale is impossible to do well for a whole variety of reasons, including the fact that sooner or later some people -- or some large groups of people -- may tr… [+2086 chars]"}, {"source": {"id": null, "name": "Kiro7.com"}, "author": "KIRO 7 News Staff", "title": "State announces new policies to help businesses, employees impacted by coronavirus - KIRO Seattle", "description": "Gov. Jay Inslee announced new statewide policies Tuesday to support businesses impacted by the spreading coronavirus.", "url": "https://www.kiro7.com/news/local/state-announces-new-policies-help-businesses-employees-impacted-by-coronavirus/6QUNNGTUSRD3THXZVECVUIPURI/", "urlToImage": "https://arc-anglerfish-arc2-prod-cmg.s3.amazonaws.com/public/3JR6JI436ZB3NK4HRQTXU6IQI4.jpg", "publishedAt": "2020-03-10T17:46:27Z", "content": "SEATTLE — Gov. Jay Inslee announced new statewide policies Tuesday to support businesses impacted by the spreading coronavirus. \r\nThrough careful planning and by working together, we can mitigate the economic hardships this situation is going to cause, Inslee… [+1592 chars]"}, {"source": {"id": null, "name": "Mcsweeneys.net"}, "author": "Jenny Donoghue", "title": "Jerry from Cheer Mat-Talks You Through the Coronavirus Outbreak", "description": "Yes! Sanitize those hands, girl! Come on, Jane! PUSH ! Push that shopping cart down the canned food aisle! Pick it up! Pick up that can! Pick up some more! Panic buy!! Girl, I see you buying but are you panicking?! PANIC MORE !! PANIC HARDER !!! You can do it…", "url": "https://www.mcsweeneys.net/articles/jerry-from-cheer-mat-talks-you-through-the-coronavirus-outbreak", "urlToImage": "http://d3thpuk46eyjbu.cloudfront.net/uploads/production/13371/1583454520/original/Screen_Shot_2020-01-29_at_3.08.01_PM.png", "publishedAt": "2020-03-10T18:00:00Z", "content": "Yes! Sanitize those hands, girl! Come on, Jane! PUSH!\r\nPush that shopping cart down the canned food aisle! Pick it up!\r\nPick up that can! Pick up some more! Panic buy!!\r\nGirl, I see you buying but are you panicking?! PANICMORE!!\r\nPANICHARDER!!! You can do it!… [+1506 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "BlackRock employee in New York tests positive for coronavirus", "description": "BlackRock Inc said on Tuesday a New York employee was diagnosed with the coronavirus, and has been in self-quarantine and working from home since March 4.", "url": "https://www.reuters.com/article/us-health-coronavirus-blackrock-idUSKBN20X2LY", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501336408&w=1200&r=LYNXMPEG291N0", "publishedAt": "2020-03-10T17:31:21Z", "content": "(Reuters) - BlackRock Inc (BLK.N) said on Tuesday a New York employee was diagnosed with the coronavirus, and has been in self-quarantine and working from home since March 4. \r\nThe employee showed no symptoms, and colleagues who may have been in close contact… [+165 chars]"}, {"source": {"id": null, "name": "Skift.com"}, "author": "Reuters", "title": "U.S. Airlines Expand Free Ticket Change Policy Amid Coronavirus Uncertainty", "description": "The largest U.S. airlines are allowing passengers to rebook tickets through April 30 without paying fees to change flights citing uncertainty about traveling during the coronavirus outbreak.", "url": "https://skift.com/2020/03/10/u-s-airlines-expand-free-ticket-change-policy-amid-coronavirus-uncertainty/", "urlToImage": "https://skift.com/wp-content/uploads/2020/03/los-angeles-airport-scaled-e1583842584328.jpg", "publishedAt": "2020-03-10T17:15:39Z", "content": "The largest U.S. airlines are allowing passengers to rebook tickets through April 30 without paying fees to change flights citing uncertainty about traveling during the coronavirus outbreak.\r\nDelta Airlines Inc said Monday it would waive change fees for custo… [+1522 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Mary Honkus", "title": "Olive Garden and Other Chain Restaurants Will Now Offer Paid Sick Leave Due to Coronavirus", "description": "The spread of the coronavirus has companies urging employees to stay home if they’re sick, but for workers in the restaurant industry, staying home isn’t an option when many can’t afford to miss a shift because they are not offered paid sick leave. Darden Res…", "url": "https://people.com/food/darden-restaurants-now-offer-paid-sick-leave/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2019%2F08%2Fgettyimages-535060677.jpg%3Fcrop%3D0px%2C0px%2C1408px%2C739.2px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T17:47:47Z", "content": "The spread of the coronavirus has companies urging employees to stay home if they’re sick, but for workers in the restaurant industry, staying home isn’t an option when many can’t afford to miss a shift because they are not offered paid sick leave.\r\nDarden Re… [+1993 chars]"}, {"source": {"id": null, "name": "Wmtw.com"}, "author": null, "title": "20 Mainers test negative for coronavirus, 5 test results pending, Maine CDC says - WMTW Portland", "description": "20 Mainers test negative for coronavirus, 5 test results pending, Maine CDC says WMTW Portland 'Should have been a sense of urgency': Former FDA chief warns of spike in US coronavirus cases USA TODAY Trump budget chief holds firm on CDC cuts amid virus outbre…", "url": "https://www.wmtw.com/article/20-mainers-test-negative-for-coronavirus-10-test-results-pending-maine-cdc-says/31350739", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/maine-coronavirus-1583789614.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-03-10T17:59:43Z", "content": "AUGUSTA, Maine —The Maine Center for Disease Control Prevention said Tuesday that 20 Mainers who were tested for the coronavirus have tested negative.\r\nThere are five tests that are pending results, health officials said.\r\nThere are no presumptive or confirme… [+776 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Eric Todisco", "title": "Joe Giudice Calls Italy's Coronavirus Lockdown 'Ridiculous': 'Grow a Set of Cojones'", "description": "Joe Giudice is not pleased with Italy’s national lockdown amid the novel coronavirus (COVID) outbreak. On Tuesday, the Real Housewives of New Jersey s tar, 49, shared a video of himself wandering the empty streets of Italy, where he has been living since Octo…", "url": "https://people.com/tv/joe-giudice-calls-italy-coronavirus-lockdown-ridiculous/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fjoe-giudice-italy-coronavirus-lockdown.jpg%3Fcrop%3D0px%2C388px%2C1500px%2C788px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T17:54:53Z", "content": "Joe Giudice is not pleased with Italy’s national lockdown amid the novel coronavirus (COVID) outbreak.\r\nOn Tuesday, the Real Housewives of New Jersey star, 49, shared a video of himself wandering the empty streets of Italy, where he has been living since Octo… [+2366 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "https://www.facebook.com/Jakeshermanpolitico, https://www.facebook.com/Annapalmerpolitico/", "title": "POLITICO Playbook PM: Trump's payroll tax cut falls flat on Hill - Politico", "description": "POLITICO Playbook PM: Trump's payroll tax cut falls flat on Hill Politico Trump pitched 0% payroll tax rate for the rest of the year, White House official says CNBC Trump meets with GOP lawmakers on proposed payroll tax cut amid coronavirus concerns CBS News …", "url": "https://www.politico.com/newsletters/playbook-pm/2020/03/10/trumps-payroll-tax-cut-falls-flat-on-hill-488547", "urlToImage": "https://static.politico.com/2e/55/32825c4442b38a577b7f16583d12/200310-trump-ap-773.jpg", "publishedAt": "2020-03-10T17:20:00Z", "content": "Getting the payroll tax cut into law would appear to require a good dose of dealmaking by the president. | Evan Vucci/AP Photo\r\nPOSTCARD TO THE PRESIDENT HOUSE DEMOCRATS are sending an unmistakable message to President DONALD TRUMP: They have no interest in t… [+16029 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Rachel DeSantis", "title": "Apple Says You Can Use Disinfectant Wipes to Clean iPhones as Coronavirus Continues to Spread", "description": "Practicing good hygiene to prevent the spread of coronavirus includes keeping cell phones germ-free. But Apple had long advised its customers to avoid using disinfecting wipes on gear like iPhones, as the harsh products could damage screen coating and possibl…", "url": "https://people.com/health/apple-you-can-disinfectant-wipes-clean-iphones/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcleaning-iphone.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T17:41:51Z", "content": "Practicing good hygiene to prevent the spread of coronavirus includes keeping cell phones germ-free. But Apple had long advised its customers to avoid using disinfecting wipes on gear like iPhones, as the harsh products could damage screen coating and possibl… [+2667 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Ale Russian", "title": "Julie Andrews' Lifetime Achievement Award Gala Postponed Due to Coronavirus Outbreak", "description": "Julie Andrews will have to wait a little longer to celebrate her storied career. The stage and screen icon, 84, was set to receive the American Film Institute’s Life Achievement Award at a gala on April 25. But with cases of coronavirus quickly growing in num…", "url": "https://people.com/movies/julie-andrews-lifetime-achievement-award-gala-postponed-due-to-coronavirus-outbreak/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2017%2F02%2Fjulie-andrews.jpg%3Fcrop%3D0px%2C0px%2C2000px%2C1050px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T17:44:22Z", "content": "Julie Andrews will have to wait a little longer to celebrate her storied career.\r\nThe stage and screen icon, 84, was set to receive the American Film Institute’s Life Achievement Award at a gala on April 25. But with cases of coronavirus quickly growing in nu… [+1644 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jeran Wittenstein and Kartikay Mehrotra", "title": "Engineer Who Attended Cybersecurity Event Contracts Coronavirus", "description": "(Bloomberg) -- An engineer who attended the annual RSA cybersecurity conference in San Francisco last month has tested positive for the coronavirus and is seriously ill with respiratory issues.The 45-year-old man began experiencing symptoms when he returned h…", "url": "https://finance.yahoo.com/news/engineer-attended-cybersecurity-event-contracts-180441855.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-10T18:04:41Z", "content": "(Bloomberg) -- An engineer who attended the annual RSA cybersecurity conference in San Francisco last month has tested positive for the coronavirus and is seriously ill with respiratory issues.\r\nThe 45-year-old man began experiencing symptoms when he returned… [+2913 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sujata Rao", "title": "Buy or sell? Investors navigate coronavirus data fog", "description": "For money managers, it's bad enough watching the coronavirus wipe trillions of dollars off world markets' value. Even worse is not knowing how bad the outbreak really is for the economy, company balance sheets, and in turn for their portfolios.", "url": "https://www.reuters.com/article/us-health-coronavirus-data-analysis-idUSKBN20X2LA", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501336177&w=1200&r=LYNXMPEG291MY", "publishedAt": "2020-03-10T17:29:43Z", "content": "LONDON (Reuters) - For money managers, it’s bad enough watching the coronavirus wipe trillions of dollars off world markets’ value. Even worse is not knowing how bad the outbreak really is for the economy, company balance sheets, and in turn for their portfol… [+5412 chars]"}, {"source": {"id": null, "name": "News-journal.com"}, "author": "From Staff and Wire Reports", "title": "Officials: Gregg County resident with new coronavirus was treated at Christus Good Shepherd - Longview News-Journal", "description": "Officials: Gregg County resident with new coronavirus was treated at Christus Good Shepherd Longview News-Journal NET Health confirms case of COVID-19 in Gregg County KLTV First East Texas case of Coronavirus confirmed in Gregg County KETKnbc Officials: Case …", "url": "https://www.news-journal.com/general/officials-gregg-county-resident-with-new-coronavirus-was-treated-at/article_6bcee2a4-62ea-11ea-a333-fbe610b06637.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-journal.com/content/tncms/assets/v3/editorial/6/22/6222a164-62f9-11ea-b606-271b13246186/5e67d6561caa8.image.jpg?resize=856%2C630", "publishedAt": "2020-03-10T18:07:21Z", "content": "County Judge Bill Stoudt has confirmed a new coronavirus patient was treated at Christus Good Shepherd Medical Center in Longview.\r\nThe patient did not contract the disease from the Longview community and is in isolation, he said at a press conference today.\r… [+4697 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Telegraph Sport", "title": "Katie Ormerod becomes first Briton to win World Cup snowboard title", "description": "Katie Ormerod has become the first British snowboarder to win a World Cup title after the International Ski Federation (FIS) announced the postponement of the final event because of concerns over the coronavirus.", "url": "https://www.telegraph.co.uk/snowboarding/2020/03/10/katie-ormerod-becomes-first-briton-win-world-cup-snowboard-title/", "urlToImage": "https://www.telegraph.co.uk/content/dam/snowboarding/2020/03/10/TELEMMGLPICT000153127254-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "publishedAt": "2020-03-10T17:42:05Z", "content": "Katie Ormerod has become the first British snowboarder to win a World Cup title after the International Ski Federation (FIS) announced the postponement of the final event because of concerns over the coronavirus.\r\nOrmerod has made the podium in all four of th… [+1459 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sibile Marcellus", "title": "Coronavirus threatens the jobs of these 15 million US workers", "description": "New research from Deutsche Bank indicates precisely how many Americans are at risk of losing their jobs due to the coronavirus outbreak’s impact on the U.S. economy.", "url": "https://finance.yahoo.com/news/coronavirus-threatens-the-jobs-of-these-15-million-us-workers-174841701.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QmfEOyWUCQpXbfDMWaO9EA--~B/aD0zNTIzO3c9NTI4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/25cde680-62f2-11ea-969b-9f94f813ae72", "publishedAt": "2020-03-10T17:48:41Z", "content": "The types of extreme measures that could help contain the coronavirus outbreak in the U.S. cancelling conferences and festivals, restrictingtravel, working from home are also the types of actions that could throw the U.S. economy into a recession. This dilemm… [+2947 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Associated Press", "title": "Coronavirus in New Rochelle: Schools, businesses shuttered and National Guard deployed amid spiraling outbreak - Fox Business", "description": "New York Governor Andrew Cuomo said on Tuesday that all schools and businesses in a part of New Rochelle considered a hot zone for coronavirus transmission will close for two weeks beginning on Thursday.", "url": "https://www.foxbusiness.com/lifestyle/schools-businesses-in-part-of-new-rochelle-new-york-to-close-for-2-weeks-to-stem-coronavirus-spread", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/08/0/0/18227713997238.jpg?ve=1&tl=1", "publishedAt": "2020-03-10T17:25:15Z", "content": "ALBANY, N.Y. — Schools, houses of worship and large gathering places will be shuttered for two weeks in a “containment area” centered in suburban New Rochelle, the heart of what appears to be the nation's biggest cluster of cases of the coronavirus, Gov. Andr… [+1606 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Olivia Messer", "title": "Coronavirus Ripoff Season Is Here. And a Kid Got Burned.", "description": "River Vale Police Department Police in New Jersey seized bottles of “spray sanitizer ” from a 7-Eleven location on Monday night after a woman said her young son suffered first-degree burns to his arm and leg. “While further investigation is underway, our firs…", "url": "https://www.thedailybeast.com/coronavirus-ripoff-season-is-here-and-a-kid-got-burned", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583861423/200310-messer-coronahoax-tease_kb5ozb", "publishedAt": "2020-03-10T17:39:40Z", "content": "Police in New Jersey seized bottles of spray sanitizer from a 7-Eleven location on Monday night after a woman said her young son suffered first-degree burns to his arm and leg.\r\nWhile further investigation is underway, our first priority is to make the public… [+5174 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Bruno Maçães, Bruno Maçães", "title": "Coronavirus and the Clash of Civilizations", "description": "America now faces a more delicate threat than those posed by Chinese manufacturing prowess or digital technologies.", "url": "https://www.nationalreview.com/2020/03/coronavirus-and-the-clash-of-civilizations/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/02/coronavirus-022820-19.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2020-03-10T17:54:02Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jay McGregor, Contributor, Jay McGregor, Contributor https://www.forbes.com/sites/jaymcgregor/", "title": "Buying A New iPhone? How Coronavirus Is Affecting Apple, Samsung And Others", "description": "If you’re in the market for new devices, then you may experience delays in shipping as factories in China temporarily close - or run a limited operation - to combat the virus.", "url": "https://www.forbes.com/sites/jaymcgregor/2020/03/10/buying-a-new-iphone-how-coronavirus-is-affecting-apple-samsung-and-others/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1203890713%2F0x0.jpg", "publishedAt": "2020-03-10T18:01:42Z", "content": "Im a London-based freelance journalist who specializes in all aspects of technology including reviews, investigations, comment and news. I'm the editor-in-chief of the investigative journalism focused YouTube channel, Point. I also write for The Guardian, Ind… [+76 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Nicole Brown", "title": "Tips for managing coronavirus anxiety", "description": "Dr. Sue Varma recommends picking one reliable news source to get information and \"limit the level of intrusions.\"", "url": "https://www.cbsnews.com/news/coronavirus-anxiety-disorder-what-to-do-doctor-advice/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/a5ebb0e8-4de0-45a9-812b-53638f1cdd70/thumbnail/1200x630/870bce82d89f9e2b94a439ce477a01db/0310-ctm-cvirusandanxiety-varma-2044902-640x360.jpg", "publishedAt": "2020-03-10T17:30:31Z", "content": "If you're feeling anxious about coronavirus, there are steps you can take to manage those feelings in a positive way, said Dr. Sue Varma on \"CBS This Morning.\"\r\nVarma recommends an approach she calls \"practical philosophy,\" which involves identifying what you… [+2143 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Mairead McArdle, Mairead McArdle", "title": "Pence Announces Insurance Companies Agreed to Waive Co-Pays for Coronavirus Testing", "description": "Pence announced that a number of insurance companies have agreed to waive co-pays for coronavirus tests as part of the Trump administration's \"whole of America\" approach.", "url": "https://www.nationalreview.com/news/pence-announces-insurance-companies-agreed-to-waive-co-pays-for-coronavirus-testing/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/03/pence.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-10T17:33:55Z", "content": null}, {"source": {"id": null, "name": "Complex.com"}, "author": "Trace William Cowen", "title": "Phishing Emails Touting Fake HIV Results and Coronavirus Cures Are Circulating", "description": "To be clear, there is no known cure for coronavirus, nor would one receive such news via a shady email.", "url": "https://www.complex.com/life/2020/03/phishing-emails-fake-hiv-results-coronavirus-cures-circulating", "urlToImage": "https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1/rfgbjwgaongibl574gwa/covid", "publishedAt": "2020-03-10T18:01:39Z", "content": "The coronavirus takeover of the U.S. news cycle has, as sadly should have been expected, inspired nefarious individuals to craft malware-infused emails.\r\nAs detailed in a piece from BuzzFeed News reporter Jane Lytvynenko on Tuesday, research from the cybersec… [+1543 chars]"}, {"source": {"id": null, "name": "Justjared.com"}, "author": "Just Jared", "title": "Jameela Jamil Responds to Trolls Saying She's Going to Get Coronavirus", "description": "Jameela Jamil is getting a lot of tweets suggesting she will be one of the first celebrities to be diagnosed with COVID-19 aka Coronavirus. “If you’re gonna make a joke about how I am going to be the first actress with coronavirus, ya late and ya basic. Jokin…", "url": "http://www.justjared.com/2020/03/10/jameela-jamil-responds-to-trolls-saying-shes-going-to-get-coronavirus/", "urlToImage": "http://cdn01.cdn.justjared.com/wp-content/uploads/headlines/2020/03/jameela-jamil-coronavirus2.jpg", "publishedAt": "2020-03-10T17:16:31Z", "content": "Jameela Jamil is getting a lot of tweets suggesting she will be one of the first celebrities to be diagnosed with COVID-19 aka Coronavirus.\r\n“If youre gonna make a joke about how I am going to be the first actress with coronavirus, ya late and ya basic. Jokin… [+986 chars]"}, {"source": {"id": null, "name": "Niemanlab.org"}, "author": "Joshua Benton", "title": "How much danger does coronavirus pose to the battered U.S. news industry?", "description": "The news cycles of the past few days have been almost completely monopolized by the novel coronavirus, with stories that would have dominated headlines not that long ago seem to have been shoved deep inside the Internet’s A-section. (Just this morning, Harvar…", "url": "https://www.niemanlab.org/2020/03/how-much-danger-does-coronavirus-pose-to-the-battered-u-s-news-industry/", "urlToImage": "https://www.niemanlab.org/images/pennsylvania-coronavirus-cc-700x467.jpg", "publishedAt": "2020-03-10T17:51:50Z", "content": "The news cycles of the past few days have been almost completely monopolized by the novel coronavirus, with stories that would have dominated headlines not that long ago seem to have been shoved deep inside the Internet’s A-section.\r\n(Just this morning, Harva… [+7453 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of XPO Logistics Are Up Today", "description": "The shipping specialist is expanding its presence in the United Kingdom.", "url": "https://www.fool.com/investing/2020/03/10/why-shares-of-xpo-logistics-are-up-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562577/xpo-sorting-facility-source-xpo.jpg", "publishedAt": "2020-03-10T17:39:00Z", "content": "What happened\r\nShares of XPO Logistics (NYSE:XPO) were up about 7% around 1:30 p.m. Tuesday, after the shipping and transport specialist announced plans to buy a logistics operation in the United Kingdom. The company's dealmaking efforts are under scrutiny ri… [+1733 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "CORONAVIRUS: Biogen’s Boston conference continues to be leading source of coronavirus cases. 32 pe…", "description": "CORONAVIRUS: Biogen’s Boston conference continues to be leading source of coronavirus cases. 32 people infected with COVID-19 now linked to February meeting of managers. Related: PhRMA, the Washington lobbying arm for the drug industry, will close for the rem…", "url": "https://pjmedia.com/instapundit/360932/", "urlToImage": null, "publishedAt": "2020-03-10T17:45:17Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Nike LeBron 17 Low Offered Classic Black and Red Style", "description": "Los Angeles Lakers superstar forward LeBron James may be concerned about potentially playing in front of empty stadiums due to the novel coronavirus, but it's business as usual for his Nike Basketball line, which has just presented the LeBron 17 Low in a clas…", "url": "https://hypebeast.com/2020/3/nike-lebron-17-low-black-university-red-cd5007-001-release-date-info", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fnike-lebron-17-low-black-university-red-cd5007-001-release-date-info-tw-0.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-10T17:40:48Z", "content": "Los Angeles Lakers superstar forward LeBron James may be concerned about potentially playing in front of empty stadiums due to the novel coronavirus, but it’s business as usual for his Nike Basketball line, which has just presented the LeBron 17 Low in a clas… [+1971 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Jen Gann", "title": "What If Coronavirus Means Your Kids Are Stuck at Home?", "description": "We asked parents about their go-to indoor activities with kids.", "url": "http://www.thecut.com/article/indoor-activities-for-kids.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/10/10-coronavirus-home-kids.w1200.h630.jpg", "publishedAt": "2020-03-10T17:54:37Z", "content": "Last week, NPR reported that attempts to stem the spread of the coronavirus meant almost 300 million students worldwide were not in class. In the United States, some schools have closed, and the Centers for Disease Control and Prevention has said that America… [+8276 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Georg Szalai", "title": "iHeartMedia CEO on Coronavirus: ‘In Times of Need,’ People ‘Are Hanging Out With Us More’", "description": "Radio and audio entertainment powerhouse iHeartMedia hasn't seen any negative coronavirus impact and may actually see listeners feel a closer connection with the company's services due to the virus, chairman and CEO Bob Pittman said Tuesday", "url": "https://www.billboard.com/articles/business/radio/9331826/bob-pittman-iheartmedia-coronavirus-radio-industry", "urlToImage": "https://static.billboard.com/files/media/Bob-Pittman-2019-billboard-1548-1024x677.jpg", "publishedAt": "2020-03-10T17:33:08Z", "content": "Radio and audio entertainment powerhouse iHeartMedia hasn't seen any negative coronavirus impact and may actually see listeners feel a closer connection with the company's services due to the virus, chairman and CEO Bob Pittman said Tuesday.\r\nHe, along with p… [+2007 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "The Editors, The Editors", "title": "President Trump Needs to Step Up on the Coronavirus", "description": "So far, he has obviously failed to rise to the challenge of leadership. It does no one any favors to pretend otherwise.", "url": "https://www.nationalreview.com/2020/03/president-trump-needs-to-step-up-on-the-coronavirus/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/03/Trump-now-.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-10T18:00:31Z", "content": null}, {"source": {"id": null, "name": "Matadornetwork.com"}, "author": "Eben Diskin", "title": "Coachella might be postponed", "description": "If the move isn’t possible, they will be canceled. The post Coachella and Stagecoach may be postponed over coronavirus appeared first on Matador Network.", "url": "https://matadornetwork.com/read/coachella-stagecoach-may-postponed-coronavirus/", "urlToImage": "https://d36tnp772eyphs.cloudfront.net/blogs/1/2020/03/Coachella-1200x806.jpg", "publishedAt": "2020-03-10T18:06:10Z", "content": "As more and more events are canceled due to the coronavirus, organizers of the Coachella and Stagecoach music festivals are looking into ways to salvage the popular events. Coachella, which was slated for April 10-12 and 17-19 in Indio, California, might be m… [+1046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Valentina Di Donato, Livia Borghese and Emma Reynolds, CNN", "title": "Cities deserted and families separated on Italy's first day of lockdown", "description": "Famous tourist sites were deserted, a smattering of bar-goers kept at arm's length from each other at formerly lively establishments and worried citizens stood in line outside once bustling stores in Italy after drastic restrictions were imposed to contain th…", "url": "https://www.cnn.com/2020/03/10/europe/italy-coronavirus-quarantine-europe-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200310112132-01-italy-coronavirus-business-impact-0309-super-tease.jpg", "publishedAt": "2020-03-10T17:57:46Z", "content": "Rome (CNN)Famous tourist sites were deserted, a smattering of bar-goers kept at arm's length from each other at formerly lively establishments and worried citizens stood in line outside once bustling stores in Italy after drastic restrictions were imposed to … [+7090 chars]"}, {"source": {"id": null, "name": "Pocket-lint.com"}, "author": "Rik Henderson", "title": "New Xbox Series X details planned for GDC keynote livestream", "description": "The Game Developers Conference (GDC) might not be going ahead next week thanks to fears over the coronavirus outbreak, but Xbox is still planning to host", "url": "https://www.pocket-lint.com/games/news/xbox/151380-xbox-series-x-keynote-livestream-how-to-watch", "urlToImage": "https://cdn.pocket-lint.com/r/s/1200x630/assets/images/151380-games-news-151380-xbox-series-x-details-planned-for-gdc-keynote-livestream-image1-jqqmu6rrnm.jpg", "publishedAt": "2020-03-10T17:35:32Z", "content": "The Game Developers Conference (GDC) might not be going ahead next week thanks to fears over the coronavirus outbreak, but Xbox is still planning to host seminars for developers and a keynote address. It will just stream them online instead.\r\nThe main, hour-l… [+975 chars]"}, {"source": {"id": null, "name": "Wtmj.com"}, "author": "Melissa Barclay", "title": "Coronavirus crackdown has Italian business owner from Racine working remotely - WTMJ", "description": "New restrictions for residents of Italy were implemented on Monday which includes the entire European country being placed on lockdown", "url": "https://wtmj.com/homepage-showcase/2020/03/10/coronavirus-crackdown-has-italian-business-owner-from-racine-working-remotely/", "urlToImage": "https://mk0wtmjradioy7erqedl.kinstacdn.com/wp-content/uploads/2020/03/DANA-ROGERS-2-2.jpg", "publishedAt": "2020-03-10T18:06:57Z", "content": "New restrictions for residents of Italy were implemented on Monday which includes the entire European country being placed on lockdown until further notice to help reduce the spread of the coronavirus. \r\nWTMJ’s Melissa Barclay has been keeping in contact with… [+2150 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Bruno Maçães", "title": "Coronavirus and the Clash of Civilizations", "description": "I spent the last two months traveling through Asia, all the way from Pakistan to the Philippines, with stops in India, Nepal, Singapore, Malaysia, and Vietnam. These were the months when the coronavirus epidemic grew from a faint echo in our daily news feed i…", "url": "https://news.yahoo.com/coronavirus-clash-civilizations-175402475.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/71TwHTPXgENlrGCQTJJAMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuOTc5NDcyMTQwNzYyNQ--/https://s.yimg.com/uu/api/res/1.2/5.f71SA0FaVkcg0QwGnhkw--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/7bb28e03097d6bd64096c4c3613d2d9d", "publishedAt": "2020-03-10T17:54:02Z", "content": "I spent the last two months traveling through Asia, all the way from Pakistan to the Philippines, with stops in India, Nepal, Singapore, Malaysia, and Vietnam. These were the months when the coronavirus epidemic grew from a faint echo in our daily news feed i… [+10750 chars]"}, {"source": {"id": null, "name": "Thestranger.com"}, "author": "Josh Jardine", "title": "Coronavirus and Cannabis: How Pot Is Impacted by an Epidemic", "description": "by Josh Jardine BELTERZ / GETTY IMAGES As we make our way into a new chapter in “End of Days: Death by Stupidity Edition,” it's worth taking a moment to consider how COVID-19 may impact the cannabis industry, and if cannabis can be part of a tool kit to deal …", "url": "https://www.thestranger.com/slog/2020/03/10/43105703/coronavirus-and-cannabis-how-pot-is-impacted-by-an-epidemic", "urlToImage": "https://media2.fdncms.com/stranger/imager/u/original/43105794/1583777018-pot2-gettyimages-157602409.jpg", "publishedAt": "2020-03-10T18:00:37Z", "content": "As we make our way into a new chapter in End of Days: Death by Stupidity Edition, it's worth taking a moment to consider how COVID-19 may impact the cannabis industry, and if cannabis can be part of a tool kit to deal with the epidemic.Governor Jay Inslee has… [+4190 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Shareholder Update on Treatment for Coronavirus Optioned by Spherix", "description": "Spherix Incorporated (Nasdaq: SPEX) today provided an update on the recently announced treatment for Coronavirus technology optioned by the Company.", "url": "https://news.yahoo.com/shareholder-treatment-coronavirus-optioned-spherix-175900409.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1o5UPxzsVxZOG_smK1hLlQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTI2OA--/https://s.yimg.com/uu/api/res/1.2/2e4bIu_eH5eciPY9O8p7OA--~B/aD0xMzQ7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/f81d766deb8c316fd2c08203d7beecfb", "publishedAt": "2020-03-10T17:59:00Z", "content": "NEW YORK, March 10, 2020 /PRNewswire/ -- Spherix Incorporated (Nasdaq: SPEX) today provided an update on the recently announced treatment for Coronavirus technology optioned by the Company.\r\nSpherix Logo. (PRNewsFoto/Spherix Incorporated)\r\nAs noted in patent … [+3621 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Elizabeth Dilts Marshall", "title": "Goldman Sachs is 'very open' to acquisitions: CFO", "description": "Goldman Sachs Group Inc Chief Financial Officer Stephen Scherr said on Tuesday the bank is \"very open to acquisitions\" that can help the bank fill gaps or help the bank speed up growth of certain businesses.", "url": "https://www.reuters.com/article/us-goldman-sachs-m-a-idUSKBN20X2IL", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501323402&w=1200&r=LYNXMPEG291KI", "publishedAt": "2020-03-10T17:23:28Z", "content": "NEW YORK (Reuters) - Goldman Sachs Group Inc (GS.N) Chief Financial Officer Stephen Scherr said on Tuesday the bank is “very open to acquisitions” that can help the bank fill gaps or help the bank speed up growth of certain businesses. \r\nSpeaking at a confere… [+559 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Ben Warren", "title": "World Elite Praise China’s Draconian Response to Coronavirus", "description": "Globalists betting everything on Asian world order model", "url": "https://www.infowars.com/world-elite-praise-chinas-draconian-response-to-coronavirus/", "urlToImage": "https://assets.infowars.com/2020/03/WuhanGetty31020.jpg", "publishedAt": "2020-03-10T17:27:39Z", "content": "In 2019, the Chinese model was heavily promoted as its internet censorship system was implemented around the globe.\r\nLast year, Old-Thinker News reported that either an Asian World Order would rise, or humanity would reach for the stars.\r\nU.N. Secretary-Gener… [+2016 chars]"}, {"source": {"id": null, "name": "Poynter.org"}, "author": "Al Tompkins", "title": "How to move beyond scary COVID-19 stories", "description": "Welcome to Covering COVID-19. Every morning, starting tomorrow and for the foreseeable future, I will offer a menu of story ideas and occasionally point to innovative and thoughtful work that I hope will spark useful, reflective and even uplifting reporting o…", "url": "https://www.poynter.org/reporting-editing/2020/how-to-move-beyond-scary-covid-19-stories/", "urlToImage": "https://www.poynter.org/wp-content/uploads/2020/03/AP_20069410224457-1500x1000.jpg", "publishedAt": "2020-03-10T17:33:12Z", "content": "Welcome to Covering COVID-19.\r\nEvery morning, starting tomorrow and for the foreseeable future, I will offer a menu of story ideas and occasionally point to innovative and thoughtful work that I hope will spark useful, reflective and even uplifting reporting … [+6820 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sean O'Grady, Sean O'Grady", "title": "Greece was one thing – Italy may be too big for the EU to save", "description": "The question now is not whether the EU (read: Germany) is willing to rescue Italy from coronavirus, but whether Italy could overwhelm even Germany's resources", "url": "https://www.independent.co.uk/voices/coronavirus-italy-cases-travel-economy-giuseppe-conte-a9392621.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/10/10/italy-lockdown-10.JPG", "publishedAt": "2020-03-10T17:57:00Z", "content": "Over the past decade or so weve become used to Italy being in meltdown now it is in lockdown, too. Together, these evil twins, represent a threat of potentially enormous consequence for Italy, for Europe and for the world.\r\nThe immediate news is that the Ital… [+4286 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "SMART: Congress prepares to shutter Capitol Hill for coronavirus, opens telework center….", "description": "SMART: Congress prepares to shutter Capitol Hill for coronavirus, opens telework center.", "url": "https://pjmedia.com/instapundit/360913/", "urlToImage": null, "publishedAt": "2020-03-10T17:14:51Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Portugal suspends flights to, from Italy due to coronavirus", "description": "Portugal's government on Tuesday suspended all passenger flights to and from Italy for 14 days starting on Wednesday as a preventative measure to stem the spread of coronavirus, it said in a statement.", "url": "https://www.reuters.com/article/us-health-coronavirus-portugal-italy-idUSKBN20X2PN", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T18:08:40Z", "content": "LISBON (Reuters) - Portugal’s government on Tuesday suspended all passenger flights to and from Italy for 14 days starting on Wednesday as a preventative measure to stem the spread of coronavirus, it said in a statement. \r\nOn Monday the government suspended f… [+308 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Maureen Groppe and Christal Hayes, USA TODAY", "title": "'Like preparing for a hurricane': Lawmakers worry about coronavirus hitting them while helping manage response", "description": "Anxiety is rising on Capitol Hill as members of Congress try to protect themselves and others from coronavirus while managing the nation's response.", "url": "https://news.yahoo.com/preparing-hurricane-lawmakers-worry-coronavirus-170929958.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UJo4NTeXZErx.NY6npdNfQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/StFDWAA6QdJixsSjpPeARA--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/962252d2440ec9e2be52d4aaa7a4060f", "publishedAt": "2020-03-10T17:16:09Z", "content": "WASHINGTON  After casting a vote in the House on Monday, Rep. Lois Frankel used a tissue to open a chamber door and exit the floor.\r\nShe showed off a small bottle of hand sanitizer stowed in her purse, a product that has become a prized possession after selli… [+10303 chars]"}, {"source": {"id": null, "name": "101greatgoals.com"}, "author": "Conor Laird", "title": "Official: Chelsea & Man United’s upcoming European fixtures to be played out behind closed doors", "description": "As confirmed across social media this evening, the upcoming European fixtures of Premier League giants Chelsea and Manchester United will be played out behind closed doors. Coronavirus continues to spread The worldwide coronavirus outbreak has of course been …", "url": "https://www.101greatgoals.com/news/official-chelsea-man-uniteds-upcoming-european-fixtures-to-be-played-out-behind-closed-doors/", "urlToImage": "https://www.101greatgoals.com/wp-content/uploads/2019/07/GettyImages-1161224068.jpg", "publishedAt": "2020-03-10T18:07:43Z", "content": "As confirmed across social media this evening, the upcoming European fixtures of Premier League giants Chelsea and Manchester United will be played out behind closed doors.\r\nCoronavirus continues to spread\r\nThe worldwide coronavirus outbreak has of course bee… [+2978 chars]"}, {"source": {"id": null, "name": "Planetizen.com"}, "author": "Planetizen", "title": "National Shared Mobility Summit Cancelled Due to Coronavirus Fears", "description": "Planning conferences are among the events experiencing the effects of Coronavirus mitigation measures.", "url": "https://www.planetizen.com/news/2020/03/108694-national-shared-mobility-summit-cancelled-due-coronavirus-fears", "urlToImage": "https://www.planetizen.com/files/images/shutterstock_1566852976.jpg", "publishedAt": "2020-03-10T18:00:00Z", "content": "Mary Wisniewski reports: \"Adding to the growing list of large Chicago events canceled due to concerns over the new coronavirus, the 2020 National Shared Mobility Summit, a conference on transportation issues, will not go forward next week.\"\r\nThe event had bee… [+536 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "TAKING ON YOUR MOST VITAL QUESTIONS: Can drinking alcohol protect you from coronavirus? Here is wha…", "description": "TAKING ON YOUR MOST VITAL QUESTIONS: Can drinking alcohol protect you from coronavirus? Here is what WHO says.", "url": "https://pjmedia.com/instapundit/360841/", "urlToImage": null, "publishedAt": "2020-03-10T18:00:22Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Offgridsurvival.com"}, "author": "Off Grid Survival", "title": "National Guard Deployed In New York: Sets Up Coronavirus ‘Containment Area’", "description": "National Guard Deployed In New York: Sets Up Coronavirus ‘Containment Area’ In one of the most bizarre pieces of Coronavirus news yet, New York Governor Andrew Cuomo announced Tuesday that he was deploying the National Guard and setting up a containment zone …", "url": "https://offgridsurvival.com/national-guard-deployed-in-new-york/", "urlToImage": "https://offgridsurvival.com/wp-content/themes/church_10/images/2020/03/cointainmentzone.jpg", "publishedAt": "2020-03-10T18:01:57Z", "content": "In one of the most bizarre pieces of Coronavirus news yet,\r\nNew York Governor Andrew Cuomo announced Tuesday that he was deploying the National\r\nGuard and setting up a containment zone in New Rochelle, NY to stop the spread\r\nof the Coronavirus.\r\nThe news come… [+1716 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mairead McArdle", "title": "Pence Announces Insurance Companies Agreed to Waive Co-Pays for Coronavirus Testing", "description": "Vice President Mike Pence announced Tuesday that a number of insurance companies have agreed to waive co-pays for coronavirus tests as part of the Trump administration's \"whole of America\" approach to combat the epidemic.Pence made the remarks alongside Presi…", "url": "https://news.yahoo.com/pence-announces-insurance-companies-agreed-173355789.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sAroyYcqn4wh689ORsRDsA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/unStyLT3I385aRrUIaVqGg--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/11e58cc8ec1b5c5c1ce42ef3ae84faf7", "publishedAt": "2020-03-10T17:33:55Z", "content": "Vice President Mike Pence announced Tuesday that a number of insurance companies have agreed to waive co-pays for coronavirus tests as part of the Trump administrations whole of America approach to combat the epidemic.\r\nPence made the remarks alongside Presid… [+1878 chars]"}]