[{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Eric Eldon", "title": "Startups Weekly: Remote-first SaaS products boom as workers stay home", "description": "Silicon Valley companies had already been going remote-first when the coronavirus became a global pandemic. This means there are lots of great software tools already on the market, that are seeing a huge amount of new usage now. And not just Zoom. Alex Wilhel…", "url": "http://techcrunch.com/2020/03/07/startups-weekly-remote-first-saas-products-boom-as-workers-stay-home/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/Seeq-workplaces.png?w=764", "publishedAt": "2020-03-07T19:00:30Z", "content": "Silicon Valley companies had already been going remote-first when the coronavirus became a global pandemic. This means there are lots of great software tools already on the market, that are seeing a huge amount of new usage now. And not just Zoom. Alex Wilhel… [+7592 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Nicole Gallucci", "title": "Reminder: You don't have to watch 'Contagion'", "description": "As cases of the coronavirus continue to spread, you may be thinking to yourself, \"Hmm, maybe now is a great time to watch the 2011 medical thriller Contagion.\" Here's another thought: Do not watch the movie. Over the past few months, many people have turned t…", "url": "https://mashable.com/article/coronavirus-dont-watch-contagion-movie/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F07%252Fbc%252Fa26ef83b182e491ebed8f8dbae8f568c.cc4e3.jpg%252F1200x630.jpg?signature=ieGVi_5sZGakyEDYpTuUq3yCrLw=", "publishedAt": "2020-03-07T18:41:44Z", "content": "As cases of the coronavirus continue to spread, you may be thinking to yourself, \"Hmm, maybe now is a great time to watch the 2011 medical thriller Contagion.\"\r\nHere's another thought: Donot watch the movie.\r\nOver the past few months, many people have turned … [+2873 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Jen St. Denis", "title": "6 new cases of COVID-19 in B.C., including 2 long-term care home residents - CTV News", "description": "6 new cases of COVID-19 in B.C., including 2 long-term care home residents CTV News B.C. declares COVID-19 outbreak at North Vancouver care home, 6 new cases announced Global News B.C. unveils COVID-19 response plan as it prepares for potential of sustained o…", "url": "https://bc.ctvnews.ca/6-new-cases-of-covid-19-in-b-c-including-2-long-term-care-home-residents-1.4843279", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4843330.1583611099!/httpImage/image.png_gen/derivatives/landscape_620/image.png", "publishedAt": "2020-03-07T18:50:00Z", "content": "VANCOUVER -- \r\nB.C. health officials have announced six new cases of COVID-19, and in a concerning development, two of them are residents of a North Vancouver long-term care home.\r\nProvincial health officer Dr. Bonnie Henry said on Saturday that the residents… [+4137 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Detroit Free Press, Julie Hinds, Detroit Free Press", "title": "Coronavirus has made 2011 movie, 'Contagion,' a hot rental on Amazon Prime, iTunes", "description": "Made in 2011 by director Steven Soderbergh with an all-star cast, 'Contagion' is scary but packs a vital message about importance of precautions.", "url": "https://www.usatoday.com/story/entertainment/2020/03/07/2011-movie-contagion-virus-thriller-feels-like-2020/4986495002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/05/PDTF/b394328b-df52-4609-9947-b5d484808945-gpndc5-617rbi7z8arl990q8sv_o.jpg?crop=1999,1125,x0,y29&width=1600&height=800&fit=bounds", "publishedAt": "2020-03-07T18:20:24Z", "content": "After watching \"Contagion,\" you won't need a public health official to tell you to wash your hands often, reports the Detroit Free Press, part of the USA TODAY Network.\r\nThe 2011 movie will scare you into soap and water. It makes that precaution seem as urgen… [+6814 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Eileen A.J. Connelly", "title": "The New York Post: Cuomo declares state of emergency in New York as state coronavirus cases soar to 76", "description": "New York state Governnor Andrew Cuomo declared a state of emergency Saturday to deal with the worsening coronavirus crisis, as the number of cases jumped to 11 in the Big Apple — including one in Queens — and 76 across New York.", "url": "http://www.marketwatch.com/story/cuomo-declares-state-of-emergency-in-new-york-as-state-coronavirus-cases-soar-to-76-2020-03-07", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-GO395_cuomo_ZG_20180815162225.jpg", "publishedAt": "2020-03-07T18:32:44Z", "content": "Gov. Andrew Cuomo declared a state of emergency in New York state on Saturday to deal with the worsening coronavirus crisis, as the number of cases jumped to 11 in New York City including one in Queens and 76 across the state.Saturdays numbers more than doubl… [+3102 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Josh Spiegel", "title": "Theme Park Bits: Updates on Coronavirus at Disney Resorts, Mickey and Minnie’s Runaway Railway, and More", "description": "In this edition of Theme Park Bits: Walt Disney World releases an updated statement on coronavirus. Mickey and Minnie’s Runaway Railway has opened. Downtown Disney regains one of its flagship beverage locations. And more! By now, you have probably heard just …", "url": "https://www.slashfilm.com/theme-park-bits-updates-on-coronavirus-at-disney-resorts-mickey-and-minnies-runaway-railway-and-more/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/mickeyandminnie-runawayrailway-ridethrough.jpg", "publishedAt": "2020-03-07T19:00:13Z", "content": "In this edition of Theme Park Bits:\r\n<ul><li>Walt Disney World releases an updated statement on coronavirus.</li><li>Mickey and Minnie’s Runaway Railway has opened.</li><li>Downtown Disney regains one of its flagship beverage locations.</li><li>And more!</li>… [+3596 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike Chiari", "title": "IIHF Cancels Women's World Championships in Canada Amid Coronavirus Concerns", "description": "The International Ice Hockey Federation told the  Associated Press  on Saturday that it has canceled the Women's World Championship in Canada because of the coronavirus outbreak...", "url": "https://bleacherreport.com/articles/2879720-iihf-cancels-womens-world-championships-in-canada-amid-coronavirus-concerns", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/856/291/hi-res-ee04070af66162a7b6967e8812d89521_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-07T18:16:56Z", "content": "Carlos Osorio/Associated Press\r\nThe International Ice Hockey Federation told the Associated Press on Saturday that it has canceled the Women's World Championship in Canada because of the coronavirus outbreak.\r\nThe tournament was set to run from March 31 throu… [+1344 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Jamie Foxx Uses Hand Sanitizer After Touching Fan, Fears Coronavirus", "description": "Jamie Foxx isn't about to let a little thing like the coronavirus stop him from interacting with his loyal fans... that said, he's also NOT going to wash up after touching 'em. The renaissance man was at the Sunset Room in Hollywood for…", "url": "https://www.tmz.com/2020/03/07/jamie-foxx-hand-sanitizer-touch-fan-hands-club-coronavirus/", "urlToImage": "https://imagez.tmz.com/image/3d/16by9/2020/03/07/3df46f265d184d4bb1fa881465f5f38a_xl.jpg", "publishedAt": "2020-03-07T18:47:48Z", "content": "Jamie Foxx isn't about to let a little thing like the coronavirus stop him from interacting with his loyal fans ... that said, he's also NOT not going to wash up after touching 'em.\r\nThe renaissance man was at the Sunset Room in Hollywood for entertainment pr… [+1058 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Roy: I'll abide if coronavirus ban happens", "description": "Roy Hodgson says he will abide by any ban on over-70s from attending football matches if the government implements such a law over the coronavirus outbreak.", "url": "https://www.skysports.com/football/news/11706/11952254/roy-hodgson-will-abide-by-any-law-stopping-over-70s-from-attending-matches-due-to-coronavirus", "urlToImage": "https://e0.365dm.com/20/03/1600x900/skysports-roy-hodgson-crystal-palace_4941290.jpg", "publishedAt": "2020-03-07T18:13:00Z", "content": "Roy Hodgson says he will abide by any ban on over-70s from attending football matches if the government implements such a law over the coronavirus outbreak. \r\nSports authorities and broadcasters have been summoned by the government for discussions on coronavi… [+1524 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Chinese ship allowed to berthafter clearing COVID-19 test", "description": "The Visakhapatnam Port Trust allowed merchant vessel Fortune Hero to unload its cargo of calcined petroleum coke on Saturday after screening Chinese and Myanmar crew for coronavirus (COVID-19). The ve", "url": "https://www.thehindu.com/news/national/andhra-pradesh/chinese-ship-allowed-to-berthafter-clearing-covid-19-test/article31012082.ece", "urlToImage": "https://www.thehindu.com/news/national/andhra-pradesh/g3uwzr/article31012081.ece/ALTERNATES/LANDSCAPE_615/08VJPAGE5SHIP", "publishedAt": "2020-03-07T19:07:01Z", "content": "The Visakhapatnam Port Trust allowed merchant vessel Fortune Hero to unload its cargo of calcined petroleum coke on Saturday after screening Chinese and Myanmar crew for coronavirus (COVID-19). \r\nThe vessel with a crew of 17 Chinese nationals and five Myanmar… [+650 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the NBA is preparing for a possible COVID-19 outbreak - CBC News", "description": "How the NBA is preparing for a possible COVID-19 outbreak CBC News Is coronavirus mutating into a more deadly strain? Covid-19 myths busted The Guardian Travel industry faces largest loss since Great Recession due to coronavirus KARE 11 Made in China: Coronav…", "url": "https://www.youtube.com/watch?v=KhGNzPRsCO0", "urlToImage": null, "publishedAt": "2020-03-07T18:27:43Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Paraguay confirms its first case of coronavirus", "description": "Paraguay has registered its first confirmed case of coronavirus, the Health Ministry said on Twitter on Saturday.", "url": "https://www.reuters.com/article/us-health-coronavirus-paraguay-idUSKBN20U0TC", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-07T18:20:17Z", "content": "ASUNCION (Reuters) - Paraguay has registered its first confirmed case of coronavirus, the Health Ministry said on Twitter on Saturday. \r\nNo other details about the case were included in the tweet, which said ministry officials were scheduled to hold a news co… [+124 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "IndiGo waives rescheduling fee for bookings amid coronavirus scare", "description": "Online travel agency ixigo has also announced a full refund for all flight bookings to China, France, Germany, Hong Kong, Iran, Italy, Spain, Singapore, South Korea and Japan.", "url": "https://indianexpress.com/article/business/aviation/indigo-waives-rescheduling-fee-for-bookings-amid-coronavirus-scare-6304448/", "urlToImage": "https://images.indianexpress.com/2020/01/indiGo-1.jpg?w=759", "publishedAt": "2020-03-07T19:05:50Z", "content": "The fee waiver would only apply to change of dates of flights but not in case of cancellation.With Covid-19 cases in the country on a rise and people postponing travel, Indias largest airline IndiGo has decided it will not charge any fee for rescheduling of d… [+1785 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France says 16 people have died from coronavirus: health official", "description": "Sixteen people in France have died from coronavirus, the head of the country's public health service, Jerome Salomon, said on Saturday, an increase of five since the previous toll.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-toll-idUSKBN20U0U2", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-07T18:51:09Z", "content": "PARIS (Reuters) - Sixteen people in France have died from coronavirus, the head of the country’s public health service, Jerome Salomon, said on Saturday, an increase of five since the previous toll. \r\nFrance now has 949 confirmed cases of coronavirus, Salomon… [+62 chars]"}, {"source": {"id": null, "name": "Mprnews.org"}, "author": "Peter Cox, Andrew Krueger", "title": "Minnesota health officials say state's first coronavirus patient had minimal contact with others - Minnesota Public Radio News", "description": "Minnesota health officials say state's first coronavirus patient had minimal contact with others Minnesota Public Radio News Investigation of Minnesota's first COVID-19 case finds patient had limited contact with others Minneapolis Star Tribune RAW: Minnesota…", "url": "https://www.mprnews.org/story/2020/03/07/minnesota-health-officials-first-coronavirus-patient-minimal-contact-others", "urlToImage": "https://img.apmcdn.org/95eb648521bb13495d29e0c79d9a8bdb19546210/widescreen/ac8cb9-20200229-virus03.jpg", "publishedAt": "2020-03-07T18:24:00Z", "content": "Minnesota health officials reported Saturday that they've determined the state's first confirmed patient with coronavirus had minimal contact with others while they were sick.\r\nAnd they did not report any new confirmed cases of coronavirus after the initial c… [+1672 chars]"}, {"source": {"id": null, "name": "Freetech4teachers.com"}, "author": "noreply@blogger.com (Richard Byrne)", "title": "The Practical Ed Tech Podcast Episode 36 - Teaching Online and More", "description": "This episode of The Practical Ed Tech Podcast is a bit longer than the usual weekly episodes. The first ten minutes of this episode is spent explaining some strategies and tools for teaching online. I... Read the whole entry at FreeTech4Teachers.com » Related…", "url": "https://www.freetech4teachers.com/2020/03/the-practical-ed-tech-podcast-episode.html", "urlToImage": "https://1.bp.blogspot.com/-ACpeXvUjJxc/XmPson6DdHI/AAAAAAABrts/1ZIs7XhuqaEixAOsPVQNcFhBTSxATOeagCLcBGAsYHQ/w1200-h630-p-k-no-nu/practical%2Bed%2Btech%2Bpodcast%2Bcover%2Bimage.jpg", "publishedAt": "2020-03-07T18:53:00Z", "content": "This episode of The Practical Ed Tech Podcast is a bit longer than the usual weekly episodes. The first ten minutes of this episode is spent explaining some strategies and tools for teaching online. I did this in response to all of the emails and Tweets I've … [+694 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.S. pastor tells how Bethlehem trip turned into coronavirus quarantine ordeal", "description": "Thirteen Americans suspected of being exposed to coronavirus during a trip to the Holy Land are in quarantine near Bethlehem and are coordinating with U.S. and Palestinian authorities to try to get home.", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/Pka4QYNP7SM/u-s-pastor-tells-how-bethlehem-trip-turned-into-coronavirus-quarantine-ordeal-idUSKBN20U0AP", "urlToImage": null, "publishedAt": "2020-03-07T18:29:55Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Egypt confirms 33 new cases of coronavirus on Nile cruise ship", "description": "Egypt confirmed on Saturday 33 new cases of coronavirus on a cruise ship on the River Nile that officials said the previous day had been struck by the virus, the health minister said.", "url": "https://www.reuters.com/article/us-health-coronavirus-egypt-idUSKBN20U0TK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-07T18:28:12Z", "content": "CAIRO (Reuters) - Egypt confirmed on Saturday 33 new cases of coronavirus on a cruise ship on the River Nile that officials said the previous day had been struck by the virus, the health minister said. \r\nNone of the cases were showing symptoms of the illness,… [+123 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "LeBron James Says 'I Ain't Playing' If There Are No Fans at NBA Games Amid Coronavirus Concerns", "description": "LeBron James can’t get behind the concept of playing in an empty basketball arena. As concerns over the coronavirus outbreak continue, the NBA sent out a league-wide memo on Friday informing teams to prepare for the possibility of playing games without specta…", "url": "https://people.com/sports/lebron-james-not-playing-if-no-fans-at-nba-games-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F01%2Flebron-james.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-07T19:00:50Z", "content": "LeBron James can’t get behind the concept of playing in an empty basketball arena.\r\nAs concerns over the coronavirus outbreak continue, the NBA sent out a league-wide memo on Friday informing teams to prepare for the possibility of playing games without spect… [+1988 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Georgia Slater", "title": "Melania Trump Responds After Being Criticized for Tennis Complex Construction Amid Coronavirus Fears", "description": "Melania Trump spoke out about her work as first lady after being criticized this week for observing construction on a White House tennis complex while the nation is grappling with the novel coronavirus outbreak. Several Twitter users had slammed her for posti…", "url": "https://people.com/politics/melania-trump-responds-after-slammed-tennis-complex-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fesxkxfsxqaedmu8.jpg%3Fw%3D1200%26h%3D630%26crop%3D1", "publishedAt": "2020-03-07T18:33:16Z", "content": "Melania Trump spoke out about her work as first lady after being criticized this week for observing construction on a White House tennis complex while the nation is grappling with the novel coronavirus outbreak.\r\nSeveral Twitter users had slammed her for post… [+3735 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus updates: Two passengers evacuated from Grand Princess, supplies airlifted - Sacramento Bee", "description": "Coronavirus updates: Two passengers evacuated from Grand Princess, supplies airlifted Sacramento Bee DHEC investigating two possible cases of coronavirus in South Carolina Live 5 News WCSC Governor speaks on suspected coronavirus cases in South Carolina WYFF4…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA5OTAxODYuaHRtbNIBS2h0dHBzOi8vYW1wLnNhY2JlZS5jb20vbmV3cy9sb2NhbC9oZWFsdGgtYW5kLW1lZGljaW5lL2FydGljbGUyNDA5OTAxODYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-03-07T18:50:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yong Xiong and Theresa Waldrop, CNN", "title": "Coronavirus quarantine hotel collapses in China, trapping 70 people", "description": "Search and rescue efforts are underway after about 70 people were trapped in a hotel collapse Saturday night in southeastern China, officials in the city of Quanzhou said.", "url": "https://www.cnn.com/2020/03/07/china/china-coronavirus-hotel-collapse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200307105058-01-hotel-collapse-china-0307-super-tease.jpg", "publishedAt": "2020-03-07T18:39:22Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "More than 200 confirmed cases of coronavirus in UK - Channel 4 News", "description": "More than 200 confirmed cases of coronavirus in UK Channel 4 News More than half of all US states have reported COVID-19 cases msnNOW Coronavirus crisis in US as more cases are reported l ABC News ABC News US COVID-19 cases surge past 250, deaths reach 16 CID…", "url": "https://www.youtube.com/watch?v=deetyCSM9DU", "urlToImage": "https://i.ytimg.com/vi/deetyCSM9DU/maxresdefault.jpg", "publishedAt": "2020-03-07T18:46:03Z", "content": "Thousands of new cases - in Britain and around the world - with a surge in both infections and deaths in Italy and Iran. \r\n(Subscribe: https://bit.ly/C4_News_Subscribe) \r\nThe family of the second man to die here have paid tribute to a \"truly loving and wonder… [+315 chars]"}, {"source": {"id": null, "name": "Thenation.com"}, "author": "John Nichols", "title": "Where’s the Plan to Ensure That the Coronavirus Doesn’t Upend Elections?", "description": "John Nichols The 2020 elections have already experienced chaos. Can we ensure coronavirus does not become a crisis for democracy? The post Where’s the Plan to Ensure That the Coronavirus Doesn’t Upend Elections? appeared first on The Nation.", "url": "https://www.thenation.com/article/politics/coronavirus-elections/", "urlToImage": "https://www.thenation.com/wp-content/uploads/2020/03/coronavirus-masks-sanders-rally-gt-img.jpg", "publishedAt": "2020-03-07T18:45:35Z", "content": "Supporters of presidential candidate Bernie Sanders wear respiratory masks to protect against COVID-19. (Brian Blanco / Getty Images)\r\nThank you for signing up. For more from The Nation, check out our latest issue.\r\nThank you for signing up. For more from The… [+7720 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Suzanne Rowan Kelleher, Contributor, Suzanne Rowan Kelleher, Contributor https://www.forbes.com/sites/suzannerowankelleher/", "title": "Travelers Are Canceling Trips To Asia But Adopting A Wait-And-See Approach For Other Destinations", "description": "So far, travelers are not using a one-size-fits-all approach to determine whether to cancel upcoming trips.", "url": "https://www.forbes.com/sites/suzannerowankelleher/2020/03/07/travelers-are-canceling-trips-to-asia-but-adopting-a-wait-and-see-approach-for-other-destinations/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F993982660%2F0x0.jpg", "publishedAt": "2020-03-07T18:52:35Z", "content": "For the most part, leisure travelers are not canceling domestic trips.\r\nGetty\r\nJust like the stock market, travelers hate uncertainty. And theres nothing more uncertain than the coronavirus outbreak.\r\nSo far, travelers are not using a one-size-fits-all approa… [+3748 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Rep. Gaetz accused of mocking coronavirus concerns with gas mask", "description": "Republican Rep. Matt Gaetz stands accused of ‘misplaced humor’ regarding coronavirus concerns by wearing a gas mask on the House floor. Author Rick Wilson joins Joy Reid to discuss, also saying ‘we may have to pay a price’ for how the Trump administration is …", "url": "https://www.msnbc.com/am-joy/watch/gop-rep-gaetz-wears-gas-mask-on-house-floor-sparking-concerns-80234565559", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_joy_gatesgasmask_200307_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-07T18:30:51Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Head of Italy's co-governing Democratic Party tests positive for coronavirus", "description": null, "url": "https://www.cnn.com/collections/intl-coronavirus-uk-italy/", "urlToImage": null, "publishedAt": "2020-03-07T18:19:58Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Victoria Cavaliere, CNN", "title": "Uber to offer drivers 14 days sick leave if they fall ill with coronavirus", "description": "Uber said it will offer drivers and delivery people 14 days of paid sick leave if they fall ill with coronavirus or are placed in quarantine.", "url": "https://www.cnn.com/2020/03/07/tech/uber-coronavirus-sick-leave/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190410041346-file-uber-california-01-super-tease.jpg", "publishedAt": "2020-03-07T18:45:56Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Rick Munarriz)", "title": "4 Reasons Roku Will Bounce Back", "description": "The fast-growing streaming platform has seen its stock plunge 42% since peaking last summer. The selloff is overdone.", "url": "https://www.fool.com/investing/2020/03/07/4-reasons-roku-will-bounce-back.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562061/rokuadsolutions.png", "publishedAt": "2020-03-07T19:00:00Z", "content": "The correction has been brutal for Roku(NASDAQ:ROKU) investors. Last year's best-performing large cap, more than quadrupling in 2019, has plummeted 42% since last summer's all-time high. The stock briefly cracked below $100 on Friday, trading in the double di… [+3459 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "STEP ONE: DON’T USE TITO’S VODKA. Worried about coronavirus? Here’s how to make your own hand …", "description": "STEP ONE: DON’T USE TITO’S VODKA. Worried about coronavirus? Here’s how to make your own hand sanitizer.", "url": "https://pjmedia.com/instapundit/360622/", "urlToImage": null, "publishedAt": "2020-03-07T18:14:52Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Stephen Green", "title": "THANKS! We Can Thank Trump for the United States Having Such a Low Per-Capita Infection Rate of Coro…", "description": "THANKS! We Can Thank Trump for the United States Having Such a Low Per-Capita Infection Rate of Coronavirus.", "url": "https://pjmedia.com/instapundit/360659/", "urlToImage": null, "publishedAt": "2020-03-07T18:11:56Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Thehollywoodgossip.com"}, "author": "Emily Trainham", "title": "Farrah Abraham Makes Fun of Coronavirus, Is Still the Worst", "description": "Farrah Abraham has made a new video mocking the coronavirus scare, and no one is having it.", "url": "https://www.thehollywoodgossip.com/2020/03/farrah-abraham-makes-fun-of-coronavirus-is-still-the-worst/", "urlToImage": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--QHanxg7N--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1579199418/farrah-abraham-is-plastic.jpg", "publishedAt": "2020-03-07T19:05:38Z", "content": "So hey, you know how Farrah Abraham is real dumb and awful? Yeah, that's what we're going to be talking about today. Farrah is awful for lots of reasons, and nobody has time to sit and recount every single one of them. Instead, let's just focus on her attitud… [+3421 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Lewis", "title": "Facebook bans ads for face masks amid coronavirus panic", "description": "\"We're monitoring COVID19 closely and will make necessary updates to our policies if we see people trying to exploit this public health emergency.\"", "url": "https://www.cbsnews.com/news/coronavirus-facebook-bans-ads-commerce-listings-face-masks-covid-19/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/07/8616362b-dc54-4ff1-bc5f-98b3141c2bc9/thumbnail/1200x630g4/0013a282d5bb669b625621ff08832aef/gettyimages-1205332208.jpg", "publishedAt": "2020-03-07T19:01:21Z", "content": "Facebook announced on Friday it is banning face mask ads and commerce listings from its platforms. \"We are temporarily banning advertisements and commerce listings, like those on Marketplace, that sell medical face masks,\" the tech giant said in a statement. … [+3437 chars]"}, {"source": {"id": null, "name": "Cointelegraph.com"}, "author": "Cointelegraph By Ting Peng", "title": "Coronavirus Plagues US Crypto Conferences", "description": "Bitcoin 2020, DC Blockchain Summit 2020, and other crypto conferences reschedule due to the coronavirus outbreak", "url": "https://cointelegraph.com/news/coronavirus-plagues-us-crypto-conferences", "urlToImage": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lYTZlNzliYWNjNTA5ZmVkZTk5YTM0NGExMDdlMDFlOC5qcGc=.jpg", "publishedAt": "2020-03-07T18:35:00Z", "content": "There has been a rapid escalation of the COVID-19 coronavirus outbreak worldwide. Two major crypto conferences in the US have been affected by the epidemic so far.\r\n“Bitcoin 2020”, originally scheduled for March 27 and 28 in San Francisco, has moved to Q3 of … [+1488 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: Dozens trapped as China quarantine hotel collapses", "description": "Rescuers are working to recover people trapped in a collapsed coronavirus quarantine hotel in the Chinese city of Quanzhou, while infection cases surge across Europe.", "url": "https://www.abc.net.au/news/2020-03-08/coronavirus-updates-live/12036640", "urlToImage": "https://www.abc.net.au/news/image/12036888-16x9-700x394.jpg", "publishedAt": "2020-03-07T18:51:26Z", "content": "Posted \r\nMarch 08, 2020 05:51:26\r\nAs coronavirus continues to spread to new countries, about 70 people have been trapped after a five-storey hotel used for coronavirus quarantine collapsed in the Chinese city of Quanzhou.\r\nThis story is being updated througho… [+4287 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "NHL weighing closed locker rooms amid outbreak", "description": "The NHL is weighing a number of options, including closing locker room access to the media, as the concern over the coronavirus esaclates, commissioner Gary Bettman said Saturday.", "url": "https://www.espn.com/nhl/story/_/id/28857703/nhl-considering-closing-locker-rooms-media-amid-coronavirus-outbreak", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F0922%2Fr262160_1296x729_16%2D9.jpg", "publishedAt": "2020-03-07T18:40:49Z", "content": "The NHL is weighing a number of options, including closing locker room access to the media, as the concern over the coronavirus esaclates, commissioner Gary Bettman said Saturday.\r\n\"We're focused on the fact that the tightness, the crowdedness and the intimac… [+2324 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FP Staff", "title": "Confirmed coronavirus cases rise to 34 as Ladakh, Tamil Nadu report infections; Modi directs officials to make provisions for critical care", "description": "Three more people tested positive for the coronavirus in India on Saturday, taking the total number of cases in the country to 34 The post Confirmed coronavirus cases rise to 34 as Ladakh, Tamil Nadu report infections; Modi directs officials to make provision…", "url": "https://www.firstpost.com/health/confirmed-coronavirus-cases-rise-to-34-as-ladakh-tamil-nadu-report-infections-modi-directs-officials-to-make-provisions-for-critical-care-8129251.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/airport-screening-PTI-social.jpg", "publishedAt": "2020-03-07T18:19:06Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "FP Staff", "title": "Confirmed coronavirus cases rise to 34 as Ladkah, Tamil Nadu report infections; Modi directs officials to make provisions for critical care", "description": "Three more people tested positive for the coronavirus in India on Saturday, taking the total number of cases in the country to 34 The post Confirmed coronavirus cases rise to 34 as Ladkah, Tamil Nadu report infections; Modi directs officials to make provision…", "url": "https://www.firstpost.com/india/confirmed-coronavirus-cases-rise-to-34-as-ladkah-tamil-nadu-report-infections-modi-directs-officials-to-make-provisions-for-critical-care-8129251.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/airport-screening-PTI-social.jpg", "publishedAt": "2020-03-07T18:19:06Z", "content": "Three more people tested positive for the coronavirus in India on Saturday, taking the total number of cases in the country to 34. The total number of cases across the world crossed 1,00,000 mark, with countries such as Iran, Germay, South Korea and Italy rec… [+9943 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "Blue Cross and Blue Shield of Texas to Cover Cost of Coronavirus Tests for Members", "description": "Blue Cross and Blue Shield of Texas (BCBSTX) members will have access to coronavirus (COVID-19) testing as recommended by the Centers for Disease Control and Prevention (CDC) and prescribed by health providers. Effective immediately, BCBSTX will not require p…", "url": "https://news.yahoo.com/blue-cross-blue-shield-texas-184400341.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/moKCI1KBQxF9AqnYVPS4RA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTEzMA--/https://s.yimg.com/uu/api/res/1.2/YSevtJ5bN92SzO67D8d_2Q--~B/aD02NTt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/1aa1f7134afc219f6f71328474dc715d", "publishedAt": "2020-03-07T18:44:00Z", "content": "RICHARDSON, Texas, March 7, 2020 /PRNewswire/ -- Blue Cross and Blue Shield of Texas (BCBSTX) members will have access to coronavirus (COVID-19) testing as recommended by the Centers for Disease Control and Prevention (CDC) and prescribed by health providers.… [+3002 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "New York coronavirus cases jump to 76, Gov. Cuomo declares state of emergency", "description": "New York Governor Andrew Cuomo said the number of cases there has jumped to 76 — a 72 percent increase from the 44 cases as of Friday — and that he has declared a state of emergency.\n\nAt least 10 of the coronavirus patients in New York state are hospitalized,…", "url": "https://www.msnbc.com/msnbc/watch/new-york-coronavirus-cases-jump-to-76-gov-cuomo-declares-state-of-emergency-80233029782", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/Cuomo_2.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-07T18:20:23Z", "content": null}, {"source": {"id": null, "name": "Qz.com"}, "author": "Natasha Frost", "title": "Ram-don, popularized by “Parasite,” is the perfect meal for these troubled times", "description": "Seldom does a dish speak to both a global health crisis and a nation's rising soft power.", "url": "https://qz.com/1814346/parasite-noodle-dish-ram-don-is-perfect-coronavirus-quarantine-meal/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/12/parasitestill-1-e1576767368859.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-07T18:27:56Z", "content": "Rare is the dish that speaks to both a global public health crisis and a nations rising soft power. Enter ram-don, a student-friendly mix of two popular instant noodle flavorsand the uncredited star of Parasite, which last month became South Koreas first Acad… [+2758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arnaud Siad", "title": "More than 200 people test positive for coronavirus in the UK", "description": "A total of 206 people have tested positive for coronavirus across the United Kingdom, British health officials confirmed Saturday in a statement.", "url": "https://www.cnn.com/2020/03/07/world/uk-coronavirus-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306171508-coronavirus-vaccine-lab-germany-pleitgen-pkg-00000000-super-tease.jpg", "publishedAt": "2020-03-07T18:14:18Z", "content": null}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "State of emergency declared as NYS coronavirus victims total climbs to 76; numbers in Westchester... (Larry McShane/New York Daily News)", "description": "Larry McShane / New York Daily News : State of emergency declared as NYS coronavirus victims total climbs to 76 ; numbers in Westchester continue to expand from case of infected New Rochelle man — Gov. Cuomo declared a state of emergency Saturday as the New R…", "url": "https://www.memeorandum.com/200307/p42", "urlToImage": "https://www.nydailynews.com/resizer/nNeINB2F0SVOO7dKHwhkegf8RDQ=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/URCCYEBFCJGKHMXR7NMEKG5Z6E.jpg", "publishedAt": "2020-03-07T19:05:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Associated Press", "title": "Hockey body tells AP women’s worlds in Canada are canceled", "description": "The women’s world hockey championships in Canada were canceled Saturday because of the new coronavirus.", "url": "https://www.bostonherald.com/2020/03/07/hockey-body-tells-ap-womens-worlds-in-canada-are-canceled/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/Womens_Championships_Canceled_Hockey_24325-1.jpg?w=1024&h=698", "publishedAt": "2020-03-07T18:26:26Z", "content": "By JOHN WAWROW\r\nThe women’s world hockey championships in Canada were canceled Saturday because of the new coronavirus.\r\nInternational Ice Hockey Federation President René Fasel told The Associated Press the decision was made by conference call. The two-week … [+3203 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Dave Masciotra, Salon", "title": "The coronavirus crisis is the price we’re paying for the election of Trump", "description": "Many Americans, perhaps most, appear to view the president as a public intellectual or shock-jock media personality. Voters increasingly pledge their loyalty to a candidate who not only articulates what they want to hear, but does so in the way they want to h…", "url": "https://www.rawstory.com/2020/03/the-coronavirus-crisis-is-the-price-were-paying-for-the-election-of-trump/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2017/07/donald-trump-afp.jpg", "publishedAt": "2020-03-07T18:25:07Z", "content": "Many Americans, perhaps most, appear to view the president as a public intellectual or shock-jock media personality. Voters increasingly pledge their loyalty to a candidate who not only articulates what they want to hear, but does so in the way they want to h… [+6164 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Mary Margaret Olohan", "title": "Universities Are Pulling Students Home In Fear Over Coronavirus", "description": "Mary Margaret Olohan Security, Reactions to the virus are affecting all aspects of life. American colleges and universities are bringing home students in study abroad programs over fears of the coronavirus. Collegiate institutions across the country are bring…", "url": "https://nationalinterest.org/blog/buzz/universities-are-pulling-students-home-fear-over-coronavirus-130777", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/2020-03-06T073745Z_1446169704_RC27EF9L7EBR_RTRMADP_3_HEALTH-CORONAVIRUS-SOUTHKOREA.JPG.jpg", "publishedAt": "2020-03-07T18:30:00Z", "content": "American colleges and universities are bringing home students in study abroad programs over fears of the coronavirus.\r\nCollegiate institutions across the country are bringing students in study abroad programs back to the U.S. as the virus escalates. More than… [+2583 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Yohay Elam", "title": "Gold Price Analysis: Breaking above $1,692 critical for next coronavirus-correlated bullish run – Confluence Detector", "description": "The price of Gold closed the week at just under $1,674 in a turbulent week that saw a rush into the safe-haven asset. Coronavirus continues spreading", "url": "https://www.fxstreet.com/news/gold-price-analysis-breaking-above-1-692-critical-for-next-coronavirus-correlated-bullish-run-confluence-detector-202003071830", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Commodities/Metals/Gold/aurum-37842316_Large.jpg", "publishedAt": "2020-03-07T18:30:22Z", "content": "The price of Gold closed the week at just under $1,674 in a turbulent week that saw a rush into the safe-haven asset. Coronavirus continues spreading around the world with more infections in the US, South Korea, Iran, and across Europe. Investors are traders … [+1894 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "Florin Bodnarescu", "title": "Microsoft Weekly: Gaming rumors, newer software versions, and Surface deals", "description": "This past week we saw the surfacing of a rumor about Series X gameplay, a new Windows 10 vNext build, and even some Surface hardware deals. Be sure to catch up on all of that and more, below. Read more...", "url": "https://www.neowin.net/news/microsoft-weekly-gaming-rumors-newer-software-versions-and-surface-deals/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2020/03/1583606254_msw-20200307_story.jpg", "publishedAt": "2020-03-07T18:44:02Z", "content": "Though not unexpected, this week saw either the postponement or cancellation of certain events due to coronavirus fears, the surfacing of a rumor regarding the Series X, and the advent of pretty decent deals on Surface hardware. You can find that – as well as… [+7169 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Mike Singer", "title": "Michael Malone “concerned” about Nuggets charity event as coronavirus hits Colorado", "description": "Nuggets coach Michael Malone said he was worried about an upcoming team meet-and-greet after multiple cases of coronavirus appeared in Colorado.", "url": "https://www.denverpost.com/2020/03/07/michael-malone-coronavirus-nuggets-event/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/03/TDP-L-NUGGETS-WARRIORS-AAO-_6AO6221xxx.jpg?w=1024&h=683", "publishedAt": "2020-03-07T18:48:20Z", "content": "CLEVELAND Nuggets coach Michael Malone said he was worried about an upcoming team meet-and-greet after multiple cases of coronavirus appeared in Colorado.\r\nThe charity event is scheduled for March 16 as a meet up for fans at Vehicle Vault in Parker.\r\nIts scar… [+1690 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Alexi Cohan", "title": "Five new cases of coronavirus reported in Massachusetts, bringing total to 13", "description": "The total number of coronavirus cases in Massachusetts has jumped to 13, up from 8 total cases on Friday, according to numbers from the Department of Public Health.", "url": "https://www.bostonherald.com/2020/03/07/five-new-cases-of-coronavirus-reported-in-massachusetts-bringing-total-to-13/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/01/China_Outbreak_68074-1.jpg?w=1024&h=565", "publishedAt": "2020-03-07T18:29:42Z", "content": "The total number of coronavirus cases in Massachusetts has jumped to 13, up from 8 total cases on Friday, according to numbers from the Department of Public Health.\r\nAs of Saturday afternoon, updated totals from the state website dedicated to coronavirus info… [+620 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Lawal Sherifat", "title": "Italy coronavirus deaths near 200 after biggest daily jump", "description": "The death toll from an outbreak of coronavirus in Italy has risen by 49 to 197, the Civil Protection Agency said on Friday, the largest daily increase in fatalities since the contagion was uncovered two weeks ago. France says 11 people have now died from coro…", "url": "https://www.vanguardngr.com/2020/03/italy-coronavirus-deaths-near-200-after-biggest-daily-jump/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/03/Coronavirus.jpg?fit=1500%2C1119&ssl=1", "publishedAt": "2020-03-07T18:45:11Z", "content": "A Nigerian newspaper and Online version of the Vanguard, a daily publication in Nigeria covering Nigeria news, Niger delta, general national news, politics, business, energy, sports, entertainment, fashion,lifestyle human interest stories, etc"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Nestor Ramos", "title": "Five new cases of coronavirus reported, bringing Mass. total to 13", "description": "The additional cases follow a large group of tests administered yesterday to employees of the biotech giant Biogen.", "url": "https://www.bostonglobe.com/2020/03/07/nation/five-new-cases-coronavirus-reported-bringing-mass-total-12/", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=144", "publishedAt": "2020-03-07T18:13:26Z", "content": "The Massachusetts Department of Public Health added five new cases of COVID-19, the illness caused by the novel coronavirus, to its tally of positive test results.\r\nThe additional cases bring the total in Massachusetts to 13. That includes one case that was c… [+1068 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "U.S. financial regulators start contingency planning as virus reaches Washington", "description": "By Pete Schroeder, Chris Prentice and Katanga Johnson WASHINGTON (Reuters) - U.S. financial regulators are preparing contingency arrangements, including travel restrictions and home-working, to ensure they can effectively oversee the financial markets as the …", "url": "https://www.firstpost.com/business/u-s-financial-regulators-start-contingency-planning-as-virus-reaches-washington-8129641.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/03-2020/08/2020-03-07T173707Z_2_LYNXMPEG260I4_RTROPTP_2_HEALTH-CORONAVIRUS-USA-REGULATORS.jpg", "publishedAt": "2020-03-07T18:35:21Z", "content": "By Pete Schroeder, Chris Prentice and Katanga Johnson\r\nWASHINGTON (Reuters) - U.S. financial regulators are preparing contingency arrangements, including travel restrictions and home-working, to ensure they can effectively oversee the financial markets as the… [+4549 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Crowley", "title": "Rep. Debbie Dingell Would Put Differences Aside and Pose With Trump to Raise Awareness About Coronavirus", "description": "The Michigan congresswoman said she would elbow bump and post a photo with the president if it would educate people on the coronavirus.", "url": "https://www.newsweek.com/debbie-dingell-trump-elbow-bump-coronavirus-1491076", "urlToImage": "https://d.newsweek.com/en/full/1572136/debbie-dingell.jpg", "publishedAt": "2020-03-07T18:37:19Z", "content": "Michigan Representative Debbie Dingell said she'd like to bump elbows with President Donald Trump and share the photo to social media to promote alternate greetings to stop spreading the coronavirus--despite bumping heads with the president in the past.\r\nIn a… [+2913 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Tommy Christopher", "title": "Coronavirus ‘Monster Ship’ Passenger Reacts to Trump Comments, Invites Him to ”Come Breathe the Same Air We Are’", "description": "A passenger on the coronavirus-quarantined cruise ship Grand Princess reacted to President Donald Trump's recent remarks about the \"monster ship\" by inviting him to join them aboard the vessel and \"breathe the same air we are.\"", "url": "https://www.mediaite.com/news/coronavirus-monster-ship-passenger-reacts-to-trump-comments-invites-him-to-come-breathe-the-same-air-we-are/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/03/Coronavirus-cruise-ship-passenger-debbie-loftus.jpg", "publishedAt": "2020-03-07T18:43:12Z", "content": "A passenger on the coronavirus-quarantined cruise ship Grand Princess reacted to President Donald Trump’s recent remarks about the “monster ship” by inviting him to join them aboard the vessel and “breathe the same air we are.”\r\nDuring Friday’s visit to the C… [+1816 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "FINALLY, JANE FONDA HAS HER CANDIDATE: Hollywood’s favorite commie endorses Sanders, the “climat…", "description": "FINALLY, JANE FONDA HAS HER CANDIDATE: Hollywood’s favorite commie endorses Sanders, the “climate candidate.” Wow — Biden throws away his “moderate” status, endorses AOC’s Green New Deal, babbles that fossil fuel executives should be jailed, and plastic bags …", "url": "https://pjmedia.com/instapundit/360658/", "urlToImage": null, "publishedAt": "2020-03-07T18:22:53Z", "content": "FINALLY, JANE FONDA HAS HER CANDIDATE: Hollywoods favorite commie endorses Sanders, the climate candidate.\r\nWow — Biden throws away his moderate status, endorses AOCs Green New Deal, babbles that fossil fuel executives should be jailed, and plastic bags shoul… [+250 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Israel Coordinating Evacuation of Tourists From Palestinian Authority Over Coronavirus - Military", "description": "TEL AVIV (Sputnik) - Israel is coordinating the evacuation of hundreds of tourists from the Palestinian Authority due to the outbreak of the coronavirus disease (COVID-19) in the city of Bethlehem, the Israeli Defence Ministry's Coordination of Government Act…", "url": "https://sputniknews.com/middleeast/202003071078505339-israel-coordinating-evacuation-of-tourists-from-palestinian-authority/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107850/53/1078505315.jpg", "publishedAt": "2020-03-07T18:30:51Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "Collector tells people not to believe rumours on COVID-19", "description": "12-bedded isolation ward established at the Government Hospital", "url": "https://www.thehindu.com/news/cities/Coimbatore/collector-tells-people-not-to-believe-rumours-on-covid-19/article31011779.ece", "urlToImage": "https://www.thehindu.com/news/cities/Coimbatore/bpefvf/article31011778.ece/ALTERNATES/LANDSCAPE_615/SA08MASK", "publishedAt": "2020-03-07T18:34:23Z", "content": "The 108 persons, who had returned from China to the district, were not infected by coronavirus (COVID-19). They were doing well at their home and being continuously monitored by doctors, said Collector S. A. Raman here on Friday. He told the people not to bel… [+2252 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "NBC Sports Washington", "title": "NHL, NBA may close locker rooms from media over coronavirus fears", "description": "With growing fears over the spread of coronavirus, the NHL and NBA may close locker rooms to the media.", "url": "https://sports.yahoo.com/nhl-nba-may-close-locker-190336865.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/KYNitVe0zHCVg6Sjb6Xb_Q--~B/aD0yOTI0O3c9NTE5OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnwashington.com/7e03fc344718b4fc27af0407bacb1838", "publishedAt": "2020-03-07T19:03:36Z", "content": "With growing fears over the spread of COVID-19, more commonly known as the coronavirus, the NHL may close locker rooms to the media, according to several reports.\r\nStarting today, @NHL will close dressing rooms to media, on recommendation of Centers for Disea… [+2258 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Maldives Reports First Coronavirus Cases, 2 Employees Test Positive at Luxury Resort - News18", "description": "The country's health ministry said two unnamed foreign nationals working at the deluxe Kuredu Island Resort, about 150 kilometres (95 miles) north of the capital Male, tested positive for COVID-19.", "url": "https://www.news18.com/news/world/maldives-reports-first-coronavirus-cases-2-employees-test-positive-at-luxury-resort-2530009.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/coronavirus.jpg", "publishedAt": "2020-03-07T18:12:57Z", "content": "Colombo: Two hotel employees tested positive for the novel coronavirus at a luxury resort in the Maldives, the government said Saturday marking the first cases reported in the upmarket holiday destination.\r\nThe country's health ministry said two unnamed forei… [+868 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Nick Stellini", "title": "Coronavirus concerns lead multiple teams to change autograph policies", "description": "The teams want to stop physical contact between players and fans to guard against players possibly catching the virus.", "url": "https://mlb.nbcsports.com/2020/03/07/coronavirus-concerns-lead-multiple-teams-to-change-autograph-policies/", "urlToImage": "https://mlb.nbcsports.com/wp-content/uploads/sites/7/2020/03/GettyImages-1204235041-e1583606849169.jpg", "publishedAt": "2020-03-07T18:48:50Z", "content": "The Nationals, Astros and Phillies all announced today that their players will no longer be signing autographs or shaking hands with fans. The decisions come as the highly contagious COVID-19 outbreak continues to spread throughout the country. The teams will… [+1585 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Lawal Sherifat", "title": "Coronavirus: Osun government embarks on assessment of Chinese nationals, others to mining sites", "description": "Vows to end illegal mining Shina Abubakar – Osogbo The Osun State government has embarked on assessment exercise of Chinese nationals at mining sites as proactive and preventive measures to forestall the spread of dreaded Coronavirus to the State. The exercis…", "url": "https://www.vanguardngr.com/2020/03/coronavirus-osun-government-embarks-on-assessment-of-chinese-nationals-others-to-mining-sites/", "urlToImage": null, "publishedAt": "2020-03-07T19:10:30Z", "content": "Vows to end illegal mining\r\nShina Abubakar – Osogbo\r\nThe Osun State government has embarked on assessment exercise of Chinese nationals at mining sites as proactive and preventive measures to forestall the spread of dreaded Coronavirus to the State.\r\nThe exer… [+2139 chars]"}, {"source": {"id": null, "name": "Legalinsurrection.com"}, "author": "Leslie Eastman", "title": "Maybe it’s time to dial back the coronavirus drama", "description": "During Task Force press briefing, Vice President Pence notes millions of tests are poised to be sent to state labs by end of next week.", "url": "https://legalinsurrection.com/2020/03/maybe-its-time-to-dial-back-the-coronavirus-drama/", "urlToImage": "https://legalinsurrection.com/wp-content/uploads/2020/03/LI-38-Coronavirus-Task-Force.png", "publishedAt": "2020-03-07T19:00:20Z", "content": "During Task Force press briefing, Vice President Pence notes millions of tests are poised to be sent to state labs by end of next week.After a week of covering the Wuhan coronavirus as both as a pundit and a biosafety professional, I have come to the conclusi… [+4997 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Tennis: Hewitt hails Davis Cup pulling power as Ecuador, Italy enjoy empty feeling", "description": "Australia captain Lleyton Hewitt hailed the pulling power of the Davis Cup on Saturday as the 28-time champions booked a spot in November's finals where they were joined by Ecuador and Italy who triumphed in empty arenas locked down because of the coronavirus…", "url": "https://www.channelnewsasia.com/news/sport/tennis-hewitt-hails-davis-cup-pulling-power-as-ecuador-italy-12513510", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12513508/16x9/991/557/fe396bd1bc48178c18d6b5a521245506/QX/man-of-the-moment-australia-s-john-millman-1583606707825-4.jpg", "publishedAt": "2020-03-07T18:57:28Z", "content": "PARIS: Australia captain Lleyton Hewitt hailed the pulling power of the Davis Cup on Saturday (Mar 7) as the 28-time champions booked a spot in November's finals where they were joined by Ecuador and Italy who triumphed in empty arenas locked down because of … [+3484 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Live updates: More than 1,200 new cases reported in Italy in past 24 hours; New York has 21 additional cases (Washington Post)", "description": "Washington Post : Live updates: More than 1,200 new cases reported in Italy in past 24 hours; New York has 21 additional cases — New York confirmed 21 new coronavirus cases Saturday, and Italy reported that country's biggest daily increase in infections since…", "url": "https://www.memeorandum.com/200307/p37", "urlToImage": "https://www.washingtonpost.com/resizer/_NynEedTX3IGaiJL1IX_l1Iii6M=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZS6OC7DAGAI6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-07T18:25:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Temisan Amoye", "title": "Coronavirus: Congo to quarantine incoming Italians, Germans, French, Chinese", "description": "The Democratic Republic of Congo, DRC, will quarantine citizens of four countries when they arrive in the country, the Health Ministry has disclosed. The affected countries are Italy, France, Germany, and China, where the outbreak started. In a letter to the …", "url": "https://www.vanguardngr.com/2020/03/coronavirus-congo-to-quarantine-incoming-italians-germans-french-chinese/", "urlToImage": "https://i0.wp.com/www.vanguardngr.com/wp-content/uploads/2020/03/1024x576_1039463.jpg?fit=1024%2C576&ssl=1", "publishedAt": "2020-03-07T19:00:23Z", "content": "The Democratic Republic of Congo, DRC, will quarantine citizens of four countries when they arrive in the country, the Health Ministry has disclosed. The affected countries are Italy, France, Germany, and China, where the outbreak started.\r\nIn a letter to the… [+654 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Source: NHL closing locker rooms to media", "description": "The NHL will close locker room access to the media over concerns of the coronavirus according to a source.", "url": "https://www.espn.com/nhl/story/_/id/28857703/source-nhl-closing-locker-room-access-media-coronavirus", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F0922%2Fr262160_1296x729_16%2D9.jpg", "publishedAt": "2020-03-07T18:48:36Z", "content": "As it monitors the spread of the coronavirus, the NHL plans on closing locker room access to the media, a source told ESPN.\r\nThe new policy came on recommendation by the CDC. Sources told ESPN that the NHL could implement the new mandate as soon as Saturday. … [+1580 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Jeremy Konrad", "title": "'My Spy': Dave Bautista Shifts Release Date Back a Month to April 17th", "description": "My Spy, the upcoming comedy film starring Dave Bautista, has shifted release dates yet again. The film was originally supposed to release in August of lats year, then again from this past January to March 13th, and now it will be delayed again to April 17th. …", "url": "https://www.bleedingcool.com/2020/03/07/my-spy-dave-bautista-shifts-release-date-back-a-month-to-april-17th/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/my-spy-1200x628.jpeg", "publishedAt": "2020-03-07T18:15:22Z", "content": "My Spy, the upcoming comedy film starring Dave Bautista, has shifted release dates yet again. The film was originally supposed to release in August of lats year, then again from this past January to March 13th, and now it will be delayed again to April 17th. … [+1228 chars]"}, {"source": {"id": null, "name": "Legalinsurrection.com"}, "author": "Mike LaChance", "title": "University of Washington Cancels In-Person Classes Until End of Quarter Over Coronavirus", "description": "“Our focus remains keeping this community healthy as we fulfill our important educational, research and service mission.”", "url": "https://legalinsurrection.com/2020/03/university-of-washington-cancels-in-person-classes-until-end-of-quarter-over-coronavirus/", "urlToImage": "https://legalinsurrection.com/wp-content/uploads/2018/12/Campus-News.jpg", "publishedAt": "2020-03-07T18:30:31Z", "content": "The school is going internet based through March 20th. It is the first school to do this.University of Washington switches to virtual classes after staff member tests positive for coronavirus\r\nThe University of Washington has just become the first large U.S. … [+1035 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": null, "title": "Manu Tuilagi sees red as England secure Twickenham Triple Crown with win over Wales", "description": "England temporarily signed off a Guinness Six Nations abbreviated by coronavirus by winning the Triple Crown in a 33-30 victory over Wales that was marred by a red card shown to Manu Tuilagi.", "url": "https://www.independent.ie/sport/rugby/six-nations/manu-tuilagi-sees-red-as-england-secure-twickenham-triple-crown-with-win-over-wales-39024013.html", "urlToImage": "https://www.independent.ie/incoming/2d3a1/39023977.ece/AUTOCROP/w1240h700/england.jfif", "publishedAt": "2020-03-07T19:08:18Z", "content": "England temporarily signed off a Guinness Six Nations abbreviated by coronavirus by winning the Triple Crown in a 33-30 victory over Wales that was marred by a red card shown to Manu Tuilagi.\r\nTries by Anthony Watson and Elliot Daly helped establish a 20-6 ha… [+4172 chars]"}, {"source": {"id": null, "name": "Instyle.com"}, "author": "Alicia Brunker", "title": "Katy Perry Reveals There's \"Friction\" in Her Relationship with Orlando Bloom", "description": "And why that's a good thing.", "url": "https://www.instyle.com/news/katy-perry-orlando-bloom-relationship-friction", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2017%2F09%2F090517-perry-bloom-lead.jpg%3Fitok%3DJ9i3aA2s", "publishedAt": "2020-03-07T18:30:00Z", "content": "Days after announcing she and fiancé Orlando Bloom are expecting their first child together, Katy Perry is opening up about how their partnership is anything but perfect — and why that's a good thing. \r\nWhile speaking with Ryan Seacrest on his radio show on F… [+1491 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "NBC Sports BayArea", "title": "Warriors' Steph Curry, Draymond Green won't play Saturday vs. 76ers", "description": "The Warriors will be down a lot of star power tonight.", "url": "https://sports.yahoo.com/warriors-steph-curry-draymond-green-184809843.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/0uFY6y_emKGZrI8QF8nWbw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/31f07d0c9c23f1dd8ac377e67f3d1387", "publishedAt": "2020-03-07T18:48:09Z", "content": "The Warriors will be down a lot of star power Saturday against the Philadelphia 76ers. \r\nSteph Curry (illness) and Draymond Green (left knee soreness) were listed as out on the NBA's 10:30 a.m. PT injury report, delaying their on-court reunion by at least a g… [+892 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Egypt confirms 33 new cases of coronavirus on Nile cruise ship", "description": "Egypt confirmed 33 new cases of coronavirus on Saturday on a River Nile cruise ship.  None of the new cases were showing symptoms of the virus, Health Minist...", "url": "https://news.yahoo.com/egypt-confirms-33-cases-coronavirus-182812543.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-07T18:28:12Z", "content": "CAIRO (Reuters) - Egypt confirmed 33 new cases of coronavirus on Saturday on a River Nile cruise ship.\r\nNone of the new cases were showing symptoms of the virus, Health Minister Hala Zayed told reporters. Of 12 suspected cases among the crew announced on Frid… [+1157 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By REUTERS", "title": "Coronavirus: What you need to know", "description": "Most cases and deaths have been in China but numbers are mounting outside its borders. ;", "url": "https://www.jpost.com/International/Coronavirus-What-you-need-to-know-620109", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/454880", "publishedAt": "2020-03-07T18:33:15Z", "content": null}, {"source": {"id": null, "name": "Collider.com"}, "author": "Allie Gemmill", "title": "Dave Bautista Pic ‘My Spy’ Gets a New Release Date in Mid-April", "description": "STX Entertainment has pushed back the release date for My Spy once again. My Spy stars Dave Bautista as a confident, tough CIA agent who is forced to team up with a 9-year-old girl (Chloe Coleman) whose family he is tasked to protect. The STX feature also sta…", "url": "https://collider.com/my-spy-release-date-delayed/", "urlToImage": "https://cdn.collider.com/wp-content/uploads/2020/03/my-spy-dave-bautista-social.jpg", "publishedAt": "2020-03-07T18:26:48Z", "content": "STX Entertainment has pushed back the release date for My Spy once again. My Spy stars Dave Bautista as a confident, tough CIA agent who is forced to team up with a 9-year-old girl (Chloe Coleman) whose family he is tasked to protect. The STX feature also sta… [+1870 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Anjuli Bhargava", "title": "Coronavirus to affect aviation industry of both China and wider region", "description": "Coronavirus outbreak will have a severe impact on the tourism and aviation industry of both China and that of the wider region", "url": "https://www.business-standard.com/article/economy-policy/covid-19-indian-aviation-immune-so-far-but-air-india-sale-prospects-hit-120030800017_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-01/02/full/1546374868-5181.jpg", "publishedAt": "2020-03-07T19:10:00Z", "content": "When the SARS virus epidemic broke out in China in 2002, it not only claimed 774 lives, but also took a toll on businesses — among the casualties was also the region’s airline industry. Cathay Pacific, Hong Kong’s main carrier, was within days of shutting dow… [+3267 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Scott Disick capitalizes on coronavirus panic with ‘wash your hands’ apparel", "description": "\"You can thank the lord later, and just WASH YOUR HANDS!\"", "url": "https://pagesix.com/2020/03/07/scott-disick-capitalizes-on-coronavirus-panic-with-wash-your-hands-apparel/", "urlToImage": "https://nyppagesix.files.wordpress.com/2019/01/scott-disick.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-07T19:04:52Z", "content": "Scott Disick is reminding everyone to wash their hands as coronavirus panic intensifies and more cases are confirmed around the world.\r\nThe “Keeping Up With the Kardashians” star, 36, is getting that message across via a new apparel line featuring shirts in t… [+851 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Victoria Kim", "title": "The mentally ill. The disabled. The elderly. The coronavirus hit hardest where the frail gathered", "description": "Outbreaks at a psych ward and a group home for disabled people in South Korea underscores the threat the coronavirus poses to vulnerable populations.", "url": "https://www.latimes.com/world-nation/story/2020-03-07/the-mentally-ill-the-disabled-the-elderly-the-coronavirus-hit-hardest-where-the-frail-were-housed", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/ac86863/2147483647/strip/true/crop/4000x2100+0+283/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa6%2F33%2F5fc0b4714d2b8df74cb970df8c51%2Fvirus-outbreak-south-korea-71483.jpg", "publishedAt": "2020-03-07T19:07:15Z", "content": "But for the notoriety of the killer that claimed his life, the 63-year-old mans death at a rural hospital may have gone completely unnoticed. \r\nAfter two decades confined to a psych ward, he had no known family, friends or other ties to the outside world no o… [+7896 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | WATCH | Soap, space and sanitiser: 6 ways to protect yourself from Covid-19", "description": "With two cases of coronavirus in South Africa, there are a few things you can do to protect yourself. Find out what else you can do in just 90 seconds.", "url": "https://www.news24.com/SouthAfrica/News/watch-soap-space-and-sanitiser-6-ways-to-protect-yourself-from-covid-19-20200307", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10051/7cec3b9ad65b4b96b8ecaec301dcf842.jpg", "publishedAt": "2020-03-07T18:51:03Z", "content": "With two cases of coronavirus in South Africa, there are a few things you can do to protect yourself - and it’s as simple as soap, space and sanitiser. Find out what else you can do in just 90 seconds. \r\nThis video was produced by the Bhekisisa Centre for Hea… [+42 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Gordon For Dailymail.com", "title": "White House economic adviser Larry Kudlow claims coronavirus is 'contained'", "description": "President Donald Trump's chief economic advisor,Larry Kudlow, , has said he doesn't want to panic people over the coronavirus and suggested that the disease is as good as 'contained.'", "url": "https://www.dailymail.co.uk/news/article-8086381/White-House-economic-adviser-Larry-Kudlow-claims-coronavirus-contained.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/07/17/25664436-0-image-a-34_1583603864515.jpg", "publishedAt": "2020-03-07T18:25:51Z", "content": "President Donald Trump's chief economic adviser is continuing to send mixed messages that the COVID-19 coronavirus is under control in the U.S. despite cases in the U.S. continuing to rise. \r\nAs of Saturday afternoon there were more than 366 cases across 21 s… [+3994 chars]"}, {"source": {"id": null, "name": "Theplaylist.net"}, "author": "Rafael Motamayor", "title": "AFI Postpones Life Achievement Award Gala Celebrating Julie Andrews Because Of “Current Events”", "description": "Yet another film industry event bites the dust due to concerns over the spread of coronavirus. The latest victim is the American Film Institute postponing its Life Achievement Award gala to celebrate Julie Andrews, which was scheduled to take place April 25 a…", "url": "https://theplaylist.net/afi-life-achievement-award-coronavirus-20200307/", "urlToImage": "https://theplaylist.net/wp-content/uploads/2019/10/Julie-Andrews-Green-Room-Netflix.jpeg", "publishedAt": "2020-03-07T18:24:16Z", "content": "Yet another film industry event bites the dust due to concerns over the spread of coronavirus. The latest victim is the American Film Institute postponing its Life Achievement Award gala to celebrate Julie Andrews, which was scheduled to take place April 25 a… [+1598 chars]"}, {"source": {"id": null, "name": "Commondreams.org"}, "author": null, "title": "Will the Coronavirus Kill Globalization?", "description": "The Spanish flu helped herald the collapse of the first wave of modern globalization. A century later, could the coronavirus do the same? .. At a dinner party in mid-February, an architect told me that he was having a problem finishing his building projects. …", "url": "https://www.commondreams.org/views/2020/03/07/will-coronavirus-kill-globalization", "urlToImage": "https://www.commondreams.org/sites/default/files/views-article/thumbs/donald_trump_29.jpg", "publishedAt": "2020-03-07T18:49:04Z", "content": "At a dinner party in mid-February, an architect told me that he was having a problem finishing his building projects. It was the carpets.\r\nIt might seem ridiculous to expect that a pathogen, even one that spreads at the rate of a pandemic, could reverse an ec… [+11797 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Rasheed Sobowale", "title": "As virus outbreaks multiply, UN declines to declare pandemic", "description": "As cases of the coronavirus surge in Italy, Iran, South Korea, the U.S. and elsewhere, many scientists say it’s plain that the world is in the grips of a pandemic — a serious global outbreak. The World Health Organization has so far resisted describing the cr…", "url": "https://www.vanguardngr.com/2020/03/as-virus-outbreaks-multiply-un-declines-to-declare-pandemic/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/Coronavirus.jpeg?fit=1250%2C833&ssl=1", "publishedAt": "2020-03-07T19:04:30Z", "content": "A worker in overalls screen for fever at the entrance to a supermarket in Beijing Thursday, Feb. 27, 2020. PHOTO: AP\r\nAs cases of the coronavirus surge in Italy, Iran, South Korea, the U.S. and elsewhere, many scientists say its plain that the world is in the… [+3543 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Kaelan Deese", "title": "MSNBC's Chris Hayes pans Trump's 'disturbing' remarks at CDC", "description": "MSNBC anchor Chris Hayes slammed President Trump's visit to the Centers for Disease Control and Prevention (CDC) on Friday, calling his remarks to reporters \"disturbing.\"Tr...", "url": "https://thehill.com/homenews/media/486441-msnbcs-chris-hayes-pans-trumps-disturbing-cdc-press-conference", "urlToImage": "https://thehill.com/sites/default/files/trumpdonald_03062020getty.jpg", "publishedAt": "2020-03-07T19:08:16Z", "content": "MSNBC anchor Chris Hayes slammed President TrumpDonald John TrumpTrump to award Medal of Freedom to golfers Annika Sorenstam and Gary PlayerDemocratic senator requests classified briefing ahead of Burisma-related subpoena votePoll finds both Republicans and D… [+2348 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Italy coronavirus toll tops 230, cases near 6,000", "description": "Italy has recorded the most deaths of any country outside China and the third-most COVID-19 infections after China and South Korea", "url": "https://www.thehindu.com/news/international/italy-coronavirus-toll-tops-230-cases-near-6000/article31011571.ece", "urlToImage": "https://www.thehindu.com/news/international/plrf60/article31011570.ece/ALTERNATES/LANDSCAPE_615/HEALTH-CORONAVIRUSITALY", "publishedAt": "2020-03-07T18:19:02Z", "content": "from COVID-19 rose by 36 to 233 on Saturday while the number of infections shot up by a single-day record of 1,247 to hit 5,883.\r\nItaly has recorded the most deaths of any country outside China and the third-most COVID-19 infections after China and South Kore… [+979 chars]"}, {"source": {"id": null, "name": "Powerlineblog.com"}, "author": "Steven Hayward", "title": "The Power Line Show, Ep 171: Wot Happened? Who Knows the Thing?", "description": "(Steven Hayward) How in the heck did Joe Biden’s mummified campaign come back to life? Or is it just back to zombie status—still dead, but up and moving and menacing the living? That’s the main subject of this week’s fast-paced, high-energy episode featuring …", "url": "http://www.powerlineblog.com/archives/2020/03/the-power-line-show-ep-171-wot-happened-who-knows-the-thing.php", "urlToImage": "https://www.powerlineblog.com/ed-assets/2020/02/New-podcast-logo-1.png", "publishedAt": "2020-03-07T18:36:53Z", "content": "How in the heck did Joe Biden’s mummified campaign come back to life? Or is it just back to zombie statusstill dead, but up and moving and menacing the living? That’s the main subject of this week’s fast-paced, high-energy episode featuring John Hinderaker as… [+904 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Agence France-Presse, Agence France-Presse", "title": "Coronavirus: Italy virus death toll tops 230 as cases near 6,000", "description": "Italy’s death toll from the novel coronavirus rose by 36 to 233 on Saturday while the number of infections shot up by a single-day record of 1,247 to hit 5,883.Italy has recorded the most deaths of any country outside China and the third-most COVID-19 infecti…", "url": "https://www.scmp.com/news/world/europe/article/3074112/coronavirus-italy-virus-death-toll-tops-230-cases-near-6000", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/08/3076869a-60a0-11ea-be3e-43af5536d789_image_hires_022336.jpg?itok=ECk31txJ&v=1583605442", "publishedAt": "2020-03-07T18:23:37Z", "content": "Published: 2:23am, 8 Mar, 2020\r\nUpdated: 2:23am, 8 Mar, 2020"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Cian Cheesbrough For Mailonline", "title": "Rafa Benitez's Dalian Yifang play out table tennis tournament as they remain STRANDED in Spain", "description": "Rafa Benitez's Dalian Yifang played out a full-team table tennis tournament as they continue to be stranded at their pre-season camp in Spain as coronavirus continues to disrupt.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8086573/Rafa-Benitezs-Dalian-Yifang-play-table-tennis-tournament-remain-STRANDED-Spain.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/07/18/25665312-0-image-a-2_1583604772587.jpg", "publishedAt": "2020-03-07T18:54:38Z", "content": "2020 OLYMPIC GAMES \r\nIn doubt \r\nThe scale of the outbreak in Japan saw senior International Olympic Committee member Dick Pound describe the disease as 'the new war' threatening Tokyo 2020 and he warned the Games may have to be cancelled if the virus was stil… [+13875 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Jon Hernandez", "title": "6 new COVID-19 infections in B.C. as virus spreads inside care home", "description": "Six more people in B.C. have tested positive for COVID-19, including two residents at a long-term care home, provincial health officials have confirmed.", "url": "https://www.cbc.ca/news/canada/british-columbia/6-new-covid-19-infections-in-b-c-as-virus-spreads-inside-care-home-1.5489921", "urlToImage": "https://i.cbc.ca/1.5490004.1583613259!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/lynn-valley-care-centre.jpg", "publishedAt": "2020-03-07T18:41:19Z", "content": "Six more people in B.C. have tested positive for COVID-19, including two residents at a long-term care home, provincial health officials have confirmed.\r\nTwo residents at the Lynn Valley Care Centre in North Vancouver are infected. The facility is now conside… [+1980 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jack de Menezes, Jack de Menezes", "title": "England hang on to defeat Wales and clinch Six Nations Triple Crown", "description": "England secured the Six Nations Triple Crown with their third consecutive victory despite Manu Tuilagi seeing red at Twickenham, with the 33-30 win over rivals Wales giving them a chance of championship glory whenever this tournament comes to an end.", "url": "https://www.independent.co.uk/sport/rugby/rugby-union/international/england-vs-wales-result-score-six-nations-2020-highlights-report-a9384911.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/20/10/breaking-news.png", "publishedAt": "2020-03-07T19:04:00Z", "content": "England secured the Six Nations Triple Crown with their third consecutive victory despite Manu Tuilagi seeing red at Twickenham, with the 33-30 win over rivals Wales giving them a chance of championship glory whenever this tournament comes to an end.\r\nEddie J… [+2334 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "AFP, News Desk, Social Desk, News Desk, AFP, News Desk, AFP, Our Correspondent, Anadolu Agency, Tufail Ahmed", "title": "At least 70 trapped as quarantine facility collapses in eastern China", "description": "At least 38 people have so far been rescued from the rubble of the 80-room Xinjia hotel in coastal Quanzhou city The post At least 70 trapped as quarantine facility collapses in eastern China appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2171448/3-least-70-trapped-quarantine-facility-collapses-eastern-china/", "urlToImage": "https://c.tribune.com.pk/2020/03/2171448-chinaquarantinefacilitycollapsesafpx-1583605236-687-640x480.jpg", "publishedAt": "2020-03-07T18:22:03Z", "content": "Rescuers search for survivors in the rubble of a collapsed hotel in Quanzhou, in China's eastern Fujian province on March 7, 2020. PHOTO: AFP \r\nBEIJING: Around 70 people were trapped after the collapse of a hotel used as a coronavirus quarantine facility in e… [+1657 chars]"}, {"source": {"id": null, "name": "Gonintendo.com"}, "author": "rawmeatcowboy", "title": "Japanese retailers selling out of Coral Switch Lite preorders, Nintendo reveals Coral Switch Lite carrying case", "description": "The regular Switch is getting pretty scarce in Japan due to production lines being impacted by the coronavirus. More and more people have been turning to the Switch Lite, and we could be seeing that happen with the upcoming Coral Switch Lite. Both Amazon Japa…", "url": "https://gonintendo.com/stories/356563-japanese-retailers-selling-out-of-coral-switch-lite-preorders-ni", "urlToImage": "https://gonintendo.com/uploads/story/promo_image/356563/nintendo-switch-lite-coral-case-mns-mar72020.jpg", "publishedAt": "2020-03-07T18:30:00Z", "content": "The regular Switch is getting pretty scarce in Japan due to production lines being impacted by the coronavirus. More and more people have been turning to the Switch Lite, and we could be seeing that happen with the upcoming Coral Switch Lite.\r\nBoth Amazon Jap… [+527 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Boban sacked by AC Milan after public criticism of CEO Gazidis", "description": "ROME: AC Milan have confirmed the sacking of Chief Football Officer Zvonimir Boban after his public spat with the Serie A club’s Chief Executive Officer (CEO) Ivan Gazidis. The Croatian, who played for Milan between 1991 and 2001, has been relieved of his dut…", "url": "https://www.channelnewsasia.com/news/sport/boban-sacked-by-ac-milan-after-public-criticism-of-ceo-gazidis-12513478", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/8696096/16x9/991/557/a8d6d3290493335c3da84e6260e34509/tf/sports.png", "publishedAt": "2020-03-07T18:15:25Z", "content": "ROME: AC Milan have confirmed the sacking of Chief Football Officer Zvonimir Boban after his public spat with the Serie A clubs Chief Executive Officer (CEO) Ivan Gazidis.\r\nThe Croatian, who played for Milan between 1991 and 2001, has been relieved of his dut… [+1697 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "AP Domestic, AP", "title": "Quanzhou hotel housing virus contacts collapses", "description": "A hotel used for medical observation of people who had contact with coronavirus patients, collapsed in southeastern China on Saturday, trapping some 70 people, state media reported. (March 7)", "url": "https://www.usatoday.com/videos/news/nation/2020/03/07/quanzhou-hotel-housing-virus-contacts-collapses/644004000/", "urlToImage": "https://www.gannett-cdn.com/authoring/video-thumbnails/553c06fc-4eea-4182-b592-8a75f9368fd5_poster.jpg?quality=10", "publishedAt": "2020-03-07T18:40:45Z", "content": null}, {"source": {"id": null, "name": "Greenspun.com"}, "author": "philg", "title": "Is the death rate from the Diamond Princess a reasonable worst-case estimate for the coronavirus death rate in the U.S.?", "description": "Apologies for the macabre subject, but with everyone freaking out about the coronavirus, I’m wondering if it makes sense to step back and ask why the Diamond Princess wasn’t a worst-case scenario. The ship held 3,700 people. The virus spread all around the sh…", "url": "https://philip.greenspun.com/blog/2020/03/07/is-the-death-rate-from-the-diamond-princess-a-reasonable-worst-case-estimate-for-the-coronavirus-death-rate-in-the-u-s/", "urlToImage": "https://philip.greenspun.com/blog/wp-content/uploads/2019/02/cropped-DSC07153.jpg", "publishedAt": "2020-03-07T18:40:00Z", "content": "Apologies for the macabre subject, but with everyone freaking out about the coronavirus, I’m wondering if it makes sense to step back and ask why the Diamond Princess wasn’t a worst-case scenario. The ship held 3,700 people. The virus spread all around the sh… [+1616 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Jon Hernandez", "title": "6 new COVID-19 infections announced in B.C.", "description": "Six more people in B.C. have tested positive for COVID-19, including two residents at a long-term care home, provincial health officials have confirmed.", "url": "https://www.cbc.ca/news/canada/british-columbia/6-new-covid-19-infections-announced-in-b-c-1.5489921", "urlToImage": "https://i.cbc.ca/1.5487829.1583606148!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/canada-coronavirus-b-c.jpg", "publishedAt": "2020-03-07T18:41:19Z", "content": "Six more people in B.C. have tested positive for COVID-19, including two residents at a long-term care home, provincial health officials have confirmed.\r\nTwo residents at the Lynn Valley Care Centre in North Vancouver are infected. The facility is now conside… [+1365 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "At Least 230 Coronavirus Deaths In Italy, Cases Near 6000", "description": "Italy's death toll from the novel coronavirus rose by 36 to 233 on Saturday while the number of infections shot up by a single-day record of 1,247 to hit 5,883.", "url": "https://www.ndtv.com/world-news/at-least-230-coronavirus-deaths-in-italy-cases-near-6000-2191666", "urlToImage": "https://c.ndtvimg.com/2020-03/97h4iovo_italy-coronavirus_625x300_07_March_20.jpg", "publishedAt": "2020-03-07T18:29:34Z", "content": "All 22 Italian regions have now registered cases and one new death was reported Friday\r\nRome: Italy's death toll from the novel coronavirus rose by 36 to 233 on Saturday while the number of infections shot up by a single-day record of 1,247 to hit 5,883.\r\nIta… [+1117 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "W. E. Messamore", "title": "Stock Market’s Whiplash Is Eerily Similar to 2008 Crash", "description": "One of Wall Street's legendary economists who predicted the 2008 financial crisis says the stock market is behaving just like it did then. The post Stock Market’s Whiplash Is Eerily Similar to 2008 Crash appeared first on CCN.com", "url": "https://www.ccn.com/weekend-stock-market-whiplash-eerily-similar-to-2008-crash/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/03/Stock-market.jpg", "publishedAt": "2020-03-07T19:00:33Z", "content": "<ul><li>The stock market rallied Wednesday, the second trading session this week to interrupt the frantic selloff that begin mid-February.</li><li>But that doesnt mean the selloff is over. A legendary economist and global strategist says this is exactly what … [+3318 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Rupert Darwall, Opinion Contributor", "title": "Growth will be a thing of the past if businesses choose 'net zero' | TheHill - The Hill", "description": "Investors more obsessed with climate than investor returns, who bully corporations into adopting net-zero business strategies, are doing more than destroying shareholder value.", "url": "https://thehill.com/opinion/energy-environment/486409-growth-will-be-a-thing-of-the-past-if-businesses-choose-net-zero", "urlToImage": "https://thehill.com/sites/default/files/sandersbernie_030520getty_michigan.jpg", "publishedAt": "2020-03-07T19:00:09Z", "content": "Pledging net zero by 2050 to achieve compliance with the Paris Agreement on climate change is all the rage in the corporate world. BP has announced that it will be a net-zero company that is, maintaining a balance between emissions produced and emissions take… [+6616 chars]"}, {"source": {"id": null, "name": "Stripes.com"}, "author": null, "title": "No, you can't use Tito's Vodka to make homemade hand sanitizer", "description": "Vodka is a sought-after remedy for many things, but the coronavirus panic-driven lack of hand sanitizer is forcing one Texas vodka brand to clarify its limitations.", "url": "https://www.stripes.com/news/us/no-you-can-t-use-tito-s-vodka-to-make-homemade-hand-sanitizer-1.621652?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29", "urlToImage": "https://www.stripes.com/polopoly_fs/1.621653.1583605470!/image/image.JPG_gen/derivatives/landscape_490/image.JPG", "publishedAt": "2020-03-07T18:25:46Z", "content": "DALLAS (Tribune News Service) Vodka is a sought-after remedy for many things, but the coronavirus panic-driven lack of hand sanitizer is forcing one Texas vodka brand to clarify its limitations.\r\nAustin, Texas-based Tito's Vodka appears to have spent time rec… [+1964 chars]"}]