[{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "Follow These Twitter Accounts for Accurate Information on the Coronavirus", "description": "Twitter is a great way to get the most up-to-date information on COVID-19. I follow epidemiologists, virologists, health reporters and others—and I always learn something when I check my feed each morning. But there are also a lot of people out there who may …", "url": "https://vitals.lifehacker.com/follow-these-twitter-accounts-for-accurate-information-1842215514", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yunwy5xk68agiwna8u6j.jpg", "publishedAt": "2020-03-09T17:35:00Z", "content": "Twitter is a great way to get the most up-to-date information on COVID-19. I follow epidemiologists, virologists, health reporters and othersand I always learn something when I check my feed each morning. But there are also a lot of people out there who may l… [+2438 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "Disneyland Paris Worker Tests Positive For Coronavirus But No Plans to Close Park", "description": "A maintenance worker at Disneyland Paris in France has tested positive for the new coronavirus that has sickened over 111,000 and killed at least 3,800 people globally, according to a new report from Reuters and France’s Le Parisien. Read more...", "url": "https://gizmodo.com/disneyland-paris-worker-tests-positive-for-coronavirus-1842213980", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jtekbyn2xuwtegopn78b.jpg", "publishedAt": "2020-03-09T17:30:00Z", "content": "A maintenance worker at Disneyland Paris in France has tested positive for the new coronavirus that has sickened over 111,000 and killed at least 3,800 people globally, according to a new report from Reuters and Frances Le Parisien.\r\nThe Disney worker has not… [+1793 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Why Won't the WHO Call This a Pandemic?", "description": "This weekend, the coronavirus outbreak officially reached more than 100 countries, touching every continent but Antartica. China is no longer the only hotspot, with large epidemics currently affecting South Korea, Iran, and Italy, while other countries like t…", "url": "https://gizmodo.com/why-wont-the-who-call-this-a-pandemic-1842213254", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/pnxzrci1icivao4hsnob.jpg", "publishedAt": "2020-03-09T18:10:00Z", "content": "This weekend, the coronavirus outbreak officially reached more than 100 countries, touching every continent but Antartica. China is no longer the only hotspot, with large epidemics currently affecting South Korea, Iran, and Italy, while other countries like t… [+3760 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "CNN.com Wire Service", "title": "Family breaks quarantine attending father-daughter dance, prompting school closure - The Mercury News", "description": "Family breaks quarantine attending father-daughter dance, prompting school closure The Mercury News Family of Missouri's first coronavirus patient broke self-quarantine, attended school dance Fox News Father, sister of coronavirus patient violate self-quarant…", "url": "https://www.mercurynews.com/family-breaks-quarantine-attending-father-daughter-dance-prompting-school-closure", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/03/S121611711.jpg?w=898&h=509", "publishedAt": "2020-03-09T17:57:42Z", "content": "FRONTENAC, MO — The family of the St. Louis County woman who tested positive for COVID-19 broke quarantine and attended a father-daughter school dance Saturday evening at Villa Duchesne, County Executive Sam Page said.\r\nPage said the family was asked to self-… [+6120 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus: All sport in Italy to be suspended because of outbreak", "description": "All sport at all levels in Italy is to be suspended until 3 April at the earliest, the country's Olympic committee announces.", "url": "https://www.bbc.co.uk/sport/51808683", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/13590/production/_97584297_breaking_news.png", "publishedAt": "2020-03-09T17:58:10Z", "content": "All sport at all levels in Italy is to be suspended until 3 April at the earliest, the country's Olympic committee has announced.\r\nThis includes all football matches in Serie A but does not cover Italian clubs or national teams participating in international … [+510 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Bethany Biron)", "title": "Airbnb hosts are advertising 'coronavirus-free' hideaways stocked with toilet paper and essentials amid rising panic in US cities", "description": "Airbnb renters are boasting \"coronavirus-free\" stays stocked with essentials like toilet paper as the coronavirus spreads in the US.", "url": "https://news.yahoo.com/airbnb-hosts-advertising-coronavirus-free-174912057.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/egW3R57vmb4OrHe55e66sg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/ztdrn.KSnwhVzfYQue46MQ--~B/aD0xMjMzO3c9MTY0NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/c80c23bacfa7c388cfba9bf4946f5d2a", "publishedAt": "2020-03-09T17:49:12Z", "content": "Airbnb renters are advertising \"coronavirus-free\" stays.\r\nAirbnb\r\n<ul><li>Airbnb hosts are advertising \"coronavirus-free\" stays in an effort to attract anxious travelers as the coronavirus outbreak grows in the US. \r\n</li><li>Listings everywhere from Colorado… [+3301 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Maria Caspani", "title": "U.S. coronavirus threat fuels demand for traditional herbal remedies", "description": "New York City acupuncturist and herbalist Clayton Shiu says demand for traditional Chinese remedies has surged at his practice since March 1, the day New York announced its first case of the novel coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-herbs-idUSKBN20W2GR", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500897211&w=1200&r=LYNXMPEG281NF", "publishedAt": "2020-03-09T17:52:23Z", "content": "NEW YORK (Reuters) - New York City acupuncturist and herbalist Clayton Shiu says demand for traditional Chinese remedies has surged at his practice since March 1, the day New York announced its first case of the novel coronavirus. \r\n“It was like a light switc… [+3491 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Portugal's TAP grounds 2,500 more flights due to coronavirus", "description": "Portugal's flag carrier TAP suspended an additional 2,500 scheduled flights in March-May after 1,000 announced on Thursday, citing a fall in demand for travel due to the coronavirus outbreak, the company said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-tap-idUSKBN20W2KV", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T17:39:26Z", "content": "LISBON (Reuters) - Portugal’s flag carrier TAP suspended an additional 2,500 scheduled flights in March-May after 1,000 announced on Thursday, citing a fall in demand for travel due to the coronavirus outbreak, the company said on Monday. \r\nThe grounding of t… [+264 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Wall Street pounded by oil crash, virus fears", "description": "Wall Street's main stock indexes plummeted about 5% on Monday, as a slump in oil prices and the rapid spread of the coronavirus amplified fears of a global recession on the anniversary of the U.S. stock market's longest bull run.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/-jNyDeuf8wg/wall-street-pounded-by-oil-crash-virus-fears-idUSKBN20W1IF", "urlToImage": null, "publishedAt": "2020-03-09T17:50:51Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Florida officials call on all travelers returning from overseas to isolate for two weeks", "description": "All travelers returning to Florida from travel to any other country should self-quarantine themselves for 14 days amid the coronavirus outbreak, state health officials said in a statement on their website on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-florida-idUSKBN20W2JL", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T17:27:16Z", "content": "WASHINGTON (Reuters) - All travelers returning to Florida from travel to any other country should self-quarantine themselves for 14 days amid the coronavirus outbreak, state health officials said in a statement on their website on Monday. \r\n“The Florida Depar… [+251 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Jennifer Locke", "title": "Coronavirus: How COVID-19 is affecting the games industry", "description": "The global epidemic has cost thousands of lives and is causing ripple effects across the economy and games industry. The World Health Organization has revealed that as of March 7, there have been 100,000 confirmed coronavirus (COVID-19) cases worldwide since …", "url": "https://www.androidcentral.com/coronavirus-games-industry", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2020/02/playstation-gdc-2019-gxcp.jpg?itok=sk-q2RkV", "publishedAt": "2020-03-09T17:36:23Z", "content": "The World Health Organization has revealed that as of March 7, there have been 100,000 confirmed coronavirus (COVID-19) cases worldwide since it was first reported from Wuhan, China on December 31. Nearly 4,000 people have died as a result. The virus has effe… [+7879 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen and Hilary Brueck", "title": "The World Heath Organization says the threat of a coronavirus pandemic 'has become very real,' as global cases surpass 110,000", "description": "As the coronavirus spreads across the globe, \"the threat of a pandemic has become very real,\" World Health Organization (WHO) officials said Monday. The coronavirus has sickened more than 111,000 people and spread to more than 100 countries. WHO officials emp…", "url": "https://www.businessinsider.com/who-threat-of-coronavirus-pandemic-very-real-2020-3", "urlToImage": "https://i.insider.com/5e66747ffee23d15c62a3fbe?width=1200&format=jpeg", "publishedAt": "2020-03-09T17:36:00Z", "content": "The spread of the new coronavirus has nearly reached pandemic proportions, officials from the World Health Organization (WHO) said Monday.\r\n\"Now that the coronavirus has a foothold in so many countries, the threat of a pandemic has become very real,\" WHO Dire… [+2517 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Mark Sullivan", "title": "Coronavirus hits iPhone sales harder than expected in China", "description": "Chinese government figures say Apple sold less than 500,000 iPhones in China during February. Apple has been thinking about and preparing for the effects of the novel coronavirus on its business for months now. The company has done what it could to keep manuf…", "url": "https://www.fastcompany.com/90474870/coronavirus-hits-iphone-sales-harder-than-expected-in-china?partner=rss&utm_source=twitter.com&utm_medium=social&utm_campaign=rss+fastcompany&utm_content=rss", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-iphone-sales-china.jpg", "publishedAt": "2020-03-09T17:18:22Z", "content": "Apple has been thinking about and preparing for the effects of the novel coronavirus on its business for months now. The company has done what it could to keep manufacturing on track, but one thing it can’t control is Chinese consumers’ appetite for new iPhon… [+1415 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ASHRAF KHALIL / AP", "title": "Hundreds Asked to Self-Quarantine in D.C. After Possible COVID-19 Exposure at Church", "description": "Several hundred people are being asked to self-quarantine after potential exposure to the first confirmed case of the new coronavirus.", "url": "https://time.com/5799681/washington-dc-coronavirus-church/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/washington-dc-covid-19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-09T17:16:59Z", "content": "(WASHINGTON) — Several hundred people are being asked to self-quarantine after potential exposure to the first confirmed case of the new coronavirus in the nation’s capital, identified as the rector of a prominent Episcopal church.\r\nDistrict of Columbia Mayor… [+3354 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tracy Connor", "title": "U.S. Coronavirus Cases Top 400, Putting Thousands in Quarantine", "description": "The long reach of the new coronavirus in the U.S. could be seen Monday in the growing number of people moving into quarantine—from parishioners who shook hands with a priest, to thousands on a cruise ship, to senior aides of a top New York official.With each …", "url": "https://news.yahoo.com/quarantine-nation-coronavirus-puts-thousands-174817589.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/qOfcZccT9p1wL9953PCY.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/mr6iS_giowGoRdIBf.ZxeQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/91b2c9de090a36a51248b65fdc707876", "publishedAt": "2020-03-09T17:48:17Z", "content": "Kena Betancur/Getty\r\nThe long reach of the new coronavirus in the U.S. could be seen Monday in the growing number of people moving into quarantinefrom parishioners who shook hands with a priest, to thousands on a cruise ship, to senior aides of a top New York… [+4847 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ryan Teague Beckwith and Jennifer Epstein", "title": "Biden Says Trump Should ‘Be Quiet’ on Coronavirus", "description": "(Bloomberg) -- Joe Biden said President Donald Trump is spooking the stock market with inaccurate statements about the coronavirus.In an interview with MSNBC...", "url": "https://news.yahoo.com/biden-says-trump-quiet-coronavirus-173059205.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-09T17:30:59Z", "content": "(Bloomberg) -- Joe Biden said President Donald Trump is spooking the stock market with inaccurate statements about the coronavirus.\r\nIn an interview with MSNBC set to air at 10 p.m. Monday, the former vice president said the markets dramatic drop, which led t… [+1588 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julia Naftulin", "title": "Alcohol-free hand sanitizer prices are skyrocketing, but they don't actually work to prevent the coronavirus", "description": "Hand sanitizers from brands like Purell and Germ-X are flying off shelves amidst the coronavirus outbreak, but some of the products don't have the correct germ-killing ingredients. An effective hand sanitizer has at least 60% alcohol content, but some product…", "url": "https://www.businessinsider.com/coronavirus-people-buying-alcohol-free-hand-sanitizer-doesnt-work-2020-3", "urlToImage": "https://i.insider.com/5e665eeafee23d6b7a25cc53?width=1200&format=jpeg", "publishedAt": "2020-03-09T17:36:00Z", "content": "Hand sanitizers from brands like Purell and Germ-X are flying off shelves amidst the coronavirus outbreak, but some people, possibly without realizing, are buying versions that cannot protect them from the germs they're trying to kill.\r\nAccording to ProPublic… [+2714 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "New York State Will Produce Hand Sanitizer Made By Prison Inmates", "description": "State prisoners, paid an average of 65 cents an hour, will make the product to combat shortages due to the coronavirus outbreak.", "url": "https://www.huffpost.com/entry/coronavirus-new-york-hand-sanitizer-prisoners_n_5e666e20c5b6670e72fc2041", "urlToImage": "https://img.huffingtonpost.com/asset/5e6680712600000223b607ed.jpeg?cache=H6MwOcHTLZ&ops=1200_630", "publishedAt": "2020-03-09T17:50:51Z", "content": "New York Gov. Andrew Cuomo (D) said Monday inmates in a state prison will produce 100,000 gallons of a state-branded hand sanitizer to offset reported price gouging by vendors and shortages of the product in government agencies, schools, prisons and mass tran… [+2558 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Junhyup Kwon, Therese Reyes", "title": "We Talk to a Doctor at the Center of South Korea’s Coronavirus Explosion", "description": "South Korea currently has the highest number of coronavirus cases outside China.", "url": "https://www.vice.com/en_us/article/y3mxxv/south-korea-coronavirus-outbreak-medical-doctor-solution-tips", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e65f852c22ac50099c8ffa2/lede/1583750882869-photo.jpeg?crop=1xw:0.8425xh;0xw,0.0788xh&resize=1200:*", "publishedAt": "2020-03-09T17:24:22Z", "content": "This article originally appeared on VICE Asia.\r\nSouth Korea currently has the highest number of novel coronavirus (COVID-19) cases outside China, with 7,478 confirmed infections and 54 deaths as of Monday, March 9 according to the Korea Centers for Disease Co… [+6079 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aaron Holmes", "title": "Uber won't say whether it's notifying people who rode with the New York driver who tested positive for coronavirus", "description": "An Uber driver is currently in isolation in a New York City hospital after testing positive for COVID-19 over the weekend, but it's not clear whether Uber will notify passengers who rode in his vehicle. Uber confirmed to Business Insider that the man who test…", "url": "https://www.businessinsider.com/coronavirus-queens-uber-driver-wont-say-notifying-riders-queens-driver-2020-3", "urlToImage": "https://i.insider.com/5e667e144e15a70b6d0ba125?width=1200&format=jpeg", "publishedAt": "2020-03-09T17:53:29Z", "content": "An Uber driver was confined to isolation in a New York City hospital this weekend after testing positive for COVID-19 — but it's not clear how recently he came in contact with passengers, and Uber won't specify whether people who rode with the driver are bein… [+1628 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Alexander Quon", "title": "COVID-19: N.S. restricts access to long-term care homes for those who travelled internationally - Global News", "description": "COVID-19: N.S. restricts access to long-term care homes for those who travelled internationally Global News Nova Scotia Health Authority to open dedicated COVID-19 testing sites Tuesday CBC.ca N.S. restricts international travellers from visiting long-term ca…", "url": "http://globalnews.ca/news/6650551/covid-19-nova-scotia-long-term-care-homes-restricted-international-travel/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2019/08/cpt11615839-1.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-09T17:44:01Z", "content": "Nova Scotia is moving to restrict access to long-term care homes for those who have travelled internationally, the province announced on Monday.\r\nThe move comes after new national screening protocols were established in response to the ongoing spread of the n… [+3278 chars]"}, {"source": {"id": null, "name": "Flowingdata.com"}, "author": "Nathan Yau", "title": "Flatten the coronavirus curve", "description": "The coronavirus can possibly infect a lot more people than there are those who can provide medical care. But if we slow the spread, and there are fewer people in need of care at the same time, the …", "url": "https://flowingdata.com/2020/03/09/flatten-the-coronavirus-curve/", "urlToImage": "https://i2.wp.com/flowingdata.com/wp-content/uploads/2020/03/flatten-the-curve-smaller.gif?fit=670%2C565&ssl=1", "publishedAt": "2020-03-09T17:55:18Z", "content": "The coronavirus can possibly infect a lot more people than there are those who can provide medical care. But if we slow the spread, and there are fewer people in need of care at the same time, the difference might be less overbearing. This version of the “fla… [+137 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "amiller@businessinsider.com (Anna Medaris Miller)", "title": "CDC: Americans over 60 should stock up on food and medications and avoid venturing out as the coronavirus spreads", "description": "Dr. Nancy Messonnier recommended Americans at higher risk of getting ill from the coronavirus take precautions allowing them to stay close to home.", "url": "https://news.yahoo.com/cdc-americans-over-60-stock-174800265.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/IY0paPAHA58cgH6DI5KDyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/qe20Sc3o144cuIzaWBpWDg--~B/aD0xNjY3O3c9MjIyMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/c6c39c9e439193e264d6d74fc0f60791", "publishedAt": "2020-03-09T17:48:00Z", "content": "health weightloss greens vegetables veggies fruits vegan vegetarian grocery groceries fitness nutrition scale farmers market wellness\r\nCrystal Cox/Business Insider\r\n<ul><li>In a media briefing on Monday about the novel coronavirus, Dr. Nancy Messonnier focuse… [+4289 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "William Cummings, USA TODAY", "title": "'I was quite serious': Rep. Matt Gaetz denies he wore gas mask to make light of coronavirus after constituent dies", "description": "Rep. Matt Gaetz denied he was making light of the coronavirus outbreak when he wore a gas mask in Congress after one of his constituents died.", "url": "https://news.yahoo.com/quite-serious-rep-matt-gaetz-181103452.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/TQi56J98Lz3ceRncJQTSWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xNjAw/https://s.yimg.com/uu/api/res/1.2/el8myU6HDMAgsDmUls8yrw--~B/aD0xMDgwO3c9ODY0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-03/05/5e610825b1172c645e16af6f/5e6108280b56620001968023_864x1080_FES_v1.jpg", "publishedAt": "2020-03-09T18:11:03Z", "content": "Rep. Matt Gaetz denied he was making light of the coronavirus outbreak when he wore a gas mask in Congress after one of his constituents died from the COVID-19 disease. \r\n\"Made light?!?! I was quite serious,\" the Florida Republican tweeted Sunday in response … [+4054 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Shelby Brown", "title": "Bill Gates funds coronavirus home testing kits, report says - CNET", "description": "The at-home tests would reportedly have a two-day turnaround for results.", "url": "https://www.cnet.com/news/bill-gates-funds-coronavirus-home-testing-kits-report-says/", "urlToImage": "https://cnet3.cbsistatic.com/img/3vRjZxfUJFx5kUgJcVu2NZMZLJQ=/756x567/2020/03/09/7f698743-08e4-4eee-9a9f-0e77668738b7/gettyimages-1185999096.jpg", "publishedAt": "2020-03-09T17:25:00Z", "content": "The Bill and Melinda Gates Foundation is working to fight against the coronavirus outbreak. \r\nMichael Cohen / Stringer/ Getty Images\r\nBusiness titan Bill Gates' foundation will reportedly fund home testing kits for those who think they might be infected with … [+995 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Jennifer Locke", "title": "Coronavirus: How COVID-19 is affecting the games industry", "description": "The global epidemic has cost thousands of lives and is causing ripple effects across the economy and games industry. The World Health Organization has revealed that as of March 7, there have been 100,000 confirmed coronavirus (COVID-19) cases worldwide since …", "url": "https://www.windowscentral.com/coronavirus-games-industry", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2020/02/gdc-2019-hero.jpg?itok=2R7sQqZg", "publishedAt": "2020-03-09T17:38:23Z", "content": "The World Health Organization has revealed that as of March 7, there have been 100,000 confirmed coronavirus (COVID-19) cases worldwide since it was first reported from Wuhan, China on December 31. Nearly 4,000 people have died as a result. The virus has effe… [+9163 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "Video about the amazing beetles that shoot blinding acid from their butt", "description": "Oogpister beetles are able to shoot formic acid into the eyes and mouth of would-be predators. In this BBC video you can see an oogpister teach a mongoose a painful lesson. We also meet a defenseless lizard that has developed the same marking pattern on the o…", "url": "https://boingboing.net/2020/03/09/video-about-the-amazing-beetle.html", "urlToImage": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2020/03/Screen-Shot-2020-03-09-at-10.23.58-AM.jpg?fit=700%2C344&ssl=1", "publishedAt": "2020-03-09T17:34:15Z", "content": "Oogpister beetles are able to shoot formic acid into the eyes and mouth of would-be predators. In this BBC video you can see an oogpister teach a mongoose a painful lesson.\r\nWe also meet a defenseless lizard that has developed the same marking pattern on the … [+2725 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Elizabeth C. Tippett, Associate Professor, School of Law, University of Oregon", "title": "Will sick leave protect me if I get ill from coronavirus? 5 questions answered", "description": "Editor’s note: In the coming weeks and months, an outbreak of COVID-19 in the United States could leave workers scrambling to figure out what happens to their job – and their pay – if the new coronavirus prevents them from reporting to work. The answer will d…", "url": "https://news.yahoo.com/sick-leave-protect-ill-coronavirus-171415560.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.YEveQ7wr2f003lZdfNmmw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzkuNDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/xENjjsKNup.sunFv5QP3Ew--~B/aD05NDQ7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_conversation_us_articles_815/4e70a28e146937cb01a15f05ffae8265", "publishedAt": "2020-03-09T17:14:15Z", "content": "Inadequate leave policies means many of us work while sick.PeopleImages/Getty Images\r\nEditors note: In the coming weeks and months, an outbreak of COVID-19 in the United States could leave workers scrambling to figure out what happens to their job and their p… [+5222 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Jason Torchinsky", "title": "Geely Released An Anti-Coronovirus SUV But It's Really About The Same As Tesla's Bioweapon Defense Mode", "description": "I’m not really sure there is any object that feels more like the first quarter of 2020 than a Chinese market SUV with a special air filtration system designed to combat the Coronavirus. The SUV is Geely’s new Icon SUV, a small, mild hybrid crossover with an a…", "url": "https://jalopnik.com/geely-released-an-anti-coronovirus-suv-but-its-really-a-1842213979", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/aw4yfnetehh2ggog2ian.png", "publishedAt": "2020-03-09T17:35:00Z", "content": "Im not really sure there is any object that feels more like the first quarter of 2020 than a Chinese market SUV with a special air filtration system designed to combat the Coronavirus. The SUV is Geelys new Icon SUV, a small, mild hybrid crossover with an act… [+2907 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Justin Baragona", "title": "Fox Hosts Varney and Bartiromo Look to Joe Biden to Calm the Stock Market", "description": "With the stock market experiencing record-setting drops on Monday morning that prompted trading to briefly halt, pro-Trump Fox Business Network hosts Stuart Varney and Maria Bartiromo turned their eyes to... uh... Joe Biden to boost the stocks.During Monday m…", "url": "https://news.yahoo.com/fox-hosts-varney-bartiromo-look-172958450.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/S0klMhcUXOWf_LphiCd6Gg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/2tfzgPVJfcBacfUMjaBfVA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/0f65279c2c5fbbf8b647c6d22295f5d7", "publishedAt": "2020-03-09T17:29:58Z", "content": "With the stock market experiencing record-setting drops on Monday morning that prompted trading to briefly halt, pro-Trump Fox Business Network hosts Stuart Varney and Maria Bartiromo turned their eyes to... uh... Joe Biden to boost the stocks.\r\nDuring Monday… [+2461 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Matt Posky", "title": "Could Coronavirus Complications Make AVs More Popular?", "description": "As the coronavirus epidemic scares populations out of stores, transportation hubs, and stock markets, autonomous vehicles may be getting a leg up in China. Bloomberg reports that Neolix, an autonomous delivery company based in Beijing, has seen a surge in dem…", "url": "https://www.thetruthaboutcars.com/2020/03/could-coronavirus-complications-make-avs-more-popular/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2020/03/neolix-chinese-delivery-pod-610x458.jpg", "publishedAt": "2020-03-09T17:59:40Z", "content": "As the coronavirus epidemic scares populations out of stores, transportation hubs, and stock markets, autonomous vehicles may be getting a leg up in China. BloombergÂ reports thatÂ Neolix, an autonomous delivery company based in Beijing, has seen a surge in d… [+3348 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Reid McCarter on News, shared by Reid McCarter to The A.V. Club", "title": "Defying all logic and reason, the world record for largest Smurf gathering has just been broken", "description": "Humanity refuses to let anything get in the way of our stupidest possible goals. Take, for instance, the fact that thousands of people just got together in the midst of the coronavirus outbreak —an outbreak that’s led to this year’s SXSW being canceled and th…", "url": "https://news.avclub.com/defying-all-logic-and-reason-the-world-record-for-larg-1842216045", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zmyoxejcezewjtxpbqho.jpg", "publishedAt": "2020-03-09T18:08:00Z", "content": "Humanity refuses to let anything get in the way of our stupidest possible goals. Take, for instance, the fact that thousands of people just got together in the midst of the coronavirus outbreakan outbreak thats led to this years SXSW being canceled and the su… [+1943 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Wayfair Stock Tanked Today", "description": "The online furniture specialist recently downplayed coronavirus risks, but investors are still worried.", "url": "https://www.fool.com/investing/2020/03/09/why-wayfair-stock-tanked-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562274/wayfair.jpg", "publishedAt": "2020-03-09T17:55:06Z", "content": "What happened\r\nShares of online furniture retailer Wayfair (NYSE:W) have tanked today, down by 11% as of 1:20 p.m. EDT, after the broader market aggressively sold off. Ongoing coronavirus fears and a steep decline in oil prices are heightening concerns around… [+1583 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Infinera Stock Dropped Today", "description": "Coronavirus fears and a plunge in oil prices are roiling global markets.", "url": "https://www.fool.com/investing/2020/03/09/why-infinera-stock-dropped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562258/stock-chart-down-3.jpg", "publishedAt": "2020-03-09T17:21:03Z", "content": "What happened\r\nShares of Infinera (NASDAQ:INFN) have dropped today, down by 10% as of 12:30 p.m. EDT, amid a broad market sell-off over novel coronavirus fears and a precipitous plunge in oil prices. Investors are becoming increasingly concerned that the COVI… [+1537 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Trivago Stock Plummeted Today", "description": "As coronavirus fears rattle the market, travel companies face greater risks.", "url": "https://www.fool.com/investing/2020/03/09/why-trivago-stock-plummeted-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562265/trivago_products.jpg", "publishedAt": "2020-03-09T17:29:06Z", "content": "What happened\r\nShares of Trivago (NASDAQ:TRVG) have plummeted today, down by 15% as of 1 p.m. EDT, after broader markets tanked. The novel coronavirus outbreak and a drop in oil prices are stoking fears of a global recession. Like many travel companies, Triva… [+1353 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why UPS, FedEx, and Other Logistics Stocks Are Crashing on Monday", "description": "At-best the recovery from coronavirus disruptions seems likely to happen late in 2020.", "url": "https://www.fool.com/investing/2020/03/09/why-ups-fedex-and-other-logistics-stocks-are-crash.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562196/intermodal-crates-at-port-source-getty.jpg", "publishedAt": "2020-03-09T18:04:00Z", "content": "What happened\r\nShares of XPO Logistics(NYSE:XPO) traded down more than 10%, and shares of FedEx(NYSE:FDX) and United Parcel Service(NYSE:UPS) were each down more than 5%, on Monday morning, as COVID-19 coronavirus fears continue to rattle the markets.\r\nAs the… [+2809 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Italy set to suspend all sports including Serie A", "description": "All sporting events in Italy - including all matches in Serie A - have been suspended until April 3 due to the growing spread of coronavirus.", "url": "https://www.skysports.com/football/news/11854/11953959/coronavirus-italy-set-to-suspend-all-sporting-events-until-april-3", "urlToImage": "https://e1.365dm.com/16/08/1600x900/italy-italian-flag-euro-2016_3772220.jpg", "publishedAt": "2020-03-09T17:12:00Z", "content": "All sporting events in Italy - including all matches in Serie A - have been suspended until April 3 due to the growing spread of coronavirus.\r\nItaly's top sports body, the Italian Olympic Committee (CONI) called for all sports to be blocked until April 3 and … [+730 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus and Premier League: Key questions about what lies ahead", "description": "As coronavirus continues to affect sporting events across the world, BBC Sport looks at the key questions about what lies ahead for the Premier League.", "url": "https://www.bbc.co.uk/sport/football/51805836", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1584B/production/_111193188_handsanitizer_getty.jpg", "publishedAt": "2020-03-09T17:25:34Z", "content": "Fans wear disposable face masks prior to the Premier League match between Burnley and Tottenham at Turf Moor\r\nBritish sport remains open for business - but it seems to be just a matter of time before the need to protect the public from the coronavirus outbrea… [+6433 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Trump's focus on coronavirus numbers could backfire: Experts", "description": "Trump has sought to present figures that appear more favourable than reality.", "url": "https://www.aljazeera.com/news/2020/03/trump-focus-coronavirus-numbers-backfire-experts-200309152024881.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/6/a38dc8402d86415abf558fbaaba23b46_18.jpg", "publishedAt": "2020-03-09T17:37:15Z", "content": "US President Donald Trump loves numbers, and the ones he believes illustrate his accomplishments - an unemployment rate at a 50-year-low and stock markets at record highs - have become touchstones in his speeches, rallies and Twitter missives.\r\nThe numbers in… [+5496 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fox News coronavirus outbreak special with Dr. Oz | 'Outnumbered Overtime' - Fox News", "description": "Fox News coronavirus outbreak special with Dr. Oz | 'Outnumbered Overtime' Fox News Cleveland native Dr. Oz has become TV’s go-to expert on coronavirus cleveland.com Dr. Oz's coronavirus survival guide Fox News Dr. Mehmet Oz: 5 coronavirus survival action ste…", "url": "https://www.youtube.com/watch?v=LHHC07j2-8s", "urlToImage": null, "publishedAt": "2020-03-09T18:07:06Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Seattle's Patient Zero Spread Coronavirus Despite Ebola-Style Lockdown", "description": null, "url": "https://www.bloomberg.com/news/features/2020-03-09/how-coronavirus-spread-from-patient-zero-in-seattle", "urlToImage": null, "publishedAt": "2020-03-09T18:00:31Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Gabrielle Coppola", "title": "Auto Industry's Coronavirus Fears Shifting From Supply to Demand", "description": "Automakers and suppliers across the globe have been scrambling to keep production going after the coronavirus shuttered parts plants across China. But now a bigger fear is emerging: Consumers may be in no mood to buy cars and trucks.", "url": "https://www.bloomberg.com/news/articles/2020-03-09/auto-industry-s-coronavirus-fears-shifting-from-supply-to-demand", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iMO0UEhr2JrM/v0/1200x800.jpg", "publishedAt": "2020-03-09T17:42:10Z", "content": "Automakers and suppliers across the globe have been \r\nscrambling to keep production going after the coronavirus shuttered parts plants across China. But now a bigger fear is emerging: Consumers may be in no mood to buy cars and trucks.\r\nWith more than \r\n100,0… [+3830 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Robert Weiss Ph.D., MSW", "title": "The Coronavirus in Psychotherapy", "description": "If you are like me, then right about now you feel fully (and justifiably) alert and preoccupied by the coronavirus.", "url": "https://www.psychologytoday.com/ca/blog/love-and-sex-in-the-digital-age/202003/the-coronavirus-in-psychotherapy", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/coronavirus_2_fb_link_size.jpg?itok=grAH0-mg", "publishedAt": "2020-03-09T18:00:00Z", "content": "If you are like me, then right about now you feel fully (and justifiably) alert and preoccupied by the coronavirus. People like us are now consuming the news faster than the virus can travel, then quickly turning around to bombard everyone one we know with th… [+6086 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Robert Weiss Ph.D., MSW", "title": "The Coronavirus in Psychotherapy", "description": "If you are like me, then right about now you feel fully (and justifiably) alert and preoccupied by the coronavirus.", "url": "https://www.psychologytoday.com/us/blog/love-and-sex-in-the-digital-age/202003/the-coronavirus-in-psychotherapy", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/coronavirus_2_fb_link_size.jpg?itok=grAH0-mg", "publishedAt": "2020-03-09T18:00:00Z", "content": "If you are like me, then right about now you feel fully (and justifiably) alert and preoccupied by the coronavirus. People like us are now consuming the news faster than the virus can travel, then quickly turning around to bombard everyone one we know with th… [+6086 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "John Koetsier, Contributor, John Koetsier, Contributor https://www.forbes.com/sites/johnkoetsier/", "title": "China Smartphone Sales Drop 55%, Thanks To Coronavirus. But E-Commerce And Delivery Businesses Are Booming", "description": "Coronavirus giveth and coronavirus taketh away.", "url": "https://www.forbes.com/sites/johnkoetsier/2020/03/09/china-smartphone-sales-drop-55-thanks-to-coronavirus-but-e-commerce-and-delivery-businesses-are-booming/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e667f1e44b78400068c5caf%2F0x0.jpg", "publishedAt": "2020-03-09T18:05:11Z", "content": "Data from the China Academy of Information and Communications Technology, a research institute that is part of the countrys Ministry of Industry and Information Technology, says that smartphone sales dropped 56% in February 2020 compared to data from 2019.\r\nT… [+2869 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Amid Coronavirus Outbreak, Apple Confirms That It's Okay to Clean Your iPhone With Disinfectant", "description": "Apple today updated its support document on cleaning Apple products with new information that confirms it's okay to to use a 70 percent isopropyl alcohol wipe or Clorox Disinfecting Wipes for the purpose of cleaning germs from your devices. Prior to now, Appl…", "url": "https://www.macrumors.com/2020/03/09/apple-okays-cleaning-iphone-with-disinfectant/", "urlToImage": "https://images.macrumors.com/article-new/2020/03/iphonedisinfectingwipes.jpg", "publishedAt": "2020-03-09T17:44:09Z", "content": "Apple today updated its support document on cleaning Apple products with new information that confirms it's okay to to use a 70 percent isopropyl alcohol wipe or Clorox Disinfecting Wipes for the purpose of cleaning germs from your devices.\r\nPrior to now, App… [+1638 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch again: Boris Johnson says government is moving towards 'delay phase' of coronavirus - The Telegraph", "description": "Watch again: Boris Johnson says government is moving towards 'delay phase' of coronavirus The Telegraph Coronavirus: Boris Johnson to hold emergency Cobra meeting BBC News PM Boris Johnson on fourth coronavirus death and 319 people testing positive in the UK …", "url": "https://www.youtube.com/watch?v=Yc1alOEjDVA", "urlToImage": "https://i.ytimg.com/vi/Yc1alOEjDVA/maxresdefault.jpg", "publishedAt": "2020-03-09T17:27:52Z", "content": null}, {"source": {"id": null, "name": "Texastribune.org"}, "author": "Raga Justin", "title": "Texas coronavirus case confirmed in Collin County - The Texas Tribune", "description": "Texas coronavirus case confirmed in Collin County The Texas Tribune Frisco Man Is First 'Presumptive Positive' Case For Novel Coronavirus In North Texas CBSDFW Frisco Father Has Presumptive Positive Case of Coronavirus, Health Officials Confirm NBC 5 Dallas-F…", "url": "https://www.texastribune.org/2020/03/09/texas-coronavirus-case-confirmed-collin-county/", "urlToImage": "https://thumbnails.texastribune.org/0bhGzOLuOB10Zvtkmw-ZPvjslf4=/1200x804/smart/filters:quality(95)/https://static.texastribune.org/media/files/7e021275c51612caf0ee088a445e54ac/2020-03-09T150204Z_1207439039_RC2FGF9GKRWY_RTRMADP_3_HEALTH-CORONAVIRUS.JPG", "publishedAt": "2020-03-09T17:56:33Z", "content": "A man in Collin County tested positive for the new coronavirus the first case in Texas thought to be caught domestically and not related to a group of Houston-area travelers who took cruises in Egypt in February.\r\nThe Collin County case is the 24th confirmed … [+1496 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "CDC: Coronavirus spread may last into 2021, but impact can be blunted - STAT", "description": "CDC: Coronavirus spread may last into 2021, but impact can be blunted STAT CDC urges at-risk Americans to ‘take action’ by stocking up on food and medicine for coronavirus Yahoo Lifestyle CDC: If you're over 60, stock up on food, stay home, amid coronavirus -…", "url": "https://www.statnews.com/2020/03/09/coronavirus-spread-could-last-into-next-year-but-impact-could-be-blunted-cdc-official-says/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/02/GettyImages-1197113021-1-1024x576.jpg", "publishedAt": "2020-03-09T18:04:38Z", "content": "A top federal health official said Monday that the evolving coronavirus outbreak could persist in the United States into next year, while stressing that public health interventions could still reduce the spread of the virus and cases of illness and death.\r\nAs… [+4372 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Shawn Langlois", "title": "Key Words: Think it’s bad now? Wait a month, says hedge-fund manager Kyle Bass", "description": "Kyle Bass of Hayman Capital Management believes “this too shall pass,” when it comes to the deep selloff in the market on Monday — the Dow was down more than 2,000 points early — but he’s in no hurry to buy up stocks at bargain prices.", "url": "http://www.marketwatch.com/story/think-its-bad-now-wait-a-month-says-hedge-fund-manager-kyle-bass-2020-03-09", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HD766_kyle_b_ZG_20190212072706.jpg", "publishedAt": "2020-03-09T17:46:53Z", "content": "Kyle Bass, chief investment officer of Hayman Capital Management, believes this too shall pass, when it comes to Mondays deep selloff the Dow Jones Industrial Average\r\n DJIA, \r\n -7.16%\r\nwas down more than 2,100 points but hes in no hurry to buy up stocks at b… [+1167 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bethany Biron", "title": "Airbnb hosts are advertising 'coronavirus-free' hideaways stocked with toilet paper and essentials amid rising panic in US cities", "description": "Airbnb hosts are advertising \"coronavirus-free\" stays in an effort to attract anxious travelers as the coronavirus outbreak grows in the US. Listings everywhere from Colorado to Ohio are boasting COVID-19-free getaways, with some noting that they are stocked …", "url": "https://www.businessinsider.com/airbnb-hosts-advertising-coronavirus-free-hideaways-amid-panic-2020-3", "urlToImage": "https://i.insider.com/5e6655dbfee23d695611d658?width=1200&format=jpeg", "publishedAt": "2020-03-09T17:49:12Z", "content": "As fear mounts over spread of the coronavirus — wreaking havoc on the stock market and looming over the international tourism industry — savvy Airbnb hosts are looking to lure travelers with \"COVID-19 free\" stays. \r\nThough concern surrounding global travel re… [+1481 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Donna Fuscaldo)", "title": "Apple's 5G iPhone May Be Delayed Due to Coronavirus", "description": "The device's next update is expected to bring on a supercycle of customer upgrades -- when it arrives.", "url": "https://www.fool.com/investing/2020/03/09/apples-5g-iphone-may-be-delayed-due-to-coronavirus.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562244/coronavirus-apple-supplier-mf.jpg", "publishedAt": "2020-03-09T17:53:00Z", "content": "Apple's  (NASDAQ:AAPL) 5G iPhone is expected to usher in the next  supercycle of upgrade purchases when it's released this fall. But with the novel coronavirus wreaking havoc on the whole tech industry's supply chains -- and the global economy -- that launch … [+1536 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Howard Smith)", "title": "Uber, DoorDash Consider Coronavirus-Related Benefits for Workers", "description": "Potential benefits follow a California bill pushing better treatment for contract workers.", "url": "https://www.fool.com/investing/2020/03/09/uber-and-doordash-are-among-firms-considering-coro.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562168/ridesharing.jpg", "publishedAt": "2020-03-09T17:13:00Z", "content": "Ride-sharing companies Uber (NYSE:UBER) and Lyft (NASDAQ:LYFT), as well as delivery services DoorDash Inc., Postmates Inc., and others are considering helping workers with COVID-19. \r\nThe companies are getting together to determine a plan to pay workers who h… [+1443 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Cory Renauer)", "title": "Coronavirus Concerns Have Big Pharma Working From Home", "description": "After a COVID-19 cluster was traced to a Biogen meeting, two big Massachusetts pharmaceutical companies have asked employees to work remotely when possible.", "url": "https://www.fool.com/investing/2020/03/09/coronavirus-has-big-pharma-working-from-home.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562198/gettyimages-1205778458.jpg", "publishedAt": "2020-03-09T17:20:00Z", "content": "Over the past few days, health officials in Cambridge, Massachusetts, reported on a cluster of 26 cases of COVID-19 that were traced to a Biogen(NASDAQ:BIIB) internal strategy meeting held in late February. In response, Takeda(NYSE:TAK), another global pharma… [+1543 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New York City Mayor Bill de Blasio Gives A Coronavirus Update | NBC News (Live Stream) - NBC News", "description": "New York City Mayor Bill de Blasio Gives A Coronavirus Update | NBC News (Live Stream) NBC News De Blasio says a citywide quarantine a 'possibility' — as are limited school closures New York Post Watch: New York mayor Bill de Blasio addresses coronavirus outb…", "url": "https://www.youtube.com/watch?v=xXh7jUxfdak", "urlToImage": "https://i.ytimg.com/vi/xXh7jUxfdak/maxresdefault.jpg", "publishedAt": "2020-03-09T17:57:32Z", "content": "Watch coronavirus livestream coverage of the outbreak as COVID-19 spreads, impacting markets and daily life across the U.S. and abroad.» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC» Watch more NBC video: http://bit.ly/MoreNBCNews\r\nNBC News is a le… [+603 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "In era of coronavirus, Greek church says Holy Communion will carry on", "description": "Greece's Orthodox Church said that Holy Communion, the partaking of wine soaked in bread from the same chalice for atonement from sins, would continue despite the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-health-coronavirus-greece-church-idUSKBN20W2N1", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500903725&w=1200&r=LYNXMPEG281QZ", "publishedAt": "2020-03-09T18:07:52Z", "content": "ATHENS (Reuters) - Greece’s Orthodox Church said that Holy Communion, the partaking of wine soaked in bread from the same chalice for atonement from sins, would continue despite the coronavirus outbreak. \r\nDebate has raged in deeply religious Greece on whethe… [+1283 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Maharashtra reports coronavirus cases: Pune couple who returned from Dubai", "description": "The two have been kept in the isolation facility at Naidu hospital and their condition is stable.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-reports-coronavirus-cases-pune-couple-who-returned-from-dubai-6307303/", "urlToImage": "https://images.indianexpress.com/2020/03/coronavirus1-6.jpg?w=759", "publishedAt": "2020-03-09T18:10:36Z", "content": "The number of confirmed coronavirus cases in India is now 47. (Express photo)Two people tested positive for coronavirus in Pune, Maharashtra, taking the disease burden to 47 in India on Monday.\r\nThese are the first cases of coronavirus in Maharashtra.\r\nAccord… [+885 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Mary Honkus", "title": "Postmates Announces New Food Delivery Option in Response to Coronavirus", "description": "The coronavirus outbreak hasn’t stopped people from ordering takeout, but Postmates is hoping to make the process safer with the introduction of non-contact delivery. On Friday, the food delivery service announced the new option in a blog post on their websit…", "url": "https://people.com/food/postmates-coronavirus-outbreak-no-contact-option/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fpostmates-contactless-1.png%3Fcrop%3D241px%2C0px%2C2731px%2C1434px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T17:16:48Z", "content": "The coronavirus outbreak hasn’t stopped people from ordering takeout, but Postmates is hoping to make the process safer with the introduction of non-contact delivery.\r\nOn Friday, the food delivery service announced the new option in a blog post on their websi… [+1604 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Melanie Grayce West, Jimmy Vielkind", "title": "Head of N.Y. Port Authority Tests Positive for Coronavirus - The Wall Street Journal", "description": "Head of N.Y. Port Authority Tests Positive for Coronavirus The Wall Street Journal View Full Coverage on Google News", "url": "https://www.wsj.com/articles/n-y-port-authority-director-tests-positive-for-coronavirus-11583770500", "urlToImage": "https://images.wsj.net/im-162224/social", "publishedAt": "2020-03-09T17:43:00Z", "content": "ALBANY, N.Y.The executive director of the Port Authority of New York and New Jersey has tested positive for the novel coronavirus, as the state of New York surpassed Washington state with the most cases in the country, New York Gov. Andrew Cuomo said.\r\n Rick … [+271 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Julie Mazziotta", "title": "Family of Missouri Woman with Coronavirus Broke Quarantine to Attend School Dance", "description": "The family of a Missouri woman with coronavirus broke quarantine to attend a school dance on Saturday, prompting the school to cancel classes. The patient, a woman in her twenties just outside of St. Louis, was confirmed to have coronavirus on Saturday after …", "url": "https://people.com/health/family-of-missouri-woman-with-coronavirus-broke-quarantine-to-attend-school-dance/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcoronavirus-testing.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T18:05:45Z", "content": "The family of a Missouri woman with coronavirus broke quarantine to attend a school dance on Saturday, prompting the school to cancel classes.\r\nThe patient, a woman in her twenties just outside of St. Louis, was confirmed to have coronavirus on Saturday after… [+2192 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Patrick Hipes", "title": "Olympic Flame Lighting Ceremony Will Be Closed To Public Due To Coronavirus Concerns", "description": "The traditional Lighting Ceremony of the Olympic Flame in Greece that kicks off the Olympics season will be held Thursday without spectators owing to coronavirus concerns, organizers said Monday. The Hellenic Olympic Committee also urged local communities to …", "url": "https://deadline.com/2020/03/olympic-flame-lighting-ceremony-closed-to-public-coronavirus-1202877553/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/olympics-torch.jpg?w=1024", "publishedAt": "2020-03-09T17:31:44Z", "content": "The traditional Lighting Ceremony of the Olympic Flame in Greece that kicks off the Olympics season will be held Thursday without spectators owing to coronavirus concerns, organizers said Monday.\r\nThe Hellenic Olympic Committee also urged local communities to… [+1830 chars]"}, {"source": {"id": null, "name": "Autoblog.comhttps"}, "author": "Sven Gustafson", "title": "Cadillac Celestiq electric sedan could top $200,000", "description": "Filed under: Cadillac, Electric, Luxury, sedan Continue reading Cadillac Celestiq electric sedan could top $200,000 Cadillac Celestiq electric sedan could top $200,000 originally appeared on Autoblog on Mon, 9 Mar 2020 14:04:00 EDT. Please see our terms for u…", "url": "https://www.autoblog.comhttps://www.autoblog.com/2020/03/09/cadillac-celestiq-price/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/800x450/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2020/03/09111148/cwc-4949-1.jpg", "publishedAt": "2020-03-09T18:04:00Z", "content": "General Motors teased a slew of new electric vehicles last week at a media event where cameras werent allowed, and now theres more news about the Celestiq, one of the two EVs in the pipeline for Cadillac. Reports suggest it wont come cheap and will retail for… [+2235 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "John Dobosz, Forbes Staff, John Dobosz, Forbes Staff https://www.forbes.com/sites/johndobosz/", "title": "5 Safe Dividend Growth Stocks To Weather The Coronavirus Storm", "description": "The market sell off has created bargains in strong dividend stocks.", "url": "https://www.forbes.com/sites/johndobosz/2020/03/09/5-safe-dividend-growth-stocks-to-weather-the-coronavirus-storm/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F537799082%2F0x0.jpg", "publishedAt": "2020-03-09T17:40:28Z", "content": "Hormel Foods has a strong dividend as well as a line up well known consumer staples like Spam. ... [+] (Photo by Roberto Machado Noa/LightRocket via Getty Images)\r\nLightRocket via Getty Images\r\nStock-market selloffs usually have a banner, something to blame f… [+9266 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Asit Sharma)", "title": "Thor's Margins and Backlog Improve; Management Updates Investors on Coronavirus Impact", "description": "Industry conditions have firmed up, but will COVID-19 stymie Thor's profits this year?", "url": "https://www.fool.com/investing/2020/03/09/thors-margins-and-backlog-improve-management-updat.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562182/rvs-parked-at-pacific-beach.jpg", "publishedAt": "2020-03-09T17:20:00Z", "content": "As recreational vehicle (RV) dealers' inventories continue to normalize, Thor Industries(NYSE:THO) is seeing a return to profitable growth. The manufacturer issued its fiscal second-quarter 2020 earnings report Monday morning. Despite otherwise benign busines… [+4659 chars]"}, {"source": {"id": null, "name": "Barrons.com"}, "author": "Eric J. Savitz", "title": "Apple February iPhone Sales in China Collapsed. A Rebound Could Be Ahead. - Barron's", "description": "Apple February iPhone Sales in China Collapsed. A Rebound Could Be Ahead. Barron's Apple sees China iPhone shipments tank in ‘doomsday’ scenario but bull says to keep the faith MarketWatch iPhone 12 reportedly delayed a month and could miss holiday season Tom…", "url": "https://www.barrons.com/articles/apple-february-iphone-sales-in-china-collapsed-coronavirus-51583772277", "urlToImage": "https://images.barrons.com/im-148587/social", "publishedAt": "2020-03-09T17:45:00Z", "content": "Apple (ticker: AAPL) last month warned investors that due to both supply chain and demand issues in China, it wouldnt hit its previous March quarter revenue guidance of $63 billion to $67 billionand the latest data provides further evidence of the depth of th… [+1601 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Daniel Sparks)", "title": "Why Apple Stock Fell on Monday", "description": "iPhone sales in China reportedly tanked during February.", "url": "https://www.fool.com/investing/2020/03/09/why-apple-stock-fell-on-monday.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562259/why-apple-stock-is-down.jpg", "publishedAt": "2020-03-09T17:27:00Z", "content": "What happened\r\nShares of Apple(NASDAQ:AAPL) were slammed today, with the stock falling as much as 9% at one point. That decline has moderated some, with the stock down 5% as of 12:50 p.m. EDT.\r\nMuch of the tech stock's decline was likely fueled by the market'… [+1111 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/caitlin-yilek", "title": "'Business as usual': White House denies limits on in-person meetings amid coronavirus outbreak - Washington Examiner", "description": "The spread of the coronavirus has not affected White House operations, press secretary Stephanie Grisham said Monday.", "url": "https://www.washingtonexaminer.com/news/business-as-usual-white-house-denies-limits-on-in-person-meetings-amid-coronavirus-outbreak", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/7252e4a/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fd6%2Fe2%2Fd2f224f9463d8295cbcf1636e9dc%2Ftrump.jpg", "publishedAt": "2020-03-09T17:23:00Z", "content": "The spread of the coronavirus has not affected White House operations, press secretary Stephanie Grisham said Monday. \r\nGrisham said reports about the White House directing staff to limit in-person interactions and meetings were completely false. \r\n\"While we … [+837 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Keith Noonan)", "title": "Why Glu Mobile Stock Climbed 20.7% in February", "description": "Strong performance for the video-game company's key franchises propelled gains last month, but shares are sliding in March.", "url": "https://www.fool.com/investing/2020/03/09/why-glu-mobile-stock-climbed-207-in-february.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561052/gettyimages-1191350295.jpg", "publishedAt": "2020-03-09T17:23:00Z", "content": "What happened\r\nGlu Mobile's (NASDAQ:GLUU) strong quarterly results helped it defy the market sell-off driven by concerns about the SARS-CoV-2 novel coronavirus late in February. The video game company's shares rose 20.7% last month, according to data from S&a… [+1729 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Tracy Connor", "title": "Quarantine Nation: Coronavirus Puts Thousands in Isolation", "description": "Kena Betancur/Getty The long reach of the new coronavirus in the U.S. could be seen Monday in the growing number of people moving into quarantine—from parishioners who shook hands with a priest, to thousands on a cruise ship, to senior aides of a top New York…", "url": "https://www.thedailybeast.com/thousands-in-isolation-as-coronavirus-cases-spark-new-quarantines", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3209,w_5706,x_0,y_488/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583776031/GettyImages-1206095839_irseyu", "publishedAt": "2020-03-09T17:48:17Z", "content": "The long reach of the new coronavirus in the U.S. could be seen Monday in the growing number of people moving into quarantinefrom parishioners who shook hands with a priest, to thousands on a cruise ship, to senior aides of a top New York official.\r\nWith each… [+3463 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Grater", "title": "Italy’s Box Office Suffers Disastrous Weekend As Government Closes All Cinemas To Combat Coronavirus", "description": "The Italian film industry was facing up to the worst box office session in its history this weekend, that was until the country’s government issued a decree shuttering all of its cinemas on Sunday (March 8) for almost a month, meaning it became something of a…", "url": "https://deadline.com/2020/03/italys-box-office-disastrous-weekend-government-closes-all-cinemas-combat-coronavirus-1202877598/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/italy-coronavirus.jpg?w=1024", "publishedAt": "2020-03-09T17:15:50Z", "content": "The Italian film industry was facing up to the worst box office session in its history this weekend, that was until the country’s government issued a decree shuttering all of its cinemas on Sunday (March 8) for almost a month, meaning it became something of a… [+1202 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Tommaso Ebhardt, Chiara Remondini", "title": "Ski in Italy? Not This Year as Virus Shuts Slopes Across Alps", "description": "Italy’s ski season is coming to an abrupt end--not due to a lack of snow or cold, but because of concerns about fever.", "url": "https://www.bloomberg.com/news/articles/2020-03-09/ski-in-italy-not-this-year-as-virus-shuts-slopes-across-alps", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iUnvf.wX8EgA/v0/1200x785.jpg", "publishedAt": "2020-03-09T17:53:55Z", "content": "Italy’s ski season is coming to an abrupt end--not due to a lack of snow or cold, but because of concerns about fever.\r\nThough slopes typically remain open into April or even May, the spread of the coronavirus across northern Italy has prompted the country’s … [+1418 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Benjamin VanHoose", "title": "Cristiano Ronaldo Plays 1,000th Game of His Career to Empty Stadium Amid Coronavirus Concerns", "description": "Cristiano Ronaldo achieved a milestone in his soccer career in front of a phantom crowd. On Sunday, the 35-year-old athlete played his 1,000th official game as a professional, bringing his Juventus team to victory over Inter Milan, 2-0. Due to precautionary m…", "url": "https://people.com/sports/cristiano-ronaldo-plays-1000th-game-of-his-career-to-empty-stadium-amid-coronavirus-concerns/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fcristiano-ronaldo-2.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-09T17:29:26Z", "content": "Cristiano Ronaldo achieved a milestone in his soccer career in front of a phantom crowd.\r\nOn Sunday, the 35-year-old athlete played his 1,000th official game as a professional, bringing his Juventus team to victory over Inter Milan, 2-0. Due to precautionary … [+2047 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Julie Gaubert", "title": "Macron strolls Champs Elysées in 'message of confidence' amid coronavirus", "description": "Emmanuel and Brigitte Macron walked hand-in-hand on Paris' Champs-Elysees on Monday \"to send a message of confidence to the French economy\" amid coronavirus.", "url": "https://www.euronews.com/2020/03/09/macron-strolls-champs-elysees-in-message-of-confidence-amid-coronavirus", "urlToImage": "https://static.euronews.com/articles/stories/04/55/70/52/1000x563_cmsv2_f0ac6f96-d883-501f-b9ef-dc2f35c33477-4557052.jpg", "publishedAt": "2020-03-09T17:31:59Z", "content": "French President Emmanuel Macron and First Lady Brigitte Macron walked hand-in-hand on Paris' Champs-Elysees on Monday \"to send a message of confidence to the French economy\" amid the coronavirus outbreak.\r\nFrance, like many other countries, has imposed restr… [+3041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sheena Jones and Eliott C. McLaughlin, CNN", "title": "Head of the New York/New Jersey port authority has coronavirus", "description": "The head of the Port Authority of New York and New Jersey has tested positive for coronavirus, New York Gov. Andrew Cuomo said Monday.", "url": "https://www.cnn.com/2020/03/09/us/port-authority-coronavirus-director-new-york-new-jersey/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200309131524-rick-cotton-port-authority-file-super-tease.jpg", "publishedAt": "2020-03-09T18:05:56Z", "content": "(CNN)The head of the Port Authority of New York and New Jersey has tested positive for coronavirus, New York Gov. Andrew Cuomo said Monday. \r\nExecutive Director Rick Cotton is underself-quarantine working from home, and his senior team will be tested and plac… [+1527 chars]"}, {"source": {"id": null, "name": "Marginalrevolution.com"}, "author": "Tyler Cowen", "title": "America is historically slow to mobilize, but eventually quite effective", "description": "That is the theme of my latest Bloomberg column, and Pearl Harbor, terrorism risk, and the financial crisis stand among the notable examples. Here is one excerpt: It is no accident that America is so often so slow out of the starting gate. The federal governm…", "url": "https://marginalrevolution.com/marginalrevolution/2020/03/america-is-historically-slow-to-mobilize-but-eventually-quite-effective.html", "urlToImage": "https://marginalrevolution.com/wp-content/uploads/2016/10/MR-logo-thumbnail.png", "publishedAt": "2020-03-09T17:45:13Z", "content": "That is the theme of my latest Bloomberg column, and Pearl Harbor, terrorism risk, and the financial crisis stand among the notable examples.  Here is one excerpt:\r\nIt is no accident that America is so often so slow out of the starting gate. The federal gover… [+1578 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Adam K. Raymond", "title": "Lawmakers Push for Recess Amid Coronavirus Outbreak: Report", "description": "Capitol Hill is getting anxious about the arrival of coronavirus.", "url": "http://nymag.com/intelligencer/2020/03/lawmakers-push-for-recess-amid-coronavirus-outbreak-report.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/03/09/09-nancy-pelosi.w1200.h630.jpg", "publishedAt": "2020-03-09T17:27:26Z", "content": "Anxious lawmakers are clamoring for congressional leadership to protect them from coronavirus, with some raising the possibly of recessing for a period of weeks, NBC News reports.\r\nMembers are very nervous, a senior Democratic leadership aide told NBC. Theres… [+2320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Why Trump is congratulating himself on the US coronavirus response", "description": "The US President keeps praising himself for halting arrivals from coronavirus-hit China weeks ago, and claimed on Friday that he had \"stopped\" the contagion -- even though the virus is already marching across America.", "url": "https://www.cnn.com/2020/03/09/world/meanwhile-in-america-march-9-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306180142-01-trump-cdc-0306-super-tease.jpg", "publishedAt": "2020-03-09T17:36:47Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Telegraph Sport", "title": "Brian Moore's Full Contact podcast: Idiotic Joe Marler only has himself to blame for potential ban", "description": "There's just one round left in the 2020 Six Nations and, as fears over coronavirus spread across the continent, we will now be denied the traditional &quot;Super Saturday&quot; after both England and Ireland had their games postponed.", "url": "https://www.telegraph.co.uk/rugby-union/2020/03/09/brian-moores-full-contact-podcast-idiotic-joe-marler-has-blame/", "urlToImage": "https://www.telegraph.co.uk/content/dam/rugby-union/2020/03/09/TELEMMGLPICT000227224085-xlarge_trans_NvBQzQNjv4BqR1gN756bgu-Oq1JkfYLunFR8Iw88tYcABPr4uB-KLnc.jpeg?imwidth=1200", "publishedAt": "2020-03-09T17:57:30Z", "content": "There's just one round left in the 2020 Six Nations and, as fears over coronavirus spread across the continent, we will now be denied the traditional \"Super Saturday\" after both England and Ireland had their games postponed.\r\nNevertheless, there is still plen… [+1273 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": "Digg", "title": "Playing This Deeply Soothing Zamboni Simulator Might Help You Forget How Terrible Everything Is", "description": "The current state of the world is, to put it mildly, not great. And while the internet is a source of bad news, it can also provide a small oasis of calm.", "url": "https://digg.com/2020/zamboni-simulator", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/03/09172450/Screen-Shot-2020-03-09-at-1.23.43-PM-1.jpg", "publishedAt": "2020-03-09T17:37:04Z", "content": "The current state of the world is, to put it mildly, not great. Coronavirus, stock crashes, elections, a weirdly winter-less winter — we could go on. And to be online is to be in the middle of it all, following an endless stream of headlines that send your co… [+708 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Shannon Pettypiece and Hans Nichols and Geoff Bennett and Eamon Javers, CNBC", "title": "Trump to weigh coronavirus stimulus options Monday", "description": "White House and administration officials will present President Donald Trump with a set of economic stimulus options as early as Monday afternoon.", "url": "https://www.nbcnews.com/politics/white-house/trump-weigh-coronavirus-stimulus-options-monday-including-paid-sick-leave-n1153291", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_11/3262116/200309-donald-trump-cs-1233p_3a6c3bf765ca819d41671ac5ef18c176.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-09T17:23:00Z", "content": "WASHINGTON White House and administration officials will present President Donald Trump with a set of economic stimulus options as early as this afternoon, including a plan to offer paid sick leave to those affected by the coronavirus and assistance for the h… [+2903 chars]"}, {"source": {"id": null, "name": "Dpreview.com"}, "author": "Jeremy Gray", "title": "Adobe joins Nikon in withdrawing from this year's NAB Show in Las Vegas due to COVID-19", "description": "Adobe has announced it's withdrawing from this year's NAB Show in Las Vegas due to concerns surrounding COVID-19 (the coronavirus). In the brief statement, embedded below, Adobe says it is disappointed it has to make this decision but says 'the health and saf…", "url": "https://www.dpreview.com/news/6721123062/adobe-joins-nikon-in-withdrawing-from-this-year-s-nab-show-in-las-vegas-due-to-covid-19", "urlToImage": "https://2.img-dpreview.com/files/p/E~TS940x788~articles/6721123062/iu.jpeg", "publishedAt": "2020-03-09T17:45:00Z", "content": "First teased as a prototype back in 2017, Irix has confirmed the 45mm F1.4 manual lens is on the horizon for multiple full-frame camera systems. \r\nNikon says the delay is being caused by issues with acquiring various components used to make its flagship DSLR.… [+4439 chars]"}, {"source": {"id": null, "name": "Ksl.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Update on the latest in business - KSL.com", "description": "Stocks are falling sharply Monday on Wall Street on a combination of coronavirus fears and plunging oil prices, triggering a brief, automatic halt in trading to let investors catch their breath.", "url": "https://www.ksl.com/article/46727897/update-on-the-latest-in-business", "urlToImage": null, "publishedAt": "2020-03-09T17:18:17Z", "content": "FINANCIAL MARKETS\r\nStocks fall sharply on virus fears, oil plunge\r\nNEW YORK (AP) Stocks are falling sharply Monday on Wall Street on a combination of coronavirus fears and plunging oil prices, triggering a brief, automatic halt in trading to let investors cat… [+7079 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: People with mild symptoms to be told to self-isolate", "description": "It comes as the UK prepares to move to the next stage of tackling the coronavirus outbreak.", "url": "https://www.bbc.co.uk/news/uk-51807781", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-09T17:16:56Z", "content": "People who show \"even minor\" signs of respiratory tract infections or a fever will soon be told to self-isolate for seven days as the UK prepares to move to the next stage of tackling the coronavirus outbreak.\r\nThe UK government's chief medical adviser, Prof … [+82 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Zachary Evans, Zachary Evans", "title": "World Health Organization: Threat of Wuhan Coronavirus Becoming a Pandemic ‘Very Real’", "description": "The World Health Organization warned on Monday that the threat of a Wuhan coronavirus pandemic is now \"very real.\"", "url": "https://www.nationalreview.com/news/world-health-organization-threat-of-wuhan-coronavirus-becoming-a-pandemic-very-real/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2020/03/WHO2-.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-03-09T17:30:13Z", "content": null}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Mark Sullivan", "title": "Coronavirus hits iPhone sales harder than expected in China", "description": "Chinese government figures say Apple sold less than 500,000 iPhones in China during February. Apple has been thinking about and preparing for the effects of the novel coronavirus on its business for months now. The company has done what it could to keep manuf…", "url": "https://www.fastcompany.com/90474870/coronavirus-hits-iphone-sales-harder-than-expected-in-china?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-iphone-sales-china.jpg", "publishedAt": "2020-03-09T17:18:22Z", "content": "Apple has been thinking about and preparing for the effects of the novel coronavirus on its business for months now. The company has done what it could to keep manufacturing on track, but one thing it can’t control is Chinese consumers’ appetite for new iPhon… [+1415 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jonathan M. Gitlin", "title": "The 2020 Volkswagen Atlas Cross Sport is how America likes its hatchbacks", "description": "It turns out the US buyer will embrace the hatch as long as you supersize it first.", "url": "https://arstechnica.com/cars/2020/03/the-2020-volkswagen-atlas-cross-sport-is-how-america-likes-its-hatchbacks/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/03/Atlas-Cross-Sport-6-760x380.jpg", "publishedAt": "2020-03-09T17:46:10Z", "content": "1 with 1 posters participating\r\n<ul><li>\r\n They say America doesn't like the hatchback, but what is a VW Atlas Cross Sport but a VW hatchback at 1.16 magnification? \r\n</li><li>\r\n Do you remember the TV show Eureka? I do, and we came across what must have been… [+9600 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus on verge of pandemic, but can be controlled: WHO Chief | ABC News - ABC News", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=ZQs1q1oafyI", "urlToImage": null, "publishedAt": "2020-03-09T17:40:31Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Stevepavlina.com"}, "author": "Steve Pavlina", "title": "This Isn’t January’s Reality Anymore", "description": "The latest news in the world reminds me of this scene from Airplane 2, when a host of problems culminates in panic. Today the we have the coronavirus spreading rapidly, the stock market plummeting to the point that trading was halted, and the usual sexist ego…", "url": "https://www.stevepavlina.com/blog/2020/03/this-isnt-januarys-reality-anymore/", "urlToImage": "https://www.stevepavlina.com/wp-content/uploads/2020/01/Puzzle-1024x684.jpg", "publishedAt": "2020-03-09T17:23:40Z", "content": "The latest news in the world reminds me of this scene from Airplane 2, when a host of problems culminates in panic.\r\nToday the we have the coronavirus spreading rapidly, the stock market plummeting to the point that trading was halted, and the usual sexist eg… [+6211 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Bill Maurer", "title": "Tesla Q1 Push Faces Major Uncertainty", "description": "Europe Q1 2020 registrations not doing well against Q4 2019.How has coronavirus impacted Shanghai Model 3 and Model Y ramps?Economic worries and gas price declines don't help EV shift.", "url": "https://seekingalpha.com/article/4330674-tesla-q1-push-faces-major-uncertainty", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/3/6/1017993-1583530158400232.png", "publishedAt": "2020-03-09T17:28:39Z", "content": "The final three weeks of a quarter generally are the most important ones for electric vehicle maker Tesla (TSLA). As we've seen in the past, this is the time where the company has a large push to deliver as many vehicles as possible. With the stock price havi… [+5412 chars]"}, {"source": {"id": null, "name": "Index.hu"}, "author": "Kovács Zoltán", "title": "Hungary to update coronavirus protocol within 24 hours", "description": "Hungary to update coronavirus protocol within 24 hours - Private clinics may soon start offering coronavirus tests but they will be considered unaccredited, police presence at Budapest hospital extended.", "url": "https://index.hu/english/2020/03/09/coronavirus_press_conference_march_9/", "urlToImage": "https://kep.cdn.index.hu/1/0/3197/31970/319709/31970919_2452603_dbf0b5b20a3773dd6417767d547e4d6a_wm.jpg", "publishedAt": "2020-03-09T17:44:00Z", "content": "The Hungarian coronavirus protocol will change within the next 24 hours to reflect changes in the WHO guidelines and the case definition, private clinics may soon start offering tests (but authorities regard these as unaccredited), and police presence will st… [+10052 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Chuck DeVore, Contributor, Chuck DeVore, Contributor https://www.forbes.com/sites/chuckdevore/", "title": "The Coronavirus Claims Its First Texas Casualty: Austin’s South By Southwest", "description": "...with an announcement on Friday, the annual tech, film and music gathering that was slated to run from March 13 to the 22 was canceled for the first time in its 32-year history, with the COVID-19 virus, more commonly known as the coronavirus, killing what e…", "url": "https://www.forbes.com/sites/chuckdevore/2020/03/09/the-coronavirus-claims-its-first-texas-casualty-austins-south-by-southwest/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1205521602%2F0x0.jpg", "publishedAt": "2020-03-09T18:00:03Z", "content": "SXSW 2020 banners are seen in the Red River Cultural District on March 6, 2020 in Austin Texas. - ... [+] The South by Southwest festival in Texas has been cancelled due to concerns over the spread of the novel coronavirus, organizers and the host city of Aus… [+4770 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian Weller, Contributor, Christian Weller, Contributor https://www.forbes.com/sites/christianweller/", "title": "Black Workers At Greater Risk Amid Growing Recession Worries", "description": "The global spread of the coronavirus has raised the specter of a recession. Less economic growth will mean less hiring and higher unemployment and more economic pain for millions of Americans. Black workers are especially vulnerable to feeling the adverse eff…", "url": "https://www.forbes.com/sites/christianweller/2020/03/09/black-workers-at-greater-risk-amid-growing-recession-worries/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F489934852%2F0x0.jpg", "publishedAt": "2020-03-09T17:39:12Z", "content": "As the threat of a recession increases, Black workers are at greater risks of unemployment\r\nGetty\r\nThe global spread of the coronavirus has raised the specter of a recession. Less economic growth will mean less hiring and higher unemployment and more economic… [+4376 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Chevaz Clarke", "title": "Gates Foundation to provide at-home coronavirus test kits in Seattle", "description": "Washington state has the most confirmed coronavirus cases and deaths in the U.S.", "url": "https://www.cbsnews.com/news/coronavirus-at-home-test-kits-bill-gates-foundation-seattle-area/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/09/bb259ffb-45d3-45cc-8918-952aa0dc659a/thumbnail/1200x630g2/87166ad41e519e56ff43604aa8d684f8/gettyimages-948065752.jpg", "publishedAt": "2020-03-09T17:26:52Z", "content": "The Bill &amp; Melinda Gates Foundation is preparing to roll out at-home coronavirus testing kits to residents of the Seattle area — the community hardest hit by the virus in the U.S. so far.\r\nMore than 500 cases of coronavirus have been confirmed in the U.S.… [+2364 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Katie Heaney", "title": "To Help Slow Coronavirus, Work From Home If You Can", "description": "It’s important to reduce the spread of COVID-19 wherever possible.", "url": "http://www.thecut.com/2020/03/why-you-should-work-from-home-amid-coronavirus-outbreak.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/09/9-wfh.w1200.h630.jpg", "publishedAt": "2020-03-09T17:59:09Z", "content": "There is still a lot we dont know about COVID-19, but as the number of new cases declines in both China and South Korea, there are some lessons: Free and easy testing helps, as do quarantine procedures. (This is not to say that containment doesnt come at a co… [+3354 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Altria Stock Lost 15% Last Month", "description": "Shares of the Marlboro maker dipped on continued weakness in its Juul investment.", "url": "https://www.fool.com/investing/2020/03/09/why-altria-stock-lost-15-last-month.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562240/man-smoking.jpg", "publishedAt": "2020-03-09T17:49:00Z", "content": "What happened\r\nShares of Altria (NYSE:MO) were sliding last month as the company's investment in Juul Labs continued to come under pressure and as the stock fell at the end of the month on the coronavirus-related sell-off.\r\nAccording to data from S&amp;P Glob… [+2190 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kathryn Watson", "title": "Trump, top Republicans scramble to contain economic blow of coronavirus", "description": "Congress is starting to get serious about potential tax breaks for those hurt by the spreading coronavirus.", "url": "https://www.cbsnews.com/news/coronavirus-trump-republicans-scramble-contain-economic-impact/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/09/f4dce3d4-8245-4e41-b768-0e93b9da4d02/thumbnail/1200x630g4/0421bcc25ddfc9d55bb480f524ddd9ca/gettyimages-1206254517.jpg", "publishedAt": "2020-03-09T17:59:51Z", "content": "Washington — The federal government scrambled to minimize the economic fallout from the spreading coronavirus as financial markets fell off a cliff on Monday, with President Trump convening his top economic advisers in Washington and the Republican chairman o… [+2325 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Jeremy Konrad", "title": "Olympic Torch Lighting Closed to Public Amid Coronavirus Concerns", "description": "The Olympic torch lighting ceremony will be closed to the public, organizers announced today. The traditional lighting of the flame in Greece will instead only be witnessed by 100 accredited guests invited by the IOC and the Tokyo 2020 Games Organizing Commit…", "url": "https://www.bleedingcool.com/2020/03/09/olympic-torch-lighting-closed-to-public-amid-coronavirus-concerns/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/olympic-flame-1200x628.jpg", "publishedAt": "2020-03-09T18:07:26Z", "content": "The Olympic torch lighting ceremony will be closed to the public, organizers announced today. The traditional lighting of the flame in Greece will instead only be witnessed by 100 accredited guests invited by the IOC and the Tokyo 2020 Games Organizing Commit… [+1185 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Beth Skwarecki", "title": "Follow These Twitter Accounts For Accurate Information On The Coronavirus", "description": "Twitter is a great way to get the most up-to-date information on COVID-19. I follow epidemiologists, virologists, health reporters and others—and I always learn something when I check my feed each morning. But there are also a lot of people out there who may …", "url": "https://www.lifehacker.com.au/2020/03/follow-these-twitter-accounts-for-accurate-information-on-the-coronavirus/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/yunwy5xk68agiwna8u6j.jpg", "publishedAt": "2020-03-09T17:35:00Z", "content": "Twitter is a great way to get the most up-to-date information on COVID-19. I follow epidemiologists, virologists, health reporters and othersand I always learn something when I check my feed each morning. But there are also a lot of people out there who may l… [+2438 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Greece suspends all flights to northern Italy on coronavirus", "description": "Greece suspended all flights to and from northern Italy as part of measures to combat the spread of coronavirus, its civil aviation authority said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-greece-flights-idUSKBN20W2LL", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T17:50:31Z", "content": "ATHENS (Reuters) - Greece suspended all flights to and from northern Italy as part of measures to combat the spread of coronavirus, its civil aviation authority said on Monday. \r\nThe suspension takes immediate effect and will run until March 23, encompassing … [+414 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Czechs starts border checks of foreigners suspected of having coronavirus", "description": "The Czech government will start border checks of arriving foreign travelers suspected of having coronavirus, Interior Minister Jan Hamacek said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-czech-idUSKBN20W2NB", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T18:09:38Z", "content": "PRAGUE (Reuters) - The Czech government will start border checks of arriving foreign travelers suspected of having coronavirus, Interior Minister Jan Hamacek said on Monday. \r\nThe EU member country has reported 36 cases of the infection, mainly in people who … [+1316 chars]"}]