[{"source": {"id": "engadget", "name": "Engadget"}, "author": "Jon Fingas", "title": "Coronavirus home testing kits are coming to Seattle", "description": "It might soon be much easier and safer to determine if someone has been infected by the novel coronavirus. The team behind a Gates Foundation-backed project told the Seattle Times that it's preparing to deliver home testing kits for the virus to Seattle (wher…", "url": "https://www.engadget.com/2020/03/08/home-test-kits-for-coronavirus-seattle/", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D6481%252C4320%252C623%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1066%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2020-03%252F249e6c10-5f61-11ea-9e7f-a15cf5287a94%26client%3Da1acac3e1b3290917d92%26signature%3Ddc6453b0e4c1968e1dada9708bf8569f328c0378&client=amp-blogside-v2&signature=db3035d5cb5ec79f0ce92f6a2f70588dc5b7dd2d", "publishedAt": "2020-03-09T00:35:00Z", "content": "The test will let people stay at home and reduce the chances of spreading the virus. At the same time, it could also improve the turnaround by processing large numbers of tests in a relatively short space of time. The Gates Foundation's Scott Dowell estimated… [+700 chars]"}, {"source": {"id": null, "name": "Actionnewsnow.com"}, "author": null, "title": "First case of the novel Coronavirus diagnosed in Shasta County - Action News Now", "description": "First case of the novel Coronavirus diagnosed in Shasta County Action News Now At least 234 people have been diagnosed with coronavirus in US, according to CDC | ABC News ABC News Shasta County in Northern California reports its first presumed case of coronav…", "url": "https://www.actionnewsnow.com/content/news/First-case-of-the-novel-Coronavirus-diagnosed-in-Shasta-County-568613851.html", "urlToImage": "http://media.heartlandtv.com/images/MGN_640x360_00305C00-KQKJP.jpg", "publishedAt": "2020-03-09T00:39:00Z", "content": "SHASTA COUNTY, Calif. - Officials with the Shasta County Health and Human Services Agency confirm the first case of Coronavirus in Shasta County has been diagnosed in a man in his 50s. \r\nOfficials say the patient is recovering in isolation at home. The Shasta… [+329 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS3 Staff", "title": "Pennsylvania Announces 2 More Presumptive Positive Coronavirus Cases In Montgomery County - CBS Philly", "description": "Pennsylvania Announces 2 More Presumptive Positive Coronavirus Cases In Montgomery County CBS Philly Two cases of COVID-19 in Montgomery County's location identified; Declaration of Disaster Emergency signed 6abc.com State officials confirm two more presumpti…", "url": "https://philadelphia.cbslocal.com/2020/03/08/coronavirus-two-more-presumptive-positive-cases-montgomery-county/", "urlToImage": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2020/02/coronavirus.png?w=1440", "publishedAt": "2020-03-09T01:00:00Z", "content": "NORRISTOWN, Pa. (CBS) — Two more people from Montgomery County have tested presumptive positive for coronavirus, state health officials say. The Pennsylvania Department of Health on Sunday afternoon announced two adults have mild symptoms of COVID-19 and are … [+1756 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Analyst View: Oil price plunge, coronavirus fears unleash market chaos", "description": "Financial markets have been thrown into turmoil following Saudi Arabia's response to the collapse of OPEC+ talks and concerns about the global spread of the coronavirus.", "url": "https://www.reuters.com/article/us-global-markets-views-analyst-idUSKBN20W02E", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500565902&w=1200&r=LYNXMPEG2801F", "publishedAt": "2020-03-09T00:41:16Z", "content": "TOKYO (Reuters) - Financial markets have been thrown into turmoil following Saudi Arabia’s response to the collapse of OPEC+ talks and concerns about the global spread of the coronavirus. \r\nFollowing are comments from analysts: \r\nJOHN LEKAS, CEO, LEADER CAPIT… [+2836 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: Ted Cruz in self-isolation, Italy in lockdown - CNET", "description": "The latest developments in the COVID-19 outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-ted-cruz-in-isolation-italy-in-lockdown/", "urlToImage": "https://cnet3.cbsistatic.com/img/Ps4pNNwmdQEJ3WpUS-fEpRv9suU=/756x567/2020/03/03/d3e555ce-f996-491f-8f5a-303e9516ddb1/gettyimages-1203669279.jpg", "publishedAt": "2020-03-09T00:45:00Z", "content": "In three months, coronavirus has spread across every continent, except Antarctica, leaving some cities empty and silent.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a newly-identified coronavirus first detected in China in December, has rapi… [+33301 chars]"}, {"source": {"id": null, "name": "Kitco.com"}, "author": "http://www.facebook.com/kitconews", "title": "Yen soars as investors stampede to safety; oil-exposed currencies tank - Kitco NEWS", "description": "Yen soars as investors stampede to safety; oil-exposed currencies tank Kitco NEWS Canadian Dollar Sank, Yen May Gain After Dismal Chinese Trade Data DailyFX Dollar and commodity currencies trampled by oil, virus double shock Investing.com Aso warns against ye…", "url": "https://www.kitco.com/news/2020-03-08/FOREX-Yen-soars-as-investors-stampede-to-safety-oil-exposed-currencies-tank.html", "urlToImage": "https://www.kitco.com/news/images/reuters/Reuters_235x147_V4.jpg", "publishedAt": "2020-03-09T00:25:00Z", "content": "* Yen soars to three-year high, breaks 104/dollar\r\n * Euro jumps 1% as U.S. Treasury futures point to tumbling\r\nyields\r\n * Oil-exposed currencies plunge\r\nSINGAPORE, March 9 (Reuters) - The Japanese yen leapt 1.6%\r\n to a more than three-year high on Monday as … [+1543 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Top U.S. congressional Democrats urge worker protections during coronavirus outbreak", "description": "The two top U.S. congressional Democrats urged President Donald Trump on Sunday to act quicker to protect workers affected by the deadly coronavirus, including free testing for the virus and paid sick leave for those under quarantine orders or caring for chil…", "url": "https://news.yahoo.com/top-u-congressional-democrats-urge-010034402.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/iilO_3twujztF34Esnu98w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/zGvT77wj7GLnK.yYYNHxaA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/5453bfc114abc891c31c539ae8b2d0bf", "publishedAt": "2020-03-09T01:00:34Z", "content": "WASHINGTON (Reuters) - The two top U.S. congressional Democrats urged President Donald Trump on Sunday to act quicker to protect workers affected by the deadly coronavirus, including free testing for the virus and paid sick leave for those under quarantine or… [+1450 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Mike Murphy", "title": "De Blasio urges New Yorkers to work from home, if possible — and no handshakes", "description": "New York Mayor Bill De Blasio said Sunday that people should work from home, if possible, or stagger work schedules in an effort to cut down on crowds amid the coronavirus outbreak.", "url": "http://www.marketwatch.com/story/de-blasio-urges-new-yorkers-to-work-from-home-if-possible-and-no-handshakes-2020-03-08", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB778_nychea_ZG_20200308214132.jpg", "publishedAt": "2020-03-09T00:49:27Z", "content": "New York Mayor Bill De Blasio said Sunday that people should work from home, if possible, or stagger work schedules in an effort to cut down on crowds amid the coronavirus outbreak.In a series of tweets, De Blasio laid out some suggestions on how to protect y… [+1746 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "Virus fears, violence hit International Women's Day rallies - ABS-CBN News", "description": "Virus fears, violence hit International Women's Day rallies ABS-CBN News In Pictures: International Women's Day around the world Aljazeera.com Protests and Celebrations Mark International Women's Day Around the Globe TIME We all benefit from a more gender-equ…", "url": "https://news.abs-cbn.com/overseas/03/09/20/virus-fears-violence-hit-international-womens-day-rallies", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/reuters/03/09/women.jpg", "publishedAt": "2020-03-09T01:04:00Z", "content": "PARIS — Tens of thousands took to the streets across the globe to mark International Women's Day on Sunday despite many events in Asia being canceled because of the new coronavirus outbreak, and attacks on women at some events in Europe and Asia.\r\nWomen were … [+3822 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Sylvester Stallone Wards Off Coronavirus with Latex Gloves While Shopping", "description": "Sylvester Stallone's getting back into the ring -- and this time... he's fighting the coronavirus with a pair of gloves he's probably not all that used to. The legendary actor was spotted at a Whole Foods Sunday in Beverly Hills, where Rocko was…", "url": "https://www.tmz.com/2020/03/08/sylvester-stallone-wears-gloves-latex-grocery-shopping-coronavirus/", "urlToImage": "https://imagez.tmz.com/image/5c/16by9/2020/03/08/5cd9f59c5ac1470b923672ecf6edbd12_xl.jpg", "publishedAt": "2020-03-09T00:48:04Z", "content": "Sylvester Stallone's getting back into the ring -- and this time ... he's fighting the coronavirus with a pair of gloves he's probably not all that used to.\r\nThe legendary actor was spotted at a Whole Foods Sunday in Beverly Hills, where Rocko was snapping up… [+812 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Andy Meek", "title": "It’s a good thing Elon Musk isn’t in charge of the coronavirus response", "description": "Tesla CEO Elon Musk posted a 5-word tweet Friday afternoon that suggested coronavirus panic is \"dumb.\" He's continuing to take a fair amount of criticism on Twitter for this as coronavirus continues to spread. Contrast his statement, meanwhile, with another m…", "url": "https://bgr.com/2020/03/08/coronavirus-panic-elon-musk-twitter/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/03/webp.net-resizeimage-1-1.jpg?quality=98&strip=all", "publishedAt": "2020-03-09T00:27:16Z", "content": "<ul><li>Tesla CEO Elon Musk posted a 5-word tweet Friday afternoon that suggested coronavirus panic is “dumb.”</li><li>He’s continuing to take a fair amount of criticism on Twitter for this as coronavirus continues to spread. Contrast his statement, meanwhile… [+3569 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Bill Gates-funded program will soon offer home-testing kits...", "description": "Bill Gates-funded program will soon offer home-testing kits... (Second column, 2nd story, link ) Related stories: As coronavirus spreads, warnings become more urgent for elderly and frail...", "url": "http://feedproxy.google.com/~r/DrudgeReportFeed/~3/pV8b6jIcuWo/", "urlToImage": null, "publishedAt": "2020-03-09T01:04:37Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Ted Cruz to Self-Quarantine After CPAC Contact with Coronavirus Patient", "description": "Ted Cruz is the first person in Congress to take the big step of self-quarantining after he says he recently came into contact with someone who now has coronavirus. The Texas senator made the announcement Sunday, saying out of an abundance of…", "url": "https://www.tmz.com/2020/03/08/senator-ted-cruz-self-quarantine-contact-handshake-coronavirus-cpac/", "urlToImage": "https://imagez.tmz.com/image/aa/16by9/2020/03/09/aaad4f8b4d694a23bb0d5b4644f12465_xl.jpg", "publishedAt": "2020-03-09T00:26:50Z", "content": "Ted Cruz is the first person in Congress to take the big step of self-quarantining after he says he recently came into contact with someone who now has coronavirus.\r\nThe Texas senator made the announcement Sunday, saying out of an abundance of caution ... he'… [+1626 chars]"}, {"source": {"id": null, "name": "Kxl.com"}, "author": null, "title": "New Recommendations For Oregon Schools After Student Tests Positive In Hillsboro - 750 KXL", "description": "New Recommendations For Oregon Schools After Student Tests Positive In Hillsboro 750 KXL Coronavirus outbreak: Oregon governor, health officials to give update on COVID-19 response Global News Gov. Kate Brown declares coronavirus state of emergency, announces…", "url": "https://www.kxl.com/new-recommendations-for-oregon-schools-after-student-tests-positive-in-hillsboro/", "urlToImage": "https://www.kxl.com/wp-content/uploads/2020/03/Oregon-Coronavirus-Graphic-1.jpg", "publishedAt": "2020-03-09T00:57:00Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Chun Han Wong", "title": "Beijing Portrays President Xi Jinping as Hero of Coronavirus Fight...", "description": "Beijing Portrays President Xi Jinping as Hero of Coronavirus Fight... (First column, 6th story, link ) Related stories: 2020 hopefuls keep up campaigns for now... Dems twice as likely as Republicans to call imminent threat... Robbers wearing surgical masks ro…", "url": "https://www.wsj.com/articles/beijing-portrays-president-as-hero-of-coronavirus-fight-11583678054", "urlToImage": "https://images.wsj.net/im-161991/social", "publishedAt": "2020-03-09T00:25:37Z", "content": "HONG KONGAs Chinese authorities voiced confidence they were containing the countrys coronavirus outbreak, the official Xinhua News Agency meticulously chronicled President Xi Jinpings personal battle against the epidemicfrom visiting front-line medical worker… [+259 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Growing Fears Over Response To Coronavirus As Number Of Confirmed Cases Soar | NBC Nightly News - NBC News", "description": "Growing Fears Over Response To Coronavirus As Number Of Confirmed Cases Soar | NBC Nightly News NBC News Administration officials seek to offer consistent message amid shifting coronavirus situation | TheHill The Hill Coronavirus: Trump's optimism at odds wit…", "url": "https://www.youtube.com/watch?v=GLsXcv5zouQ", "urlToImage": "https://i.ytimg.com/vi/GLsXcv5zouQ/hqdefault.jpg", "publishedAt": "2020-03-09T00:20:35Z", "content": "Dr. Anthony Fauci said he was concerned about community spread and that the administration needs to take whatever action is appropriate to contain the outbreak. President Trump has stayed optimistic about the outbreak, saying he has a perfectly coordinated pl… [+952 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fast moving developments in the coronavirus outbreak - ABC News", "description": "Fast moving developments in the coronavirus outbreak ABC News Coronavirus in New York: New Rochelle mayor gives update from ground zero of state outbreak CBS News How virus hunters determine an outbreak's origins ABC News Precautions to take at work during th…", "url": "https://www.youtube.com/watch?v=ya3Pqasvyno", "urlToImage": "https://i.ytimg.com/vi/ya3Pqasvyno/maxresdefault.jpg", "publishedAt": "2020-03-09T01:01:22Z", "content": "33 states and Washington D.C. have confirmed cases, two more today, and the death toll rising to 21 victims in the United States.\r\nWATCH THE FULL EPISODES OF 'WORLD NEWS TONIGHT':https://bit.ly/35ZFVjm\r\nWATCH OTHER FULL EPISODES OF WORLD NEWS TONIGHT:http://a… [+144 chars]"}, {"source": {"id": null, "name": "Kmov.com"}, "author": "Dan Greenwald, Sara  Bannoura", "title": "St. Louis coronavirus: Father took daughter to Villa dance, disobeying quarantine and prompting school closure, Page says - KMOV.com", "description": "St. Louis coronavirus: Father took daughter to Villa dance, disobeying quarantine and prompting school closure, Page says KMOV.com Villa Duchesne cancels school Monday; health officials tracking history and contacts of first coronavirus case STLtoday.com Woma…", "url": "https://www.kmov.com/news/st-louis-coronavirus-father-took-younger-daughter-to-villa-dance/article_41ec34a4-6179-11ea-b3e3-6fbf809e7778.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kmov.com/content/tncms/assets/v3/editorial/a/ed/aed6df1d-2781-52d2-af16-187f4987b302/5e65787abedf3.image.jpg?resize=1120%2C630", "publishedAt": "2020-03-09T00:45:00Z", "content": "FRONTENAC, Mo. (KMOV.com) St. Louis County Executive Sam Page said the coronavirus patient's father disobeyed quarantine and went to a school dance with his other daughter Saturday evening. \r\nPage said the family was asked to self-quarantine on Thursday, Marc… [+3915 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Saudi Arabia reports four new coronavirus cases", "description": "Saudi Arabia reported four new coronavirus cases on Monday, bringing the total of registered cases to 15, its health ministry said in a statement.", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/OQFGfb2wEug/saudi-arabia-reports-four-new-coronavirus-cases-idUSKBN20W03O", "urlToImage": null, "publishedAt": "2020-03-09T01:09:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Should Americans prepare for a lockdown like China and Italy? - ABC News", "description": "Should Americans prepare for a lockdown like China and Italy? ABC News Italy quarantine resident: 'It's really important to be responsible in this moment' BBC News Italy plans large-scale quarantine in response to coronavirus outbreak Fox News Italy to quaran…", "url": "https://www.youtube.com/watch?v=vuW37m_Uj28", "urlToImage": "https://i.ytimg.com/vi/vuW37m_Uj28/maxresdefault.jpg", "publishedAt": "2020-03-09T01:04:26Z", "content": "ABC News Chief Medical Correspondent answers these questions on what we should expect from the coronavirus outbreak in the U.S.\r\nWATCH THE FULL EPISODES OF 'WORLD NEWS TONIGHT':https://bit.ly/35ZFVjm\r\nWATCH OTHER FULL EPISODES OF WORLD NEWS TONIGHT:http://abc… [+136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Ted Cruz will self-quarantine after interacting with individual with coronavirus - CNN", "description": "Ted Cruz will self-quarantine after interacting with individual with coronavirus CNN Ted Cruz to stay at home after 'brief' interaction with coronavirus patient at CPAC Fox News Ted Cruz shook hands with infected CPAC attendee | TheHill The Hill Ted Cruz will…", "url": "https://www.cnn.com/2020/03/08/politics/ted-cruz-coronavirus-cpac/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170924153209-ted-cruz-file-super-tease.jpg", "publishedAt": "2020-03-09T00:33:44Z", "content": "Washington (CNN)Sen. Ted Cruz announced Sunday he will self-quarantine in Texas after interacting with an individual who tested positive for the novel coronavirus at last week's Conservative Political Action Conference.\r\nCruz, the first member of Congress to … [+1873 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Benet Koleka", "title": "Albania confirms first coronavirus cases, in father and son back from Italy", "description": "Albania reported its first coronavirus infections on Monday, in a father and son who had returned from Italy.", "url": "https://www.reuters.com/article/us-health-coronavirus-albania-idUSKBN20W012", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-09T00:23:32Z", "content": "TIRANA (Reuters) - Albania reported its first coronavirus infections on Monday, in a father and son who had returned from Italy. \r\nThe two were in stable condition and they did not have complications, the health ministry said just after midnight on \r\nBefore t… [+238 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Mainland China reports 40 new cases of coronavirus", "description": "Mainland China had 40 new confirmed cases of coronavirus infections on Sunday, the country's National Health Commission said on Monday, down from 44 cases a day earlier.", "url": "https://www.reuters.com/article/us-health-coronavirus-china-toll-idUSKBN20W00Y", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500560357&w=1200&r=LYNXMPEG2800E", "publishedAt": "2020-03-09T00:22:10Z", "content": "BEIJING (Reuters) - Mainland China had 40 new confirmed cases of coronavirus infections on Sunday, the country’s National Health Commission said on Monday, down from 44 cases a day earlier. \r\nThat brings the total accumulated number of confirmed cases in main… [+345 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Britain sets up team to tackle coronavirus disinformation", "description": "The British government said on Monday it had set up a team to tackle \"interference and disinformation\" around the spread of coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-disinforma-idUSKBN20W00S", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500559965&w=1200&r=LYNXMPEG2800B", "publishedAt": "2020-03-09T00:18:37Z", "content": "LONDON (Reuters) - The British government said on Monday it had set up a team to tackle “interference and disinformation” around the spread of coronavirus. \r\nBritain has so far confirmed 273 cases of the virus and three deaths. Prime Minister Boris Johnson is… [+889 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Senator Ted Cruz Self-Quarantines After Interacting With CPAC Attendee Who Tested Positive For Coronavirus", "description": "As the world closely watches the spread of the coronavirus, everyone is taking precautions — including Senator Ted Cruz. He recently took to Twitter on Sunday to reveal that he recently shook hands with someone at CPAC who had tested positive for COVID-19. Cr…", "url": "https://deadline.com/2020/03/senator-ted-cruz-self-quarantines-cpac-coronavirus-1202877150/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/ted-cruz-e1583712487725.jpg?w=1000", "publishedAt": "2020-03-09T00:20:01Z", "content": "As the world closely watches the spread of the coronavirus, everyone is taking precautions — including Senator Ted Cruz. He recently took to Twitter on Sunday to reveal that he recently shook hands with someone at CPAC who had tested positive for COVID-19.\r\nC… [+1624 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Major lockdown in Italy from coronavirus - ABC News", "description": "Banning travel for a quarter of the population and closing public gatherings after at least 366 people have died from the virus in Italy. WATCH THE FULL EPIS...", "url": "https://www.youtube.com/watch?v=TlP6Tlj04T4", "urlToImage": "https://i.ytimg.com/vi/TlP6Tlj04T4/maxresdefault.jpg", "publishedAt": "2020-03-09T01:04:20Z", "content": "Banning travel for a quarter of the population and closing public gatherings after at least 366 people have died from the virus in Italy.\r\nWATCH THE FULL EPISODES OF 'WORLD NEWS TONIGHT':https://bit.ly/35ZFVjm\r\nWATCH OTHER FULL EPISODES OF WORLD NEWS TONIGHT:… [+143 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Denise Roland, Drew Hinshaw", "title": "Era of 'Social Distancing' Begins...", "description": "Era of 'Social Distancing' Begins... (Top headline, 4th story, link ) Related stories: 10-year Treasury below 0.5%... Anxiety grips companies across world as virus spreads... Ted Cruz self-quarantines after contact at CPAC... Inside Administration, Debate Rag…", "url": "https://www.wsj.com/articles/social-distancing-is-new-coronavirus-buzz-phrase-does-it-work-11583524419", "urlToImage": "https://images.wsj.net/im-161498/social", "publishedAt": "2020-03-09T00:25:36Z", "content": "Political leaders in the democratic world are grappling with a difficult balancing act in a bid to contain the coronavirus: when to pull the trigger on measures like closing schools and canceling public gatherings without risking social and economic backlash?… [+85 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Anita Chabria, Rong-Gong Lin II, Alex Wigglesworth", "title": "California has 114 coronavirus cases, L.A. County has 14: Here is what you need to know", "description": "California has 114 coronavirus cases, L.A. County has 14: Here is what you need to know", "url": "https://www.latimes.com/california/story/2020-03-08/california-has-114-coronavirus-cases-l-a-county-has-14-here-is-what-you-need-to-know", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/06f8bf7/2147483647/strip/true/crop/5184x2722+0+583/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2F0d%2F20aa9d484144a8e2961f00e40355%2Fepa-rex-californias-response-to-first-c-10569239a.JPG", "publishedAt": "2020-03-09T00:40:01Z", "content": "The number of coronavirus cases rose to 114 on Sunday, as officials continued to report new cases around the state.\r\nRiverside County declared an emergency declaration after it was announced a patient was being treated at a Rancho Mirage hospital.\r\nLos Angele… [+1198 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Global Health Security Team, Annelies Gartner", "title": "coronavirus uk latest news italy covid 19 deaths cases update", "description": "A decision by Italian authorities to place 16 million people into coronavirus quarantine descended into chaos on Sunday night as dozens of flights from affected areas were permitted to land in Britain.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-uk-latest-news-italy-covid-19-deaths-cases-update/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/09/TELEMMGLPICT000227321567-xlarge_trans_NvBQzQNjv4BqRQSYshNMi5jQhKAvOcPkgelocizkaa61lMmyDG7lymY.jpeg?imwidth=1200", "publishedAt": "2020-03-09T01:10:21Z", "content": "A specialist unit to counter disinformation about the coronavirus outbreak has been set up by the Government.\r\nWhitehall teams have been brought together to provide a comprehensive picture of the extent, scope and impact of fake news circulating on Covid-19.\r… [+646 chars]"}, {"source": {"id": null, "name": "Twit.tv"}, "author": "TWiT", "title": "TWiT 761: The Esperanto of Time", "description": "Coronavirus Craziness: The Pope is OK, SXSW canceled, contractors can't get n95 masks, Chinese carmakers shut down The response to Coronavirus - big tech sends workers home, but restaurant workers have to keep the slinging hash Woz is NOT Patient Zero Countri…", "url": "https://twit.tv/shows/this-week-in-tech/episodes/761", "urlToImage": "https://elroy.twit.tv/sites/default/files/images/episodes/814302/hero/edit.00_39_06_08.still004.jpg", "publishedAt": "2020-03-09T00:20:13Z", "content": "Download Options\r\n(Right-click and Save As... to download)"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Toluse Olorunnipa, Josh Dawsey and Juliet Eilperin, The Washington Post", "title": "Close call threatens to upend Trump's routine...", "description": "WASHINGTON - A growing sense of concern and uncertainty about the reach of the novel coronavirus has begun to take hold in the White House, after an attendee at a recent political conference where President Donald Trump spoke tested positive for covid-19, the…", "url": "http://www.washingtonpost.com/politics/coronavirus-case-at-cpac-brings-outbreak-closer-to-trump-threatening-to-upend-his-routine-amid-reelection-bid/2020/03/08/8e3ba384-6170-11ea-912d-d98032ec8e25_story.html", "urlToImage": "https://www.thehour.com/img/pages/article/opengraph_default.jpg", "publishedAt": "2020-03-09T01:04:36Z", "content": "WASHINGTON - A growing sense of concern and uncertainty about the reach of the novel coronavirus has begun to take hold in the White House, after an attendee at a recent political conference where President Donald Trump spoke tested positive for covid-19, the… [+9828 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Matt Wilstein", "title": "Donald Trump Jr. Defends ‘Hyperbole’ About Democrats and Coronavirus", "description": "Just over a week ago, as the severity of the worldwide coronavirus outbreak was just starting to become apparent, Donald Trump Jr. went on Fox & Friends and said this about Democrats: “Anything that they can use to try to hurt Trump, they will… But for them t…", "url": "https://www.thedailybeast.com/donald-trump-jr-defends-hyperbole-about-democrats-and-coronavirus", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583713948/JR_nkx8iq", "publishedAt": "2020-03-09T00:32:59Z", "content": "Just over a week ago, as the severity of the worldwide coronavirus outbreak was just starting to become apparent, Donald Trump Jr. went on Fox &amp; Friends and said this about Democrats: Anything that they can use to try to hurt Trump, they will But for them… [+1061 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Brooke Sjoberg", "title": "Facebook is banning ads for face masks amid coronavirus", "description": "Facebook wants to cut down on people profiting from coronavirus fear. The post Facebook is banning ads for face masks amid coronavirus appeared first on The Daily Dot.", "url": "https://www.dailydot.com/debug/facebook-coronavirus-face-mask-ads/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/Facebook-coronavirus-face-mask-ads.jpg", "publishedAt": "2020-03-09T00:35:51Z", "content": "In a statement update from Facebook on Friday, the social media platform announced it would be removing ads and marketplace listings for medical face masks amid the coronavirus outbreaks. \r\nThe scarcity of masks resulting from mass panic has made them difficu… [+846 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Australia Tourism Will Take 3 Years to Recover: Tourism & Transport Forum CEO", "description": "Mar.08 -- Margy Osmond, chief executive officer at Tourism & Transport Forum, discusses how the coronavirus has impacted Australian tourism and her outlook for the sector. She speaks on “Bloomberg Markets: Asia.”", "url": "https://finance.yahoo.com/video/australia-tourism-3-years-recover-004907666.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/5TW6lNviI8oBaAQbeE35uA--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/09/5e659795da8e834b4bf4c2ee/5e659795da8e834b4bf4c2ef_o_U_v2.jpg", "publishedAt": "2020-03-09T00:49:07Z", "content": "Mar.08 -- Margy Osmond, chief executive officer at Tourism &amp; Transport Forum, discusses how the coronavirus has impacted Australian tourism and her outlook for the sector. She speaks on Bloomberg Markets: Asia."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Britain sets up team to tackle coronavirus disinformation", "description": "The British government said on Monday it had set up a team to tackle \"interference and disinformation\" around the spread of coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-disinforma-idUSKBN20W00S", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500559965&w=1200&r=LYNXMPEG2800B", "publishedAt": "2020-03-09T00:18:37Z", "content": "LONDON (Reuters) - The British government said on Monday it had set up a team to tackle “interference and disinformation” around the spread of coronavirus. \r\nBritain has so far confirmed 273 cases of the virus and three deaths. Prime Minister Boris Johnson is… [+889 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Victoria's coronavirus cases rise to 15", "description": "Victoria's official tally of COVID-19 cases rises to 15, after three more cases are diagnosed, including two people who had recently travelled to the United States and one person who had recently returned from Iran.", "url": "https://www.abc.net.au/news/2020-03-09/victoria-records-new-coronavirus-covid-19-cases/12038048", "urlToImage": "https://www.abc.net.au/news/linkableblob/8413676/data/abc-news-og-data.jpg", "publishedAt": "2020-03-09T00:48:44Z", "content": "Updated \r\nMarch 09, 2020 12:01:07\r\nVictoria's official tally of COVID-19 cases has risen to 15, after three more cases were diagnosed, including two people who had recently travelled to the United States and one person who had recently returned from Iran.\r\nHe… [+1113 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Giancarlo Sopo", "title": "Cruz says he interacted with CPAC attendee with coronavirus, but 'extremely low' chances he's sick", "description": "U.S. Senator Ted Cruz (R-Texas) announced on Sunday evening that he came in contact with the Conservative Political Action Conference attendee who tested positive for the coronavirus. The individual is believed to have been carrying the illness while at CPAC …", "url": "https://www.theblaze.com/news/ted_cruz_coronavirus_cpac", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg2NjczMS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU4NDcwNzAyMX0.DjP1AgSl3qEk_jgkghppn3Z-8oT2U5SKKYyJ2otyLmI/img.jpg?width=1200&coordinates=0%2C85%2C0%2C86&height=600", "publishedAt": "2020-03-09T00:49:01Z", "content": "U.S. Senator Ted Cruz (R-Texas) announced on Sunday evening that he came in contact with the Conservative Political Action Conference attendee who tested positive for the coronavirus. The individual is believed to have been carrying the illness while at CPAC … [+3555 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "China Will Continue to Ease Policies, Standard Chartered Says", "description": "Mar.08 -- Lan Shen, economist at Standard Chartered, talks about China's economy and policies. China’s exports fell more than expected in the first two months of this year as the coronavirus outbreak led to extended holidays, depressed factory output, and blo…", "url": "https://finance.yahoo.com/video/china-continue-ease-policies-standard-005704217.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QA6ouou7m.3B5MQOD7ca.g--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/09/5e6599f8cbde736af98d2602/5e6599f8cbde736af98d2603_o_U_v2.jpg", "publishedAt": "2020-03-09T00:57:04Z", "content": "Mar.08 -- Lan Shen, economist at Standard Chartered, talks about China's economy and policies. Chinas exports fell more than expected in the first two months of this year as the coronavirus outbreak led to extended holidays, depressed factory output, and bloc… [+105 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " A Look At Seattle, The City At Epicenter Of The Coronavirus Outbreak In The U.S. via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_96c01e5e38891dffcdd7b87a3490b723", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-09T00:40:16Z", "content": "St. Louis Blues, Justin Faulk, Chicago Blackhawks, Craig Berube\r\nCHICAGO Justin Faulk, who missed the Blues game with New Jersey on Friday, could miss a second game with his upper- body injury. Coach Craig..."}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Kenneth Garger", "title": "Ted Cruz self-quarantining after meeting coronavirus-stricken CPAC attendee", "description": "Sen. Ted Cruz is quarantining himself after coming into contact 10 days ago with an attendee of the Conservative Political Action Committee conference who was later diagnosed with the coronavirus. Cruz said in a Sunday statement he learned of the interaction …", "url": "https://nypost.com/2020/03/08/ted-cruz-self-quarantining-after-meeting-coronavirus-stricken-cpac-attendee/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/ted-cruz.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-09T01:03:39Z", "content": "Sen. Ted Cruz is quarantining himself after coming into contact 10 days ago with an attendee of the Conservative Political Action Committee conference who was later diagnosed with the coronavirus.\r\nCruz said in a Sunday statement he learned of the interaction… [+1174 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Imani Moise", "title": "Citigroup splits Buffalo, NY, trading staff as coronavirus precaution", "description": "Citigroup Inc is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans. The third largest U.S. bank will this week keep fewer than 60% …", "url": "https://finance.yahoo.com/news/citigroup-splits-buffalo-ny-trading-001230425.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.YRvGUleOWusRjvxA3etkQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05ODguOA--/https://s.yimg.com/uu/api/res/1.2/XYewjN2sLR6ognE_k4fzYw--~B/aD02MTg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/5a08151ab9f3a99eee3e7d0341a4f515", "publishedAt": "2020-03-09T00:12:30Z", "content": "By Imani Moise\r\nNEW YORK - Citigroup Inc &lt;C.N&gt; is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans. \r\nThe third largest U.S.… [+1359 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Imani Moise", "title": "Citigroup splits Buffalo, NY, trading staff as coronavirus precaution", "description": "Citigroup Inc is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans. The third largest U.S. bank will this week keep fewer than 60% …", "url": "https://finance.yahoo.com/news/citigroup-splits-buffalo-ny-trading-001230837.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/z0yinU6D0EltZdE7WLgVUg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05ODguOA--/https://s.yimg.com/uu/api/res/1.2/ub5GEDLspx2064tRdJHulA--~B/aD02MTg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/5a08151ab9f3a99eee3e7d0341a4f515", "publishedAt": "2020-03-09T00:12:30Z", "content": "By Imani Moise\r\nNEW YORK - Citigroup Inc &lt;C.N&gt; is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans. \r\nThe third largest U.S.… [+1359 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "China reports zero locally transmitted coronavirus cases outside Hubei", "description": "Mainland China outside Hubei reported no new locally transmitted cases of coronavirus on Sunday for the second straight day, while 36 were reported in Wuhan, officials said Monday. China had 40 new confirmed cases of coronavirus infections on Sunday, the Nati…", "url": "https://news.yahoo.com/mainland-china-reports-40-cases-002210090.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/SzzNduNt8cR_18DGUKR5Gw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/Skt5Zo0JRkHNTe1Aux1qLA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/fa4219fb848993ea01829bc0f7c9a095", "publishedAt": "2020-03-09T00:22:10Z", "content": "BEIJING (Reuters) - Mainland China outside Hubei reported no new locally transmitted cases of coronavirus on Sunday for the second straight day, while 36 were reported in Wuhan, officials said Monday.\r\nChina had 40 new confirmed cases of coronavirus infection… [+821 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Matt Wilstein", "title": "Donald Trump Jr. Defends ‘Hyperbole’ About Democrats and Coronavirus", "description": "Just over a week ago, as the severity of the worldwide coronavirus outbreak was just starting to become apparent, Donald Trump Jr. went on Fox & Friends and said this about Democrats: “Anything that they can use to try to hurt Trump, they will… But for them t…", "url": "https://news.yahoo.com/donald-trump-jr-defends-hyperbole-003259858.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kdPQJlfQuuCLks4HK1_B7A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/kqtK01NmZv5gH4KVcUoHuA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/adc23b98241e285aa7783984fcc7b243", "publishedAt": "2020-03-09T00:32:59Z", "content": "Just over a week ago, as the severity of the worldwide coronavirus outbreak was just starting to become apparent, Donald Trump Jr. went on Fox &amp; Friends and said this about Democrats: Anything that they can use to try to hurt Trump, they will But for them… [+1309 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Global health expert: 'We may be entering potentially another phase'", "description": "Director of the Texas Children's Hospital Center for Vaccine Development Dr. Peter Hotez tells NBC’s Kasie Hunt that the increase of available coronavirus tests will likely cause 'a sharp increase in the number of actual cases reported.'", "url": "https://www.msnbc.com/kasie-dc/watch/global-health-expert-we-may-be-entering-potentially-another-phase-80292421686", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202003/n_hunt_hotez_20200308_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-09T00:11:36Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Associated Press", "title": "Oil plunges 20 percent as another virus-fueled trading week begins", "description": "Oil prices are plunging as a dispute among producers could lead a global economy weakened by the coronavirus to be awash in an oversupply of crude.", "url": "https://www.bostonglobe.com/2020/03/09/business/oil-plunges-20-percent-another-virus-fueled-trading-week-begins/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/in-s7WEtgMGyys-v58GnzwovWFc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/YWCMCRIF6NG5BIA4SFPTP36LAI.jpg", "publishedAt": "2020-03-09T00:16:56Z", "content": "NEW YORK (AP) Oil prices are plunging as a dispute among producers could lead a global economy weakened by the coronavirus to be awash in an oversupply of crude.\r\nBrent crude, the international standard, lost $9.50, or 20.1%, to $35.77 per barrel, as of 7:58 … [+2405 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Catherine Garcia", "title": "Ted Cruz self-quarantines after shaking hands with coronavirus patient", "description": "Sen. Ted Cruz (R-Texas) will spend the next week self-quarantined at his home in Texas, following a 'brief interaction' with a person at the Conservative Political Action Conference who has tested positive for the coronavirus, COVID-19.\nOn Sunday, Cruz said h…", "url": "https://theweek.com/speedreads/900752/ted-cruz-selfquarantines-after-shaking-hands-coronavirus-patient", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1195342807.jpg?itok=2kqGJL0C", "publishedAt": "2020-03-09T00:42:40Z", "content": "The Italian government Sunday took the drastic measure of shutting down much of the country's north in an effort to curb the spread of the novel coronavirus, COVID-19, restricting the movement of around 16 million people in places like Milan and Venice until … [+1368 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Dominiq R.", "title": "Coachella Could Be Canceled Due To The Coronavirus", "description": "Coachella producers considering canceling the festival out of fear of the coronavirus. https://www.hotnewhiphop.com/coachella-could-be-canceled-due-to-the-coronavirus-news.105745.html", "url": "https://www.hotnewhiphop.com/coachella-could-be-canceled-due-to-the-coronavirus-news.105745.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1583712436_29706df2d15b124a0e0160c72d6903ba.jpg/45867707eee000712b4190d16adfc6c5/1583712436_33aea8fab20bae63fd8937e7d2c8806b.jpg", "publishedAt": "2020-03-09T00:54:56Z", "content": "With the 2020 Coachella Music &amp; Arts Festival set to begin on Friday, April 10, the festival's producers are considering canceling the event amidst the pandemonium surrounding the novel coronavirus. Last week, Los Angeles County declared a state of emerge… [+1889 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Milca P.", "title": "Coronavirus Postponement Of \"No Time To Die\" To Lead To $30-50M Loss", "description": "Coronavirus dishes out another hit. https://www.hotnewhiphop.com/coronavirus-postponement-of-no-time-to-die-to-lead-to-s30-50m-loss-news.105744.html", "url": "https://www.hotnewhiphop.com/coronavirus-postponement-of-no-time-to-die-to-lead-to-s30-50m-loss-news.105744.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1583711373_79237841a1e473ae2b04a150eca0d64b.jpg/cd5a47f8571b921620d9de45d5d5e345/1583711373_a18cd3c29ca0e5b4a14f7a6c63358552.jpg", "publishedAt": "2020-03-09T00:28:12Z", "content": "Recently, MGM announced its plans to push back the debut of the forthcoming No Time To Die film all the way to November 2020 because of the coronavirus. While it was set to arrive on April 10th, the potential ramifications of the crippling epidemic caused fil… [+1295 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Ashraf Khalil And Michael Balsamo", "title": "Coronavirus: Ted Cruz in self-isolation after shaking hands with man later diagnosed - Global News", "description": "Coronavirus: Ted Cruz in self-isolation after shaking hands with man later diagnosed Global News Ted Cruz will self-quarantine after interacting with individual with coronavirus CNN Ted Cruz to self-quarantine after contact with man infected by coronavirus PO…", "url": "http://globalnews.ca/news/6648191/coronavirus-ted-cruz-self-isolation/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/2020-03-08t234749z_1271080870_rc2xte9wdnn7_rtrmadp_3_health-coronavirus-cpac-ted-cruz.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-09T00:36:04Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "North Korea fires three unidentified projectiles off its east coast: Report - Hindustan Times", "description": "North Korea fires three unidentified projectiles off its east coast: Report Hindustan Times North Korea fires 3 projectiles: South's military Moneycontrol North Korea Fires Three Projectiles: South Korean Military NDTV News Coronavirus: Foreigners leave N Kor…", "url": "https://www.hindustantimes.com/world-news/north-korea-fires-3-projectiles-report/story-wPggqRo4BbP1qB490YV3UL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/09/Pictures/missiles-artillery-korean-visits-people-korean-leader_f82b2a80-619d-11ea-bf5c-d064e47554d2.jpg", "publishedAt": "2020-03-09T01:03:37Z", "content": "North Korea has fired three projectiles, Seoul’s military said Monday, a week after it launched what the South said appeared to be two short-range ballistic missiles.\r\nThree devices were fired eastwards over the sea from the Sondok area in South Hamgyong prov… [+1998 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "[Global Insight] Can a COVID-19 vaccine be developed by year-end? - ARIRANG NEWS", "description": "[Global Insight] Can a COVID-19 vaccine be developed by year-end? ARIRANG NEWS Drinking alcohol will not protect you from Covid-19, says WHO India Today Over 1 lakh confirmed coronavirus cases reported globally: WHO The Siasat Daily Fact Check: Drinking alcoh…", "url": "https://www.youtube.com/watch?v=jmUg_XZ99Wc", "urlToImage": "https://i.ytimg.com/vi/jmUg_XZ99Wc/maxresdefault.jpg", "publishedAt": "2020-03-09T00:12:00Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Qatar Suspends Entry for Travelers From 14 Countries Due to Coronavirus", "description": "CAIRO (Sputnik) - Qatar temporarily suspended entry for travelers from 14 countries amid the coronavirus (COVID-19) outbreak, the government said on Sunday.", "url": "https://sputniknews.com/middleeast/202003091078515240-qatar-suspends-entry-for-travelers-from-14-countries-due-to-coronavirus/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107842/53/1078425300.jpg", "publishedAt": "2020-03-09T00:59:06Z", "content": "CAIRO (Sputnik) - Qatar temporarily suspended entry for travelers from 14 countries amid the coronavirus (COVID-19) outbreak, the government said on Sunday.Doha banned entry for visitors arriving from China, South Korea, Iran, Iraq, Egypt, Lebanon, India, Pak… [+1291 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "ASHRAF KHALIL, MICHAEL BALSAMO", "title": "Ted Cruz staying at home for 14 days after exposure to man with coronavirus", "description": "Republican Senator Ted Cruz said Sunday he will remain at his home in Texas after learning that he shook hands and briefly chatted with a man in suburban Washington who has tested positive for coronavirus.", "url": "https://www.bostonglobe.com/2020/03/09/nation/ted-cruz-staying-home-after-exposure-man-with-coronavirus/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/cS2GGGO0ZlAkKP0J_zjvv7SvZjg=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/SLONUSVBVZGTJJ4PFYLQCUAHR4.jpg", "publishedAt": "2020-03-09T00:39:38Z", "content": "WASHINGTON (AP) Republican Senator Ted Cruz said Sunday he will remain at his home in Texas after learning that he shook hands and briefly chatted with a man in suburban Washington who has tested positive for coronavirus.\r\nIn a statement, Cruz said he met the… [+265 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: Ted Cruz in self-isolation, Italy in lock down - CNET", "description": "The latest developments in the COVID-19 outbreak.", "url": "https://www.cnet.com/news/coronavirus-updates-ted-cruz-in-isolation-italy-in-lock-down/", "urlToImage": "https://cnet3.cbsistatic.com/img/Ps4pNNwmdQEJ3WpUS-fEpRv9suU=/756x567/2020/03/03/d3e555ce-f996-491f-8f5a-303e9516ddb1/gettyimages-1203669279.jpg", "publishedAt": "2020-03-09T00:45:00Z", "content": "Coronavirus has spread across every continent, except Antarctica, in three months, leaving some cities empty and silent.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a newly-identified coronavirus first detected in China in December, has rapi… [+33306 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "John Connolly", "title": "Hockey East monitoring coronavirus data", "description": "Hockey East is closely monitoring the situation regarding the coronavirus threat and has taken preliminary steps, including waving off handshakes in the traditional post-game lines. Players and coaches have been instructed to 'fist-bump' if so inclined and fo…", "url": "https://www.bostonherald.com/2020/03/08/hockey-east-monitoring-coronavirus-data/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/busc001.jpg?w=1024&h=810", "publishedAt": "2020-03-09T00:32:02Z", "content": "Hockey East is closely monitoring the situation regarding the coronavirus threat and has taken preliminary steps, including waving off handshakes in the traditional post-game lines. Players and coaches have been instructed to fist-bump if so inclined and for … [+5904 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Top U.S. congressional Democrats urge worker protections during coronavirus outbreak", "description": "The two top U.S. congressional Democrats urged President Donald Trump on Sunday to act quicker to protect workers affected by the deadly coronavirus, including free testing for the virus and paid sick leave for those under quarantine orders or caring for chil…", "url": "https://www.reuters.com/article/us-health-coronavirus-democrats-idUSKBN20W02U", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200309&t=2&i=1500572294&w=1200&r=LYNXMPEG2802E", "publishedAt": "2020-03-09T01:00:34Z", "content": "WASHINGTON (Reuters) - The two top U.S. congressional Democrats urged President Donald Trump on Sunday to act quicker to protect workers affected by the deadly coronavirus, including free testing for the virus and paid sick leave for those under quarantine or… [+1455 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "How the coronavirus has hit global sport", "description": "PARIS: AFP Sport looks at the effects on sport of the coronavirus, which at 11pm on Sunday had killed 3,792 people while infecting more than 109,000 in 99 countries worldwide.", "url": "https://www.bangkokpost.com/sports/1874764/how-the-coronavirus-has-hit-global-sport", "urlToImage": "https://static.bangkokpost.com/media/content/20200309/c1_3557084_700.jpg", "publishedAt": "2020-03-09T00:45:00Z", "content": "PARIS: AFP Sport looks at the effects on sport of the coronavirus, which at 11pm on Sunday had killed 3,792 people while infecting more than 109,000 in 99 countries worldwide.\r\nFOOTBALL\r\n-- In Italy, the hardest-hit European country with 366 deaths from COVID… [+5102 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Sarah K. Burris", "title": "Dow futures sink more than 1,000 points and oil prices plummet amid coronavirus", "description": "Dow futures have dropped more than 1,000 points, CNN reported Sunday afternoon. As the coronavirus is locking down businesses, schools, and other public spaces, the market appears to be reacting. The hospitality industry is already one of those being hurt by …", "url": "https://www.rawstory.com/2020/03/dow-futures-sink-more-than-1000-points-and-oil-prices-plummet-amid-coronavirus/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2015/10/Stock-trader-in-despair-via-Shutterstock-1000x600.jpg", "publishedAt": "2020-03-09T00:55:31Z", "content": "Dow futures have dropped more than 1,000 points, CNN reported Sunday afternoon. \r\nAs the coronavirus is locking down businesses, schools, and other public spaces, the market appears to be reacting. The hospitality industry is already one of those being hurt b… [+1071 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Japan fourth-quarter GDP revised down to 7.1% annualized contraction - Investing.com", "description": "Japan fourth-quarter GDP revised down to 7.1% annualized contraction Investing.com Japan’s economy contracts 7% in December quarter, risking recession MarketWatch Japan GDP Slumps More Than Estimated, Fueling Recession Fear Yahoo Finance Japan’s economy shrin…", "url": "https://www.investing.com/news/economic-indicators/japan-fourthquarter-gdp-revised-down-to-71-annualized-contraction-2104317", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEG28009_L.jpg", "publishedAt": "2020-03-09T00:41:51Z", "content": "By Kaori Kaneko and Tetsushi Kajimoto\r\nTOKYO (Reuters) - Japan's economy shrank more than initially estimated in the fourth quarter - by the most since the 2014 sales tax hike - exacerbating fears for economic prospects at a time when the impact of the corona… [+4159 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Death Toll From Coronavirus in Mainland China Reaches 3,119, Over 80,700 Infected", "description": "The outbreak of pneumonia caused by a new strain of coronavirus (COVID-19) was first registered in the Chinese city of Wuhan last December, later spreading to more than 100 countries around the globe.", "url": "https://sputniknews.com/asia/202003091078515093-death-toll-from-coronavirus-in-mainland-china-reaches-3119-over-80700-infected/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107230/85/1072308589.png", "publishedAt": "2020-03-09T00:16:53Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Ted Cruz to Self-Quarantine After Shaking Hands With COVID-19 Infected Person", "description": "The novel coronavirus (COVID-19) has infected more than 500 people in the United States, according to media reports, while at least 21 have died in the state of Washington.", "url": "https://sputniknews.com/us/202003091078515065-ted-cruz-to-self-quarantine-after-shaking-hands-with-covid-19-infected-person/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107851/51/1078515180.jpg", "publishedAt": "2020-03-09T00:43:47Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "John Shiffman", "title": "U.S. airport screeners, health workers plagued by fear and anger as coronavirus spreads - Reuters UK", "description": "As coronavirus cases exploded across the world, federal medical workers tasked with screening incoming passengers at U.S. airports grew alarmed: Many were working without the most effective masks to protect them from getting sick themselves.", "url": "https://uk.reuters.com/article/uk-health-coronavirus-workers-insight-idUKKBN20V00R", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200308&t=2&i=1500188731&w=1200&r=LYNXMPEG27013", "publishedAt": "2020-03-09T01:08:56Z", "content": "(Reuters) - As coronavirus cases exploded across the world, federal medical workers tasked with screening incoming passengers at U.S. airports grew alarmed: Many were working without the most effective masks to protect them from getting sick themselves. \r\nScr… [+8527 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christal Hayes, USA TODAY", "title": "Sen. Ted Cruz is self-quarantining after interacting with person who tested positive for coronavirus at CPAC", "description": "Sen. Ted Cruz became the first member of Congress to self-quarantine after interacting with a person at CPAC who tested positive for COVID-19", "url": "https://news.yahoo.com/sen-ted-cruz-self-quarantining-002527172.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kv6Smieq8mTZBAxGmeFUqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/bomeOhTBUOSxpi3EQ1fyZQ--~B/aD0yMzc2O3c9MzU2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/797de2ff8d3a1a795ec82a163fcc2a60", "publishedAt": "2020-03-09T00:25:27Z", "content": "WASHINGTON  Sen. Ted Cruz on Sunday said he would self-quarantine after interacting with a person at a conservative conference who has tested positive for the coronavirus  making the Texas Republican the first known member of Congress to have possibly come in… [+3290 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Qatar bans arrivals from Thailand, 13 other countries over virus fears", "description": "CAIRO: Qatar has temporarily barred travellers from 14 countries, including Thailand, from Monday as a precaution against the rapidly spreading coronavirus, the government announced on Sunday.", "url": "https://www.bangkokpost.com/thailand/general/1874754/qatar-bans-arrivals-from-thailand-13-other-countries-over-virus-fears", "urlToImage": "https://static.bangkokpost.com/media/content/20200309/c1_1874754_200309073704_700.jpg", "publishedAt": "2020-03-09T00:35:00Z", "content": "CAIRO: Qatar has temporarily barred travellers from 14 countries, including Thailand, from Monday as a precaution against the rapidly spreading coronavirus, the government announced on Sunday.\r\nThe ban covers China, Egypt, India, Iran, Iraq, Lebanon, Banglade… [+229 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "USD/CHF slides to lowest since February 2018 on oil price war and coronavirus fears", "description": "USD/CHF is losing altitude as coronavirus-led risk aversion has intensified with Saudi Arabia launching an all-out oil price war with Russia. The curr", "url": "https://www.fxstreet.com/news/usd-chf-slides-to-lowest-since-february-2018-on-oil-price-war-and-coronavirus-fears-202003090102", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/USDCHF/swiss-currency-francs-4064932_Large.jpg", "publishedAt": "2020-03-09T01:02:47Z", "content": "<ul><li>The safe-haven CHF is drawing bids as investors are selling risk in Asia. </li><li>Fears of an all-out oil price war have bolstered the coronavirus-led risk aversion.</li></ul>USD/CHF is losing altitude as coronavirus-led risk aversion has intensified… [+1353 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Omkar Godbole", "title": "Fed could slash rates to zero - Barclays' economist Gapen", "description": "The US Federal Reserve will do what is necessary to contain the negative impact of coronavirus on the domestic economy, even if it means slashing inte", "url": "https://www.fxstreet.com/news/fed-could-slash-rates-to-zero-barclays-economist-gapen-202003090109", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/CentralBanks/FED/new-us-2013-100-bill-federal-reserve-seal-extreme-macro-28149984_Large.jpg", "publishedAt": "2020-03-09T01:09:06Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Ross J Burland", "title": "Some White House officials privately believe number of US coronavirus cases will double or more in next 48 hours – Washington Post", "description": "Some White House officials privately believe number of us coronavirus cases will double or more in next 48 hours - Washington Post More to come...", "url": "https://www.fxstreet.com/news/some-white-house-officials-privately-believe-number-of-us-coronavirus-cases-will-double-or-more-in-next-48-hours-washington-post-202003090013", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/America/globe-background-gm176132618-10633045_Large.jpg", "publishedAt": "2020-03-09T00:13:09Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Olga R. Rodriguez, Christopher Weber", "title": "California prepares to dock cruise ship with 21 virus cases", "description": "As the US death toll from the new coronavirus reached at least 21, California Gov. Gavin Newsom and the mayor of Oakland sought Sunday to reassure the public that none of the passengers from a ship will be released into the public before undergoing a 14-day q…", "url": "https://www.bostonglobe.com/news/nation/2020/03/08/california-prepares-dock-cruise-ship-with-virus-cases/7iAHK1h8FlrcRe1pQVupyN/story.html", "urlToImage": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=144", "publishedAt": "2020-03-09T01:03:40Z", "content": "Meanwhile, the number of infections in the United States climbed above 500 as testing for the virus increased.\r\nDr. Anthony Fauci, the National Institutes of Healths infectious diseases chief, said Sunday that widespread closure of a city or region, as Italy … [+6424 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jim Collins, Contributor, Jim Collins, Contributor https://www.forbes.com/sites/jimcollins/", "title": "The Markets Are Plunging...Are You Doing Anything About It?", "description": "The bond market has been flashing red signals about the health of the global economy for the past two weeks as the fallout from the COVID-19 outbreak continues to unfold.", "url": "https://www.forbes.com/sites/jimcollins/2020/03/08/the-markets-are-plungingare-you-doing-anything-about-it/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1205332377%2F0x0.jpg", "publishedAt": "2020-03-09T00:24:46Z", "content": "The markets are plunging.  Are you paying attention to your portfolio?  Futures on the Dow Jones Industrial Average were down 1,400 points as of 8 pm Sunday, implying a 5.4% decline in that index at the opening of trade Monday morning.  The bond market has be… [+4797 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence, Contributor, Ewan Spence, Contributor https://www.forbes.com/sites/ewanspence/", "title": "New Surface Surprise As Microsoft Surface Duo Revealed", "description": "Once more, the Microsoft Surface Duo has been spotted in the wild. Once more Microsoft's decision to announce the dual screen Android device has proven to be a good call.", "url": "https://www.forbes.com/sites/ewanspence/2020/03/08/microsoft-surface-duo-new-leak-rumor-twitter-pictures-testing-android/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e6593ea44b78400068c4f6b%2F0x0.jpg", "publishedAt": "2020-03-09T00:57:34Z", "content": "Microsoft is not alone in encouraging staff to work from home due to the continued impact of coronavirus around the world, and many staff are taking up that offer. One of them is Microsoft Senior Director Frank Shaw, who happily showed of his new home office … [+2185 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Citigroup splits Buffalo, NY, trading staff as coronavirus precaution", "description": "Citigroup Inc  is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans.", "url": "https://www.channelnewsasia.com/news/business/citigroup-splits-buffalo--ny--trading-staff-as-coronavirus-precaution-12517004", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12517002/16x9/991/557/9fd68bcdd52e14a63fe04820e4f66bcb/KS/the-citigroup-inc-logo-is-seen-at-the-sibos-banking-and-financial-conference-in-toronto-1.jpg", "publishedAt": "2020-03-09T00:15:32Z", "content": "NEW YORK - Citigroup Inc is splitting its staff in Buffalo, New York, to ensure it can keep its operations humming as the coronavirus spreads across the state, according to a source familiar with the plans. \r\nThe third largest U.S. bank will this week keep fe… [+1359 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "US coronavirus cases pass 500 as defiant Trump praises response", "description": "LOS ANGELES: The number of confirmed US coronavirus cases soared past 500 on Sunday (Mar 8), including two further deaths, as President Donald Trump defended his administration's \"perfectly coordinated\" response to the epidemic. The virus has reached around 3…", "url": "https://www.channelnewsasia.com/news/world/us-coronavirus-cases-pass-500-as-defiant-trump-praises-response-12516818", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12516870/16x9/991/557/bf0010907a6793551dfce2011b9e598d/Hb/donald-trump.jpg", "publishedAt": "2020-03-09T00:35:10Z", "content": "LOS ANGELES: The number of confirmed US coronavirus cases soared past 500 on Sunday (Mar 8), including two further deaths, as President Donald Trump defended his administration's \"perfectly coordinated\" response to the epidemic.\r\nThe virus has reached around … [+4323 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Rick Sobey", "title": "15 new coronavirus cases in Massachusetts, doubling overnight", "description": "The number of reported people infected with coronavirus in Massachusetts more than doubled overnight, the state Department of Public Health announced on Sunday.", "url": "https://www.bostonherald.com/2020/03/08/15-new-coronavirus-cases-in-massachusetts-doubling-overnight/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/coronams01-2.jpg?w=1024&h=684", "publishedAt": "2020-03-09T00:53:04Z", "content": "The number of coronavirus infections in Massachusetts more than doubled overnight due to a Biogen conference, health authorities said — but top officials balked at canceling mass events.\r\nFifteen new presumptive positive cases of coronavirus were reported Sun… [+3322 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Flu has killed far more people than coronavirus so far - KGUN9", "description": "The coronavirus has reached six continents in a matter of weeks, with confirmed cases of COVID-19 in 89 countries.", "url": "https://www.youtube.com/watch?v=Ji3TzmpM9RU", "urlToImage": "https://i.ytimg.com/vi/Ji3TzmpM9RU/maxresdefault.jpg", "publishedAt": "2020-03-09T00:20:51Z", "content": "The coronavirus has reached six continents in a matter of weeks, with confirmed cases of COVID-19 in 89 countries."}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "Gold remains positive above $1,700 as coronavirus propels risk aversion", "description": "With the risk aversion on its full stream, Gold prices refresh multi-month top to $1,703.40, currently at $1,699, amid the Asian session on Monday.", "url": "https://www.fxstreet.com/news/gold-remains-positive-above-1-700-as-coronavirus-propels-risk-aversion-202003090110", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Commodities/Metals/Gold/gold-nuggets-7636265_Large.jpg", "publishedAt": "2020-03-09T01:10:53Z", "content": "<ul><li>Gold trades near the highest since early-December 2012.</li><li>Fears of coronavirus keep pushing traders to safe-havens.</li><li>The White House diplomats anticipate COVID-19 cases to doubt or more in 48 hours.</li><li>Fed widely expected to announce… [+1568 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Sean Boynton", "title": "COVID-19: B.C. man on Grand Princess ‘exhilarated’ to be repatriated back to Canada - Global News", "description": "COVID-19: B.C. man on Grand Princess ‘exhilarated’ to be repatriated back to Canada Global News Quarantined Canadians on board Grand Princess to be repatriated CBC News Feds chartering plane to repatriate Canadians on California cruise ship CTV News Coronavir…", "url": "http://globalnews.ca/news/6648059/coronavirus-grand-princess-bc-repatriated/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/fx409-35_2020_200305-2.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-09T00:42:33Z", "content": "The news that Canada will soon repatriate the 237 Canadians aboard a cruise ship that has confirmed cases of coronavirus on board was music to the ears of a Surrey, B.C., man and his wife.\r\nForeign Affairs Minister François-Philippe Champagne said Sunday that… [+3344 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mortal Kombat 11 – Official Spawn Gameplay Trailer - GameSpot", "description": "Mortal Kombat 11 – Official Spawn Gameplay Trailer GameSpot Mortal Kombat 11 Spawn Gameplay Revealed During Final Kombat 2020 Screen Rant Mortal Kombat 11 tournaments cancelled at last minute over coronavirus concerns VG247 New Character Pack adds ten new fig…", "url": "https://www.youtube.com/watch?v=OM8MAeKdkP4", "urlToImage": "https://i.ytimg.com/vi/OM8MAeKdkP4/maxresdefault.jpg", "publishedAt": "2020-03-09T00:24:00Z", "content": "The wait is over! Spawn makes his Outworld debut in Mortal Kombat 11 beginning with Early Access on March 17. Full Release March 24!"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jason Slotkin", "title": "International Women's Day 2020: Clashes, Coronavirus And Women Prepare To Strike", "description": "Mexican women geared up for a strike; coronavirus fears forced cancellations in China; marchers in Pakistan and Kyrgyzstan were attacked; and police confrontations were reported in Chile and Turkey.", "url": "https://www.npr.org/2020/03/08/813477367/international-womens-day-2020-clashes-coronavirus-and-women-prepare-to-strike", "urlToImage": "https://media.npr.org/assets/img/2020/03/08/ap_20068742693920_wide-05f5b997d3d9bf255a5e808bcb0f46e378f3a7ed.jpg?s=1400", "publishedAt": "2020-03-09T00:57:47Z", "content": "Marchers in Santiago, Chile, flooded the streets as part of International Women's Day marches. Confrontations with police were reported at events in Chile and Turkey and other countries.\r\nEsteban Felix/AP\r\nOrganizers and marchers have been out marking Interna… [+7079 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Catherine Garcia", "title": "Ted Cruz self-quarantines after shaking hands with coronavirus patient", "description": "Sen. Ted Cruz (R-Texas) will spend the next week self-quarantined at his home in Texas, following a \"brief interaction\" with a person at the Conservative Political Action Conference who has tested positive for the new COVID-19 coronavirus.On Sunday, Cruz said…", "url": "https://news.yahoo.com/ted-cruz-self-quarantines-shaking-004240632.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/huJBCPUXSdz5CS2GiRh8AA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eA77MT5qv3xUYHlV3J0bGg--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/3527e5df6b8085e1d9204aca8ebb1299", "publishedAt": "2020-03-09T00:42:00Z", "content": "Sen. Ted Cruz (R-Texas) will spend the next week self-quarantined at his home in Texas, following a \"brief interaction\" with a person at the Conservative Political Action Conference who has tested positive for the new COVID-19 coronavirus.\r\nOn Sunday, Cruz sa… [+794 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Ryan Merrifield)", "title": "Coronavirus: Pensioners 'to be told not to leave home' if outbreak gets worse", "description": "PM Boris Johnson will chair another COBRA meeting this week to decide on whether to impose restrictions on movement as Britain steps up the fight against coronavirus", "url": "https://www.mirror.co.uk/news/uk-news/coronavirus-pensioners-to-told-not-21657439", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21657450.ece/ALTERNATES/s1200/0_Lori-Spencer-talks-on-the-phone-through-a-window-with-her-mother-Judie-Shape-who-is-81-and-was-tes.jpg", "publishedAt": "2020-03-09T00:45:39Z", "content": "Pensioners could be told to stay at home if coronavirus spreads throughout Britain, in a drastic measure being considered by ministers, according to reports.\r\nThe special measure for the elderly and those with health problems is set to be announced by Deputy … [+2637 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Christian Whiton", "title": "China Threatens to Throw America 'Into the Mighty Sea of the Coronavirus.'", "description": "Christian Whiton Politics, America China is threatening to wreak havoc on America’s drug supply amid the Wuhan coronavirus outbreak. Thanks to our globalist elite and especially missteps during the Obama-Biden administration, Beijing has the power to do just …", "url": "https://nationalinterest.org/feature/china-threatens-throw-america-mighty-sea-coronavirus-130877", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/2020-03-05T153611Z_230395752_RC2RDF9VYHG6_RTRMADP_3_HEALTH-CORONAVIRUS-3M.jpg", "publishedAt": "2020-03-09T00:36:00Z", "content": "China is threatening to wreak havoc on Americas drug supply amid the Wuhan coronavirus outbreak. Thanks to our globalist elite and especially missteps during the Obama-Biden administration, Beijing has the power to do just that.\r\nIn an article in Xinhua, one … [+5403 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "One dead as Italian prisons revolt over COVID-19 outbreak measures", "description": "ROME: Inmates in four Italian prisons have revolted over new rules introduced to contain the coronavirus outbreak, leaving one prisoner dead and others injured, a prison rights group said Sunday (Mar 8). Prisoners at jails in Naples Poggioreale in the south, …", "url": "https://www.channelnewsasia.com/news/world/coronavirus-covid-19-italy-prison-12516992", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/9128510/16x9/991/557/a60d85290ba94e78963f6f0ebc02ec27/jv/file-photo-of-italy-police.jpg", "publishedAt": "2020-03-09T00:15:25Z", "content": "ROME: Inmates in four Italian prisons have revolted over new rules introduced to contain the coronavirus outbreak, leaving one prisoner dead and others injured, a prison rights group said Sunday (Mar 8).\r\nPrisoners at jails in Naples Poggioreale in the south,… [+2730 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump in the Time of the Coronavirus (David Remnick/New Yorker)", "description": "David Remnick / New Yorker : Trump in the Time of the Coronavirus — The first official act of the Trump Administration was the Inauguration—and, within hours, a lie delivered from the White House press room about how this had been “the largest audience to eve…", "url": "https://www.memeorandum.com/200308/p78", "urlToImage": "https://media.newyorker.com/photos/5e656901a441c10008ee326b/16:9/w_1280,c_limit/Remnick-TrumpsKatrina.jpg", "publishedAt": "2020-03-09T01:10:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Ted Cruz shook hands with infected CPAC attendee (John Bowden/The Hill)", "description": "John Bowden / The Hill : Ted Cruz shook hands with infected CPAC attendee — Sen. Ted Cruz (R-Texas) said Sunday that he shook hands with a man now confirmed to be infected with the novel form of coronavirus during a recent interaction at the Conservative Poli…", "url": "https://www.memeorandum.com/200308/p74", "urlToImage": "https://thehill.com/sites/default/files/cruzted_101619gn_lead.jpg", "publishedAt": "2020-03-09T00:40:06Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Despite virus risk, 2020 hopefuls keep up campaigns for now (Associated Press)", "description": "Associated Press : Despite virus risk, 2020 hopefuls keep up campaigns for now — GRAND RAPIDS, Mich. (AP) — As the coronavirus hits more states, Democratic presidential candidate Bernie Sanders said Sunday his campaign is gauging when it may become necessary …", "url": "https://www.memeorandum.com/200308/p76", "urlToImage": "https://storage.googleapis.com/afs-prod/media/89a1795c2ac2406ca3d19b2fbb59ea6c/3000.jpeg", "publishedAt": "2020-03-09T00:45:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Powerlineblog.com"}, "author": "John Hinderaker", "title": "Join Me Tomorrow On the Dennis Prager Show", "description": "(John Hinderaker) I will host the Dennis Prager radio show tomorrow from 12 to 3 p.m. Eastern. It should be a fun show; I will be joined by our own Steve Hayward during the first hour, and by Amity Shlaes, talking about her new book Great Society, in the thir…", "url": "http://www.powerlineblog.com/archives/2020/03/join-me-tomorrow-on-the-dennis-prager-show-2.php", "urlToImage": "https://www.powerlineblog.com/ed-assets/2020/03/Dennis-Prager.jpg", "publishedAt": "2020-03-09T00:16:58Z", "content": "I will host the Dennis Prager radio show tomorrow from 12 to 3 p.m. Eastern. It should be a fun show; I will be joined by our own Steve Hayward during the first hour, and by Amity Shlaes, talking about her new book Great Society, in the third hour. We will ta… [+236 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Sen. Ted Cruz self-quarantines after contact with CPAC attendee who has coronavirus (Samantha Ketterer/Houston Chronicle)", "description": "Samantha Ketterer / Houston Chronicle : Sen. Ted Cruz self-quarantines after contact with CPAC attendee who has coronavirus — Sen. Ted Cruz has self-quarantined after shaking hands with a person who tested positive for COVID-19, he said in a news release. — C…", "url": "https://www.memeorandum.com/200308/p72", "urlToImage": "https://s.hdnux.com/photos/01/02/47/57/17464312/7/rawImage.jpg", "publishedAt": "2020-03-09T00:20:03Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Eastasiaforum.org"}, "author": "EAF editors", "title": "Leadership and responses to the coronavirus", "description": "Author: Editorial Board, ANU In every crisis, there's opportunity. The legacies of political leaders are often defined by how they handle crises. The new coronavirus (COVID-19) epidemic is such a crisis and demands leadership to prevent the spread of new infe…", "url": "https://www.eastasiaforum.org/2020/03/09/leadership-and-responses-to-the-coronavirus/", "urlToImage": "https://www.eastasiaforum.org/wp-content/uploads/2020/03/87893936_137626830948883_3924853926695796736_n-600x406.jpg", "publishedAt": "2020-03-09T01:00:34Z", "content": "Author: Editorial Board, ANU\r\nIn every crisis, there’s opportunity. The legacies of political leaders are often defined by how they handle crises. The new coronavirus (COVID-19) epidemic is such a crisis and demands leadership to prevent the spread of new inf… [+6749 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Erin Tiernan", "title": "Massachusetts residents ‘really concerned’ as coronvirus cases spike", "description": "Residents attending a coronoavirus Town Hall Sunday said they want more information and are wary of the ongoing increase in the number of cases locally and around the world.", "url": "https://www.bostonherald.com/2020/03/08/massachusetts-residents-really-concerned-as-coronvirus-cases-spike/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2020/03/coronanl03-1.jpg?w=1024&h=830", "publishedAt": "2020-03-09T01:11:33Z", "content": "Residents attending a coronavirus Town Hall Sunday said they want more information and are wary of the ongoing increase in the number of cases locally and around the world.\r\n“I am still really concerned,” said Nathalie Ais of Quincy.\r\nAis was among hundreds w… [+2857 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Bruce Finley", "title": "Aspen residents and visitors who had contact with coronavirus-positive Australian woman reporting respiratory trouble", "description": "A woman in her 20s who was visiting Aspen returned home to Australia last week and tested positive for the COVID-19 coronavirus, and now Aspen residents and visitors she had contact with at social gatherings have reported respiratory symptoms, state health of…", "url": "https://www.denverpost.com/2020/03/08/coronavirus-update-aspen-australian-woman/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/03/b327e7bcf25641fda08dde66aaa529c5.jpg?w=1024&h=683", "publishedAt": "2020-03-09T00:18:50Z", "content": "A woman in her 20s who was visiting Aspen returned home to Australia last week and tested positive for the COVID-19 coronavirus, and now Aspen residents and visitors she had contact with at social gatherings have reported respiratory symptoms, state health of… [+2057 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Anil Panchal", "title": "US 10-year, 30-year treasury yields flash record lows amid coronavirus fears", "description": "Following its day-start drop to the record low of 0.487%, the US 10-year treasury yields seesaw near 0.522%, down 20 basis points, amid the initial mi", "url": "https://www.fxstreet.com/news/us-10-year-30-year-treasury-yields-flash-record-lows-amid-coronavirus-fears-202003090024", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Bonds/Bond/bond-1040437_Large.jpg", "publishedAt": "2020-03-09T00:24:32Z", "content": "<ul><li>US 10-year and 30-year treasury yields drop to the record low.</li><li>US equity futures down nearly 5.0% daily limit, gold above $1,700.</li><li>The increasing odds of the Fed’s rate cut, coronavirus headlines weigh on market’s risk-tone.</li></ul>Fo… [+1184 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ranjeetha Pakiam", "title": "Gold Bursts Above $1,700 With Market Mayhem Stoking Haven Demand", "description": "(Bloomberg) -- Gold rallied above $1,700 an ounce as a concerted global rush into havens intensified, with the upswing driven by turmoil in the oil market, the spread of the coronavirus, sinking equities, and expectations of easier monetary policy as recessio…", "url": "https://finance.yahoo.com/news/gold-bursts-above-1-700-003651665.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/mMDTisLtmYdewn7cM8eWVQ--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/3dac94bfa29e557276d0bfbaa3475fac", "publishedAt": "2020-03-09T00:36:51Z", "content": "(Bloomberg) -- Gold rallied above $1,700 an ounce as a concerted global rush into havens intensified, with the upswing driven by turmoil in the oil market, the spread of the coronavirus, sinking equities, and expectations of easier monetary policy as recessio… [+2558 chars]"}, {"source": {"id": null, "name": "Kidsactivitiesblog.com"}, "author": "Brittanie", "title": "Costco Has Suspended Free Samples In U.S. Stores. Here’s Why.", "description": "I just knew this day was coming. On Wednesday of last week my son and I were enjoying some samples of those tasty chicken sausages (and ultimately bought some). By yesterday I had noticed that there weren’t any vendors giving out samples and now I know why. C…", "url": "https://kidsactivitiesblog.com/135392/costco-has-suspended-free-samples-in-u-s-stores-heres-why/", "urlToImage": "https://kidsactivitiesblog.com/wp-content/uploads/2020/03/shutterstock_1520775317-1024x683.jpg", "publishedAt": "2020-03-09T00:50:13Z", "content": "March 8, 2020 by BrittanieLeave a Comment\r\nI just knew this day was coming. On Wednesday of last week my son and I were enjoying some samples of those tasty chicken sausages (and ultimately bought some). By yesterday I had noticed that there weren’t any vendo… [+1030 chars]"}, {"source": {"id": null, "name": "Crikey.com.au"}, "author": "Charlie Lewis", "title": "Virus Watch: market rout, workers’ rights, and kids will be kids", "description": "The stock market has tumbled this morning as concerns about the coronavirus grow. The post Virus Watch: market rout, workers’ rights, and kids will be kids appeared first on Crikey.", "url": "https://www.crikey.com.au/2020/03/09/coronavirus-watch-stock-market/", "urlToImage": "https://www.crikey.com.au/wp-content/uploads/2020/03/20191203001435851795-original.jpg", "publishedAt": "2020-03-09T00:50:45Z", "content": null}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Ilya Arkhipov, Will Kennedy, Olga Tanas and Grant Smith", "title": "How Putin spurned the Saudis to start a war on America’s shale oil industry - Los Angeles Times", "description": "Oil futures sunk by 31% in a matter of seconds after the open of trading Monday in Asia, the worst decline since the Gulf War in 1991.", "url": "https://www.latimes.com/business/story/2020-03-08/oil-price-war", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/5569187/2147483647/strip/true/crop/1600x840+0+30/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa7%2F24%2F09895cccbdd567e56678306fba05%2Fla-fg-oil-russia-iran-20141014-001", "publishedAt": "2020-03-09T01:10:00Z", "content": "At 10:16 a.m. on a wet and dreary morning, Russias energy minister walked into OPECs headquarters in central Vienna knowing his boss was ready to turn the global oil market upside down.\r\nAlexander Novak told his Saudi Arabian counterpart Prince Abdulaziz bin … [+7332 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "NBC Sports Chicago", "title": "Bulls Outsiders Podcast: Bulls win turnover battle but lose in Brooklyn", "description": "On this edition of the Bulls Outsiders podcast, Matt Peck, David Watson, and John Sabine react to the Bulls' 110-107 loss in Brooklyn.", "url": "https://sports.yahoo.com/bulls-outsiders-podcast-bulls-win-002920141.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/5O9EdxjLoVpTELoNZ.8Iww--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnchicago.com/3474d711fae50b80eb656576b20a293d", "publishedAt": "2020-03-09T00:29:20Z", "content": "On this edition of the Bulls Outsiders podcast, Matt Peck, David Watson, and John Sabine react to the Bulls' 110-107 loss in Brooklyn.\r\n0:45 - Reaction to the loss despite the Nets having 28 turnovers\r\n3:30 - On Bulls reserves getting so many more shot attemp… [+964 chars]"}, {"source": {"id": null, "name": "Dansdeals.com"}, "author": "Dan", "title": "US State Department: Stop Taking Cruises Due To Coronavirus; Grand Princess Passengers To Be Quarantined On Military Bases", "description": "The US State Department is warning US citizens, especially those at higher risk, to stop taking cruises due to coronavirus. Higher risk people include older adults and travelers with underlying health issues. U.S. citizens, especially with underlying conditio…", "url": "https://www.dansdeals.com/points-travel/us-state-department-stop-taking-cruises-due-coronavirus-grand-princess-passengers-quarantined-military-bases/", "urlToImage": "https://i.dansdeals.com/wp-content/uploads/2020/03/08202102/ezgif-6-15bb69909b1b.jpg", "publishedAt": "2020-03-09T00:29:26Z", "content": "Advertiser Disclosure: Many of the links that appear on this site are from companies from which DansDeals.com receives compensation. Dan’s Deals LLC is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to p… [+1201 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Stephen Spratt and Ruth Carson", "title": "Treasury Yields Plunge to Record Lows With Entire Curve Below 1%", "description": "(Bloomberg) -- Treasury yields tumbled to record lows, with the entire curve below 1% for the first time in history, as an oil-price war worsened a virus-driven crisis in global markets.The latest leg of the blistering rally was fueled by an all-out price-war…", "url": "https://finance.yahoo.com/news/treasury-yields-plunge-record-lows-004348502.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ZpvUeig0AtFyfh3_fNdj9A--~B/aD03NjA7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/da8b9357a2ae9522ed8c3d1532a02894", "publishedAt": "2020-03-09T00:43:48Z", "content": "(Bloomberg) -- Treasury yields tumbled to record lows, with the entire curve below 1% for the first time in history, as an oil-price war worsened a virus-driven crisis in global markets.\r\nThe latest leg of the blistering rally was fueled by an all-out price-w… [+1499 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Associated Press", "title": "Protests and celebrations mark Women’s Day, despite threats", "description": "From the streets of Manila to the plazas of Santiago, Chile, people around the world marked International Women’s Day on Sunday with calls to end exploitation and increase equality. But tensions marred some celebrations, with police reportedly using tear gas …", "url": "https://nypost.com/2020/03/08/protests-and-celebrations-mark-womens-day-despite-threats/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/international-womens-day.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-09T00:23:47Z", "content": "From the streets of Manila to the plazas of Santiago, Chile, people around the world marked International Womens Day on Sunday with calls to end exploitation and increase equality.\r\nBut tensions marred some celebrations, with police reportedly using tear gas … [+5968 chars]"}]