[{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Alyse Stanley", "title": "The World Health Organization's Making TikToks to Tackle Coronavirus Misinformation", "description": "On Friday the World Health Organization took the fight against online health misinformation to TikTok, the same day it elevated its coronavirus threat assessment to the organization’s highest possible level. Read more...", "url": "https://gizmodo.com/the-world-health-organizations-making-tiktoks-to-tackle-1841987951", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/tfzbyfmagtqgvm7iiksc.jpg", "publishedAt": "2020-02-29T04:52:00Z", "content": "On Friday the World Health Organization took the fight against online health misinformation to TikTok, the same day it elevated its coronavirus threat assessment to the organizations highest possible level.\r\nWe are on the highest level of alert or highest lev… [+3224 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Mary Papenfuss", "title": "Elementary School Employee Is Diagnosed With First Case Of Coronavirus In Oregon", "description": "Officials fear staff and students may have been exposed to COVID-19. The school is closed for deep cleaning.", "url": "https://www.huffpost.com/entry/oregon-coronavirus-first-case-community-school_n_5e59cb33c5b6beedb4eb5460", "urlToImage": "https://img.huffingtonpost.com/asset/5e59e1eb260000b710b5ff5c.jpeg?cache=xqW52xUZNh&ops=1200_630", "publishedAt": "2020-02-29T04:58:32Z", "content": "An elementary school employee has been diagnosed with Oregon’s first apparent case of the new coronavirus.\r\nIt may also be the third case in the nation of a “community spread” of the virus, known as COVID-19, because the affected individual hasn’t traveled to… [+2077 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kang Jin-kyu, with Laurent Thomet in Beijing", "title": "South Korea virus cases surge as WHO sounds maximum alert", "description": "South Korea reported on Saturday its biggest surge in new coronavirus cases and concerns grew of a possible epidemic in the United States as the World Health Organization raised its risk alert to its highest level. The virus has rapidly spread across the worl…", "url": "https://news.yahoo.com/south-korea-virus-cases-surge-sounds-maximum-alert-034009720.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/vuPYtLmylQN7CxjQiAUbQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MzEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/em.Kti41Tgukx808SqkapA--~B/aD00OTk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/58eec545d4d9c94e40a2fd0a99a8c5253b34b02a.jpg", "publishedAt": "2020-02-29T04:32:29Z", "content": "Seoul (AFP) - South Korea reported on Saturday its biggest surge in new coronavirus cases and concerns grew of a possible epidemic in the United States as the World Health Organization raised its risk alert to its highest level.\r\nThe virus has rapidly spread … [+4475 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Lake Oswego school employee with coronavirus lives in Washington County; Forest Hills Elementary shut - OregonLive", "description": "Lake Oswego school employee with coronavirus lives in Washington County; Forest Hills Elementary shut OregonLive Coronavirus: Live Coverage and Updates The New York Times RAW: Oregon announces first presumed case of coronavirus KGW News Oregon coronavirus cas…", "url": "https://www.oregonlive.com/clackamascounty/2020/02/clackamas-county-school-employee-has-coronavirus-forest-hills-elementary-shut.html", "urlToImage": "https://www.oregonlive.com/resizer/qgRJZoetexw59AuJDdHMFeX2xwA=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/Y2QAUIJDUZA5VOATPVZL2PDTZU.jpg", "publishedAt": "2020-02-29T04:12:00Z", "content": "A Washington County adult has tested positive for coronavirus in Oregons first case, officials said Friday. The test needs to be confirmed by federal health officials. \r\nThe employee of Lake Oswegos Forest Hills Elementary lives in Washington County and is is… [+1511 chars]"}, {"source": {"id": null, "name": "Kuow.org"}, "author": "Jill Jackson", "title": "2 new coronavirus cases found in Seattle area, health officials say - KUOW News and Information", "description": "2 new coronavirus cases found in Seattle area, health officials say KUOW News and Information Suspected ‘community transmission’ of coronavirus in third West Coast state: report Raw Story Mill Creek teen, King County woman test positive for coronavirus KING 5…", "url": "https://www.kuow.org/stories/new-coronavirus-cases-found-in-king-and-snohomish-counties", "urlToImage": "https://kuow-prod.imgix.net/store/4756beb2e850b01b8084534d015dcb9b.png?fm=jpg&fit=max&w=1200&h=628&q=80", "publishedAt": "2020-02-29T04:25:53Z", "content": "Washington state is now home to two newly confirmed cases of the coronavirus disease, or COVID-19.The two presumptive positives announced by state and county health officials Friday night included a Snohomish County high school student with no recent overseas… [+6388 chars]"}, {"source": {"id": null, "name": "Opb.org"}, "author": "AP", "title": "2 New Coronavirus Cases Identified In Washington State - OPB News", "description": "2 New Coronavirus Cases Identified In Washington State OPB News Suspected ‘community transmission’ of coronavirus in third West Coast state: report Raw Story Two presumed new cases of coronavirus in Washington, including student in Snohomish County KOMO News …", "url": "https://www.opb.org/news/article/washington-state-coronavirus-cases-identified/", "urlToImage": "https://images1.opb.org/c_fill%2Ch_300%2Cq_90%2Cw_400/ap_20058793356405_1582941471102.jpg", "publishedAt": "2020-02-29T04:24:00Z", "content": "Washington state health officials announced two new coronavirus cases Friday night, a woman who had recently traveled to South Korea and a high school student whose school will be closed and sanitized.\r\nThe high school student attends Jackson High School in E… [+1031 chars]"}, {"source": {"id": null, "name": "Kxly.com"}, "author": null, "title": "High school student one of two new coronavirus patients announced in Washington state - KXLY Spokane", "description": "High school student one of two new coronavirus patients announced in Washington state KXLY Spokane Washington state confirms 2 new coronavirus cases, 1 of unknown origin Fox News Two presumed new cases of coronavirus in Washington, including student in Snohom…", "url": "https://www.kxly.com/high-school-student-one-of-two-new-coronavirus-cases-announced-in-washington-state/", "urlToImage": "https://www.kxly.com/content/uploads/2020/02/hypatia-h_23efb87ae271b163e615f6be5ea6ec94-h_cbd5f3c6be01740f4475404787b8a2c1-300-1024x710.jpg", "publishedAt": "2020-02-29T05:04:07Z", "content": "February 28, 2020 8:52 PM\r\nPosted: February 28, 2020 8:52 PM\r\nThe Washington Department of Health confirmed two new coronavirus cases in the state at a press conference on Friday, one of which health officials say is in a high school student.  \r\nThe cases are… [+1445 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Sen Nguyen", "title": "All infected patients in Vietnam cured: A coronavirus miracle?", "description": "World Health Organization officials and health experts say swift response crucial in containing virus in the country.", "url": "https://www.aljazeera.com/news/2020/02/infected-patients-vietnam-cured-coronavirus-miracle-200228035007608.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/2/29/8e6b836cb217434e99a7445cdb205831_18.jpg", "publishedAt": "2020-02-29T04:20:16Z", "content": "Ho Chi Minh, Vietnam - Amid the rapid spread of the coronavirus outbreak around the world, Vietnam announced earlier this week that all 16 infected patients in the country have been discharged from the hospital, having been declared cured of the deadly diseas… [+7464 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Fedor Zarkhin | The Oregonian/OregonLive", "title": "Oregon braces for possible coronavirus epidemic - OregonLive", "description": "Oregon braces for possible coronavirus epidemic OregonLive U.S. health officials confirmed second case of community coronavirus CBS Evening News A second case of coronavirus is spreading through another California community msnNOW Coronavirus is spreading thr…", "url": "https://www.oregonlive.com/news/2020/02/oregon-braces-for-possible-coronavirus-epidemic.html", "urlToImage": "https://www.oregonlive.com/resizer/e83RtiXJpxliunUCa9TXallBT0Q=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/VKU5Q6FQZBAFRF3PD75BNYIKCE.jpg", "publishedAt": "2020-02-29T04:27:00Z", "content": "UPDATE 5:30 p.m. Feb. 28:Oregon has its first coronavirus case.\r\nThe immediate coronavirus risk to Oregonians is low but people still should use their understandable concerns about the global outbreak to take precautions, the states top health officials said … [+4470 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "US postpones summit with ASEAN leaders amid coronavirus fears", "description": "The postponements come amid growing fears that the virus will spread in the United States as countries report new infections, companies announce curbs on employees' travel and global stock markets continue to plummet.", "url": "https://indianexpress.com/article/world/us-postpones-summit-with-asean-leaders-amid-coronavirus-fears-6292133/", "urlToImage": "https://images.indianexpress.com/2020/02/china-coronavirus-759.jpg?w=759", "publishedAt": "2020-02-29T04:12:35Z", "content": "By: Reuters | Washington | \r\nPublished: February 29, 2020 9:42:35 am\r\nA man wears a face mask at a metro station in Beijing as the country is hit by an outbreak of the novel coronavirus, China, February 24, 2020. (REUTERS)The United States has decided to post… [+3017 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Singer’s Elliott seeks to replace Twitter CEO Jack Dorsey", "description": "Elliott’s push comes at a pivotal time with the US election, Summer Olympics and other major events, like the spread of the coronavirus, which tend to attract more users and advertisers to Twitter.", "url": "https://indianexpress.com/article/technology/tech-news-technology/singers-elliott-seeks-to-replace-twitter-ceo-dorsey-6292197/", "urlToImage": "https://images.indianexpress.com/2020/02/twitter-759-2.jpg?w=759", "publishedAt": "2020-02-29T04:56:13Z", "content": "By: Bloomberg | \r\nUpdated: February 29, 2020 10:29:08 am\r\nElliott approached San Francisco-based Twitter about its concerns privately and has had constructive discussions with it since then, the people said. (Image: Bloomberg)Activist investor Elliott Managem… [+3868 chars]"}, {"source": {"id": null, "name": "Toucharcade.com"}, "author": "Eli Hodapp", "title": "Birthday Pandemics! – The TouchArcade Show #436", "description": "Woooooo it's my birthday today and to celebrate we're ... talking about smart washers and dryers along with the Coronavirus wreaking havok on everything to do GDC. After that we shift gears to talk about some big news stories of the week, which seems to be pr…", "url": "https://toucharcade.com/2020/02/28/birthday-pandemics-the-toucharcade-show-436/", "urlToImage": "https://toucharcade.com/wp-content/uploads/2014/05/Podcast-Illustration-0121.jpg", "publishedAt": "2020-02-29T04:14:33Z", "content": "Woooooo it’s my birthday today and to celebrate we’re … talking about smart washers and dryers along with the Coronavirus wreaking havok on everything to do GDC. After that we shift gears to talk about some big news stories of the week, which seems to be prim… [+1089 chars]"}, {"source": {"id": null, "name": "Kptv.com"}, "author": "FOX 12 Staff", "title": "‘Disinfect everything’: Portland janitorial business notes spike in customers in midst of coronavirus concerns - KPTV.com", "description": "PORTLAND, OR (KPTV) – A Portland janitorial service has noticed a spike in customers in the midst of coronavirus concerns.", "url": "https://www.kptv.com/news/disinfect-everything-portland-janitorial-business-notes-spike-in-customers-in/article_430727fc-5aaf-11ea-8c38-c3ffe2b14425.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kptv.com/content/tncms/assets/v3/editorial/c/d2/cd2434ce-eac2-5873-bb5e-8b545222670d/5e5a01c6ed599.image.jpg?resize=1120%2C630", "publishedAt": "2020-02-29T04:52:00Z", "content": "PORTLAND, OR (KPTV) A Portland janitorial service has noticed a spike in customers in the midst of coronavirus concerns.\r\nA project manager with PDX Cleaning says her industry has always been busy, but she and her colleagues have noticed a triple to quadruple… [+702 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Michelle Nichols", "title": "U.N. chief recommends ministers, diplomats skip traveling to meeting due to coronavirus risks", "description": "U.N. Secretary-General Antonio Guterres has recommended that ministers and diplomats skip traveling to a meeting in New York of the Commission on the Status of Women due to the coronavirus outbreak, according to a letter seen by Reuters on Friday.", "url": "https://www.reuters.com/article/us-china-health-un-idUSKBN20N05R", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200229&t=2&i=1496799841&w=1200&r=LYNXMPEG1S03R", "publishedAt": "2020-02-29T04:39:37Z", "content": "WASHINGTON (Reuters) - U.N. Secretary-General Antonio Guterres has recommended that ministers and diplomats skip traveling to a meeting in New York of the Commission on the Status of Women due to the coronavirus outbreak, according to a letter seen by Reuters… [+1494 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Carlos Garcia", "title": "'This is their new hoax!' — Trump says Democrats are spreading misinformation about the coronavirus at South Carolina rally", "description": "President Donald Trump told his supporters at a South Carolina that Democrats were spreading misinformation about the coronavirus, and called it \"their new hoax.\" Critics instantly pounced on the comments as proof that the administration was not taking the th…", "url": "https://www.theblaze.com/news/trump-calls-coronavirus-worries-a-hoax", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgzNTk0OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYwMjgxNjEzMn0.tI63yIku21aay8oLjm9hhMXeeC-Ubi7MrHEI6MJTdFk/img.jpg?width=1200&coordinates=0%2C166%2C0%2C167&height=600", "publishedAt": "2020-02-29T05:06:01Z", "content": "President Donald Trump told his supporters at a South Carolina that Democrats were spreading misinformation about the coronavirus, and called it \"their new hoax.\"\r\nCritics instantly pounced on the comments as proof that the administration was not taking the t… [+1884 chars]"}, {"source": {"id": null, "name": "Q13fox.com"}, "author": "https://www.facebook.com/Q13FOX", "title": "2 new coronavirus cases in Washington: Snohomish Co. high school student and King Co. woman - Q13 News Seattle", "description": "2 new coronavirus cases in Washington: Snohomish Co. high school student and King Co. woman Q13 News Seattle Suspected ‘community transmission’ of coronavirus in third West Coast state: report Raw Story Two presumed new cases of coronavirus in Washington, inc…", "url": "https://q13fox.com/2020/02/28/2-new-presumed-cases-of-coronavirus-in-washington-snohomish-co-high-school-student-and-king-co-woman/", "urlToImage": "https://tribkcpq.files.wordpress.com/2020/02/kathy-lofy-coronavirus-press-conference.jpeg?quality=85&strip=all&w=1200", "publishedAt": "2020-02-29T04:22:00Z", "content": "SHORELINE, Wash. — State health officials on Friday announced two new cases of novel coronavirus in Washington state, a King County woman who recently traveled to South Korea and a Snohomish County high school student whose school will be closed and sanitized… [+2914 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Vincent Barone", "title": "Oregon reports coronavirus case of unknown origin", "description": "Oregon reported its first coronavirus case on Friday — and revealed the troubling news that it could not be linked to the patient’s travel history or to known contact with anyone else who is sick. It’s the third instance of the virus spreading without a trace…", "url": "https://nypost.com/2020/02/29/oregon-reports-coronavirus-case-of-unknown-origin/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/oregon-coronavirus.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T05:01:59Z", "content": "Oregon reported its first coronavirus case on Friday and revealed the troubling news that it could not be linked to the patients travel history or to known contact with anyone else who is sick. \r\nIts the third instance of the virus spreading without a traceab… [+1855 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Adam Schrader", "title": "‘CoronaCoin’ cryptocurrency lets traders cash in on coronavirus outbreak", "description": "A new cryptocurrency will let buyers reap grim benefits from the number of people who fall ill or die from the deadly coronavirus outbreak. The Bitcoin-like cryptocurrency, called CoronaCoin, will operate off a morbid, and gimmicky, structure: the number of a…", "url": "https://nypost.com/2020/02/28/coronacoin-cryptocurrency-lets-traders-cash-in-on-coronavirus-outbreak/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/coronavirus-tech.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T04:33:18Z", "content": "A new cryptocurrency will let buyers reap grim benefits from the number of people who fall ill or die from the deadly coronavirus outbreak.\r\nThe Bitcoin-like cryptocurrency, called CoronaCoin, will operate off a morbid, and gimmicky, structure: the number of … [+1408 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan to create fund to subsidize parents during school closure: Nikkei", "description": "Japan's government plans to create a fund to help companies pay subsidies to workers who need to take days off to look after their children while schools are closed, the Nikkei business daily reported on Saturday, without citing sources.", "url": "https://www.reuters.com/article/us-china-health-japan-idUSKBN20N068", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-29T04:41:28Z", "content": "TOKYO (Reuters) - Japan’s government plans to create a fund to help companies pay subsidies to workers who need to take days off to look after their children while schools are closed, the Nikkei business daily reported on Saturday, without citing sources. \r\nT… [+1056 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Corona Beer Dismisses Rumours, Says 'Coronavirus' Has Not Affected Its Sales - News18", "description": "Corona Beer Dismisses Rumours, Says 'Coronavirus' Has Not Affected Its Sales News18 WORKING FOR YOU: Coronavirus myths busted, no link to beer brand WWLP-22News After \"38% Of Americans\" Trends, Corona Beer Says Sales Not Hit By Coronavirus NDTV News COMMENTAR…", "url": "https://www.news18.com/news/buzz/corona-beer-dismisses-rumours-says-coronavirus-has-not-affected-its-sales-2520019.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Untitled-design-126.png", "publishedAt": "2020-02-29T05:10:51Z", "content": "Confusion between coronavirus and Corona beer has been a punchline of questionable taste during the outbreak, but for the brand, the matter may be no joke.\r\nThe phrase \"38 per cent of Americans\" was trending Friday (Feb 28) on Twitter following a survey showi… [+1133 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "South Korea tells citizens to stay home at ‘critical moment’ in coronavirus battle - Hindustan Times", "description": "South Korea tells citizens to stay home at ‘critical moment’ in coronavirus battle Hindustan Times Coronavirus Update: India Temporarily Suspends Visa On Arrival For Japan, South Korea NDTV News Coronavirus: India suspends visa on arrival facility for South K…", "url": "https://www.hindustantimes.com/world-news/south-korea-tells-citizens-to-stay-home-at-critical-moment-in-coronavirus-battle/story-12iqSQrIPoCq1mPtaAfpKJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/02/29/Pictures/virus-outbreak-chinas-lessons_7a697f72-5ab1-11ea-af9c-120932ee3561.jpg", "publishedAt": "2020-02-29T05:09:00Z", "content": "South Korea urged citizens on Saturday to stay indoors as it warned of a “critical moment” in its battle on the coronavirus after recording the biggest daily jump in infections, with 594 new cases taking the tally to 2,931.\r\nSouth Korea is grappling with the … [+1967 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "ANALYSIS: TRUE. Cotton calls China travel ban ‘the single most consequential and valuable thing’ d…", "description": "ANALYSIS: TRUE. Cotton calls China travel ban ‘the single most consequential and valuable thing’ done to slow coronavirus.", "url": "https://pjmedia.com/instapundit/359880/", "urlToImage": null, "publishedAt": "2020-02-29T04:19:59Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Citytoday.news"}, "author": "CTBUREAU_NGB", "title": "WHO upgrades global risk of Covid-19 spread to highest level - citytoday", "description": "WHO upgrades global risk of Covid-19 spread to highest level citytoday Coronavirus outbreak update: List of countries affected by COVID-19 Business Insider India How to prepare for a coronavirus pandemic - Business Insider Business Insider Nordic Coronavirus:…", "url": "https://citytoday.news/who-upgrades-global-risk-of-covid-19-spread-to-highest-level/", "urlToImage": null, "publishedAt": "2020-02-29T04:48:02Z", "content": "Prime News, International, Geneva (Switzerland), February 29:- The World Health Organisation on Friday (Feb 28) raised its global risk assessment of the new coronavirus to its highest level after the epidemic spread to sub-Saharan Africa and financial markets… [+1310 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Window of opportunity for containing coronavirus rapidly closing", "description": "Donald McNeil, science and health reporter for the New York Times, talks with Rachel Maddow about early assessments of the rate of transmission and rate of lethality of the new coronavirus.", "url": "https://www.msnbc.com/rachel-maddow/watch/window-of-opportunity-for-containing-coronavirus-rapidly-closing-79661125924", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_maddow_mcneil1_200218_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T04:59:42Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Suspected ‘community transmission’ of coronavirus in third West Coast state: report", "description": "Doctors in two more states reported suspected “community transmission” of coronavirus on Saturday. The first reported case occurred in California. The second case in California was reported on Friday. Then Oregon reported their first suspected coronavirus vic…", "url": "https://www.rawstory.com/2020/02/suspected-community-transmission-of-coronavirus-in-third-west-coast-state-report/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/01/coronavirus..jpeg", "publishedAt": "2020-02-29T04:31:52Z", "content": "Doctors in two more states reported suspected “community transmission” of coronavirus on Saturday.\r\nThe first reported case occurred in California. The second case in California was reported on Friday.\r\nThen Oregon reported their first suspected coronavirus v… [+1287 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Reuters issues CORRECTION & deletes tweet after roasted for reporting ‘just 1 American with coronavirus in hospital: VP Pence'", "description": "Reuters has raised quite a few eyebrows, invoking a storm of online mockery after it posted an ambiguous tweet about Mike Pence’s handling of the coronavirus crisis, prompting some to fear for the VP’s health. Read Full Article at RT.com", "url": "https://www.rt.com/usa/481984-reuters-pence-coronavirus-colon/", "urlToImage": "https://cdni.rt.com/files/2020.02/article/5e59edcb2030270db815c646.png", "publishedAt": "2020-02-29T05:03:08Z", "content": "Punctuation is important, especially in the middle of a global health crisis, and Reuters has learned this the hard way after it got pillared by netizens for leaving too much room for interpretation in a recent tweet about the coronavirus situation in the US.… [+2098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Lemon slams Trump administration for reaction to coronavirus", "description": "CNN's Don Lemon breaks down the \"lackluster response\" from President Trump and White House officials to coronavirus and massive losses in the stock market.", "url": "https://www.cnn.com/videos/politics/2020/02/29/coronavirus-trump-white-house-response-dons-take-ctn-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228230410-don-lemon-ctn-dons-take-022819-super-tease.jpg", "publishedAt": "2020-02-29T04:21:03Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Five People Who Contacted Coronavirus-Infected Iranian Hospitalized in Moscow", "description": "MOSCOW (Sputnik) - Five people who contacted a coronavirus-infected citizen of Iran during his transit stay in Moscow have been hospitalized to the Russian capital’s infectious diseases hospital, the virus was not found in them, the center for monitoring and …", "url": "https://sputniknews.com/russia/202002291078436091-five-people-who-contacted-coronavirus-infected-iranian-hospitalized-in-moscow/", "urlToImage": "https://cdn2.img.sputniknews.com/images/106030/50/1060305073.jpg", "publishedAt": "2020-02-29T04:37:54Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Death toll of coronavirus in China climbs to 2,835 with 47 more fatalities - Moneycontrol", "description": "Death toll of coronavirus in China climbs to 2,835 with 47 more fatalities Moneycontrol Coronavirus outbreak: What do we know about death rate and who's most at risk from COVID-19? Times of India COVID-19: China reports 35 more deaths, 573 new cases The Hindu…", "url": "https://www.moneycontrol.com/news/world/death-toll-of-coronavirus-in-china-climbs-to-2835-with-47-more-fatalities-4988611.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/nCov-770x433.jpg", "publishedAt": "2020-02-29T04:55:00Z", "content": "Forty seven more people have died of the deadly coronavirus, rasing the death toll in the country to 2,835 while the number of confirmed cases climbed to 79,251, Chinese health officials said on Saturday.\r\nChina's National Health Commission (NHC) in its daily… [+2344 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Junko Fujita", "title": "Japan PM Abe seeks citizens' help in coronavirus fight as Olympics to go ahead", "description": "Japanese Prime Minister Shinzo Abe on Saturday called on the public to cooperate in a \"tough battle\" to contain the coronavirus outbreak in coming weeks as the country prepares to hold the Olympic Games in Tokyo as planned. \"To be frank, we cannot win this ba…", "url": "https://news.yahoo.com/japan-create-fund-subsidize-parents-044128888.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xFQWbtD18vcjZ8_XLpWahg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04OTY-/https://s.yimg.com/uu/api/res/1.2/vnbD1BbSIVYHV7JBxBWfaw--~B/aD01NjA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/f7e59ccc7a1295c2b03c2de5eff2e478", "publishedAt": "2020-02-29T04:41:28Z", "content": "By Junko Fujita\r\nTOKYO (Reuters) - Japanese Prime Minister Shinzo Abe on Saturday called on the public to cooperate in a \"tough battle\" to contain the coronavirus outbreak in coming weeks as the country prepares to hold the Olympic Games in Tokyo as planned.\r… [+3020 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Alyse Stanley", "title": "The World Health Organisation's Making TikToks To Tackle Coronavirus Misinformation", "description": "On Friday the World Health Organisation took the fight against online health misinformation to TikTok, the same day it elevated its coronavirus threat assessment to the organisation’s highest possible level. More »", "url": "https://www.gizmodo.com.au/2020/02/the-world-health-organizations-making-tiktoks-to-tackle-coronavirus-misinformation/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/tfzbyfmagtqgvm7iiksc.jpg", "publishedAt": "2020-02-29T04:52:00Z", "content": "On Friday the World Health Organisation took the fight against online health misinformation to TikTok, the same day it elevated its coronavirus threat assessment to the organisations highest possible level.\r\nWe are on the highest level of alert or highest lev… [+3228 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Michael Moore: Trump calling coronavirus 'hoax' is 'dangerous'", "description": "Oscar-winning documentary filmmaker Michael Moore blasts the presidents for attacking Democrats in the wake of fears over the coronavirus.", "url": "https://www.msnbc.com/11th-hour/watch/michael-moore-trump-calling-coronavirus-hoax-is-dangerous-79660613973", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_bwms_moore_coronavirus_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T04:44:07Z", "content": null}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "BRIAN MELLEY", "title": "Restaurants in LA’s Koreatown reel amid coronavirus rumor", "description": "LOS ANGELES (AP) — In a Koreatown restaurant known for its beef bone broth soup, the lunchtime crowd Friday was half its normal size. The reason was a virulent rumor about a customer with coronavirus. Han Bat Shul Lung Tang was one of five restaurants that lo…", "url": "https://www.seattletimes.com/seattle-news/health/restaurants-in-las-koreatown-reel-amid-coronavirus-rumor/", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2020-02-29T05:03:48Z", "content": "LOS ANGELES (AP) In a Koreatown restaurant known for its beef bone broth soup, the lunchtime crowd Friday was half its normal size. The reason was a virulent rumor about a customer with coronavirus.\r\nHan Bat Shul Lung Tang was one of five restaurants that los… [+4680 chars]"}, {"source": {"id": null, "name": "Innerfidelity.com"}, "author": "Rafe Arnott", "title": "High End 2020: Coronavirus Fears Trigger Cancellation", "description": "The High-fidelity and personal-audio trade show circuit has been dealt a blow from the coronavirus with the cancellation of High End Munich. Citing growing concerns over the continued spread of the coronavirus – especially in European countries – the High End…", "url": "https://www.innerfidelity.com/content/high-end-2020-coronavirus-fears-trigger-cancellation", "urlToImage": "https://www.innerfidelity.com/images/200228-HIGH-END-2.jpg", "publishedAt": "2020-02-29T04:48:57Z", "content": "The High-fidelity and personal-audio trade show circuit has been dealt a blow from the coronavirus with the cancellation of High End Munich.\r\nCiting growing concerns over the continued spread of the coronavirus especially in European countries the High End So… [+2353 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Fifa warns coronavirus could postpone international matches", "description": "BELFAST:- Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.", "url": "https://www.bangkokpost.com/world/1868419/fifa-warns-coronavirus-could-postpone-international-matches", "urlToImage": "https://static.bangkokpost.com/media/content/20200229/c1_3546184_700.jpg", "publishedAt": "2020-02-29T04:45:00Z", "content": "BELFAST:- Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.\r\nThis weekend's matches in the leading two divisions in Switzerland, where football's g… [+2063 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Fifa warns coronavirus could postpone international matches", "description": "BELFAST:- Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.", "url": "https://www.bangkokpost.com/sports/1868419/fifa-warns-coronavirus-could-postpone-international-matches", "urlToImage": "https://static.bangkokpost.com/media/content/20200229/c1_3546184_700.jpg", "publishedAt": "2020-02-29T04:45:00Z", "content": "BELFAST:- Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.\r\nThis weekend's matches in the leading two divisions in Switzerland, where football's g… [+2063 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Trump faces crisis of confidence and competence over coronavirus", "description": "Ron Klain, Pres. Obama's Ebola Czar, and Laurie Garrett, Pulitzer Prize-winning reporter covering global pandemics, say the Trump administration has not inspired confidence nor shown competence in how it is combating coronavirus.", "url": "https://www.msnbc.com/the-last-word/watch/trump-faces-crisis-of-confidence-and-competence-over-coronavirus-79660101777", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_lw_coronavirus_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T04:28:14Z", "content": "Ron Klain, Pres. Obama's Ebola Czar, and Laurie Garrett, Pulitzer Prize-winning reporter covering global pandemics, say the Trump administration has not inspired confidence nor shown competence in how it is combating coronavirus.Feb. 29, 2020"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": null, "title": "Trump calls coronavirus fear the Dems' 'new hoax' as more cases are confirmed", "description": "While fears and the number of coronavirus cases keep growing, Trump held a rally and Mike Pence - who the president put in charge of the government's response - held a fundraiser.", "url": "http://www.msnbc.com/11th-hour/watch/trump-calls-coronavirus-fear-the-dems-new-hoax-as-more-cases-are-confirmed-79659589888", "urlToImage": null, "publishedAt": "2020-02-29T04:43:51Z", "content": null}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Fifa: Virus could postpone international matches", "description": "BELFAST: Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.", "url": "https://www.bangkokpost.com/sports/1868419/fifa-virus-could-postpone-international-matches", "urlToImage": "https://static.bangkokpost.com/media/content/20200229/c1_3546184_700.jpg", "publishedAt": "2020-02-29T04:45:00Z", "content": "BELFAST: Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.\r\nThis weekend's matches in the leading two divisions in Switzerland, where football's gl… [+2076 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Fifa: Virus could postpone international matches", "description": "BELFAST: Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.", "url": "https://www.bangkokpost.com/world/1868419/fifa-virus-could-postpone-international-matches", "urlToImage": "https://static.bangkokpost.com/media/content/20200229/c1_3546184_700.jpg", "publishedAt": "2020-02-29T04:45:00Z", "content": "BELFAST: Fifa president Gianni Infantino has refused to rule out postponing international football matches in response to the escalating global threat of the coronavirus.\r\nThis weekend's matches in the leading two divisions in Switzerland, where football's gl… [+2076 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Rappler.com", "title": "DOT postpones nationwide mall sales amid coronavirus scare", "description": "MANILA, Philippines – The Department of Tourism (DOT) postponed the nationwide mall sales scheduled for the whole month of March, due to concerns over the novel coronavirus, which causes the disease COVID-19. The nationwide sale was part of the 2020 Philippin…", "url": "https://www.rappler.com/life-and-style/travel/252999-dot-postpones-nationwide-mall-sales-amid-coronavirus-scare", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/334E0B9A14CA4B0182B77265A341A61D/shopping-festival.jpg", "publishedAt": "2020-02-29T04:54:17Z", "content": null}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "BRITTANY KEOGH", "title": "Coronavirus profiteering: Trade Me user selling face masks for $50 each", "description": "Some people are using the coronavirus outbreak to make a quick buck by selling four mini hand sanitisers for $50 and face masks for $50 each.", "url": "https://www.stuff.co.nz/national/health/119916999/coronavirus-profiteering-trade-me-user-selling-face-masks-for-50-each", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/e/9/b/v/image.related.StuffLandscapeSixteenByNine.1420x800.1ze8jr.png/1582950728848.png", "publishedAt": "2020-02-29T04:32:07Z", "content": "While supermarkets urge customers not to stockpile goods, some people are making a quick buck out of others' concern about coronavirus.\r\n Face masks are being sold online for up to $50 each and mini bottles of hand sanitisers for $12.50.\r\n On Friday, the firs… [+2407 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Kanis Leung, Kanis Leung", "title": "Coronavirus: who are those hoping to jump on Hong Kong’s mask production bandwagon?", "description": "Dicky Chan’s ambition has led him to a small en suite bedroom he cannot leave – at least temporarily.Inside a cramped, subdivided flat in the New Territories, the 38-year-old cleaning firm boss is undergoing self-quarantine, an inconvenient, if necessary, ste…", "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3052992/coronavirus-who-are-those-hoping-jump-hong-kongs", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/29/8e8e26d4-5a15-11ea-b438-8452af50d521_image_hires_124831.JPG?itok=PtQWdGu3&v=1582951723", "publishedAt": "2020-02-29T04:45:29Z", "content": null}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Coronavirus fears cause stocks to plunge in worst week since 2008 financial crisis", "description": "Former Obama and Clinton Economic Adviser Gene Sperling tells Ali Velshi that the stock market is plummeting due to lack of information and testing as well as consumer fears about coronavirus: \"Some of that consumer activity will go away and it will not neces…", "url": "https://www.msnbc.com/the-last-word/watch/coronavirus-fears-cause-stocks-to-plunge-in-worst-week-since-2008-financial-crisis-79661125598", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_lw_sperling_200228_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T04:31:40Z", "content": "Former Obama and Clinton Economic Adviser Gene Sperling tells Ali Velshi that the stock market is plummeting due to lack of information and testing as well as consumer fears about coronavirus: \"Some of that consumer activity will go away and it will not neces… [+125 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Agnes ANYA, Peter BRIEGER", "title": "No going back: Bali's Chinese tourists fear virus-hit homeland", "description": "Hundreds of Chinese tourists on vacation in Bali are scrambling to avoid going home, fearing both infection from the deadly new coronavirus and Beijing's handling of the epidemic. Concerns over the rapidly-spreading outbreak prompted Indonesia to shut down al…", "url": "https://news.yahoo.com/no-going-back-balis-chinese-tourists-fear-virus-043823339.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hP1bq8pgFGGNOn986YeHnw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/NMOgEL91OO2haoerpTdDLg--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/6c4925b01681c27b5bdef6e9da25e3a15718579f.jpg", "publishedAt": "2020-02-29T04:58:06Z", "content": "Hundreds of Chinese tourists on vacation in Bali are scrambling to avoid going home, fearing both infection from the deadly new coronavirus and Beijing's handling of the epidemic.\r\nConcerns over the rapidly-spreading outbreak prompted Indonesia to shut down a… [+2999 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Humbled Saudis May Yet Clinch OPEC+ Deal as Virus Crisis Worsens", "description": "(Bloomberg) -- Saudi Arabia has so far been thwarted by Russia in its push to shore up oil markets against the coronavirus. But when they meet next week, the humbled kingdom may yet clinch victory.Ever since it became clear the outbreak was savaging energy de…", "url": "https://finance.yahoo.com/news/humbled-saudis-may-yet-clinch-050000738.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/6M5epUzu9g0vLrLGCun1Sw--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/05821bf4a17f345cc736e0673d5ccffd", "publishedAt": "2020-02-29T05:00:00Z", "content": "(Bloomberg) -- Saudi Arabia has so far been thwarted by Russia in its push to shore up oil markets against the coronavirus. But when they meet next week, the humbled kingdom may yet clinch victory.\r\nEver since it became clear the outbreak was savaging energy … [+5804 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Kanis Leung, Kanis Leung", "title": "We are not copying Singapore, Hong Kong finance minister Paul Chan says of move to donate top officials’ salaries to charity amid coronavirus crisis", "description": "Hong Kong’s finance minister has denied that the government was following Singapore’s example by having top officials donate a month’s salary to charity amid the coronavirus outbreak.Financial Secretary Paul Chan Mo-po on Saturday said the move was made becau…", "url": "https://www.scmp.com/news/hong-kong/politics/article/3052989/we-are-not-copying-singapore-hong-kong-finance-minister", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/29/f9322d68-5a98-11ea-b438-8452af50d521_image_hires_122229.jpg?itok=WwitOfP5&v=1582950158", "publishedAt": "2020-02-29T04:15:51Z", "content": null}, {"source": {"id": null, "name": "Thegatewaypundit.com"}, "author": "Kristinn Taylor", "title": "Mike Bloomberg and Other Democrats Falsely Accuse Trump of Calling the Coronavirus a Hoax", "description": "Leading Democrats including presidential candidate Mike Bloomberg used bogus media reports to falsely accuse President Trump of calling the coronavirus a hoax, thereby proving Trump’s point that the Democrats are politicizing the coronavirus against him. Bloo…", "url": "https://www.thegatewaypundit.com/2020/02/mike-bloomberg-and-other-democrats-falsely-accuse-trump-of-calling-the-coronavirus-a-hoax/", "urlToImage": "https://www.thegatewaypundit.com/wp-content/uploads/Trump-Rally-North-Charleston-South-Carolina-2-Screen-Image-02282020-1200x630.jpg", "publishedAt": "2020-02-29T04:50:15Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Market is in longer duration time wise correction, says Ajay Khandelwal", "description": "Earnings surprises and misses have been evenly matched for this quarter. It has been a mixed bag but the big earnings revival seems to be round the corner", "url": "https://www.moneycontrol.com/news/business/markets/market-is-in-longer-duration-time-wise-correction-says-ajay-khandelwal-4988481.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/02/Sensex_nifty_BSE_NSE_traders_NSE-770x433.jpg", "publishedAt": "2020-02-29T04:57:31Z", "content": "In telecom space, all bad news is already priced in and no bad news is expected in the foreseeable future with regards to business environment or pricing, Ajay Khandelwal, Head PMS, Globe Capital Markets tells Moneycontrol's Sunil Matkar.\r\nQ. How do you expec… [+3078 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Liam Mannix", "title": "Diamond Princess owner won't offer refunds for cruise cancellations", "description": "Passengers are being told there is low risk from taking a cruise on ship and centre of coronavirus crisis.", "url": "https://www.smh.com.au/national/diamond-princess-owner-won-t-offer-refunds-for-cruise-cancellations-20200229-p545mb.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.219%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/q_86%2Cf_auto/7114e17eb8e567a61d39c93da11c5c26118b4420", "publishedAt": "2020-02-29T04:37:23Z", "content": "A spokesman for Carnival Australia, the Australian wing of the company that owns the Diamond Princess, said the risk of catching coronavirus aboard is low.\r\nThe companys resolve may be hardened by pressure from a sudden financial pinch; its share price has fa… [+3158 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Coronavirus Live Updates: New Unexplained Cases Reported in Oregon and California (New York Times)", "description": "New York Times : Coronavirus Live Updates: New Unexplained Cases Reported in Oregon and California — Officials in both states raced to contact people who might have been exposed, and experts warned that the cases could indicate signs of spread within the Unit…", "url": "https://www.memeorandum.com/200228/p154", "urlToImage": "https://static01.nyt.com/images/2020/02/28/us/28virus-briefing-ucdavis/merlin_169682550_476a9429-d94c-4e70-91ae-818d9e601c70-facebookJumbo.jpg", "publishedAt": "2020-02-29T04:20:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JON GAMBRELL Associated Press", "title": "Bahrain threatens untested from Iran with arrest amid virus", "description": "Bahrain threatened legal prosecution against travelers who came from Iran and hadn't been tested for the new coronavirus", "url": "https://abcnews.go.com/International/wireStory/bahrain-threatens-untested-iran-arrest-amid-virus-69300053", "urlToImage": "https://s.abcnews.com/images/International/WireAP_94ee23d764144badaa0c72122abda7e1_16x9_992.jpg", "publishedAt": "2020-02-29T05:01:31Z", "content": "DUBAI, United Arab Emirates -- \r\nBahrain on Saturday threatened legal prosecution against travelers who came from Iran and hadn't been tested for the new coronavirus, and also barred public gatherings for two weeks as confirmed cases across the wider Mideast … [+2245 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "WABC – NY", "title": "Why did CDC send NYC man home without testing for coronavirus?", "description": "One man has locked himself in his Brooklyn apartment, trying to get by with a hacking cough and a fever - and a real concern he is infected with the novel coronavirus.", "url": "https://news.yahoo.com/why-did-cdc-send-nyc-042218225.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/lbl3VryZ5ywxbVnZOTEnGA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/BExzegRhoHJRh5oD97nSFg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/29/5e59e80569e6c51d61e0f975/5e59e80569e6c51d61e0f976_o_U_v2.jpg", "publishedAt": "2020-02-29T04:22:18Z", "content": "One man has locked himself in his Brooklyn apartment, trying to get by with a hacking cough and a fever - and a real concern he is infected with the novel coronavirus."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "JON GAMBRELL", "title": "Bahrain threatens untested from Iran with arrest amid virus", "description": "Bahrain on Saturday threatened legal prosecution against travelers who came from Iran and hadn't been tested for the new coronavirus, and also barred public gatherings for two weeks as confirmed cases across the wider Mideast grew to over 520. The tiny island…", "url": "https://news.yahoo.com/bahrain-threatens-untested-iran-arrest-050034085.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/og3uQogFPAa729sOKT5WIg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDkuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/Qg6D2gQLnUUmE5ryWdXAkw--~B/aD0yNTYxO3c9Mzg2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/4e4351173def39312ff45f55031b05b9", "publishedAt": "2020-02-29T05:00:34Z", "content": "DUBAI, United Arab Emirates (AP) Bahrain on Saturday threatened legal prosecution against travelers who came from Iran and hadn't been tested for the new coronavirus, and also barred public gatherings for two weeks as confirmed cases across the wider Mideast … [+2243 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "No going back: Bali's Chinese tourists fear virus-hit homeland", "description": "DENPASAR, Indonesia: Hundreds of Chinese tourists on vacation in Bali are scrambling to avoid going home, fearing both infection from the deadly new coronavirus and Beijing's handling of the epidemic. Concerns over the rapidly spreading outbreak prompted Indo…", "url": "https://www.channelnewsasia.com/news/asia/covid19-chinese-tourists-bali-12485054", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12485056/16x9/991/557/fd7a703ed41e2f24600b90157321f15b/II/bali-chinese-tourists.jpg", "publishedAt": "2020-02-29T05:04:52Z", "content": "DENPASAR, Indonesia: Hundreds of Chinese tourists on vacation in Bali are scrambling to avoid going home, fearing both infection from the deadly new coronavirus and Beijing's handling of the epidemic.\r\nConcerns over the rapidly spreading outbreak prompted Ind… [+3208 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Oil prices sink to lowest in over a year, biggest weekly drop since 2016", "description": "Coronavirus panic also sent global stock markets and industrial and precious metals prices tumbling, with losses amounting to $5 trillion.", "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-sink-to-lowest-in-over-a-year-biggest-weekly-drop-since-2016/articleshow/74411407.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74411403,width-1070,height-580,imgsize-238255,overlay-etmarkets/photo.jpg", "publishedAt": "2020-02-29T04:52:50Z", "content": "NEW YORK: Oil prices slumped for a sixth day in a row on Friday to their lowest in more than a year, causing futures to drop by the most in a week since 2016, as the spread of coronavirus stoked fears that a slowing global economy would hit energy demand.\r\nTh… [+2248 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Mysterious 'Object' Spotted in ISS Live Feed by UFO Hunter Puzzles Netizens", "description": "A user first to notice the speedy flying object suggested that its shape was “more like an ice cream cone, pointy in the back and rounded in the front”, not a typical shape for normal rockets or the more familiar spacecraft known to humanity.", "url": "https://sputniknews.com/science/202002291078436019-mysterious-object-spotted-in-iss-live-feed-by-ufo-hunter-puzzles-netizens/", "urlToImage": "https://cdn4.img.sputniknews.com/images/107573/27/1075732785.jpg", "publishedAt": "2020-02-29T04:12:29Z", "content": "A user first to notice the speedy flying object suggested that its shape was more like an ice cream cone, pointy in the back and rounded in the front, not a typical shape for normal rockets or the more familiar spacecraft known to humanity.YouTube conspiracis… [+1832 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "newsfeeds@nzherald.co.nz", "title": "Coronavirus: Toddler's birthday cancelled after uncle arrives on flight EK450", "description": "An Auckland toddler has had her much-anticipated birthday party canned after her uncle arrived into New Zealand on the coronavirus-affected flight from Iran.The girl's mother, who didn't want to be named, said her 30-year-old brother...", "url": "https://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=12312788", "urlToImage": "https://www.nzherald.co.nz/resizer/9gLi1REqKUTNt1LBjyUcAlz-5og=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/U7NDD5CKFNC77K5OHPAA5ZMBYA.jpg", "publishedAt": "2020-02-29T05:07:45Z", "content": "An Auckland toddler has had her much-anticipated birthday party canned after her uncle arrived into New Zealand on the coronavirus-affected flight from Iran.\r\n The girl's mother, who didn't want to be named, said her 30-year-old brother came into the country … [+4951 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Kok Xinghui,Dewey Sim, Kok Xinghui,Dewey Sim", "title": "Coronavirus: Southeast Asian supply chains feel the squeeze from Covid-19", "description": "For Kenneth Loo, chief operating officer and executive director of Straits Construction in Singapore, the coronavirus outbreak is posing a headache on two fronts: his pipeline of workers and construction materials.Loo estimates that although mainland Chinese …", "url": "https://www.scmp.com/week-asia/economics/article/3052943/coronavirus-southeast-asian-supply-chains-feel-squeeze-covid-19", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/28/91d60562-5a03-11ea-b438-8452af50d521_image_hires_201405.JPG?itok=JZf21Hz8&v=1582892054", "publishedAt": "2020-02-29T04:30:05Z", "content": null}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "BRIAN MELLEY Associated Press", "title": "Restaurants in LA's Koreatown reel amid coronavirus rumor", "description": "Fears of the coronavirus combined with the speed and reach of social media can quickly cripple the healthiest of businesses", "url": "https://abcnews.go.com/Health/wireStory/restaurants-las-koreatown-reel-amid-coronavirus-rumor-69300094", "urlToImage": "null", "publishedAt": "2020-02-29T05:04:18Z", "content": "LOS ANGELES -- \r\nIn a Koreatown restaurant known for its beef bone broth soup, the lunchtime crowd Friday was half its normal size. The reason was a virulent rumor about a customer with coronavirus.\r\nHan Bat Shul Lung Tang was one of five restaurants that los… [+4675 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "awoodward@businessinsider.com (Aylin Woodward)", "title": "Anthony Fauci, who the Trump administration barred from speaking freely, is a public-health hero. The disease expert guided the US through AIDS, Zika, and Ebola.", "description": "Fauci has been a US health official since 1984, advising six presidents. Trump's administration barred him from speaking publicly without approval.", "url": "https://news.yahoo.com/anthony-fauci-trump-administration-barred-044100548.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ISFgRUJAd0AiFlbAI29O5g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NTkuNTQ5OTI5Njc2NTEy/https://s.yimg.com/uu/api/res/1.2/QfsAekpOw9IUoNarDZdjxg--~B/aD01MzM7dz03MTE7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/EN/business_insider_articles_888/1f77a97dd99116d934f819bc42e9b491", "publishedAt": "2020-02-29T04:41:00Z", "content": "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, speaking at a press conference about the coronavirus, February 26, 2020.\r\nMichael Brochstein / Echoes Wire/Barcroft Media via Getty Images\r\n<ul><li>The Trump administration … [+8139 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "U.N. chief recommends ministers, diplomats skip travelling to meeting due to coronavirus risks", "description": "More than 7,000 people usually attend the annual meeting, officials said, which is dedicated to the promotion of gender equality and the empowerment of women. It is due to be held from March 9 to 20.", "url": "https://www.thehindu.com/news/international/un-chief-recommends-ministers-diplomats-skip-travelling-to-meeting-due-to-coronavirus-risks/article30948804.ece", "urlToImage": "https://www.thehindu.com/news/international/1jkwbf/article30521729.ece/ALTERNATES/LANDSCAPE_615/ANTONIOGUTERRES", "publishedAt": "2020-02-29T04:48:46Z", "content": "U.N. Secretary-General Antonio Guterres has recommended that ministers and diplomats skip travelling to a meeting in New York of the Commission on the Status of Women due to the coronavirus outbreak, according to a letter seen by Reuters on Friday.\r\nMore than… [+1293 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Elliott built a stake in Twitter, is pushing for changes - sources", "description": "Activist hedge fund Elliott Management, which often pushes technology companies to improve operations, has built a stake in Twitter Inc and is pushing for changes, including removing the chief executive officer, two people familiar with the matter said on Fri…", "url": "https://www.channelnewsasia.com/news/business/elliott-built-a-stake-in-twitter--is-pushing-for-changes---sources-12485010", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12485008/16x9/991/557/6a428658aaf1be4386c79c00100d7132/PQ/file-photo--the-twitter-logo-displayed-on-a-screen-on-the-floor-of-the-nyse-5.jpg", "publishedAt": "2020-02-29T04:26:04Z", "content": "NEW YORK: Activist hedge fund Elliott Management, which often pushes technology companies to improve operations, has built a stake in Twitter Inc and is pushing for changes, including removing the chief executive officer, two people familiar with the matter s… [+1835 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "US Postpones ASEAN Regional Summit Due To Coronavirus: US Official", "description": "The United States has delayed a regional ASEAN summit scheduled to take place in Las Vegas next month due to fears of the coronavirus, a senior administration official said Friday.", "url": "https://www.ndtv.com/world-news/us-postpones-asean-regional-summit-in-las-vegas-due-to-coronavirus-us-official-2187532", "urlToImage": "https://c.ndtvimg.com/2020-02/8shbh4pg_coronavirus-global-map-reuters_625x300_29_February_20.jpg", "publishedAt": "2020-02-29T04:49:23Z", "content": "The announcement came as California officials confirmed the second coronavirus case in the US.\r\nWashington: The United States has delayed a regional ASEAN summit scheduled to take place in Las Vegas next month due to fears of the coronavirus, a senior adminis… [+1709 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Jim Newell", "title": "Tom Steyer Gives South Carolina One Last, Bizarre Show", "description": "Tom Steyer had invested tens of millions of dollars into the state. The only thing left to do was dance.", "url": "https://slate.com/news-and-politics/2020/02/tom-steyer-juvenile-put-on-a-bizarre-closing-south-carolina-rally.html", "urlToImage": "https://compote.slate.com/images/4b126285-7207-4a41-bc50-6f616b54e0b9.png?width=780&height=520&rect=1018x679&offset=0x9", "publishedAt": "2020-02-29T05:09:27Z", "content": "Tom Steyer and Juvenile. How did we get here?\r\n<ol><li>\r\nTop General Orders Removal of All Confederate Paraphernalia From Marine Bases\r\n </li><li>\r\nElizabeth Warrens Deft Approach to Male Bluster, as Seen in a Disastrous Live Chris Matthews Interview\r\n </li><… [+5349 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "CBS puts the Amazing Race on hiatus due to the coronavirus outbreak. Now what will subby do on Wednesday nights? [Weird]", "description": "CBS puts the Amazing Race on hiatus due to the coronavirus outbreak. Now what will subby do on Wednesday nights?", "url": "https://www.fark.com/comments/10727604/CBS-puts-Amazing-Race-on-hiatus-due-to-coronavirus-outbreak-Now-what-will-subby-do-on-Wednesday-nights", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/N/Nc/fark_NcFdD5LyP0VrjfI_1hA4Mb38-NA.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1583125200&Signature=GjoxbNNYXVi0gb0cZk7nrTOYxyE%3D", "publishedAt": "2020-02-29T04:47:42Z", "content": "<li>Links are submitted by members of the Fark community.\r\n</li><li>When community members submit a link, they also write a custom headline for the story.\r\n</li><li>Other Farkers comment on the links. This is the number of comments. Click here to read them.\r\n… [+117 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Matt Milano", "title": "Google Employee Diagnosed With Coronavirus", "description": "Despite limiting travel, an employee at Google’s Switzerland offices has been diagnosed with the coronavirus. The post Google Employee Diagnosed With Coronavirus appeared first on WebProNews.", "url": "http://feedproxy.google.com/~r/WebpronewsTopNewsRssFeed/~3/XikECP3KExs/", "urlToImage": null, "publishedAt": "2020-02-29T05:01:29Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Hassan Rashed)", "title": "Cristiano Ronaldo confident Juventus can turn Champions League tie around against Lyon", "description": "The Serie A champions were beaten 1-0 in the first leg of their last 16 tie against the French club on Wednesday", "url": "https://www.mirror.co.uk/sport/football/news/cristiano-ronaldo-confident-juventus-can-21602030", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21602025.ece/ALTERNATES/s1200/0_Olympique-Lyon-v-Juventus-UEFA-Champions-League-Round-of-16-First-Leg.jpg", "publishedAt": "2020-02-29T04:52:37Z", "content": "Cristiano Ronaldo is confident that Juventus will be able to turn their Champions League tie against Lyon around and progress to the quarter-finals.\r\nThe Serie A champions were beaten 1-0 in the first leg of their last 16 tie on Wednesday after a disappointin… [+2213 chars]"}, {"source": {"id": null, "name": "Juancole.com"}, "author": "Reese Erlich", "title": "Iran goes from Bad to Worse: Hardliners win elections, thanks in part to Trump’s treaty withdrawal", "description": "(Progressive.org) - 'TEHRAN—The parliamentary candidates had rented a large hall for a campaign rally, but only a few hundred supporters showed up. They came to see Mohammad-Bagher Ghalibaf, a leading hardliner and possible presidential candidate next year. A…", "url": "https://www.juancole.com/2020/02/hardliners-elections-withdrawal.html", "urlToImage": "https://media.juancole.com/images/2020/02/man-street-posters.jpg", "publishedAt": "2020-02-29T05:03:37Z", "content": "(Progressive.org) – ‘TEHRANThe parliamentary candidates had rented a large hall for a campaign rally, but only a few hundred supporters showed up. They came to see Mohammad-Bagher Ghalibaf, a leading hardliner and possible presidential candidate next year.\r\nA… [+7122 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Aylin Woodward", "title": "Anthony Fauci, who the Trump administration barred from speaking freely, is a public-health hero. The disease expert guided the US through AIDS, Zika, and Ebola.", "description": "The Trump administration reportedly barred Anthony Fauci, a top US experts on infectious disease, from speaking publicly about the coronavirus outbreak without approval. More »", "url": "https://www.businessinsider.com.au/who-is-anthony-fauci-speech-controlled-by-trump-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5e58ee48fee23d1fc2519c67", "publishedAt": "2020-02-29T04:41:00Z", "content": "<ul><li>\r\nThe Trump administration reportedly barred Anthony Fauci, a top US experts on infectious disease, from speaking publicly about the coronavirus outbreak without approval.\r\n</li><li>\r\nSome of Fauci’s statements about the virus have been at odds with c… [+5807 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Nirmala Sitharaman Sees 4.7% GDP Growth As 'Steadiness' In Economy", "description": "On the impact of coronavirus on the economy, Ms Sitharaman sought to allay any fears saying there is no need to immediately press the \"panic button\", but things could get challenging if the issues prolong for another two or three weeks, citing feedback from t…", "url": "https://www.ndtv.com/business/nirmala-sitharaman-sees-4-7-gdp-growth-as-steadiness-in-economy-2187531", "urlToImage": "https://c.ndtvimg.com/2020-02/m7fbddgg_nirmala-sitharaman-presser-_650x400_01_February_20.jpg", "publishedAt": "2020-02-29T04:49:05Z", "content": "Ms Sitharaman said the government is \"pushing the banks like never before\" to lend in all categories\r\nNew Delhi: Finance Minister Nirmala Sitharaman on Friday termed the 4.7 per cent GDP growth of Q3 as \"steadiness\" in the economy and a good sign, soon after … [+1347 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sanam Mirchandani", "title": "Mid and smallcaps cede their entire 2020 gains", "description": "The broader markets fell in line with the slump in the main benchmarks on Friday.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/mid-and-smallcaps-cede-their-entire-2020-gains/articleshow/74411890.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74411152,width-1070,height-580,imgsize-1034475,overlay-etwealth/photo.jpg", "publishedAt": "2020-02-29T04:31:09Z", "content": "The renewed bull run in mid- and small-cap shares has come to an abrupt halt. The selloff in the stock market in the last one week triggered by a global spread of coronavirus has resulted in these shares giving up all their gains of 2020.\r\nThe broader markets… [+4420 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "James Massola", "title": "Passengers on Emirates coronavirus flight spent nearly two hours in Bali airport", "description": "The presence of the woman in the terminal raises questions about other passengers in the Denpasar airport in Bali being exposed to the virus.", "url": "https://www.smh.com.au/world/asia/passengers-on-emirates-coronavirus-flight-spent-nearly-two-hours-in-bali-airport-20200229-p545m4.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2779272904483431%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_58%2C$y_115/t_crop_custom/q_86%2Cf_auto/783de86336457d452f417a3faf30af92348a4cc6", "publishedAt": "2020-02-29T04:48:37Z", "content": "\"The person passed through the terminal hall, where if she was showing symptoms [fever], the scanner would've picked it up,\" Doctor Darsana said.\r\n\"The officers that handled them were all wearing proper self-protection items [masks] and we have hand sanitiser… [+4026 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Oregon reports first novel coronavirus case of unknown origin", "description": "​​According to the statement, the infected individual identified as a resident of Washington County neither had history of travel to a country where the virus was circulating, nor is believed to have had a close contact with another confirmed case.", "url": "https://economictimes.indiatimes.com/news/international/world-news/oregon-reports-first-novel-coronavirus-case-of-unknown-origin/articleshow/74411071.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74411102,width-1070,height-580,imgsize-366572,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-29T04:11:55Z", "content": "The latest confirmed case of Coronavirus in Oregon is of unknown origin said Oregon health authority when it declared its first confirmed presumptive case of novel coronavirus on Friday. \r\nAccording to the statement, the infected individual identified as a re… [+334 chars]"}, {"source": {"id": null, "name": "Fin24.com"}, "author": null, "title": "Fin24.com | Coronavirus will likely knock SA mining, tourism and telecoms - report", "description": "A weaker growth pace for the Chinese economy due to the coronavirus outbreak will have knock-on effects on sectors in SA's economy.", "url": "https://www.fin24.com/Economy/South-Africa/coronavirus-will-likely-knock-sa-mining-tourism-and-telecoms-report-20200229-2", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10017/5c821328e8f04ccfb0cd9b4ad7d32f1e.png", "publishedAt": "2020-02-29T05:00:03Z", "content": "China is South Africa's largest supplier of imports, and its biggest buyer of exports - and the impact of the coronavirus outbreak on the Chinese economy will certainly be felt in the South African economy, according to a PwC report.\r\nThe report on the impact… [+4605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Coronavirus: World's richest lose $444 billion after hellish week for markets", "description": "Last week was an expensive one for most investors, even for billionaires. The combined fortunes of the world’s 500 richest people fell by $444 billion as the coronavirus continued to spread — and spread fear — rattling equity markets worldwide.", "url": "https://timesofindia.indiatimes.com/business/international-business/coronavirus-worlds-richest-lose-444-billion-after-hellish-week-for-markets/articleshow/74411457.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74411446,width-1070,height-580,imgsize-149637,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-29T04:38:01Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Businesstoday.in"}, "author": "Reuters", "title": "Coronavirus outbreak: Bill Gates outlines actions to combat 'once-in-a-century' pathogen", "description": "The novel coronavirus that first emerged in China and has now spread to 46 countries is much harder to stop than similar viruses that caused the Middle East Respiratory Syndrome (MERS) or Severe Acute Respiratory Syndrome (SARS)", "url": "https://www.businesstoday.in/current/world/coronavirus-outbreak-bill-gates-once-in-a-century-pathogen/story/397171.html", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/billgates_505_290220103655.jpg", "publishedAt": "2020-02-29T05:06:54Z", "content": "Philanthropist Bill Gates on Friday urged wealthy nations to help low and middle-income countries strengthen their health systems in hopes of slowing the spread of the coronavirus, which Gates said has started to behave like a \"once-in-a-century\" pathogen. \"B… [+1641 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Anthony Fauci, who the Trump administration barred from speaking freely, is a public-health hero. The disease expert guided the US through AIDS, Zika, and Ebola.", "description": "The Trump administration reportedly barred Anthony Fauci, a top US experts on infectious disease, from speaking publicly about the coronavirus outbreak without approval. Some of Fauci's statements about the virus have been at odds with claims from President T…", "url": "https://www.businessinsider.com/who-is-anthony-fauci-speech-controlled-by-trump-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5e59a9cefee23d554757af93?width=1200&format=jpeg", "publishedAt": "2020-02-29T04:41:00Z", "content": "Anthony Fauci has guided the US through the AIDS, Zika, and Ebola epidemics. \r\nHe's been the director of the US' National Institute of Allergy and Infectious Diseases (NIAID) since 1984, advising six presidents. George W. Bush awarded him the Presidential Med… [+1420 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "Associated Press", "title": "AP Fact Check: Democrats distort coronavirus readiness", "description": "WASHINGTON (AP) \u0097 Democratic presidential contenders are describing the federal infectious-disease bureaucracy as rudderless and ill-prepared for the coronavirus threat because of budget cuts and ham-handed leadership by President Donald Trump. That\u0092s a disto…", "url": "https://www.freerepublic.com/focus/f-news/3820446/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:30:51Z", "content": "Skip to comments.\r\nAP Fact Check: Democrats distort coronavirus readinessAssociated Press ^\r\n | February 26, 2020\r\n | Lauran Neergaard and Calvin Woodward\r\nPosted on 02/28/2020 8:30:51 PM PST by karpov\r\nWASHINGTON (AP) — Democratic presidential contenders are… [+2830 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "New York Post", "title": "Democrats\u0092 disgraceful dissembling only increases coronavirus threat", "description": "In a clear sign that they\u0092re not truly worried about the COVID-19 threat, many Democrats are using it as another club to hit President Trump \u0097 facts be damned. At Tuesday\u0092s debate, Mike Bloomberg smugly asserted, \u0093There\u0092s nobody here to figure out what the he…", "url": "https://www.freerepublic.com/focus/f-news/3820449/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:33:21Z", "content": "Skip to comments.\r\nDemocrats disgraceful dissembling only increases coronavirus threatNew York Post ^\r\n | February 28, 2020\r\n | Post Editorial Board\r\nPosted on 02/28/2020 8:33:21 PM PST by karpov\r\nIn a clear sign that they’re not truly worried about the COVID… [+2404 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "hopkinsmedicine", "title": "Coronavirus Disease 2019 vs. the Flu", "description": "Influenza (\u0093the flu\u0094) and COVID-19, the illness caused by the new coronavirus, are both infectious respiratory illnesses. Although the symptoms of COVID-19 and the flu can look similar, the two illnesses are caused by different viruses. As of Feb. 28, 2020, t…", "url": "https://www.freerepublic.com/focus/f-news/3820450/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:34:13Z", "content": "Skip to comments.\r\nCoronavirus Disease 2019 vs. the Fluhopkinsmedicine ^\r\n | 2/28/20\r\n | Lisa Lockerd Maragakis, M.D., M.P.H.\r\nPosted on 02/28/2020 8:34:13 PM PST by NoLibZone\r\nInfluenza (“the flu”) and COVID-19, the illness caused by the new coronavirus, are… [+4242 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Adam Schrader", "title": "Gwyneth Paltrow admits ‘Shallow Hal’ was a ‘disaster’", "description": "Gwyneth Paltrow admits her role co-starring in the 2001 drama “Shallow Hal” was a “disaster.” The “Goop” founder makes the admission in a Netflix US-tweeted video, in which she plays a game called “The BFF Test With Gwyneth Paltrow” with assistant Kevin Keati…", "url": "https://nypost.com/2020/02/28/gwyneth-paltrow-admits-shallow-hal-was-a-disaster/", "urlToImage": "https://thenypost.files.wordpress.com/2020/02/msdshha-fe005.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-02-29T04:42:23Z", "content": "Gwyneth Paltrow admits her role co-starring in the 2001 drama Shallow Hal was a disaster.\r\nThe “Goop” founder makes the admission in a Netflix US-tweeted video, in which she plays a game called The BFF Test With Gwyneth Paltrow with assistant Kevin Keating, w… [+1929 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": "ANDRE CHUMKO", "title": "Coronavirus: Can you catch coronavirus twice?", "description": "Reports of a woman catching the virus twice shouldn't be cause for concern, experts here say.", "url": "https://www.stuff.co.nz/national/health/119914064/coronavirus-can-you-catch-coronavirus-twice", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/1/z/e/9/5/1/image.related.StuffLandscapeSixteenByNine.1420x800.1ze6a8.png/1582950192502.jpg", "publishedAt": "2020-02-29T04:23:10Z", "content": "Experts say despite reports of people being able to contract coronavirus twice, people shouldn't panic as there's not enough research to support that conclusion definitively.\r\nThe Times reported a case of a Japanese woman who had tested positive for the virus… [+3491 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Melissa Gomez, Evan Halper", "title": "Democratic candidates tell Trump, 'do your damn job' on coronavirus outbreak", "description": "Democratic presidential candidates harshly criticized Trump for his response to the coronavirus outbreak. On Friday, Trump accused Democrats of using the outbreak to bring him down.", "url": "https://www.latimes.com/politics/story/2020-02-28/democratic-candidates-criticize-trump-coronavirus-response", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/27c8181/2147483647/strip/true/crop/6160x3234+0+436/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbe%2Fc1%2F621ad3af4406bf313281a341fda9%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1204035891.jpg", "publishedAt": "2020-02-29T04:32:42Z", "content": "Democratic presidential candidates are questioning President Trumps response to the global coronavirus outbreak and urging him, among other things, to do his damn job. \r\nCandidates, many campaigning in South Carolina on the eve of the states primary election … [+4295 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "Radio Farda", "title": "First Prominent Cleric In Iran Dies Of Coronavirus", "description": "81-year old cleric Hadi Khosroshahi, has died of coronavirus in Iran, local media reported. A prominent figure in IranÂ\u0092s hole city of Qom, Khosroshahi was a black-turbaned cleric carrying the title of \"Sayyid,\" meaning a descendent of Prophet Muhammad. Khosr…", "url": "https://www.freerepublic.com/focus/f-news/3820451/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:37:16Z", "content": "Skip to comments.\r\nFirst Prominent Cleric In Iran Dies Of CoronavirusRadio Farda ^\r\n | 28 Feb 2020\r\n | Radio Farda\r\nPosted on 02/28/2020 8:37:16 PM PST by Cronos\r\n81-year old cleric Hadi Khosroshahi, has died of coronavirus in Iran, local media reported. \r\nA … [+4147 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "The Epoch Times", "title": "Kudlow: What Could Sink the Economy Is Socialism, Not Coronavirus", "description": "WASHINGTON\u0097Top White House economic adviser Larry Kudlow said Friday that socialism rather than coronavirus poses a greater risk to the U.S. economy amid ongoing concerns surrounding the COVID-19 virus. At this year\u0092s Conservative Political Action Conference …", "url": "https://www.freerepublic.com/focus/f-news/3820445/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:18:08Z", "content": "Skip to comments.\r\nKudlow: What Could Sink the Economy Is Socialism, Not CoronavirusThe Epoch Times ^\r\n | February 28, 2020 Updated: February 28, 2020\r\n | EMEL AKAN\r\nPosted on 02/28/2020 8:18:08 PM PST by E. Pluribus Unum\r\nWASHINGTON—Top White House economic … [+4042 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "Hoarding in the USA? Coronavirus sparks consumer concerns", "description": "American consumers awoke this week to the coronavirus threat and are beginning to display a symptom of the illness seen in Asia and Europe - hoarding.", "url": "https://bdnews24.com/world/americas/2020/02/29/hoarding-in-the-usa-coronavirus-sparks-consumer-concerns", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/29/us-hoarding-290220-01.jpg/ALTERNATES/w640/us-hoarding-290220-01.jpg", "publishedAt": "2020-02-29T04:53:25Z", "content": "Nothing in the United States yet resembles what Italy witnessed in recent days - where supermarket shelves were stripped bare and videos posted on social media showed consumers coming to blows over bags of pasta.\r\nBut there is unquestionably a growing sense o… [+4511 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Deb Price,Louise Moon, Deb Price,Louise Moon", "title": "Online prices of liquid soap, disinfectants, toilet paper soar in Hong Kong as coronavirus fuels panic buying, even robbery", "description": "If online prices provide an accurate measurement, then Hong Kong should be known as the City of Very Clean Hands, judging by the soaring costs of liquid soap, disinfectants and wipes.The median price of liquid soaps including disinfectants soared by more than…", "url": "https://www.scmp.com/business/article/3052812/online-prices-liquid-soap-disinfectants-toilet-paper-soar-hong-kong", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/28/d2182d92-59d3-11ea-b438-8452af50d521_image_hires_122507.jpg?itok=3uJ_kI_n&v=1582863917", "publishedAt": "2020-02-29T04:45:12Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "mirrornews@mirror.co.uk (Joshua Taylor)", "title": "Coronavirus: Emergency laws drawn up to keep UK moving if disease sweeps nation", "description": "Army doctors could be deployed in NHS hospitals and maximum class sizes at schools could be scrapped if too many teachers suffer symptoms - meanwhile the emergency COBRA committee is preparing to meet", "url": "https://www.mirror.co.uk/news/politics/coronavirus-emergency-laws-drawn-up-21601955", "urlToImage": null, "publishedAt": "2020-02-29T04:24:07Z", "content": null}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "UK's Johnson says coronavirus top priority, as first Briton dies", "description": "Prime Minister Boris Johnson said slowing the spread of the coronavirus was now his government's top priority, shortly after news on Friday that the first Briton had died of the disease after contracting it on a cruise ship moored in Japan.", "url": "https://bdnews24.com/world/2020/02/29/uk-s-johnson-says-coronavirus-top-priority-as-first-briton-dies", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/29/uk-johnson-290220-01.jpg/ALTERNATES/w640/uk-johnson-290220-01.jpg", "publishedAt": "2020-02-29T04:20:09Z", "content": "The country was right to be concerned about the virus, he said, as the number of people infected in Britain rose to 20.\r\n\"The issue of coronavirus is something that is now the government's top priority,\" he told broadcasters in his first statement on the dise… [+2030 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "WADA cancels symposium over coronavirus concerns", "description": "More sports News: The World Anti-Doping Agency has cancelled its annual symposium and related athlete session in Switzerland over concerns about the coronavirus epidemi", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/wada-cancels-symposium-over-coronavirus-concerns/articleshow/74411589.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74411580,width-1070,height-580,imgsize-185227,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-02-29T04:52:47Z", "content": "MONTREAL: The World Anti-Doping Agency has cancelled its annual symposium and related athlete session in Switzerland over concerns about the coronavirus epidemic.\r\nIn a statement issued on Friday, Montreal-based WADA said it took the decision based on the Swi… [+1813 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "N Korea's Kim guides military drills, warns 'serious consequences' if virus breaks out -KCNA", "description": "North Korean leader Kim Jong Un oversaw military drills on Friday, state media KCNA said, a rare public outing amid efforts to prevent an outbreak of the coronavirus in the isolated country.", "url": "https://bdnews24.com/world/asia-pacific/2020/02/29/n-korea-s-kim-guides-military-drills-warns-serious-consequences-if-virus-breaks-out--kcna", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/29/kim-coronavirus-290220-01.jpg/ALTERNATES/w640/kim-coronavirus-290220-01.jpg", "publishedAt": "2020-02-29T04:44:29Z", "content": "North Korea has not confirmed any cases of the virus, but state media said a month-long quarantine period had been imposed for people showing symptoms and \"high-intensity\" measures were taken including reinforcing checks in border regions and at airports and … [+2310 chars]"}, {"source": {"id": null, "name": "Bdnews24.com"}, "author": null, "title": "N Korea's Kim guides military drills, warns 'serious consequences' if virus breaks out", "description": "North Korean leader Kim Jong Un oversaw military drills on Friday, state media KCNA said, a rare public outing amid efforts to prevent an outbreak of the coronavirus in the isolated country.", "url": "https://bdnews24.com/world/asia-pacific/2020/02/29/n-korea-s-kim-guides-military-drills-warns-serious-consequences-if-virus-breaks-out", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2020/02/29/kim-coronavirus-290220-01.jpg/ALTERNATES/w640/kim-coronavirus-290220-01.jpg", "publishedAt": "2020-02-29T04:44:29Z", "content": "North Korea has not confirmed any cases of the virus, but state media said a month-long quarantine period had been imposed for people showing symptoms and \"high-intensity\" measures were taken including reinforcing checks in border regions and at airports and … [+2310 chars]"}, {"source": {"id": null, "name": "Startribune.com"}, "author": "BRIAN MELLEY", "title": "Restaurants in LA's Koreatown reel amid coronavirus rumor", "description": "In a Koreatown restaurant known for its beef bone broth soup, the lunchtime crowd Friday was half its normal size. The reason was a virulent rumor about a customer with coronavirus.", "url": "http://www.startribune.com/restaurants-in-la-s-koreatown-reel-amid-coronavirus-rumor/568324362/", "urlToImage": "http://assets.startribune.com/static/img/branding/logos/strib-social-card.png?d=1582740040", "publishedAt": "2020-02-29T05:05:27Z", "content": "LOS ANGELES In a Koreatown restaurant known for its beef bone broth soup, the lunchtime crowd Friday was half its normal size. The reason was a virulent rumor about a customer with coronavirus.\r\nHan Bat Shul Lung Tang was one of five restaurants that lost bus… [+4602 chars]"}, {"source": {"id": null, "name": "Westernjournal.com"}, "author": "Johnathan Jones, The Western Journal", "title": "If Biden really thinks men have no right to touch women, how does he explain these cringe-worthy photos?", "description": "Former Vice President Joe Biden was campaigning in South Carolina on Thursday when he went off script and asked his audience to imagine a naked woman while he was discussing women's empowerment. Biden, who is known for being handsy with women and children and…", "url": "https://www.westernjournal.com/biden-really-thinks-men-no-right-touch-women-explain-cringe-worthy-photos/", "urlToImage": "https://www.wnd.com/wp-content/uploads/2019/05/creepy_joe_biden.jpg", "publishedAt": "2020-02-29T04:33:07Z", "content": "Former Vice President Joe Biden was campaigning in South Carolina on Thursday when he went off script and asked his audience to imagine a naked woman while he was discussing women's empowerment.\r\nBiden, who is known for being handsy with women and children an… [+4684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rajesh Mascarenhas", "title": "The charm of PE multiples: Here are the safe havens", "description": "About 30 stocks from the BSE500 index have managed to buck the trend on D-Street.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/the-charm-of-pe-multiples-here-are-the-safe-havens/articleshow/74411276.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74411302,width-1070,height-580,imgsize-792660,overlay-etmarkets/photo.jpg", "publishedAt": "2020-02-29T04:41:38Z", "content": "The Indian stock market plunged sharply on Friday with the Sensex declining 3.64 per cent, its biggest single-day fall since August 24, 2015, on fears that coronavirus outbreak may trigger recession across major economies. Indian benchmark fell 7 per cent in … [+896 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Colin Gleeson", "title": "Coronavirus rocks financial world as hopes for containment fade", "description": "Business Week: Also in the news was Brexit; the economy; tax reforms; and Eason deal", "url": "https://www.irishtimes.com/business/coronavirus-rocks-financial-world-as-hopes-for-containment-fade-1.4187948", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4187947&origw=1440", "publishedAt": "2020-02-29T05:00:26Z", "content": "Hopes that the coronavirus could be contained to China vanished over the past week as infections spread around the world, countries started stockpiling medical equipment, and stock markets plummeted as fears grew of a global recession.\r\nWe have a crisis befor… [+6767 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Mukesh Ambani Named World's Ninth Richest, With 2 Others", "description": "Mr Ambani is restructuring Reliance Industries to facilitate the planned strategic investments in group businesses - Reliance Jio, Reliance Retail, refining and petrochemicals. The conglomerate aims to be a zero net debt company in 18 months and is in discuss…", "url": "https://www.ndtv.com/business/mukesh-ambani-named-worlds-ninth-richest-with-2-others-2187522", "urlToImage": "https://i.ndtvimg.com/i/2016-12/mukesh-ambani_650x400_41480579988.jpg", "publishedAt": "2020-02-29T04:28:30Z", "content": "Mr Ambani maintained a place in the top 10 for the second time after a $13 billion surge in his wealth\r\nNew Delhi: Reliance Industries Ltd (RIL) chief Mukesh Ambani is the ninth richest person in the world along with Steve Ballmer of Microsoft and Larry Page … [+1781 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "Sen. Kennedy Grills Acting DHS Secretary: Americans Deserve Answers On Coronavirus And I'm Not Getting Them From You", "description": "Sen. John Kennedy (R-LA) questions Acting Secretary of Homeland Security Chad Wolf on coronavirus at an Appropriations Committee hearing this week.\r\n\r\nSENATOR JOHN KENNEDY (R-LA): Thank you, Madame Chairman. Thank you, Mr. Secretary, for being here. How many …", "url": "https://www.realclearpolitics.com/video/2020/02/28/sen_kennedy_grills_acting_dhs_secretary_americans_deserve_answers_on_coronavirus_and_im_not_getting_them_from_you.html", "urlToImage": "https://assets.realclear.com/images/50/502851.jpg", "publishedAt": "2020-02-29T04:37:33Z", "content": "Sen. John Kennedy (R-LA) questions Acting Secretary of Homeland Security Chad Wolf on coronavirus at an Appropriations Committee hearing this week.SENATOR JOHN KENNEDY (R-LA): Thank you, Madame Chairman. Thank you, Mr. Secretary, for being here. How many case… [+6999 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Moneycontrol Pro Weekender: Time to pay the bill?", "description": "There is no reason to believe that the worst is behind us.", "url": "https://www.moneycontrol.com/news/business/moneycontrol-pro-weekender-time-to-pay-the-bill-4988111.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/05/moneycontrol-pro-1-770x433.png", "publishedAt": "2020-02-29T04:43:59Z", "content": "Dear Reader,\r\nIndias December quarter GDP numbers, announced on February 28, are irrelevant at worst and a sideshow at best now. The threat of a global pandemic tends to concentrate the mind and push out other concerns.\r\nThe markets had initially hoped that t… [+6194 chars]"}]