[{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: World must prepare for pandemic, says WHO - BBC News - BBC News", "description": "Coronavirus: World must prepare for pandemic, says WHO - BBC News BBC News Democracies Are Better at Fighting Outbreaks The Atlantic Coronavirus: World must prepare for pandemic, says WHO BBC News Is the Coronavirus Outbreak a Pandemic Yet? The New York Times…", "url": "https://www.youtube.com/watch?v=UcxHL8LHI_A", "urlToImage": "https://i.ytimg.com/vi/UcxHL8LHI_A/maxresdefault.jpg", "publishedAt": "2020-02-25T08:42:18Z", "content": "Fears are growing that the coronavirus outbreak could become a pandemic as new cases are reported around the world. The virus, which emerged in China, has spread to at least 29 countries.The World Health Organization has said the world should do more to prepa… [+604 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Kojima Productions Is Skipping Game Developer's Conference Over Coronavirus Fears", "description": "Kojima Productions is backing out of the 2020 Game Developer's Conference (GDC) due to the COVID-19 outbreak. The Japanese video game development studio announced on its website:\"Kojima Productions has made the difficult decision to cancel our participation a…", "url": "https://hypebeast.com/2020/2/kojima-productions-skipping-game-developers-conference-covid-19", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F02%2Fkojima-productions-skipping-game-developers-conference-covid-19-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-02-25T08:22:48Z", "content": "Kojima Productions is backing out of the 2020 Game Developer’s Conference (GDC) due to the COVID-19 outbreak. The Japanese video game development studio announced on its website:\r\n“Kojima Productions has made the difficult decision to cancel our participation… [+933 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Sarah Newey, Anne Gulland", "title": "Coronavirus: a quick guide to the outbreak sweeping the world", "description": "What is a coronavirus?", "url": "https://www.telegraph.co.uk/news/2020/02/25/what-coronavirus-start-spread-pandemic/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/02/17/TELEMMGLPICT000225059365-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "publishedAt": "2020-02-25T09:03:14Z", "content": "What is a coronavirus?\r\nCoronaviruses are a family of viruses that cause disease in animals. Seven, including the new virus, have made the jump to humans but most just cause cold-like symptoms.\r\nTwo coronaviruses Middle East respiratory syndrome (Mers) and se… [+6750 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Buffett on coronavirus, capitalism & why he finally got an iPhone", "description": "Buffett on coronavirus, capitalism & why he finally got an iPhone\"It is scary stuff,\" Buffett said on coronavirus. \"I don't think it should affect what you do in stocks.\"", "url": "https://economictimes.indiatimes.com/news/international/business/warren-buffet-on-coronavirus-capitalism-why-he-replaced-his-old-phone-with-an-iphone/articleshow/74297780.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74297910,width-1070,height-580,imgsize-520772,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-25T08:15:18Z", "content": "Berkshire's billionaire CEO Warren Buffett — legendary investor and one of Apple's biggest shareholders — has finally traded in his old flip phone for an iPhone.\r\nIn an interview to CNBC, Buffett covered a wide array of topics ranging from his thoughts on Dem… [+2580 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Brenda Richardson, Contributor, Brenda Richardson, Contributor https://www.forbes.com/sites/brendarichardson/", "title": "Coronavirus Fears Cause Mortgage Rates To Tumble As Investors Flee To Safe Havens", "description": "Investors are fleeing to safe-haven investments amid coronavirus fears, pushing U.S. mortgage rates to new lows.", "url": "https://www.forbes.com/sites/brendarichardson/2020/02/25/coronavirus-fears-cause-mortgage-rates-to-tumble-as-investors-flee-to-safe-havens/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e54d190d378190007f439cf%2F960x0.jpg", "publishedAt": "2020-02-25T08:20:04Z", "content": "Homeowners and would-be home buyers are taking advantage of the drop in mortgage rates.\r\nGetty\r\nAs the coronavirus spreads across the globe, the U.S. housing market is bracing for the economic fallout from the epidemic, which was first identified in Wuhan, Ch… [+7562 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Adam Miller", "title": "Why the coronavirus outbreak isn't considered a pandemic just yet", "description": "As the coronavirus outbreak continues to spread outside of China, experts say the situation is rapidly moving toward a pandemic. Adam Miller looks at why the World Health Organization isn't calling it one just yet.", "url": "https://www.cbc.ca/news/health/coronavirus-pandemic-canada-world-1.5474387", "urlToImage": "https://i.cbc.ca/1.5474491.1582581832!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/italy-coronavirus.JPG", "publishedAt": "2020-02-25T09:00:00Z", "content": "As the coronavirus outbreak continues to spread outside of China with hundreds of confirmed cases on a daily basis, experts say the situation is rapidly moving toward what's known as a pandemic.\r\nBut World Health Organization Director General Tedros Adhanom G… [+5365 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraq's Sadr suspends protest call over coronavirus fears - statement", "description": "Populist Iraqi Shi'ite cleric Moqtada al-Sadr suspended a call for his followers to hold massive protests against his political opponents due to fears over the spread of coronavirus on Tuesday, minutes after the health ministry urged citizens to avoid public …", "url": "https://www.reuters.com/article/us-iraq-protests-idUSKCN20J11K", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-25T08:51:06Z", "content": "BAGHDAD (Reuters) - Populist Iraqi Shi’ite cleric Moqtada al-Sadr suspended a call for his followers to hold massive protests against his political opponents due to fears over the spread of coronavirus on Tuesday, minutes after the health ministry urged citiz… [+313 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "China says WSJ reporter in Wuhan can remain in country until end of epidemic", "description": "China's foreign ministry said on Tuesday that one of the three Wall Street Journal reporters who were ordered to leave the country can remain in China as she is stranded in Wuhan, the epicenter of the coronavirus outbreak.", "url": "https://www.reuters.com/article/us-usa-china-media-wsj-idUSKCN20J0YF", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-25T08:14:53Z", "content": "BEIJING (Reuters) - China’s foreign ministry said on Tuesday that one of the three Wall Street Journal reporters who were ordered to leave the country can remain in China as she is stranded in Wuhan, the epicenter of the coronavirus outbreak. \r\nSpokesman Zhao… [+690 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "No Opec decision yet on oil cuts: Saudi Arabia", "description": "\"Everything serious requires attendance,\" he told reporters on the sidelines of an industry conference in Riyadh.", "url": "https://economictimes.indiatimes.com/markets/commodities/news/opec-countries-should-not-be-complacent-about-coronavirus-saudi-energy-minister/articleshow/74299080.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74299067,width-1070,height-580,imgsize-118760,overlay-etmarkets/photo.jpg", "publishedAt": "2020-02-25T08:50:34Z", "content": "Riyadh: Saudis Arabia's Minister of Energy, Prince Abdulaziz bin Salman, said on Tuesday that Opec+ countries should not be complacent about the coronavirus.\r\n\"Everything serious requires attendance,\" he told reporters on the sidelines of an industry conferen… [+971 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Will Horton, Contributor, Will Horton, Contributor https://www.forbes.com/sites/willhorton1/", "title": "ANA’s Boeing 787 Order Switches From Rolls-Royce To GE, Out Of Practicality More Than Vengeance", "description": "All Nippon Airways intends to acquire up to 20 more Boeing 787 Dreamliners, giving Boeing and its 787 program a boost during a downturn made worse by the Coronavirus.", "url": "https://www.forbes.com/sites/willhorton1/2020/02/25/anas-boeing-787-order-switches-from-rolls-royce-to-ge-out-of-practicality-more-than-vengeance/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F130600777%2F960x0.jpg", "publishedAt": "2020-02-25T08:20:59Z", "content": "All Nippon Airways intends to acquire up to 20 more Boeing 787 Dreamliners, giving Boeing and its 787 program a boost during a downturn made worse by the Coronavirus. ANA was the launch customer and operator of the 787, and this deal, once finalised, will be … [+6843 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "South Korea 'very grave', President Moon Jae-in says as coronavirus cases approach 900", "description": "The Korea Centers for Disease Control and Prevention (KCDC) confirmed 60 new cases in its morning update -- after three days of triple-digit increases -- taking the tally to 893, the largest national total anywhere outside China. More than 80% of the infectio…", "url": "https://economictimes.indiatimes.com/news/international/world-news/south-korea-very-grave-moon-says-as-coronavirus-cases-approach-900/articleshow/74298414.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74298434,width-1070,height-580,imgsize-398162,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-25T08:17:06Z", "content": "The novel coronavirus outbreak in South Korea is \"very grave\", President Moon Jae-in said Tuesday as he visited its epicentre, even as the country announced its smallest rise in cases for several days.\r\nThe Korea Centers for Disease Control and Prevention (KC… [+2859 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Gulf states suspend more flights", "description": "Gulf states are imposing flight restrictions to try to slow the spread of the virus.", "url": "https://www.bbc.co.uk/news/business-51626803", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/33D8/production/_111027231_irancorona.jpg", "publishedAt": "2020-02-25T09:10:02Z", "content": "Image copyrightAnadolu Agency\r\nGulf states have imposed more flight restrictions in an effort to try to slow the spread of the coronavirus outbreak.\r\nThe United Arab Emirates (UAE) has suspended all flights to and from Iran apart from Tehran.\r\nBahrain has sus… [+1497 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Maria Martinez", "title": "French business sentiment upbeat in February - MarketWatch", "description": "French manufacturing sector sentiment remains unchanged in February from January, as business leaders became more optimistic about activity in the sector...", "url": "https://www.marketwatch.com/story/french-business-sentiment-upbeat-in-february-2020-02-25-34853057", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-02-25T08:30:00Z", "content": "French manufacturing sector sentiment remains unchanged in February from January, as business leaders became more optimistic about activity in the sector despite coronavirus fears.\r\nFigures from statistic agency Insee's monthly survey on Tuesday showed that m… [+693 chars]"}, {"source": {"id": null, "name": "Designtaxi.com"}, "author": null, "title": "Short Film Shows Wuhan’s Hauntingly Deserted Streets Amid Coronavirus Lockdown", "description": "[Click here to view the video in this article] Video screenshot via KernelNguyen / Shutterstock.com Wuhan, where the COVID-19 started spreading, is currently on lockdown as an attempt to prevent the novel virus from traveling. Filmmaker Lan Bo has revealed a …", "url": "https://designtaxi.com/news/408764/Short-Film-Shows-Wuhan-s-Hauntingly-Deserted-Streets-Amid-Coronavirus-Lockdown/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+designtaxi_news+%28TAXI+Daily+News%29", "urlToImage": "https://editorial.designtaxi.com/editorial-images/news-COVID-19-250220/Wuhan.jpg", "publishedAt": "2020-02-25T08:24:59Z", "content": "Video screenshot via KernelNguyen / Shutterstock.comWuhan, where the COVID-19 started spreading, is currently on lockdown as an attempt to prevent the novel virus from traveling. Filmmaker Lan Bo has revealed a short film, Wuhan: The Long Night, which present… [+1164 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Kuwait reports three new cases of coronavirus, raising total to eight", "description": "Kuwait said on Tuesday three more nationals had been infected with the coronavirus, all of them people who had returned from Iran, state news agency KUNA reported.", "url": "https://www.reuters.com/article/us-china-health-kuwait-idUSKCN20J0XW", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-25T08:13:58Z", "content": "DUBAI (Reuters) - Kuwait said on Tuesday three more nationals had been infected with the coronavirus, all of them people who had returned from Iran, state news agency KUNA reported. \r\nThe three new cases - who were in a stable condition and under quarantine -… [+145 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Blanchard Senior Health Reporter For Mailonline Stephen Matthews Health Editor For Mailonline", "title": "Britons returning from coronavirus-hit northern Italy, Iran or South Korea 'should self-isolate'", "description": "Those who have been to areas in lockdown, such as towns in the Lombardy and Veneto regions, should isolate themselves even if they don't feel ill, Health Secretary Matt Hancock said.", "url": "https://www.dailymail.co.uk/health/article-8041417/Britons-returning-coronavirus-hit-northern-Italy-Iran-South-Korea-self-isolate.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/00/25148622-0-image-a-59_1582589453485.jpg", "publishedAt": "2020-02-25T08:56:57Z", "content": "All Britons who have been to northern Italy should self-isolate at home if they start to feel ill, the government has advised today amid fears the coronavirus outbreak is turning into a pandemic.\r\nThose who have been to areas locked down by Italian officials,… [+12541 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus Puts Europe’s Corporate Bond Market Into Deep Freeze", "description": "(Bloomberg) -- Global borrowers shunned Europe’s corporate debt market for a second day as a cluster of new coronavirus cases in Italy sent yields sharply higher, bringing sales of new bonds to a near standstill.ING Groep’s downsized debt offering Monday is t…", "url": "https://finance.yahoo.com/news/coronavirus-puts-europe-corporate-bond-085100346.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/KtU8mGW3eDk8c9Hs7g9faw--~B/aD0xMTQ4O3c9MTI5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/604362af01f81efd520fd1f220fcac94", "publishedAt": "2020-02-25T08:51:00Z", "content": "(Bloomberg) --\r\nGlobal borrowers shunned Europes corporate debt market for a second day as a cluster of new coronavirus cases in Italy sent yields sharply higher, bringing sales of new bonds to a near standstill.\r\nING Groeps downsized debt offering Monday is … [+1328 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Gulf states suspend more flights - BBC News", "description": "Coronavirus: Gulf states suspend more flights BBC News UAE halts all Iran flights over coronavirus outbreak Al Jazeera English UAE bans Iran flights over COVID-19; at least 15 dead in Iran The Hindu View Full coverage on Google News", "url": "https://www.bbc.com/news/business-51626803", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/33D8/production/_111027231_irancorona.jpg", "publishedAt": "2020-02-25T09:10:49Z", "content": "Image copyrightAnadolu Agency\r\nGulf states have imposed more flight restrictions in an effort to try to slow the spread of the coronavirus outbreak.\r\nThe United Arab Emirates (UAE) has suspended all flights to and from Iran apart from Tehran.\r\nBahrain has sus… [+3356 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "RBI MPC may consider coronavirus impact on Indian economy: Report", "description": "The report titled \"India: Growth and inflation targeting review\", Radhika Rao, Economist at DBS Bank noted that the impact on India is felt through supply chain disruptions from China as well as regional players, who in turn are net importers from China.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-mpc-may-consider-coronavirus-impact-on-indian-economy-report-4975131.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/09/economy-1-770x433.jpg", "publishedAt": "2020-02-25T08:27:06Z", "content": "The Monetary Policy Committee (MPC) of the Reserve Bank of India is likely to consider the developments around COVID-19, which has resulted in supply chain disruptions from China, Singapore's DBS Bank said in a report on Tuesday.\r\nThe report titled \"India: Gr… [+2141 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "European stocks fall again on coronavirus fears", "description": "European stock markets clawed back some of the big losses felt on Monday but fell again later on Tuesday. A surge of new cases of coronavirus, particularly in Italy, has prompted a sell-off across the continent.", "url": "https://www.dw.com/en/european-stocks-fall-again-on-coronavirus-fears/a-52498895", "urlToImage": "https://www.dw.com/image/52305509_304.jpg", "publishedAt": "2020-02-25T09:02:00Z", "content": "European stocks rebounded in early Tuesday trading before falling back again after Monday's battering on the back of renewed coronavirus fears.\r\nThe regional Stoxx 600 index rose 0.5% in the early minutes of European trading but lost those to slip by a signif… [+5124 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "World Table Tennis Championships 2020 postponed until June over coronavirus fears in South Korea", "description": "Next month’s table tennis world championships in South Korea have been postponed until June over health concerns as the east Asian nation grapples with an outbreak of the coronavirus The post World Table Tennis Championships 2020 postponed until June over cor…", "url": "https://www.firstpost.com/sports/world-table-tennis-championships-2020-postponed-until-june-over-coronavirus-fears-in-south-korea-8084011.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2017/06/Table-Tennis-racket-representational-AFP-social.jpg", "publishedAt": "2020-02-25T08:27:58Z", "content": "Seoul: Next months table tennis world championships in South Korea have been postponed until June over health concerns as the east Asian nation grapples with an outbreak of the coronavirus.\r\nRepresentational image. AFP\r\nThe event was scheduled for 22-29 March… [+1206 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Singapore Airlines cuts capacity by 10%, freezes hiring of ground staff as coronavirus takes toll", "description": "Singapore Airlines Ltd has cut nearly 10 percent of its capacity, frozen recruitment for ground positions and deferred spending as it deals with lower demand due to the coronavirus outbreak, according to an internal memo seen by Reuters The post Singapore Air…", "url": "https://www.firstpost.com/business/singapore-airlines-cuts-capacity-by-10-freezes-hiring-of-ground-staff-as-coronavirus-takes-toll-8083951.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/03/Singapore-Airlines-1280.jpg", "publishedAt": "2020-02-25T09:00:40Z", "content": "Singapore: Singapore Airlines Ltd has cut nearly 10 percent of its capacity, frozen recruitment for ground positions and deferred spending as it deals with lower demand due to the coronavirus outbreak, according to an internal memo seen by Reuters.\r\nThe carri… [+1928 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "ktaylor@businessinsider.com (Kate Taylor)", "title": "A Korean Air flight attendant tested positive for coronavirus, as people are desperately trying to cancel flights on the airline", "description": "It is not clear which routes the infected staffer flew on. Meanwhile, people are trying to cancel reservations to South Korea as its outbreak worsens.", "url": "https://news.yahoo.com/korean-air-flight-attendant-tested-081929033.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/oZq1RLx991zcGhAao8HHzw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/Npq5obctRp_TtaA4Jo8lVg--~B/aD0xMzAwO3c9MTczMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/d1e308b9617ab37b1c5790b421c864ff", "publishedAt": "2020-02-25T08:19:29Z", "content": "A member of staff for Korean Air.\r\nChung Sung-Jun/Getty Images\r\n<ul><li>A Korean Air flight attendant tested positive for the coronavirus, the South Korean airline announced on Tuesday. \r\n</li><li>Korean Air is disinfecting aircraft and asking flight attendan… [+3500 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ellie Harrison, Ellie Harrison", "title": "Tom Cruise's Mission: Impossible 7 forced to stop filming in Italy amid coronavirus fears", "description": "Several Italian towns are under lockdown following sudden outbreak of disease in the country", "url": "https://www.independent.co.uk/arts-entertainment/films/news/mission-impossible-7-tom-cruise-coronavirus-italy-venice-filming-outbreak-a9356346.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/15/17/gettyimages-1025171282.jpg", "publishedAt": "2020-02-25T08:33:28Z", "content": "Tom Cruise and the cast and crew of Mission: Impossible 7 have been forced to stop filming in Italy after the outbreak of coronavirus in the country.\r\nThe latest instalment of the blockbuster action franchise had been scheduled to film in Venice over the next… [+19487 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Fourth person from quarantined ship dies as Japan plans new measures", "description": "A fourth person has died in Japan after becoming ill aboard a coronavirus-stricken cruise ship, local media reported Tuesday, as the government vowed new measures to fight the outbreak. Nearly 700 people on board the Diamond Princess, which spent two weeks qu…", "url": "https://news.yahoo.com/fourth-person-quarantined-ship-dies-japan-plans-measures-052934371.html", "urlToImage": null, "publishedAt": "2020-02-25T08:14:33Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Not all Safe Havens Equal Amid Coronavirus Outbreak", "description": "The demand for safe haven assets has understandably been amplified amid swirling concerns over the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/not-safe-havens-equal-amid-084657583.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/gnwAlNhWulOhs98hIViHDQ--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/b5a68cef232be4645acd758e989d4cd3", "publishedAt": "2020-02-25T08:46:57Z", "content": "Gold has certainly lived up to its billing as a safe haven asset, testing the $1690 resistance level after having surged to levels not seen since Q1 2013. At the time of writing, Gold has advanced by about eight percent so far this year.\r\nBullion bulls have o… [+2989 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Phil Helsel and Peter Alexander and The Associated Press", "title": "White House seeks $2.5B for coronavirus, but Pelosi says that's not enough", "description": "House Speaker Nancy Pelosi said that the request was long overdue and inadequate and that the House would advance its own funding package.", "url": "https://news.yahoo.com/white-house-seeks-2-5b-061000689.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/TM6PcvHdUdr010jdwjs7LA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjguMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/3lDtTR1_5HD8EUT5m.tEvg--~B/aD0zNDMyO3c9NTA1ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/nbc_news_122/2e5b283fdf86f4ca2e5bc84207fe3f67", "publishedAt": "2020-02-25T08:41:46Z", "content": ""}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | Trump asks for $2.5bn to fight coronavirus, gets $1bn for vaccine", "description": "US President Donald Trump's administration is asking Congress for $2.5bn to fight the fast-spreading coronavirus.", "url": "https://www.news24.com/World/News/trump-asks-for-25bn-to-fight-coronavirus-gets-1bn-for-vaccine-20200225", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9994/0230200abfc2416ea82ef5c933f22ed5.jpg", "publishedAt": "2020-02-25T09:03:27Z", "content": "United States President Donald Trump's administration is asking Congress for $2.5bn to fight the fast-spreading coronavirus, the White House said on Monday.\r\nThe White House said more than $1bn of the requested virus budget would go toward developing a vaccin… [+3356 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Dhwani Mehta", "title": "Japan’s top currency diplomat Takeuchi: Unease over coronavirus has heightened compared to before", "description": "According to Japan’s top currency diplomat Takeuchi, the unease over coronavirus has heightened compared to before. Additional headlines: Financial ma", "url": "https://www.fxstreet.com/news/japans-top-currency-diplomat-takeuchi-unease-over-coronavirus-has-heightened-compared-to-before-202002250903", "urlToImage": "https://editorial.blob.core.windows.net/images/Macroeconomics/Countries/Asia/Japan/chureito-pagoda-and-mount-fuji-japan-in-autumn-54574220_Large.jpg", "publishedAt": "2020-02-25T09:03:29Z", "content": "Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.\r\nTrading foreign exchange on margin carries a high level of risk and may not be… [+1278 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Ethan Huff", "title": "Iranian strain of coronavirus a \"morphed\" version of the one in Wuhan", "description": "(Natural News) During a recent segment on the Wuhan coronavirus (CoVid-19), a CNBC commentator explained that the strain currently circulating in Iran is different than the one that originated in Wuhan. A clip of the segment that was shared to Twitter by Disc…", "url": "https://www.naturalnews.com/2020-02-25-iranian-strain-coronavirus-morphed-version-wuhan.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/02/Hawaii-Island-Coronavirus.jpg", "publishedAt": "2020-02-25T09:09:34Z", "content": null}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "News24.com | Deadly coronavirus hasn't reached SA shores - NICD", "description": "The deadly coronavirus - which to date has left more than 2 700 people dead - has not reached South Africa, the National Institute for Communicable Diseases says.", "url": "https://www.news24.com/SouthAfrica/News/deadly-coronavirus-hasnt-reached-sa-shores-nicd-20200225", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9838/3a1cb94a4ccb4ce5ac6f0f0edb9a8be0.jpg", "publishedAt": "2020-02-25T08:54:30Z", "content": "The deadly coronavirus (Covid-19) - which to date has left more than 2 700 people dead in more than 80 000 reported cases - has not reached South Africa.   \r\nThe National Institute for Communicable Diseases (NICD), a division of the National Health Laboratory… [+2129 chars]"}, {"source": {"id": null, "name": "Fiercebiotech.com"}, "author": "Ben Adams", "title": "Moderna wins bragging rights as it kick-starts first experimental coronavirus clinical trial", "description": "Moderna shares shot up a massive 18% after-hours last night on the fairly standard news that it was about to start a drug trial.", "url": "https://www.fiercebiotech.com/biotech/moderna-wins-bragging-rights-as-it-kickstarts-first-experimental-coronavirus-clinical-trial", "urlToImage": "https://qtxasset.com/fiercebiotech/1582621630/Moderna%20Norwood%20plant.jpg/Moderna%20Norwood%20plant.jpg?N9UMPgxpJSQAZyIkeXXotVg_npRez3px", "publishedAt": "2020-02-25T09:08:56Z", "content": "Moderna shares shot up a massive 18% after-hours last night on the fairly standard news that it was about to start a drug trial.\r\nBut, given the concern over the disease's spread, its less surprising when you see it's for a treatment for COVID-19, the novel c… [+2017 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "COVID-19: Iraq bans entry of travellers from seven countries including Singapore", "description": "Iraq indefinitely extended an entry ban on travellers from China and Iran and instituted similar bans on travellers from Thailand, South Korean, Japan, Italy and Singapore, the health ministry said on Tuesday (Feb 25).", "url": "https://www.channelnewsasia.com/news/world/covid-19-coronavirus-iraq-bans-entry-travellers-seven-countries-12468988", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12469000/16x9/991/557/9c2975e6e384296f1b236d868dcfb37/FA/iraq-virus-traveller.jpg", "publishedAt": "2020-02-25T08:51:49Z", "content": "REUTERS: Iraq extended an entry ban on travellers from China and Iran and banned travellers from five other countries over coronavirus fears, the Health Ministry said on Tuesday (Feb 25).\r\nThe entry ban is for travellers coming directly or indirectly from Chi… [+1165 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Marlowe Hood", "title": "Micro-pollution ravaging China and South Asia: study", "description": "Nearly 90 percent of the 200 cities beset by the world's highest levels of deadly micro-pollution are in China and India, with most of the rest in Pakistan and Indonesia, researchers reported Tuesday.", "url": "https://phys.org/news/2020-02-micro-pollution-ravaging-china-south-asia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/lastyear117o.jpg", "publishedAt": "2020-02-25T08:38:00Z", "content": "Nearly 90 percent of the 200 cities beset by the world's highest levels of deadly micro-pollution are in China and India, with most of the rest in Pakistan and Indonesia, researchers reported Tuesday.\r\nTaking population into account, Bangladesh emerged as the… [+4414 chars]"}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "Family of USFK service member tests positive for coronavirus", "description": "The family member of an American soldier has tested positive for the novel coronavirus on an US military base in Daegu. This is the first case of COVID-19, the disease caused by the coronavirus, on a", "url": "http://english.hani.co.kr/arti/english_edition/e_national/929762.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/800/533/imgdb/original/2020/0225/6915826196497548.jpg", "publishedAt": "2020-02-25T08:34:30Z", "content": null}, {"source": {"id": null, "name": "Counterpunch.org"}, "author": "Binoy Kampmark", "title": "Viral Losses: Australian Universities, Coronavirus and Greed", "description": "There are few things more richly deserved than the punishment of a profligate ruler who finds himself fending off a hungry citizenry. But such matters lie in the realm of government, elections, holding representative office. Universities, notably in Australia…", "url": "https://www.counterpunch.org/2020/02/25/viral-losses-australian-universities-coronavirus-and-greed/", "urlToImage": "https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png", "publishedAt": "2020-02-25T08:34:56Z", "content": "There are few things more richly deserved than the punishment of a profligate ruler who finds himself fending off a hungry citizenry. But such matters lie in the realm of government, elections, holding representative office. Universities, notably in Australia… [+6047 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Francesco Guarascio and Jakub Riha", "title": "EU orders quarantine for staff who traveled to northern Italy", "description": "EU institutions have ordered staff who travelled to areas of northern Italy hit by an outbreak of coronavirus to stay at home for two weeks, a measure that may be repeated by member states as concerns mount over the epidemic in Europe. The number of cases in …", "url": "https://news.yahoo.com/eu-orders-quarantine-staff-traveled-085907580.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MUgWn3B8D5zdlJaOtN4.fw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODA-/https://s.yimg.com/uu/api/res/1.2/KPVyt1l8ZWQ4mxy0qv.8AA--~B/aD01NTA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/7010f9e818c8187a860eef6ede860676", "publishedAt": "2020-02-25T08:59:07Z", "content": "By Francesco Guarascio and Jakub Riha\r\nBRUSSELS (Reuters) - EU institutions have ordered staff who travelled to areas of northern Italy hit by an outbreak of coronavirus to stay at home for two weeks, a measure that may be repeated by member states as concern… [+2378 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Naughtie, Andrew Naughtie", "title": "Trump ridiculed for claiming stock market looks 'very good' as Dow plunges 1,000 points amid coronavirus fears", "description": "President already under attack for administration's handling of outbreak", "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-stock-market-dow-jones-twitter-coronavirus-economy-us-a9356336.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/18/17/wall-street.jpg", "publishedAt": "2020-02-25T09:07:03Z", "content": "Donald Trump has been ridiculed for tweeting that the stock market is stronger than ever even as the Dow Jones fell by more than 1,000 points.\r\nIn his tweet, Mr Trump wrote: The coronavirus is very much under control in the USA. We are in contact with everyon… [+4521 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Three more dead in Iran coronavirus outbreak: state media", "description": "The novel coronavirus has claimed three more lives in Iran, state media reported, taking the country's overall death toll from the outbreak to 15 -- the highest outside China. Iran has been scrambling to contain COVID-19 since Wednesday when it announced its …", "url": "https://news.yahoo.com/three-more-dead-iran-coronavirus-outbreak-state-media-084507744.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hPo5b1YOKIf_5mApt87Gqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjU-/https://s.yimg.com/uu/api/res/1.2/rOx6jchVaWIEur.w2vcEDA--~B/aD01MTk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/fb109c85062d8d891bf9fbd82a8d513a50bd93f3.jpg", "publishedAt": "2020-02-25T08:45:07Z", "content": "Tehran (AFP) - The novel coronavirus has claimed three more lives in Iran, state media reported, taking the country's overall death toll from the outbreak to 15 -- the highest outside China.\r\nIran has been scrambling to contain COVID-19 since Wednesday when i… [+1296 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Haresh Menghani", "title": "USD/JPY surrenders modest recovery gains, fails to find acceptance above 111.00 mark", "description": "The USD/JPY pair failed to preserve its early modest recovery gains and has now dropped back to the lower end of its daily trading range, around the 1", "url": "https://www.fxstreet.com/news/usd-jpy-surrenders-modest-recovery-gains-fails-to-find-acceptance-above-11100-mark-202002250816", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/USDJPY/japanese-currency-16048717_Large.jpg", "publishedAt": "2020-02-25T08:16:49Z", "content": "<ul><li>USD/JPY fails to capitalize on the early attempted recovery move on Tuesday.</li><li>Concerns over the economic impact of the coronavirus capped the further gains.</li><li>A turnaround in the global risk sentiment might help limit any deeper losses.</… [+1599 chars]"}, {"source": {"id": null, "name": "Rappler.com"}, "author": "Agence France-Presse", "title": "No fans for South Korea AFC Champions League games due to virus", "description": "SEOUL, South Korea – Two AFC Champions League matches in South Korea next week will take place behind closed doors because of the deadly coronavirus outbreak, the clubs announced Tuesday, February 25. No fans will be allowed when FC Seoul plays Thailand's Chi…", "url": "https://www.rappler.com/sports/by-sport/football/252680-no-fans-south-korea-afc-champions-league-game-due-virus", "urlToImage": "https://assets.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/8AAE2440793E4AB9AC701C6CCF55BCBD/w_55880238.jpg", "publishedAt": "2020-02-25T08:27:16Z", "content": null}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "[Editorial] Coronavirus outbreak requires solutions, not politicization", "description": "After South Korea elevated its alert level for infectious disease to “red,” the highest of four levels, for the first time in 11 years, the argument that Chinese and foreigners from China should be co", "url": "http://english.hani.co.kr/arti/english_edition/english_editorials/929757.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/700/442/imgdb/original/2020/0225/7115826193163298.jpg", "publishedAt": "2020-02-25T08:29:13Z", "content": null}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "China says WSJ reporter in Wuhan can remain in country until end of epidemic", "description": "BEIJING: China's foreign ministry said on Tuesday (Feb 25) that one of the three Wall Street Journal reporters who were ordered to leave the country can remain in China as she is stranded in Wuhan, the epicentre of the coronavirus outbreak. Spokesman Zhao Lij…", "url": "https://www.channelnewsasia.com/news/asia/china-wsj-reporter-wuhan-can-remain-in-country-end-epidemic-12468922", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12450508/16x9/991/557/91b1a769fc9e94c2f1fc02ed4fd5a0ec/ER/china-has-expelled-three-wall-street-journal-reporters-over-an-op-ed-headline-authorities-deemed-racist-1582107037838-2.jpg", "publishedAt": "2020-02-25T08:20:37Z", "content": "BEIJING: China's foreign ministry said on Tuesday (Feb 25) that one of the three Wall Street Journal reporters who were ordered to leave the country can remain in China as she is stranded in Wuhan, the epicentre of the coronavirus outbreak.\r\nSpokesman Zhao Li… [+629 chars]"}, {"source": {"id": null, "name": "Blacklistednews.com"}, "author": "ladylove", "title": "SOURCE: SUBMITTED BY SPIRO SKOURAS", "description": "SOURCE: SUBMITTED BY SPIRO SKOURAS In this interview, the Author of the US Biowarfare Act, Professor Francis Boyle uncovers four separate studies which he claims confirm as ‘smoking gun’ evidence the Wuhan Coronavirus known as COVID19 was in fact weaponized. …", "url": "https://www.blacklistednews.com/article/76357/us-biowarfare-act-author-studies-confirm-coronavirus.html", "urlToImage": "https://i.ytimg.com/vi/F_TPjbu4FAE/hqdefault.jpg", "publishedAt": "2020-02-25T08:32:09Z", "content": "In this interview, the Author of the US Biowarfare Act, Professor Francis Boyle uncovers four separate studies which he claims confirm as ‘smoking gun’ evidence the Wuhan Coronavirus known as COVID19 was in fact weaponized. \r\nProfessor Boyle also discloses wh… [+6591 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Bloomberg", "title": "China energy company starts US$8.3 bil of renewable power projects", "description": "Move comes as nation pushes to restart major energy projects amid the coronavirus epidemic.", "url": "https://www.freemalaysiatoday.com/category/business/2020/02/25/china-energy-company-starts-us8-3-bil-of-renewable-power-projects/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2019/08/WindFarm-10082019-Reuters.jpeg", "publishedAt": "2020-02-25T08:49:04Z", "content": "BEIJING: China Three Gorges New Energy Co, a state-owned clean energy developer, has started construction of 25 renewable power plants in an investment worth 58 billion yuan.\r\nThe projects will have a combined capacity of 3.92 gigawatts, the company said in a… [+568 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "Fergal Bowers", "title": "Public health team to meet over Covid-19 preparations", "description": "The National Public Health Emergency Team will meet this afternoon to review the latest position on Covid-19 and Ireland's preparations.", "url": "https://www.rte.ie/news/ireland/2020/0225/1117449-europe-coronavirus/", "urlToImage": "https://img.rasset.ie/00139d19-1600.jpg", "publishedAt": "2020-02-25T08:12:33Z", "content": "The National Public Health Emergency Team will meet this afternoon to review the latest position on Covid-19 and Ireland's preparations.\r\nAuthorities are awaiting advice from the European Centre for Disease Control and Prevention in the wake of seven deaths f… [+2934 chars]"}, {"source": {"id": null, "name": "Foreignpolicy.com"}, "author": "Audrey Wilson", "title": "Why Did Malaysia’s Prime Minister Just Resign?", "description": "There is no time frame for how long Mahathir Mohamed can serve as Malaysia’s interim leader.", "url": "https://foreignpolicy.com/2020/02/25/malaysia-prime-minister-mahathir-mohamad-resign-politics-anwar-ibrahim-kuala-lumpur/", "urlToImage": "https://foreignpolicy.com/wp-content/uploads/2020/02/mahathir-malaysia-prime-minister-GettyImages-1202936810.jpg", "publishedAt": "2020-02-25T08:52:37Z", "content": "Here is todays Foreign Policy brief: Malaysias prime minister unexpectedly steps downbut remains interim leader, stocks fall sharply on fears of coronavirus pandemic, and dozens are hurt in Germany after a man drove into a carnival parade.\r\nWe welcome your fe… [+6069 chars]"}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "S. Korea’s religious groups halt services amid coronavirus spread", "description": "South Korean religious groups are halting weekly services to help prevent the spread of COVID-19, the disease caused by the novel coronavirus.The Archdiocese of Daegu was the first Catholic body to su", "url": "http://english.hani.co.kr/arti/english_edition/e_national/929761.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/800/533/imgdb/original/2020/0225/3915826195567713.jpg", "publishedAt": "2020-02-25T08:32:59Z", "content": null}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "JD Heyes", "title": "World Health Organization chief is a Chinese puppet, STILL claiming there is no coronavirus “pandemic” as global cover for the Communist regime", "description": "(Natural News) One of the reasons why so many Americans have so little faith and trust in the United Nations and its various allied organizations is because they have so consistently worked against American principles, values and foreign policy objectives. No…", "url": "https://www.naturalnews.com/2020-02-25-who-chief-is-a-chinese-puppet-still-claiming-no-coronavirus-pandemic.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/02/1402991039_united-nations-general-assembly.jpg", "publishedAt": "2020-02-25T09:10:26Z", "content": null}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "Public institutions shut down to prevent further spread of novel coronavirus", "description": "Amid the rapid spread of the novel coronavirus, even constitutional bodies such as the National Assembly are halting their operations. Since South Korea has elevated its infectious disease alert level", "url": "http://english.hani.co.kr/arti/english_edition/e_national/929759.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/970/650/imgdb/original/2020/0225/3315826194356671.jpg", "publishedAt": "2020-02-25T08:31:22Z", "content": null}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "[Photo] S. Korea, US consider minimizing joint defense drills scheduled for March", "description": "In light of the current novel coronavirus outbreak, South Korea and the US are considering scaling back their joint defense drills scheduled for March. US Defense Secretary Mark Esper announced a pote", "url": "http://english.hani.co.kr/arti/english_edition/e_international/929756.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/640/426/imgdb/original/2020/0225/431582619227308.jpg", "publishedAt": "2020-02-25T08:27:14Z", "content": null}, {"source": {"id": null, "name": "Hani.co.kr"}, "author": null, "title": "[Reportage] Into the workings of the Sincheonji religious order", "description": "Tribe of Judas Thaddaeus Daegu Church, which has been identified as an epicenter for novel coronavirus transmission in Daegu, is one of 12 nationwide branches of the Shincheonji religious order, overs", "url": "http://english.hani.co.kr/arti/english_edition/e_national/929755.html", "urlToImage": "http://flexible.img.hani.co.kr/flexible/normal/970/622/imgdb/original/2020/0225/4215826189184734.jpg", "publishedAt": "2020-02-25T08:25:24Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nick Wadhams, Jennifer Jacobs and Saleha Mohsin", "title": "U.S. Considers Expelling Chinese Journalists After Americans Barred", "description": "(Bloomberg) -- The U.S. is weighing whether to expel Chinese journalists after China kicked out three Wall Street Journal reporters, part of a push by the Trump administration to show leaders in Beijing that it will resist restrictions on Americans working in…", "url": "https://news.yahoo.com/u-considers-expelling-chinese-journalists-084513322.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7uZ47s47nNIUmYdBc8hlKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/OpBKaYqdFXvBIH8FyT457w--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/17a658eab21dbba49059d30eb2991c15", "publishedAt": "2020-02-25T08:45:13Z", "content": "(Bloomberg) -- The U.S. is weighing whether to expel Chinese journalists after China kicked out three Wall Street Journal reporters, part of a push by the Trump administration to show leaders in Beijing that it will resist restrictions on Americans working in… [+5906 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Craig Stirling, Enda Curran and Catherine Bosley / Bloomberg", "title": "Coronavirus Could Cost World $1 Trillion If It Becomes a Pandemic, Analysts Predict", "description": "Oxford Economics reckons an international health crisis could be enough to wipe more than $1 trillion from global gross domestic product.", "url": "https://time.com/5790158/coronavirus-pandemic-cost-trillion/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/coronavirus-outbreak-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-02-25T08:18:21Z", "content": "The ghastly prospect that the coronavirus outbreak could become the first truly disruptive pandemic of the globalization era is renewing doubts over the stability of the world economy.\r\nWith the death toll approaching 3,000, over 80,000 cases officially recor… [+4105 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Eryk Bagshaw", "title": "Sports Minister: Australia will not risk health of Olympic athletes", "description": "After Australia's top Olympic doctor David Hughes warned \"we would need to be sure that it is safe to take athletes into Japan\".", "url": "https://www.smh.com.au/national/sports-minister-australia-will-not-risk-health-of-olympic-athletes-20200225-p5448v.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3092190545808967%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_226%2C$y_243/t_crop_custom/q_86%2Cf_auto/7ad4f984018451a45f86da5dd12b55dadae96712", "publishedAt": "2020-02-25T08:45:00Z", "content": "Health authorities and the Australian government are privately increasingly concerned about Japan's response to the coronavirus outbreak, citing the decision to let hundreds of passengers off the Diamond Princess cruise ship in Yokohama onto public transport … [+4212 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Andrew L. Yarrow, Opinion contributor", "title": "Wall Street's coronavirus panic means little for Americans without wealth to invest", "description": "For the half of workers with a 401(k), today's stock market loss is serious. But the real problem is the inability of many workers to save much at all.", "url": "https://www.usatoday.com/story/opinion/2020/02/25/wall-street-stock-market-coronavirus-panic-covid-19-column/4862563002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/9e1f6e2ee20f44aa1f3be4f71e9f3e52b6ae2c7e/c=0-110-2121-1303/local/-/media/2020/02/24/USATODAY/usatsports/MotleyFool-TMOT-8e85f7d1-falling_stock_chart.jpg?width=1600&height=800&fit=crop", "publishedAt": "2020-02-25T08:15:01Z", "content": "Of course, for the half of working Americans with a 401(k) account, todays stock market decline does mean a loss. But the real problem is the inability of many workers to save much at all.\r\nMondays 1,031-point stock market plunge certainly brought panic to fi… [+4759 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Faiz Adnan", "title": "Company profit warnings signal virus already is a global crisis", "description": "Businesses that are exposed to travel are clear targets.", "url": "https://www.freemalaysiatoday.com/category/business/2020/02/25/company-profit-warnings-signal-virus-already-is-a-global-crisis/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2019/03/United_Air1801s.jpg", "publishedAt": "2020-02-25T08:21:48Z", "content": "United Airlines Holdings Inc has warned that sales and profit are getting hurt as the epidemic spreads. (Reuters pic)\r\nNEW YORK: For big business, the impact of the new coronavirus epidemic is exacting a growing toll worldwide.\r\nMastercard Inc and United Airl… [+3502 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Haresh Menghani", "title": "USD/CAD trades with modest losses below 1.3300 mark", "description": "The USD/CAD pair edged lower through the early European session and dropped to fresh daily lows, around the 1.3280 region in the last hour. A combinat", "url": "https://www.fxstreet.com/news/usd-cad-trades-with-modest-losses-below-13300-mark-202002250859", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/USDCAD/canadian-dollar-closeup-29758764_Large.jpg", "publishedAt": "2020-02-25T08:59:48Z", "content": "<ul><li>USD/CAD fails to capitalize on the overnight positive move to two-week tops.</li><li>Some follow-through USD pullback seemed to exert some downward pressure.</li><li>A modest uptick in oil underpinned the loonie and added to the weaker tone.</li></ul>… [+1307 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Yoel Minkoff", "title": "OPEC+ hasn't 'run out of ideas' despite bear market", "description": "<ul><li>OPEC and its allied oil-producing nations are still working to rebalance global crude markets amid speculation of tensions in the alliance over whether to cut output further.</li><li>\"We do communicate with each other and we did not run out of ideas,\"…", "url": "https://seekingalpha.com/news/3545086-opec-hasnt-run-out-of-ideas-despite-bear-market", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-25T08:34:06Z", "content": "OPEC and its allied oil-producing nations are still working to rebalance global crude markets amid speculation of tensions in the alliance over whether to cut output further.\r\n\"We do communicate with each other and we did not run out of ideas,\" Saudi Energy M… [+363 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "European shares steady as selling pressure eases", "description": "European shares bounced back on Tuesday after recording their worst losses since June 2016 in the previous session, with investors assessing the economic hit of a coronavirus outbreak that has spread far beyond China.", "url": "https://www.reuters.com/article/us-europe-stocks-idUSKCN20J0Z4", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200225&t=2&i=1494920994&w=1200&r=LYNXNPEG1O0MA", "publishedAt": "2020-02-25T08:17:49Z", "content": "(Reuters) - European shares bounced back on Tuesday after recording their worst losses since June 2016 in the previous session, with investors assessing the economic hit of a coronavirus outbreak that has spread far beyond China. \r\nMarkets across the globe at… [+653 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Tang See Kit", "title": "DPM Heng stresses need to stay vigilant as COVID-19 outbreak evolves rapidly outside of Singapore", "description": "SINGAPORE: With the COVID-19 situation evolving rapidly around the world, Singapore will need to stay vigilant and ensure that its responses remain adequate, said Deputy Prime Minister Heng Swee Keat on Tuesday (Feb 25). Within Singapore, he noted that the co…", "url": "https://www.channelnewsasia.com/news/singapore/covid19-coronavirus-singapore-heng-swee-keat-12468660", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12468676/16x9/991/557/30a048d3787ee78b4d722c98e6a0a27/uZ/dpm-heng-swee-keat-at-parkroyal-hotel-on-kitchener-road-on-feb-25--2020.jpg", "publishedAt": "2020-02-25T08:27:42Z", "content": "SINGAPORE: With the COVID-19 situation evolving rapidly around the world, Singapore will need to stay vigilant and ensure that its responses remain adequate, said Deputy Prime Minister Heng Swee Keat on Tuesday (Feb 25).\r\nWithin Singapore, he noted that the c… [+5967 chars]"}, {"source": {"id": null, "name": "Piunikaweb.com"}, "author": "Hillary Keverenge", "title": "OPPO Reno Z ColorOS 7 (Android 10) likely to be released on February 26 - PiunikaWeb", "description": "OPPO has dropped a major hint that the Reno Z ColorOS 7 update based on Android 10 could hit the beta channels from February 26.", "url": "https://piunikaweb.com/2020/02/25/oppo-reno-z-coloros-7-android-10-update-likely-to-be-released-on-february-26/", "urlToImage": "https://piunikaweb.com/wp-content/uploads/2020/02/OPPO-Reno-Z.jpg", "publishedAt": "2020-02-25T08:34:26Z", "content": "Chinese company OPPO recently served the OPPO Find X, OPPO R17, and OPPO R17 Pro with new ColorOS 7 beta updates based on Android 10 in India, Indonesia, Australia, and Thailand.\r\nThis was expected following the global ColorOS 7 roadmap the company published … [+1566 chars]"}, {"source": {"id": null, "name": "Fxstreet.com"}, "author": "Pablo Piovano", "title": "EUR/USD firmer, challenges weekly highs above 1.0860", "description": "The shared currency is extending the positive tone for yet another session on Tuesday and is lifting EUR/USD to the area of weekly tops in the 1.0865/", "url": "https://www.fxstreet.com/news/eur-usd-firmer-challenges-weekly-highs-above-10860-202002250910", "urlToImage": "https://editorial.blob.core.windows.net/images/Markets/Currencies/Majors/EURUSD/euro-and-dolar-in-the-hands-of-a-girl-60809712_Large.jpg", "publishedAt": "2020-02-25T09:10:46Z", "content": "<ul><li>EUR/USD moves higher to the 1.0860/65 band on Tuesday.</li><li>The offered bias stays unchanged around the dollar.</li><li>COVID-19 fears keep driving the price action in the global markets.</li></ul>The shared currency is extending the positive tone … [+2217 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "A Korean Air flight attendant tested positive for coronavirus, as people are desperately trying to cancel flights on the airline", "description": "A Korean Air flight attendant tested positive for the coronavirus, the South Korean airline announced on Tuesday. Korean Air is disinfecting aircraft and asking flight attendants with symptoms to self-quarantine, a representative told Business Insider. Korean…", "url": "https://www.businessinsider.com/korean-air-flight-attendant-tests-positive-for-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5b0fa4911ae6621b008b4648?width=1200&format=jpeg", "publishedAt": "2020-02-25T08:19:29Z", "content": "A Korean Air flight attendant tested positive for the coronavirus, the South Korean airline announced on Tuesday. \r\nKorean Air \"is creating a structure to work very closely with the Centers for Disease Control and Prevention Korea (CDCK) to prevent the spread… [+2869 chars]"}, {"source": {"id": null, "name": "Road.cc"}, "author": "Jack Sexty", "title": "Ultimate close pass deterrent? Coronavirus Olympic risk; London car-free day returns; NYPD tickets cyclists (again); Niklas Eg and marshal collide at UAE Tour; Miltag launch Carter USM kit + more on the live blog", "description": "Welcome to Tuesday's live blog, with Jack Sexty at the controls and Simon MacMichael taking over later this evening.", "url": "https://road.cc/content/news/271517-ultimate-close-pass-deterrent-coronavirus-olympic-risk-london-car-free-day", "urlToImage": "https://cdn.road.cc/sites/default/files/styles/main_width/public/images/News/NYPD%20%28Pete%20Stewart%2C%20Wikimedia%20Commons%29.jpg", "publishedAt": "2020-02-25T09:09:00Z", "content": "The Tokyo Olympic Games, due to start on Friday 24 July, may have to be cancelled if the coronavirus outbreak is not contained by the end of May, International Olympic Committee (IOC) member Dick Pound has warned.\r\nThe Canadian, former president of the World … [+1574 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Bloomberg", "title": "Temasek freezes pay, cuts bonuses for a year to counter virus impact", "description": "State investment arm took similar measures during 2003 SARS outbreak, 2008 global financial crisis.", "url": "https://www.freemalaysiatoday.com/category/business/2020/02/25/temasek-freezes-pay-cuts-bonuses-for-a-year-to-counter-virus-impact/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2018/10/FMT-TemasekSygnia16102018-AFP.jpg", "publishedAt": "2020-02-25T08:23:43Z", "content": "SINGAPORE: Temasek Holdings Pte, Singapores state-owned investment firm, is implementing a company-wide wage freeze for an as-yet-undetermined period and asking senior management to take voluntary pay reductions for up to a year amid the coronavirus outbreak.… [+3070 chars]"}, {"source": {"id": null, "name": "Cityam.com"}, "author": "Edward Thicknesse", "title": "Meggitt boosts profit but warns over coronavirus and 737 Max hit", "description": "Meggitt said that it would be impacted by both the coronavirus outbreak and the halt in production of the 737 The post Meggitt boosts profit but warns over coronavirus and 737 Max hit appeared first on CityAM.", "url": "https://www.cityam.com/meggitt-boosts-profit-but-warns-over-coronavirus-and-737-max-hit/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2020/02/660260286.jpg", "publishedAt": "2020-02-25T09:02:00Z", "content": "Meggitt said that it would be impacted by both the coronavirus outbreak and the halt in production of the 737 Max after in year in which the aerospace engineers boosted profit by 33 per cent.\r\nShares in the British firm fell three per cent as markets opened.\r… [+2453 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "RTÉ News", "title": "Airlines plunge as Italian coronavirus outbreak spreads", "description": "European budget airlines bore the brunt of yesterday's plunge in global stock markets as the arrival of the coronavirus in Italy pointed to a longer, deeper crisis than many have banked on.", "url": "https://www.rte.ie/news/business/2020/0225/1117451-airlines-fall-on-virus-fears/", "urlToImage": "https://img.rasset.ie/0012af02-1600.jpg", "publishedAt": "2020-02-25T08:21:54Z", "content": "European budget airlines bore the brunt of yesterday's plunge in global stock markets as the arrival of the coronavirus in Italy pointed to a longer, deeper crisis than many have banked on. \r\nEasyJet dropped 16.4% and Ryanair sank 13.5% as airlines were force… [+2806 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Gold Rates Drop Nearly 3% Retreating From Record Highs", "description": "Gold Price Today: Gold prices vary in different parts of India - the second largest consumer of the precious metal - due to factors such as excise duty, state taxes and making charges.", "url": "https://www.ndtv.com/business/gold-rates-today-india-gold-price-today-gold-rates-in-india-drop-3-percent-retreat-from-record-highs-2185328", "urlToImage": "https://i.ndtvimg.com/i/2017-02/gold-jewellery-gold-chain-650_650x400_61487902416.jpg", "publishedAt": "2020-02-25T08:37:43Z", "content": "Gold Rate India: At 1:03 pm, gold futures traded 2.27% lower at Rs 42,591.00 per 10 grams on the MCX\r\nGold Price Today: Gold prices fell on Tuesday receding from record highs touched in the previous session. MCX Gold futures declined as much as 2.77 per cent … [+1634 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Kate Taylor", "title": "A Korean Air flight attendant tested positive for coronavirus, as people are desperately trying to cancel flights on the airline", "description": "A Korean Air flight attendant tested positive for the coronavirus, the South Korean airline announced on Tuesday. Korean Air is disinfecting aircraft and asking flight attendants with symptoms to self-quarantine, a representative told Business Insider. More »", "url": "https://www.businessinsider.com.au/korean-air-flight-attendant-tests-positive-for-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5aeb0aa119ee865f008b47bf", "publishedAt": "2020-02-25T08:19:29Z", "content": "<ul><li>\r\nA Korean Air flight attendant tested positive for the coronavirus, the South Korean airline announced on Tuesday.\r\n</li><li>\r\nKorean Air is disinfecting aircraft and asking flight attendants with symptoms to self-quarantine, a representative told Bu… [+3469 chars]"}, {"source": {"id": null, "name": "Road.cc"}, "author": "Jack Sexty", "title": "NYPD ticketing cyclists (again); Ultimate close pass deterrent?; Niklas Eg and marshal collide at UAE Tour; E-biker escapes motorbike thieves; Coronavirus confirmed in Tenerife; Miltag launch Carter the Unstoppable Sex Machine kit + more on the live blog", "description": "Welcome to Tuesday's live blog, with Jack Sexty at the controls and Simon MacMichael taking over later this evening.", "url": "https://road.cc/content/news/271517-nypd-ticketing-cyclists-again-ultimate-close-pass-deterrent-niklas-eg-and", "urlToImage": "https://cdn.road.cc/sites/default/files/styles/main_width/public/images/News/NYPD%20%28Pete%20Stewart%2C%20Wikimedia%20Commons%29.jpg", "publishedAt": "2020-02-25T09:09:00Z", "content": "A Bristol cyclist has thanked his e-bike for helping him to get away from an armed and organised motorbike gang, who appeared to be targeting expensive bikes along the Avon Gorge cycle trail. \r\nThe man told the Bristol Post that he was riding his e-mountain b… [+1039 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mark Duell for MailOnline Lucy White For The Daily Mail", "title": "London and European stock markets bounce back after coronavirus panic", "description": "London's benchmark FTSE 100 index went up 0.5 per cent or 38 points to 7,195 points in early trading today after slumping to a four-month low yesterday.", "url": "https://www.dailymail.co.uk/news/article-8041363/London-European-stock-markets-bounce-coronavirus-panic.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/08/25161616-0-image-a-69_1582620390209.jpg", "publishedAt": "2020-02-25T08:48:59Z", "content": "Stock markets across Europe including in London rebounded today after major falls yesterday over fears about the economic impact of coronavirus.\r\nLondon's benchmark FTSE 100 index went up 0.5 per cent or 38 points to 7,195 points in early trading today after … [+2949 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "RTÉ News", "title": "European shares steady after yesterday's steep drops", "description": "European shares bounced back this morning after recording their worst losses since June 2016 in the previous session.", "url": "https://www.rte.ie/news/business/2020/0225/1117454-european-shares-steady-after-yesterdays-steep-drops/", "urlToImage": "https://img.rasset.ie/0013ac0e-1600.jpg", "publishedAt": "2020-02-25T09:09:50Z", "content": "European shares bounced back this morning after recording their worst losses since June 2016 in the previous session.\r\nInvestors are assessing the economic hit of a coronavirus outbreak that has spread far beyond China.\r\nMarkets across the globe attempted to … [+1698 chars]"}, {"source": {"id": null, "name": "Road.cc"}, "author": "Jack Sexty", "title": "Live blog: Bristol cyclists warned as e-biker escapes three armed thieves on motorbike; Coronavirus case confirmed in Tenerife; Warrington cycling initiative hailed a success; Germany's new cycle-friendly policies result in 12% more bike trips + more", "description": "Welcome to Tuesday's live blog, with Jack Sexty at the controls and Simon MacMichael taking over later this evening.", "url": "https://road.cc/content/news/271517-trek-segafredos-niklas-eg-smashes-marshal-uae-tour-bristol-e-biker-escapes-three", "urlToImage": null, "publishedAt": "2020-02-25T09:09:00Z", "content": "A Bristol cyclist has thanked his e-bike for helping him to get away from an armed and organised motorbike gang, who appeared to be targeting expensive bikes along the Avon Gorge cycle trail. \r\nThe man told the Bristol Post that he was riding his e-mountain b… [+1039 chars]"}, {"source": {"id": null, "name": "Road.cc"}, "author": "Jack Sexty", "title": "The ultimate close pass deterrent?; Niklas Eg crashes into marshal at UAE Tour; Bristol e-biker escapes motorbike thieves; Coronavirus confirmed in Tenerife; Miltag launch Carter the Unstoppable Sex Machine kit + more on the live blog", "description": "Welcome to Tuesday's live blog, with Jack Sexty at the controls and Simon MacMichael taking over later this evening.", "url": "https://road.cc/content/news/271517-ultimate-close-pass-deterrent-niklas-eg-crashes-marshal-uae-tour-bristol-e-biker", "urlToImage": "https://road.cc/sites/default/files/styles/main_width/public/coronavirus-pool-noodle-credit-unknown.jpeg", "publishedAt": "2020-02-25T09:09:00Z", "content": "A Bristol cyclist has thanked his e-bike for helping him to get away from an armed and organised motorbike gang, who appeared to be targeting expensive bikes along the Avon Gorge cycle trail. \r\nThe man told the Bristol Post that he was riding his e-mountain b… [+1039 chars]"}, {"source": {"id": null, "name": "Road.cc"}, "author": "Jack Sexty", "title": "Trek-Segafredo's Niklas Eg stacks it and smashes into marshal at UAE Tour; Bristol e-biker escapes three armed thieves on motorbike; Coronavirus case confirmed in Tenerife; Warrington cycling initiative hailed a success + more on the live blog", "description": "Welcome to Tuesday's live blog, with Jack Sexty at the controls and Simon MacMichael taking over later this evening.", "url": "https://road.cc/content/news/271517-trek-segafredos-niklas-eg-stacks-it-and-smashes-marshal-uae-tour-bristol-e-biker", "urlToImage": null, "publishedAt": "2020-02-25T09:09:00Z", "content": "A Bristol cyclist has thanked his e-bike for helping him to get away from an armed and organised motorbike gang, who appeared to be targeting expensive bikes along the Avon Gorge cycle trail. \r\nThe man told the Bristol Post that he was riding his e-mountain b… [+1039 chars]"}, {"source": {"id": null, "name": "Cityam.com"}, "author": "Joe Curtis", "title": "Japan's Nikkei sinks after global stocks' Covid-19 plunge", "description": "Japan’s stock market plummeted overnight after a plunge in global stocks yesterday as investors reacted to a rapid spread of The post Japan's Nikkei sinks after global stocks' Covid-19 plunge appeared first on CityAM.", "url": "https://www.cityam.com/japans-nikkei-sinks-after-global-stocks-covid-19-plunge/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2020/02/1196638640.jpg", "publishedAt": "2020-02-25T09:02:06Z", "content": "Japans stock market plummeted overnight after a plunge in global stocks yesterday as investors reacted to a rapid spread of the Cobvid-19 strain of coronavirus outside of China.\r\nThe Nikkei sank 3.3 per cent after US and European stocks suffered similar falls… [+2320 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Lara Keay For Mailonline", "title": "Ryanair and easyJet passengers angry at airlines refuse to refund flights to Italy amid Coronavirus", "description": "People due to fly to Italy with Ryanair or easyJet this week are furious after the airlines told them they cannot get a refund and will have to pay to change their flights as routes are 'operating as normal'.", "url": "https://www.dailymail.co.uk/news/article-8041151/Ryanair-easyJet-passengers-angry-airlines-refuse-refund-flights-Italy-amid-Coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/08/25161712-0-image-a-22_1582620410434.jpg", "publishedAt": "2020-02-25T08:49:20Z", "content": "Passengers have hit out at budget airlines Ryanair and easyJet for refusing to refund flights to Italy after seven people died from coronavirus there. \r\nItaly has dramatically stepped up its fight to contain the virus after a huge spike in cases, with 229 dia… [+5249 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Blanchard Senior Health Reporter For Mailonline Stephen Matthews Health Editor For Mailonline", "title": "Britons returning from coronavirus-hit northern Italy, Iran or South Korea 'should self-isolate'", "description": "Those who have been to areas in lockdown, such as towns in the Lombardy and Veneto regions, should isolate themselves even if they don't feel ill, Health Secretary Matt Hancock said.", "url": "https://www.dailymail.co.uk/health/article-8041417/Britons-returning-coronavirus-hit-northern-Italy-Iran-South-Korea-self-isolate.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/00/25148622-0-image-a-59_1582589453485.jpg", "publishedAt": "2020-02-25T08:52:56Z", "content": "All Britons who have been to northern Italy should self-isolate at home if they start to feel ill, the government has advised today amid fears the coronavirus outbreak is turning into a pandemic.\r\nThose who have been to areas locked down by Italian officials,… [+12541 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Press Trust of India", "title": "RBI MPC may consider coronavirus impact on Indian economy: Report", "description": "The coronavirus outbreak has brought a large part of the world's second-largest economy China to a standstill and its impact has been felt across industries", "url": "https://www.business-standard.com/article/pti-stories/rbi-mpc-may-consider-coronavirus-impact-on-indian-economy-report-120022500627_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-02/25/full/1582598557-3727.jpg", "publishedAt": "2020-02-25T08:26:00Z", "content": "The Monetary Policy Committee (MPC) of the Reserve Bank of India is likely to consider the developments around COVID-19, which has resulted in supply chain disruptions from China, Singapore's DBS Bank said in a report on Tuesday.\r\nThe report titled \"India: Gr… [+2017 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Associated Press, Associated Press", "title": "Iran flights halted as coronavirus spreads across Middle East", "description": "Dubai International Airport, the world’s busiest for international travel, said Tuesday that the United Arab Emirates is limiting flights to Iran over the outbreak of the new coronavirus, just a day after it spread across multiple Mideast nations from the Isl…", "url": "https://www.scmp.com/news/world/europe/article/3052255/iran-flights-halted-coronavirus-spreads-across-middle-east", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/25/52628754-57a4-11ea-b438-8452af50d521_image_hires_162037.jpg?itok=vQD2Qxw4&v=1582618843", "publishedAt": "2020-02-25T08:15:23Z", "content": null}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "Canberra Times", "title": "S Korea reports 84 new coronavirus cases (Cases to 977)", "description": "South Korean health authorities say they aim to test more than 200,000 members of a church at the centre of a surge of new coronavirus cases that has taken the country's tally to 977 (Please see link for full story)", "url": "https://www.freerepublic.com/focus/f-news/3819281/posts", "urlToImage": null, "publishedAt": "2020-02-25T08:55:42Z", "content": null}, {"source": {"id": null, "name": "Cityam.com"}, "author": "Angharad Carrick", "title": "FTSE 100 stages recovery after worst day in four years", "description": "The FTSE 100 has started to recover from Monday’s turbulence which saw the index close 3.3 per cent lower, its The post FTSE 100 stages recovery after worst day in four years appeared first on CityAM.", "url": "https://www.cityam.com/ftse-100-stages-recovery-after-worst-day-in-four-years/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2020/02/1087176406-2.jpg", "publishedAt": "2020-02-25T08:58:59Z", "content": "The FTSE 100 has started to recover from Monday’s turbulence which saw the index close 3.3 per cent lower, its worst performance in four years.\r\nThe blue-chip stock index rose as much as 0.4 per cent in early trading, while the FTSE 250 was up 0.3 per cent to… [+1742 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Italy PM blames an outbreak of COVID-19 on hospital", "description": "ROME: Italian Prime Minister Giuseppe Conte has blamed the management of a hospital in northern Italy for one outbreak of the new coronavirus.", "url": "https://www.channelnewsasia.com/news/world/italy-pm-blames-outbreak-coronavirus-hospital-12469020", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12460914/16x9/991/557/ea149e2f0d7ce50a595660bacc2bf3db/bf/italy-face-masks-coronavirus.jpg", "publishedAt": "2020-02-25T09:10:17Z", "content": "ROME: Italian Prime Minister Giuseppe Conte has blamed the management of a hospital in northern Italy for one outbreak of the new coronavirus.\r\n\"At this point, we know that the way one hospital facility was managed was not entirely appropriate,\" Conte told It… [+919 chars]"}, {"source": {"id": null, "name": "Businesstoday.in"}, "author": "BusinessToday.In", "title": "Gold Today: Yellow metal slips 2.5% to Rs 42,555 on profit-booking", "description": "On the Multi Commodity Exchange, Gold April 2020 Futures fell by Rs 1025 or 2.5% to 42,555 per 10 gm. On a similar note, Silver March contract also eased 1,165 points or 2.36% to Rs 48,240 per kg.", "url": "https://www.businesstoday.in/markets/commodities/gold-today-yellow-metal-slips-25-to-rs-42555-on-profit-booking/story/396853.html", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/gold_505_250220014305.jpg", "publishedAt": "2020-02-25T08:13:03Z", "content": "Gold prices in India fell today, following the bearish trend from global spot gold rates as investors booked profits on positions built up in the earlier session after the precious metal hit a seven-year high.\r\nOn the Multi Commodity Exchange, Gold April 2020… [+2248 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus and Harvey Weinstein found guilty in rape trial lead papers", "description": "Market and celebrity responses to the coronavirus strain known as Covid-19 and Harvey Weinstein lead Tuesday’s newspapers.\n\nThe Financial Times says investors have been forced to “run for cover” after global markets “tumbled sharply” in response to a spike in…", "url": "https://www.itv.com/news/2020-02-25/coronavirus-and-harvey-weinstein-found-guilty-in-rape-trial-lead-papers/", "urlToImage": "https://news.images.itv.com/image/file/2135640/img.jpg", "publishedAt": "2020-02-25T09:09:21Z", "content": null}, {"source": {"id": null, "name": "Businesstoday.in"}, "author": "BusinessToday.In", "title": "Bengaluru to Meerut to Delhi, H1N1 virus spreading fast; time to hit the panic button?", "description": "37 tested positive for Swine flu in Meerut; 6 SC judges down; SAP closes India offices after 2 cases", "url": "https://www.businesstoday.in/latest/trends/bengaluru-to-meerut-to-delhi-h1n1-virus-spreading-fast-time-to-hit-the-panic-button/story/396854.html", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/swine_flu_505_011619051705_250220015101.jpg", "publishedAt": "2020-02-25T08:21:00Z", "content": "In an alarming situation, 6 of the 34 Supreme Court judges are down with H1N1 virus (also known as swine flu), Justice DY Chandrachud said on Tuesday adding that he had requested Chief Justice of India (CJI) SA Bobde to issue necessary directions to tackle th… [+3263 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "Andy Mukherjee", "title": "Clock runs out on Malaysia’s new beginning?", "description": "Malaysia's economy becomes an early victim of its shortening political cycle.", "url": "https://www.freemalaysiatoday.com/category/opinion/2020/02/25/clock-runs-out-on-malaysias-new-beginning/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2020/02/ANWAR-IBRAHIM-TUN-MAHATHIR-YAYASAN-KEPIMPINAN-PERDANA-2.jpg", "publishedAt": "2020-02-25T08:17:09Z", "content": "After being ruled by effectively the same coalition for 61 years, Malaysia just witnessed the alternative collapse in less than two.\r\nThe crisis sparked by the shock resignation of the 94-year-old prime minister, Mahathir Mohamad, and how its resolved will gr… [+4639 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "AP | PTI", "title": "Over 80,000 people infected with COVID-19 globally; 850 cases in Japan", "description": "2,663 deaths among 77,658 cases reported in Mainland China", "url": "https://www.business-standard.com/article/pti-stories/new-virus-has-infected-over-80-000-people-globally-120022500629_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-02/25/full/1582597002-8584.jpg", "publishedAt": "2020-02-25T08:26:00Z", "content": "A viral outbreak that began in China has infected more than 80,000 people globally.\r\n The World Health Organization has named the illness COVID-19, referring to its origin late last year and the coronavirus that causes it.\r\n The latest figures reported by eac… [+507 chars]"}, {"source": {"id": null, "name": "Iol.co.za"}, "author": "Xinhua", "title": "China reports 508 new cases of coronavirus infection, 71 new deaths", "description": "The Chinese health authority said it received reports of 508 new confirmed cases of novel coronavirus infection and 71 deaths on Monday.", "url": "https://www.iol.co.za/news/world/china-reports-508-new-cases-of-coronavirus-infection-71-new-deaths-43427267", "urlToImage": "https://image.iol.co.za/image/1/process/620x349?source=https://cdn.africannewsagency.com/public/ana/media/media/2020/02/24/1582550693483.jpg", "publishedAt": "2020-02-25T09:04:00Z", "content": "IOL in your inbox\r\nSign up to receive breaking news in your inbox.\r\nOR subscribe to e-editions of our Newspaper titles."}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "", "title": "Video: Rush Limbaugh claims coronavirus is Chinese 'weapon' against Trump", "description": "This is the moment when Rush Limbaugh claims the coronavirus has been 'weaponized' by the Chinese in order to bring down Donald Trump. The host said on 'The Rush Limbaugh Show' the 'drive-by' media had 'hyped' up the outbreak as a 'pandemic.'", "url": "https://www.dailymail.co.uk/video/coronavirus/video-2117780/Video-Rush-Limbaugh-claims-coronavirus-Chinese-weapon-against-Trump.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/25/08/25161932-0-image-a-6_1582620508395.jpg", "publishedAt": "2020-02-25T08:48:21Z", "content": null}, {"source": {"id": null, "name": "Rasset.ie"}, "author": "RTÉ Radio 1", "title": "South Korea to launch mass coronavirus testing", "description": "Christian Lindmeier, spokesperson for the World Health Organisations, discusses the latest on Covid-19 as the fallout continues.", "url": "https://podcast.rasset.ie/podcasts/audio/2020/0225/20200225_rteradio1-morningireland-southkorea_c21718366_21718533_232_.mp3", "urlToImage": null, "publishedAt": "2020-02-25T08:52:52Z", "content": null}, {"source": {"id": null, "name": "Rasset.ie"}, "author": "RTÉ Radio 1", "title": "South Korea to launch mass coronavirus testing", "description": "Christian Lindmeier, spokesperson for the World Health Organisations, discusses the latest on Covid-19 as the fallout continues.", "url": "https://podcast.rasset.ie/podcasts/audio/2020/0225/20200225_rteradio1-morningireland-southkorea_c21718366_21718399_232_.mp3", "urlToImage": null, "publishedAt": "2020-02-25T08:22:00Z", "content": null}, {"source": {"id": null, "name": "Rasset.ie"}, "author": "RTÉ Radio 1", "title": "Dept clarifies advice after coronavirus deaths in Italy", "description": "Dermot Jewell, CEO of Consumers' Association Ireland, discusses the fallout after the Department of European Affairs advises Irish citizens not to travel to areas affected by the Coronavirus, such as mainland China and certain towns in northern Italy.", "url": "https://podcast.rasset.ie/podcasts/audio/2020/0225/20200225_rteradio1-morningireland-deptclarif_c21718460_21718534_232_.mp3", "urlToImage": null, "publishedAt": "2020-02-25T08:52:52Z", "content": null}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Shibu Tripathi", "title": "Delhi most polluted capital, India has 18 of top 30 worst AQI ranked cities", "description": "While Ghaziabad topped the list of most polluted regional cities (110 PM2.5), India ranked sixth on the list of 98 countries in PM2.5 concentration just behind Pakistan", "url": "https://www.business-standard.com/article/current-affairs/delhi-most-polluted-capital-india-has-18-of-top-30-worst-aqi-ranked-cities-120022500604_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-11/14/full/1573700963-3216.jpg", "publishedAt": "2020-02-25T08:24:00Z", "content": "With an average of 98.6 Particulate Matter (PM 2.5) concentration, Delhi topped the list of most polluted capital cities in the world. 18 of the 30 most polluted cities in 2019 were from India. A recent report released by AirVisual, which monitors internation… [+3389 chars]"}, {"source": {"id": null, "name": "Allafrica.com"}, "author": null, "title": "Wilkins Hospital Reopens", "description": "[The Herald] Wilkins Hospital reopened yesterday after a patient suspected of having the COVID-19 virus was discharged last week after she tested negative.", "url": "https://allafrica.com/stories/202002250182.html", "urlToImage": "https://cdn07.allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "publishedAt": "2020-02-25T08:13:55Z", "content": "Wilkins Hospital reopened yesterday after a patient suspected of having the COVID-19 virus was discharged last week after she tested negative.\r\nThe hospital evacuated patients to Beatrice Infectious Diseases Control Hospital last week to pave way for the woma… [+4009 chars]"}, {"source": {"id": null, "name": "Liveleak.com"}, "author": "NewsFlare", "title": "New York Toy Fair showcases goods as industry experts worry about effect of coronavirus", "description": "Revellers indulged in the goods being showcased at the New York Toy Fair on February 22. The temporary closing of Chinese factories who manufacture and supply toys for the western market will have a knock-on effect because of coronavirus fears, industry exper…", "url": "https://www.liveleak.com/view?t=k7jdi_1582621209", "urlToImage": "https://cdn.liveleak.com/80281E/ll_a_u/2020/Feb/25/LiveLeak-dot-com-5e54e2a574163_5_thumb.jpg", "publishedAt": "2020-02-25T09:00:09Z", "content": "Revellers indulged in the goods being showcased at the New York Toy Fair on February 22.The temporary closing of Chinese factories who manufacture and supply toys for the western market will have a knock-on effect because of coronavirus fears, industry expert… [+40 chars]"}, {"source": {"id": null, "name": "Cityam.com"}, "author": "Joe Curtis", "title": "Coronavirus: Brits returning from Italy told to self-isolate", "description": "Brits returning from northern Italy should self-isolate if they experience symptoms associated with the coronavirus outbreak, the UK’s health secretary The post Coronavirus: Brits returning from Italy told to self-isolate after Covid-19 outbreak appeared firs…", "url": "https://www.cityam.com/coronavirus-brits-returning-from-italy-told-to-self-isolate-after-covid-19-outbreak/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2020/02/1202999670.jpg", "publishedAt": "2020-02-25T08:26:49Z", "content": "Brits returning from northern Italy should self-isolate if they experience symptoms associated with the coronavirus outbreak, the UKs health secretary said today.\r\nMatt Hancock advised anyone travelling back to the UK from north of Pisa to stay at home for a … [+1967 chars]"}, {"source": {"id": null, "name": "Wccftech.com"}, "author": "Aernout van de Velde", "title": "Square Enix and Capcom Devs Scale Back PAX East Presence; EA Limits GDC 2020 Attendance, Cancelling Official Event Participations", "description": "Square Enix and Capcom have announced that they will be scaling back their PAX East presence later this week, while EA will be limiting its GDC 2020 attendance next month. The Coronavirus outbreak has caused disruptions across the gaming industry, including s…", "url": "https://wccftech.com/square-enix-capcom-pax-east-ea-limits-gdc-2020/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2020/02/wR4p8-1580828968-156812-blog-MGN_1280x720_00124C00-OPFBH.jpg", "publishedAt": "2020-02-25T08:25:59Z", "content": "Square Enix and Capcom have announced that they will be scaling back their PAX East presence later this week, while EA will be limiting its GDC 2020 attendance next month.\r\nThe Coronavirus outbreak has caused disruptions across the gaming industry, including … [+2697 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "feedfeeder", "title": "A Rare Legal Battle: Can a State Force a City to House Coronavirus Patients? - The New York Times", "description": "A Rare Legal Battle: Can a State Force a City to House Coronavirus Patients?The New York Times U.S. judge delays decision on moving coronavirus-exposed Americans to Costa Mesa, Calif.The Washington Post California City Gets 7-Day Reprieve in Coronavirus Stand…", "url": "https://slashdot.org/firehose.pl?op=view&amp;id=125809658", "urlToImage": null, "publishedAt": "2020-02-25T08:33:22Z", "content": "If the aborigine drafted an IQ test, all of Western civilization would\r\npresumably flunk it.\r\n-- Stanley Garn"}]