[{"source": {"id": "mashable", "name": "Mashable"}, "author": "Annie Colbert", "title": "SNL roasts Fox News' coronavirus coverage with help from surprise guest Elizabeth Warren", "description": "Senator Elizabeth Warren, meet Saturday Night Live Elizabeth Warren. The real Warren popped over to SNL for a surprise appearance during the show's cold open. The show kicked off with Kate McKinnon as Fox News host Laura Ingraham reluctantly covering the coro…", "url": "https://mashable.com/video/elizabeth-warren-saturday-night-live/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F08%252Fcb%252F35dd292e145840aeb996594676c02396.301f3.png%252F1200x630.png?signature=PRzfMsCnDekwGnZWrLspgQf7tiU=", "publishedAt": "2020-03-08T13:54:19Z", "content": "Senator Elizabeth Warren, meet Saturday Night Live Elizabeth Warren.\r\nThe real Warren popped over to SNL for a surprise appearance during the show's cold open. The show kicked off with Kate McKinnon as Fox News host Laura Ingraham reluctantly covering the cor… [+421 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Women worldwide march for equality", "description": "Protests raise awareness of discrimination on International Women's Day.", "url": "https://www.bbc.co.uk/news/world-51791335", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/A81E/production/_111183034_indo.jpg", "publishedAt": "2020-03-08T13:22:12Z", "content": "Image copyrightGetty ImagesImage caption\r\n Despite fears over the coronavirus outbreak, thousands of people took to the streets across Asia, including this march in Yogyakarta, Indonesia\r\nMarches to raise awareness of discrimination against women are taking p… [+1628 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Adia Robinson", "title": "Trump administration 'working very hard' on coronavirus: HHS Secretary Ben Carson", "description": "HUD Secretary Ben Carson discussed the Trump administration's response to novel coronavirus on ABC's \"This Week\" Sunday.", "url": "https://abcnews.go.com/Politics/trump-administration-working-hard-coronavirus-hhs-secretary-ben/story?id=69455917", "urlToImage": "https://s.abcnews.com/images/Politics/ben-carson-gty-rc-200307_hpMain_16x9_992.jpg", "publishedAt": "2020-03-08T13:28:48Z", "content": "Housing and Urban Development Secretary Ben Carson reiterated that the Trump administration is working very hard and looking at all the evidence on the novel coronavirus on ABC's \"This Week\" Sunday.\r\n\"You can look at worst case scenarios, you can look at best… [+2339 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Preetika Rana", "title": "The Wall Street Journal: Uber, DoorDash and other gig-economy companies discuss fund for workers affected by coronavirus", "description": "The biggest ride-sharing and food-delivery companies in the U.S. are in talks to set up a fund to compensate drivers affected by the novel coronavirus, a step that highlights the pressure they face to provide workers with broader employment protections.", "url": "http://www.marketwatch.com/story/uber-doordash-and-other-gig-economy-companies-discuss-fund-for-workers-affected-by-coronavirus-2020-03-08", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-GJ839_uber_l_ZG_20180524131858.jpg", "publishedAt": "2020-03-08T13:41:57Z", "content": "SAN FRANCISCO--The biggest ride-sharing and food-delivery companies in the U.S. are in talks to set up a fund to compensate drivers affected by the novel coronavirus, a step that highlights the pressure they face to provide workers with broader employment pro… [+1544 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MIKE STOBBE / AP", "title": "White House Stopped Officials From Recommending the Elderly Not Fly Amid COVID-19: Official", "description": "The White House overruled officials who wanted to recommend that elderly and fragile Americans be advised not to fly on commercial airlines.", "url": "https://time.com/5799117/white-house-coronavirus-seniors-flying/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/white-house-health-officials-covid-19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-08T13:51:38Z", "content": "(NEW YORK) — The White House overruled health officials who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the new coronavirus, a federal official told The Associated Press.\r\nThe Cente… [+4656 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "Coronavirus update: COVID-19 in Washington, D.C.; White House says no contact; clean your phone - AL.com", "description": "Coronavirus update: COVID-19 in Washington, D.C.; White House says no contact; clean your phone AL.com Trump 'not concerned' as first coronavirus case confirmed in Washington, D.C. POLITICO Three more coronavirus infections reported in D.C. area Saturday The …", "url": "https://www.al.com/news/2020/03/coronavirus-update-covid-19-in-washington-dc-white-house-says-no-contact-clean-your-phone.html", "urlToImage": "https://www.al.com/resizer/A4ABaPDdzT-p751bkTXkZXEBui0=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/GTH4X74WN5ENXKZGGXEQFIAYS4.jpg", "publishedAt": "2020-03-08T13:13:00Z", "content": "Washington, D.C. has its first case of coronavirus.\r\nDistrict of Columbia Mayor Muriel Bowser announced the patient was a resident in his 50s who began feeling ill in February. He does not have a history of international travel and no close contacts with any … [+2059 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jake Tapper, Anchor and Chief Washington Correspondent", "title": "This nursing home is at the center of Washington's coronavirus. Here's what one first responder saw there - CNN", "description": "This nursing home is at the center of Washington's coronavirus. Here's what one first responder saw there CNN Nursing Home at Center of Washington Coronavirus Outbreak Target of Criticism The Wall Street Journal Opinion: 1 Unfathomable Toll Of The Coronavirus…", "url": "https://www.cnn.com/2020/03/08/politics/coronavirus-washington-nursing-home-life-care-center-kirkland-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200307023019-life-care-center-kirkland-washington-0306-super-tease.jpg", "publishedAt": "2020-03-08T14:03:44Z", "content": "(CNN)When first responders reported last week to a hard-hit nursing home in Washington state, the epicenter of the nation's coronavirus outbreak, they found an understaffed facility with inadequate gear attempting to serve dozens of patients vulnerable to cat… [+5057 chars]"}, {"source": {"id": null, "name": "Digg.com"}, "author": null, "title": "'SNL' Cold Open Takes On The Coronavirus Outbreak, As 'The Ingraham Angle'", "description": "Before interviewing Senator Warren, the TV host makes it clear who is spreading lies about the outbreak.", "url": "https://digg.com/video/snl-cold-open-takes-on-the-coronavirus-outbreak-as-the-ingraham-angle", "urlToImage": "https://cdn.digg.com/wp-content/uploads/2020/03/08125520/Screen-Shot-2020-03-08-at-8.54.53-AM.png", "publishedAt": "2020-03-08T13:11:58Z", "content": "It's an internet fight and only the funniest meme will emerge victorious. This week, we have: the most fascinating ethical debates on film, \"I meet someone, we talk, they leave,\" a failed sociological experiment, and CDC memes."}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Coronavirus: China postpones Beijing International Film Festival", "description": "The 10th Beijing International Film Festival (BJIFF) has been postponed until further notice in view of the coronavirus epidemic.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/china-postpones-beijing-international-film-festival-coronavirus-6305506/", "urlToImage": "https://images.indianexpress.com/2020/03/Beijing-Film-Festival-759.jpg?w=759", "publishedAt": "2020-03-08T13:22:57Z", "content": "By: PTI | Beijing | \r\nPublished: March 8, 2020 6:52:57 pm\r\nThe logo of Beijing International Film Festival. (Photo: Film Business Asia)The 10th Beijing International Film Festival (BJIFF) has been postponed until further notice in view of the coronavirus epid… [+1197 chars]"}, {"source": {"id": null, "name": "Wtop.com"}, "author": "Alejandro Alvarez", "title": "Virginia reports second presumptive positive case of coronavirus - WTOP", "description": "Virginia reports second presumptive positive case of coronavirus WTOP US Marine in Virginia tests positive for coronavirus CNN US Marine tests positive for coronavirus in Virginia, Pentagon says Fox News Marine stationed just outside DC tests positive for cor…", "url": "http://wtop.com/virginia/2020/03/virginia-reports-second-presumptive-positive-case-of-coronavirus/", "urlToImage": "https://wtop.com/wp-content/uploads/2020/03/AP_20064576528025-4096x2731.jpg", "publishedAt": "2020-03-08T13:41:02Z", "content": "Virginia confirmed its second presumptive positive case of the new coronavirus on Sunday, only a day after the state reported its first.\r\nThe second case is a Fairfax city resident in his 80s, the Virginia Department of Health said in a news release. He first… [+1733 chars]"}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Christian Zibreg", "title": "Editor’s Desk: WWDC 2020, coronavirus, March event & rumored new mini-LED products", "description": "March kicked off with several major event cancellations due to the coronavirus outbreak. Is Apple going to cancel its upcoming WWDC 2020 conference for developers?", "url": "https://www.idownloadblog.com/2020/03/08/editors-desk-march-2-2020/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2019/03/Apple-Event-logo-black-teaser-730x480.jpg", "publishedAt": "2020-03-08T13:18:52Z", "content": "With February behind us, the tech blogosphere kicked off March with reporting on event cancellations due to the coronavirus outbreak, with Apple widely expected to cancel the upcoming WWDC 2020 conference for developers. We also covered awesome new jailbreak … [+1985 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Coronavirus deaths in Netherlands rises to three - health authorities", "description": "Two more people infected with the coronavirus in the Netherlands have died, taking the total number of fatalities to three, Dutch health officials said on Sunday.", "url": "https://www.reuters.com/article/us-health-coronavirus-netherlands-tally-idUSKBN20V0M8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T13:55:22Z", "content": "AMSTERDAM (Reuters) - Two more people infected with the coronavirus in the Netherlands have died, taking the total number of fatalities to three, Dutch health officials said on Sunday. \r\nThe National Institute for Public Health said the deceased were two men,… [+832 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Palli Thordarson", "title": "Outside the Box: Deadly viruses are no match for plain, old soap — here’s the science behind it", "description": "Soap works better than alcohol and disinfectants at destroying the structure of viruses, says chemistry professor Palli Thordarson.", "url": "http://www.marketwatch.com/story/deadly-viruses-are-no-match-for-plain-old-soap-heres-the-science-behind-it-2020-03-08", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-HZ315_hand_w_ZG_20200130101932.jpg", "publishedAt": "2020-03-08T13:39:05Z", "content": "Why does soap work so well on the new coronavirus and, indeed, most viruses? Because it is a self-assembled nanoparticle in which the weakest link is the lipid (fatty) bilayer.That sounds scientific. Let me explain. Soap dissolves the fat membrane, and the vi… [+8871 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nelson Renteria", "title": "El Salvador bans visitors from Germany, France over coronavirus", "description": "El Salvador has banned visitors from Germany and France due to coronavirus, after previously barring visitors from Italy, South Korea and Iran, countries with the largest outbreaks outside China.", "url": "https://www.reuters.com/article/us-health-coronavirus-el-salvador-idUSKBN20V0O8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T14:05:03Z", "content": "MEXICO CITY (Reuters) - El Salvador has banned visitors from Germany and France due to coronavirus, after previously barring visitors from Italy, South Korea and Iran, countries with the largest outbreaks outside China. \r\nSalvadorans and diplomats arriving fr… [+963 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Swiss death toll from new coronavirus rises to two", "description": "A patient infected with the new coronavirus has died in hospital in Liestal, authorities in the Swiss canton of Basel-Land said on Sunday, bringing the national death toll to two.", "url": "https://www.reuters.com/article/us-healthcare-coronavirus-swiss-idUSKBN20V0LK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T13:23:03Z", "content": "ZURICH (Reuters) - A patient infected with the new coronavirus has died in hospital in Liestal, authorities in the Swiss canton of Basel-Land said on Sunday, bringing the national death toll to two. \r\nNational health authorities have put the number of confirm… [+107 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: \"Caged\" pope skips Sunday address from window due to COVID-19 spread - Global News", "description": "Coronavirus outbreak: \"Caged\" pope skips Sunday address from window due to COVID-19 spread Global News Pope Francis livestreams Sunday prayers amid Italy's coronavirus outbreak New York Post Pope Francis - Angelus prayer 2020-03-08 Vatican News Did Pope Franc…", "url": "https://www.youtube.com/watch?v=hzY2qF8z9J0", "urlToImage": "https://i.ytimg.com/vi/hzY2qF8z9J0/maxresdefault.jpg", "publishedAt": "2020-03-08T14:06:36Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "German SPD calls for subsidies to help virus-hit industries", "description": "The head of Germany's Social Democrats called on Sunday for more support for firms forced to cut output because of the coronavirus epidemic, ahead of a policy meeting with the other parties in Chancellor Angela Merkel's government.", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-idUSKBN20V0O0", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T14:09:14Z", "content": "BERLIN (Reuters) - The head of Germany’s Social Democrats called on Sunday for more support for firms forced to cut output because of the coronavirus epidemic, ahead of a policy meeting with the other parties in Chancellor Angela Merkel’s government. \r\nConcer… [+1988 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italian stock exchange to open as usual on Monday", "description": "Italy's stock exchange will open as usual on Monday, a spokesman said on Sunday, after the government ordered a lockdown of large areas in the north of the country, including Milan, to stem coronavirus contagion.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-stock-exchan-idUSKBN20V0MI", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-08T13:36:17Z", "content": "MILAN (Reuters) - Italy’s stock exchange will open as usual on Monday, a spokesman said on Sunday, after the government ordered a lockdown of large areas in the north of the country, including Milan, to stem coronavirus contagion. \r\nThe Italian stock market, … [+1133 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "San Fran Bans Non-Essential Public Gatherings At City Facilities...", "description": "San Fran Bans Non-Essential Public Gatherings At City Facilities... (Top headline, 9th story, link ) Related stories: Outbreak spreads to 32 states and DC... Official: White House didn't want to tell seniors not to fly... TRUMP: 'Perfectly coordinated and fin…", "url": "https://sanfrancisco.cbslocal.com/2020/03/07/san-francisco-bans-non-essential-public-gatherings-at-city-facilities-for-2-weeks/", "urlToImage": "https://sanfrancisco.cbslocal.com/wp-content/uploads/sites/15116056/2014/07/sf-city-hall.jpg?w=625", "publishedAt": "2020-03-08T13:37:36Z", "content": "SAN FRANCISCO (CBS SF) – The City and County of San Francisco has banned “non-essential group events” at any city-owned facilities for the next two weeks because of concerns about the spread of coronavirus, according to an order Saturday signed by the county’… [+1621 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Bernie Sanders talks coronavirus on the campaign trail - CNN", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=UxiJ_bqD2Ds", "urlToImage": null, "publishedAt": "2020-03-08T14:03:40Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Kate Davidson", "title": "Federal Agencies Prepare for Disruptions...", "description": "Federal Agencies Prepare for Disruptions... (Top headline, 5th story, link ) Related stories: Outbreak spreads to 32 states and DC... Inside Administration, Debate Raged Over What to Tell Public... Official: White House didn't want to tell seniors not to fly.…", "url": "https://www.wsj.com/articles/federal-agencies-prepare-for-coronavirus-disruptions-11583639269", "urlToImage": "https://images.wsj.net/im-161228/social", "publishedAt": "2020-03-08T13:55:36Z", "content": "WASHINGTONFederal agencies are preparing to deploy emergency plans to maintain essential servicesfrom directing air traffic to delivering mail and making Social Security paymentsas the novel coronavirus epidemic widened and the nations capital diagnosed its f… [+268 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "Shameful: Flight Attendants Union Head Politicizing Coronavirus", "description": "Sara Nelson is President of the AFA-CWA, flight attendants union with 50,000 members and part of the national Communications Workers of America. She’s an activist in the left wing of the Democratic Party, a Bernie Sanders supporter, and has been called ‘the m…", "url": "https://viewfromthewing.com/shameful-flight-attendants-union-head-politicizing-coronavirus/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2020/03/snelson.png", "publishedAt": "2020-03-08T14:04:03Z", "content": "Sara Nelson is President of the AFA-CWA, flight attendants union with 50,000 members and part of the national Communications Workers of America. She’s an activist in the left wing of the Democratic Party, a Bernie Sanders supporter, and has been called ‘the m… [+3318 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Catherine Kim", "title": "Elizabeth Warren makes a surprise appearance on SNL", "description": "The real-life Elizabeth Warren joined her SNL doppelgänger, Kate McKinnon, to talk about Bloomberg, her dog, and post-primary life.", "url": "https://www.vox.com/culture/2020/3/8/21170154/elizabeth-warren-snl-cold-open-kate-mckinnon-primary-ingraham", "urlToImage": "https://cdn.vox-cdn.com/thumbor/cEeQcsAllyj-QqXdC5bLxIT6yNs=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19776840/GettyImages_1205774765.jpg", "publishedAt": "2020-03-08T13:46:46Z", "content": "Will Heath/NBC/NBCU Photo Bank/Getty Images The real-life Elizabeth Warren joined her SNL doppelgänger, Kate McKinnon, to talk post-primary life. Saturday Night Live’s Kate McKinnon has been praised for her spot-on impression of Sen. Elizabeth Warren impressi… [+4433 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Victoria Guida", "title": "Top health official to older Americans: ‘Don’t get on a cruise ship’", "description": "Dr. Anthony Fauci offered stark advice.", "url": "https://www.politico.com/news/2020/03/08/coronavirus-dont-get-on-cruise-ship-123718", "urlToImage": "https://static.politico.com/fe/9d/c7f946ce4cd3aebdd85ec4d93838/webp.net-resizeimage%20(26).jpg", "publishedAt": "2020-03-08T13:52:46Z", "content": "The quarantined Grand Princess cruise ship is seen off the coast of California last week. | California National Guard via AP\r\nA top U.S. health official on Sunday warned Americans who are elderly or have who underlying health conditions not to get on a cruise… [+743 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus: Steps to stay safe", "description": "Dr. Jon LaPook offers the latest developments in the virus' spread in the United States, and what precautions you should take to avoid infecting yourself and others.", "url": "https://www.cbsnews.com/video/coronavirus-steps-to-stay-safe/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/08/ecef9723-02d8-4c69-84bb-44fb94019ebc/thumbnail/1200x630/0cc06dceb6332f43abcc07cf78153bae/0308-sunmo-coronavirus-2043537-640x360.jpg", "publishedAt": "2020-03-08T13:29:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "TipRanks", "title": "Gilead Sciences Could Be the First to Beat the Coronavirus", "description": "The coronavirus’ grip on the market continues. Since the beginning of February, the S&P 500 has shed 8.5% of its value, a reflection of the effect the outbreak is having on the global economy. Amidst the bloodbath, one specific group of stocks is holding up. …", "url": "https://finance.yahoo.com/news/gilead-sciences-could-first-beat-140049667.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/HNVNK8E4Lm586qjA8MACuA--~B/aD01MDk7dz0xMjEyO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/ff204a1ca45848053e9017d1f51c801b", "publishedAt": "2020-03-08T14:00:49Z", "content": "The coronavirus grip on the market continues. Since the beginning of February, the S&amp;P 500 has shed 8.5% of its value, a reflection of the effect the outbreak is having on the global economy. Amidst the bloodbath, one specific group of stocks is holding u… [+3062 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Coronavirus is driving blood donations down across the U.S. Subby is going to give up some B-Negative today, each donation helps 3 people. Let's roll [PSA]", "description": "Coronavirus is driving blood donations down across the U.S. Subby is going to give up some B-Negative today, each donation helps 3 people. Let's roll", "url": "https://www.fark.com/comments/10736556/Coronavirus-is-driving-blood-donations-down-across-US-Subby-is-going-to-give-up-some-B-Negative-today-each-donation-helps-3-people-Lets-roll", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/p/p6/fark_p6SosKR-5joSoTpUuLlD0OJDYAA.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1584331200&Signature=Rw%2BbRo6k1k3e0hgmRz3KtLDn6kM%3D", "publishedAt": "2020-03-08T13:35:24Z", "content": "I went to give blood a year or two ago and they asked what countries I'd visited in the last two years.\"Uh let's see...\r\nChina, Hong Kong, India, Korea...\"\r\nSir sorry but we can't...\r\n\"Just a minute I'm not done\r\nUAE, Mexico, Taiwan, Malaysia...\"\r\nSir sorry b… [+105 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Gavin Sheehan", "title": "Electronic Arts Updates Their Esports Schedule Due To Coronavirus", "description": "Stop us if you've heard this one before. Another company has changed its plans due to the coronavirus, this time its Electronic Arts. The company posted a notice this week letting fans know of the changes to several events, which we have for you below. Some h…", "url": "https://www.bleedingcool.com/2020/03/08/electronic-arts-updates-their-esports-schedule-due-to-coronavirus/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/03/apex-legends-global-series-1200x628.jpg", "publishedAt": "2020-03-08T13:40:26Z", "content": "Stop us if you've heard this one before. Another company has changed its plans due to the coronavirus, this time its Electronic Arts. The company posted a notice this week letting fans know of the changes to several events, which we have for you below. Some h… [+2014 chars]"}, {"source": {"id": null, "name": "Mobilesyrup.com"}, "author": "Aisha Malik", "title": "Tim Hortons ditches paper cups for Roll Up the Rim amid coronavirus fears, goes more digital", "description": "Tim Hortons is completely eliminating paper Roll Up the Rim cups due to public health concerns over the novel coronavirus (COVID-19). The coffee chain says that it does not believe that it’s the right time for its 100,000 employees to collect rolled up tabs t…", "url": "https://mobilesyrup.com/2020/03/08/tim-hortons-ditches-paper-cups-roll-up-the-rim-amid-coronavirus-fears/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2020/03/tim-hortons-header-1024x576.jpg", "publishedAt": "2020-03-08T13:22:07Z", "content": null}, {"source": {"id": null, "name": "Wmur.com"}, "author": "Linda Patrazza", "title": "DHHS: 2 new presumptive positive cases of COVID-19 in New Hampshire - WMUR Manchester", "description": "DHHS: 2 new presumptive positive cases of COVID-19 in New Hampshire WMUR Manchester West Lebanon Church cancels services after suspected COVID-19 cases WCAX NH DHHS: two new presumptive cases of Covid-19 WMUR-TV Coronavirus Update: State Announces Two Presume…", "url": "https://www.wmur.com/article/two-new-presumptive-positive-cases-of-covid-19-in-new-hampshire/31271538", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/nh-coronavirus-gfx-0124-1583241786.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-03-08T13:22:12Z", "content": "MANCHESTER, N.H. —New Hampshire Health and Human Services officials are reporting two new presumptive positive cases of COVID-19 in the state.\r\n^^ At 10:30 a.m., officials will hold a press briefing about the new positive cases. See it streaming live in a vid… [+1878 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus: China reports 27 new fatalities", "description": "All the 27 deaths occurred in the virus-hit central Hubei province, China#39;s National Health Commission (NHC) said.", "url": "https://www.moneycontrol.com/news/world/coronavirus-china-reports-27-new-fatalities-5014831.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/china-viruscoronavirus-770x433.jpg", "publishedAt": "2020-03-08T13:17:06Z", "content": "China on Sunday reported 27 new deaths from coronavirus, the lowest number of fatalities in more than a month, taking the death toll to 3,097, while the COVID-19 infections for the first time fell below 50 since the disease surfaced in Hubei province in Janua… [+3210 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "American Institute of Economic Research", "title": "March Business Conditions Monthly", "description": "February is the tenth consecutive month within the 46 to 54 range for the Leading Indicators Index.The continuing modest performance of the Leading Indicators Index reflects the varied performance among the major sectors of the economy and overall slow pace o…", "url": "https://seekingalpha.com/article/4330482-march-business-conditions-monthly", "urlToImage": "https://static.seekingalpha.com/uploads/2020/3/8/saupload_BCM-Chart-1-2020_03-1.png", "publishedAt": "2020-03-08T13:12:34Z", "content": "By Robert Hughes\r\nAIER's Leading Indicators Index remains close to neutral; coronavirus threatens outlook.\r\nAIER's Leading Indicators Index rose 4 points to a reading of 54 in February, up from 50 in January. The Roughly Coincident Indicators Index and the La… [+11114 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.S. health official warns on spread of coronavirus", "description": "A top U.S. public health official said on Sunday signs of coronavirus spreading through U.S. communities was \"not encouraging\" and warned that Americans may need to think carefully about attending large gatherings if it continues.", "url": "http://feeds.reuters.com/~r/reuters/healthNews/~3/pbliyDZH75o/u-s-health-official-warns-on-spread-of-coronavirus-idUSKBN20V0MK", "urlToImage": null, "publishedAt": "2020-03-08T13:37:51Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Italy goes to new extremes to fight coronavirus outbreak", "description": "Italy, which has the highest coronavirus death toll outside of Asia, has announced stringent new measures to fight the outbreak, quarantining about a quarter of its people, and even banning weddings and funerals. Charlie D'Agata has the latest.", "url": "https://www.cbsnews.com/video/italy-goes-to-new-extremes-to-fight-coronavirus-outbreak/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/08/3967a077-de6f-4dbc-a662-5d33c9903744/thumbnail/1200x630/15b4294628285b7fe688fb9daace7e43/0308-sunmo-coronaviruscharlienewsblock-2043531-640x360.jpg", "publishedAt": "2020-03-08T13:20:00Z", "content": "Watch CBSN Live\r\nCopyright © 2020 CBS Interactive Inc. All rights reserved."}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Coronavirus: Kerala govt warns of stern action against those not reporting about overseas travel - Livemint", "description": "Coronavirus: Kerala govt warns of stern action against those not reporting about overseas travel Livemint Coronavirus Cases In India Rise To 39, Centre Bans Foreign Cruise Ships: 10 Points NDTV News Kerala launches contact-tracing programme to neutralise coro…", "url": "https://www.livemint.com/news/india/coronavirus-kerala-govt-warns-of-stern-action-against-those-not-reporting-about-overseas-travel-11583675304433.html", "urlToImage": "https://images.livemint.com/img/2020/03/08/600x338/20200308064L_1583675503185_1583675520373.jpg", "publishedAt": "2020-03-08T13:52:30Z", "content": "THIRUVANANTHAPURAM :\r\nTaking a serious view of three fresh coronavirus patients not disclosing their Italy visit, the Kerala government on Sunday warned of strict action, including prosecution, against those hiding such travel to affected countries and sympto… [+1670 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "Daniel Craig on ‘SNL’: 3 Sketches You Have to See", "description": "James Bond spoof, Elizabeth Warren surprise cameo and \"On the Couch\" musical sketch highlight James Bond star's second outing as host", "url": "https://www.rollingstone.com/tv/tv-recaps/daniel-craig-snl-recap-964207/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2020/03/dc.jpg", "publishedAt": "2020-03-08T14:01:14Z", "content": "The best episodes of Saturday Night Live are a magic trick in which everything looks easy. In lesser ones, you can see palpable sweat as the cast and crew try to stitch things together. While not nearly the abject disaster that was Daniel Craig’s last time ho… [+5177 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Tim Ahmann", "title": "Vulnerable Americans may need to avoid crowds, U.S. health official warns", "description": "Signs that coronavirus is spreading through U.S. communities were \"not encouraging\" and a top health official warned on Sunday that Americans, espe...", "url": "https://news.yahoo.com/u-health-official-warns-spread-133751535.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-08T13:37:51Z", "content": "By Tim Ahmann\r\nWASHINGTON (Reuters) - Signs that coronavirus is spreading through U.S. communities were \"not encouraging\" and a top health official warned on Sunday that Americans, especially those who are vulnerable, may need to stop attending large gatherin… [+1859 chars]"}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "Kerry Eleveld", "title": "Coronavirus Prompts White House To Mull Economic Stimulus Plan... For Trump's Hotels", "description": "In order to mitigate the economic fallout from the coronavirus, the White House is considering what economic chief Larry Kudlow called a \"timely and targeted\" intervention in the form of a tax deferment for the cruise, travel, and airline industries. “Perhaps…", "url": "https://crooksandliars.com/2020/03/coronavirus-prompts-white-house-mull", "urlToImage": "https://crooksandliars.com/files/primary_image/20/03/1080px-new_york_city_mai_2009_pd_045.jpeg", "publishedAt": "2020-03-08T14:00:01Z", "content": "In order to mitigate the economic fallout from the coronavirus, the White House is considering what economic chief Larry Kudlow called a \"timely and targeted\" intervention in the form of a tax deferment for the cruise, travel, and airline industries. Perhaps … [+1601 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Coronavirus Outbreak: Buses, Metro to be Disinfected on Regular Basis, says Kejriwal - News18", "description": "Coronavirus Outbreak: Buses, Metro to be Disinfected on Regular Basis, says Kejriwal News18 Coronavirus update: Delhi Metro, DTC buses to be disinfected everyday, says Kejriwal Livemint Coronavirus live updates: Iran Air stops all flights to Europe Times of I…", "url": "https://www.news18.com/news/india/coronavirus-outbreak-buses-metro-to-be-disinfected-on-regular-basis-says-kejriwal-2530667.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/11/arvind-kejriwal.jpg", "publishedAt": "2020-03-08T13:13:41Z", "content": "New Delhi: The Delhi government has ordered DTC and cluster buses, metro and hospitals to be disinfected on a regular basis as a precautionary measure to deal with the novel coronavirus, Chief Minister Arvind Kejriwal said on Sunday.\r\nAddressing a press confe… [+2848 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Spraying alcohol all over body will not protect you from coronavirus: WHO - Livemint", "description": "Spraying alcohol all over body will not protect you from coronavirus: WHO Livemint WHO statement on cases of COVID-19 surpassing 100 000 World Health Organization Coronavirus: Will consuming alcohol protect you? - Drinking alcohol will not protect you from CO…", "url": "https://www.livemint.com/news/india/spraying-alcohol-all-over-body-will-not-protect-you-from-coronavirus-who-11583674289580.html", "urlToImage": "https://images.livemint.com/img/2020/03/08/600x338/2020-02-24T125604Z_382240351_RC207F9PBH7N_RTRMADP_3_CHINA-HEALTH-WHO_1583674385442_1583674444038.JPG", "publishedAt": "2020-03-08T13:34:52Z", "content": "New Delhi: With 39 individuals diagnosed with the deadly novel coronavirus (COVID-19) in India, everyone seems to be going into a state of panic.And as a fallout, people are believing just about anything and everything they are coming across on the internet. … [+1440 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "TipRanks", "title": "Gilead Sciences Could Be the First to Beat the Coronavirus", "description": "The coronavirus’ grip on the market continues. Since the beginning of February, the S&P 500 has shed 8.5% of its value, a reflection of the effect the outbreak is having on the global economy. Amidst the bloodbath, one specific group of stocks is holding up. …", "url": "https://finance.yahoo.com/news/gilead-sciences-could-first-beat-140049667.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/fdP5mATZSD5rpFXqK7FBHw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD01MzcuNg--/https://s.yimg.com/uu/api/res/1.2/HNVNK8E4Lm586qjA8MACuA--~B/aD01MDk7dz0xMjEyO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/ff204a1ca45848053e9017d1f51c801b", "publishedAt": "2020-03-08T14:00:49Z", "content": "The coronavirus grip on the market continues. Since the beginning of February, the S&amp;P 500 has shed 8.5% of its value, a reflection of the effect the outbreak is having on the global economy. Amidst the bloodbath, one specific group of stocks is holding u… [+3062 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Daniel Politi", "title": "Coronavirus: Italy Puts Quarter of Its Population on Lockdown as Cases Soar", "description": "The restrictions of movement amount to the most stringent measures imposed anywhere outside China to try to slow the spread of the new virus.", "url": "https://slate.com/news-and-politics/2020/03/coronavirus-italy-quarter-population-lockdown-cases-soar.html", "urlToImage": "https://compote.slate.com/images/2323063f-3d23-4950-a0bf-c9d0c314c10a.jpeg?width=780&height=520&rect=5568x3712&offset=0x0", "publishedAt": "2020-03-08T13:56:03Z", "content": "Tourists wearing a protective face mask walk on San Marco square in Venice on March 8, 2020.\r\n<ol><li>\r\nThe Most Visible Uncontrolled Coronavirus Risk Is the President\r\n </li><li>\r\nThe Rights New Strategy to Fight Abortion Takes Aim at Doctors\r\n </li><li>\r\nTr… [+2943 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "'Most daunting virus' in half century...", "description": "'Most daunting virus' in half century... (Top headline, 8th story, link ) Related stories: Outbreak spreads to 32 states and DC... Inside Administration, Debate Raged Over What to Tell Public... Official: White House didn't want to tell seniors not to fly... …", "url": "https://www.statnews.com/2020/03/07/harvard-forum-experts-warn-most-daunting-virus-in-50-years/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/03/IOP7-1024x576.jpg", "publishedAt": "2020-03-08T13:55:36Z", "content": "CAMBRIDGE, Mass. For a veteran epidemiologist, an authority on homeland security, and a global health reporter, the outbreak of the novel coronavirus is the type of emergency they had long anticipated. But now that it is here, the three experts said Friday, t… [+9598 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Iran reports 49 new coronavirus deaths, highest single-day toll", "description": "The outbreak of the virus in Iran is one of the deadliest outside of China, where the disease originated.", "url": "https://www.moneycontrol.com/news/world/iran-reports-49-new-coronavirus-deaths-highest-single-day-toll-5014821.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Coronavirus-770x433.png", "publishedAt": "2020-03-08T13:17:06Z", "content": "Iran's health ministry on Sunday reported 49 new deaths from the novel coronavirus, the highest toll within 24 hours since the start of the outbreak in the country. \"At least 194 of our compatriots who fell sick with the COVID-19 illness have passed away,\" he… [+1317 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "What you need to know about coronavirus right now - Livemint", "description": "What you need to know about coronavirus right now Livemint China may be beating the coronavirus, at a painful cost Times of India Quarter of Italians on lockdown as virus sweeps globe Hindustan Times At 366 Fatalities, Italy Has Second-Highest Virus Deaths, I…", "url": "https://www.livemint.com/news/world/what-you-need-to-know-about-coronavirus-right-now-11583673844731.html", "urlToImage": "https://images.livemint.com/img/2020/03/08/600x338/PTI08-03-2020_000138B_1583673998873_1583674028753.jpg", "publishedAt": "2020-03-08T13:35:53Z", "content": "The spread\r\nThere are now more than 106,000 coronavirus cases and more than 3,600 deaths across the world, according to a Reuters tally of government announcements.\r\nItaly ordered a virtual lockdown across a swathe of its wealthy north on Sunday, including th… [+2601 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": "Jessica Willey", "title": "Houston-area teen band reacts to SXSW cancellation - KTRK-TV", "description": "Houston-area teen band reacts to SXSW cancellation KTRK-TV South by Southwest festival cancelled over COVID-19 CBC News SXSW Cancellation Not Covered by Insurance Variety ‘Stand with Austin’ fund urging people to visit city’s bars and restaurants after SXSW c…", "url": "https://abc13.com/5995177", "urlToImage": "https://cdn.abcotvs.com/dip/images/5995162_030820-ktrk-ewn-jessica-sxsw-houston-band.png?w=1600", "publishedAt": "2020-03-08T13:45:55Z", "content": "HOUSTON, Texas (KTRK) -- A Houston teenage band was impacted by the cancellation of the world-renowned South by Southwest festival.It was scheduled to begin Friday, March 13.\r\nThe City of Austin declared a local disaster, preventing the festival from taking p… [+1854 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Northern Italian Region Protests Massive Quarantine Over Coronavirus", "description": "ROME (Sputnik) - The president of the northern Italian region of Veneto, which includes Venice, pushed backed on Sunday against the government’s decision to place three areas under quarantine to contain coronavirus.", "url": "https://sputniknews.com/europe/202003081078512286-northern-italian-region-protests-massive-quarantine-over-coronavirus/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107850/69/1078506999.jpg", "publishedAt": "2020-03-08T13:59:23Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "Motor racing | Bahrain F1 race to be held without fans due to coronavirus", "description": "Bahrain is the second F1 race casualty of the virus", "url": "https://www.thehindu.com/sport/motorsport/motor-racing-bahrain-f1-race-to-be-held-without-fans-due-to-coronavirus/article31015729.ece", "urlToImage": "https://www.thehindu.com/sport/motorsport/w2sj4b/article31015728.ece/ALTERNATES/LANDSCAPE_615/FILES-AUTO-F1-PRIX-BAHRAIN", "publishedAt": "2020-03-08T13:20:25Z", "content": "The Bahrain Formula One Grand Prix will go ahead on March 22 without fans due to the coronavirus crisis, a blow to the Gulf Arab state's important tourism sector.\r\nBahrain, which is hosting the second round of the Formula One season at the Sakhir circuit outs… [+3331 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump administration 'working very hard' on coronavirus: HHS Secretary Ben Carson (Nihar Kabinittal/ABC News)", "description": "Nihar Kabinittal / ABC News : Trump administration ‘working very hard’ on coronavirus: HHS Secretary Ben Carson — Carson is a member of the White House's coronavirus task force. — Housing and Urban Development Secretary Ben Carson reiterated that the Trump ad…", "url": "https://www.memeorandum.com/200308/p16", "urlToImage": "https://s.abcnews.com/images/Politics/ben-carson-gty-rc-200307_hpMain_16x9_992.jpg", "publishedAt": "2020-03-08T14:10:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "LAURAN NEERGAARD", "title": "Behind the scenes, scientists prep for COVID-19 vaccine test", "description": "A team of scientists jostled for a view of the lab dish, staring impatiently for the first clue that an experimental vaccine against the new coronavirus just might work. After weeks of round-the-clock research at the National Institutes of Health, it was time…", "url": "https://news.yahoo.com/behind-scenes-scientists-prep-covid-133010863.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jX0kQssnvaa6sw8EDfCttw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/lMhDJciIeZp7R5fqUpmDaw--~B/aD0zNzUxO3c9NTYyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/3ad2f63d39950c202dbe29213425003e", "publishedAt": "2020-03-08T13:30:10Z", "content": "WASHINGTON (AP) A team of scientists jostled for a view of the lab dish, staring impatiently for the first clue that an experimental vaccine against the new coronavirus just might work.\r\nAfter weeks of round-the-clock research at the National Institutes of He… [+7836 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Italian stock exchange to open as usual on Monday", "description": "Italy's stock exchange will open as usual on Monday, a spokesman said on Sunday, after the government ordered a lockdown of large areas in the north of the country, including Milan, to stem coronavirus contagion. The Italian stock market, which is part of Lon…", "url": "https://finance.yahoo.com/news/italian-stock-exchange-open-usual-133724724.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/mtP7ZPpFwol3yYKucqgdgw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NDQuOA--/https://s.yimg.com/uu/api/res/1.2/jmjdt5bXdd54SihlJMq.kQ--~B/aD01Mjg7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0d8b95e67293dd7e8aa3d56fcebd0f7c", "publishedAt": "2020-03-08T13:37:24Z", "content": "MILAN (Reuters) - Italy's stock exchange will open as usual on Monday, a spokesman said on Sunday, after the government ordered a lockdown of large areas in the north of the country, including Milan, to stem coronavirus contagion.\r\nThe Italian stock market, w… [+1143 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Josh Feldman", "title": "Maryland Gov.: Trump Hasn’t Communicated ‘The Way I Might Like Him To’ on Coronavirus, Rest of Team Doing Good Job", "description": "Governor Larry Hogan appeared on Meet the Press this morning to talk about the response to coronavirus cases in Maryland.", "url": "https://www.mediaite.com/tv/maryland-gov-trump-hasnt-communicated-the-way-i-might-like-him-to-on-coronavirus-rest-of-team-doing-good-job/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/03/hogan.jpg", "publishedAt": "2020-03-08T13:56:11Z", "content": "Governor Larry Hogan appeared on Meet the Press this morning to talk about the response to coronavirus cases in Maryland.\r\nAt one point, Chuck Todd remarked, “There does seem as if politics is getting in the way a little bit. The president even took a shot at… [+1262 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Josh Feldman", "title": "Trump Defends Coronavirus Response as He Attacks ‘Fake News’ Again: We Have a ‘Perfectly Coordinated and Fine Tuned Plan’", "description": "President Donald Trump defended the U.S.' response to coronavirus this morning and once again attacked the \"fake news.\"", "url": "https://www.mediaite.com/trump/trump-defends-coronavirus-response-as-he-attacks-fake-news-again-we-have-a-perfectly-coordinated-and-fine-tuned-plan/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/03/trump-cdc.jpg", "publishedAt": "2020-03-08T13:12:08Z", "content": "President Donald Trump defended the U.S.’ response to coronavirus this morning and once again attacked the “fake news.”\r\nTrump tweeted this morning, “We have a perfectly coordinated and fine tuned plan at the White House for our attack on CoronaVirus. We move… [+693 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Tom Boggioni", "title": "Trump’s surgeon general grilled by CNN’s Tapper about persistent White House coronavirus lies", "description": "Appearing on CNN’s “State of the Union” early Sunday morning, the Surgeon General of the U.S. was repeatedly put on the spot by host Jake Tapper over the bungled response to the coronavirus Donald Trump’s administration and the persistent lies being spouted b…", "url": "https://www.rawstory.com/2020/03/trumps-surgeon-general-grilled-by-cnns-tapper-about-persistent-white-house-coronavirus-lies/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/adams_tapper.jpg", "publishedAt": "2020-03-08T14:00:15Z", "content": "Appearing on CNN’s “State of the Union” early Sunday morning, the Surgeon General of the U.S. was repeatedly put on the spot by host Jake Tapper over the bungled response to the coronavirus Donald Trump’s administration and the persistent lies being spouted b… [+1567 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "David Edwards", "title": "‘I don’t want to’: Ben Carson panics America by refusing to reveal ‘plan’ for cruise ship patients", "description": "A Sunday interview with Housing and Urban Development Secretary Ben Carson may have done more harm than good when it comes to assuring Americans that the Trump administration has the coronavirus under control. In an interview with ABC’s George Stephanopoulos,…", "url": "https://www.rawstory.com/2020/03/i-dont-want-to-ben-carson-freaks-out-america-by-refusing-to-reveal-plan-for-cruise-ship-patients/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/03/ben_carson2.jpg", "publishedAt": "2020-03-08T14:09:04Z", "content": "A Sunday interview with Housing and Urban Development Secretary Ben Carson may have done more harm than good when it comes to assuring Americans that the Trump administration has the coronavirus under control.\r\nIn an interview with ABC’s George Stephanopoulos… [+3939 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Birthright calls off trips to Israel over coronavirus concerns", "description": "Organization says decision will affect some 500 would-be participants from US, Germany and former Soviet Union; plans to have trips back up and running in May", "url": "https://www.timesofisrael.com/birthright-calls-off-trips-to-israel-over-coronavirus-concerns/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2017/08/F150714FFMH10-1024x640.jpg", "publishedAt": "2020-03-08T13:50:32Z", "content": "Taglit-Birthright announced Sunday that it was canceling trips to Israel in the short term out of an abundance of caution due to coronavirus concerns.\r\nThe group, which brings Jewish young adults on trips to Israel, said the decision would only affect a small… [+2157 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "Reuters, ​ Our Correspondent, Newsdesk, Newsdesk, Tech Desk, Mohammad Shahzad, News Desk, Entertainment Desk, ​ Our Correspondent, News Desk", "title": "Bangladesh confirms its first three cases of coronavirus", "description": "The affected people, aged between 20 and 35, include two people who returned home from Italy recently The post Bangladesh confirms its first three cases of coronavirus appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/2171917/3-bangladesh-confirms-first-three-cases-coronavirus/", "urlToImage": "https://c.tribune.com.pk/2020/03/2171917-whocoronavirusx-1583675909-645-640x480.jpg", "publishedAt": "2020-03-08T14:01:07Z", "content": "The affected people, aged between 20 and 35, include two people who returned home from Italy recently. (REPRESENTATIONAL IMAGE) PHOTO: AFP/FILE \r\nDHAKA: Bangladesh on Sunday confirmed its first three cases of coronavirus in the south Asian country, said the I… [+1008 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Billy Duberstein)", "title": "3 Stocks That Could Set You Up for Life", "description": "These stocks have huge opportunities in front of them.", "url": "https://www.fool.com/investing/2020/03/08/3-stocks-that-could-set-you-up-for-life.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/561841/gettyimages-475276248.jpg", "publishedAt": "2020-03-08T13:15:00Z", "content": "If you pick the right stock and hold it long enough, there's a shot that it could fund your entire retirement. Don't believe me? There are several of examples of companies that turned just $1,000 into $1 million, if held for the long term.\r\nOf course, it's ne… [+6311 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "KELLI KENNEDY and ADRIANA GOMEZ LICON", "title": "Nursing homes face unique challenge with coronavirus", "description": "From Miami to Seattle, nursing homes and other facilities for the elderly are stockpiling masks and thermometers, preparing for staff shortages and screening visitors to protect a particularly vulnerable population from the coronavirus. Of the 21 deaths acros…", "url": "https://news.yahoo.com/nursing-homes-face-unique-challenge-135314592.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5BJW4o6_AnWCDRsblVuRAQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjIuOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/LWp8cuSLKzPN9uQmpjPboA--~B/aD00NDgwO3c9NjY0NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/3d876d5ba5b69a3c82d37038edbaa55e", "publishedAt": "2020-03-08T13:53:14Z", "content": "MIAMI (AP) From Miami to Seattle, nursing homes and other facilities for the elderly are stockpiling masks and thermometers, preparing for staff shortages and screening visitors to protect a particularly vulnerable population from the coronavirus.\r\nIn China, … [+5423 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "Researcher accused of sensationalism after he calls COVID-19 ‘most frightening’ disease - Republic World - Republic World", "description": "Researcher accused of sensationalism after he calls COVID-19 ‘most frightening’ disease - Republic World Republic World Deja flu: Spanish Lady killed 14 million in British India a century ago Times of India Coronavirus: WHO says mortality rate has surpassed i…", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/researcher-calls-coronavirus-most-frightening-netizens-accuse-him-o.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/e28i5ptmgjq42ayr_1583673158.jpeg?tr=f-jpeg", "publishedAt": "2020-03-08T13:34:00Z", "content": "Social media has accused a leading researcher involved in the development of a potential vaccine for COVID-19 of fearmongering after he said that the novel Coronavirus is the “most frightening” disease he ever encountered in his career. Dr Richard Hatchett ap… [+2312 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "The Associated Press", "title": "Serie A: Parma-SPAL match kicks off despite Italy Sports Minister’s call to suspend games over coronavirus outbreak", "description": "Serie A played on Sunday despite calls from Italy’s sports minister and players’ association president to suspend the games in Italy’s top football division. The post Serie A: Parma-SPAL match kicks off despite Italy Sports Minister’s call to suspend games ov…", "url": "https://www.firstpost.com/health/serie-a-parma-spal-match-kicks-off-despite-italy-sports-ministers-call-to-suspend-games-over-coronavirus-outbreak-8131331.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/Parma-Spal-Serie-A-AP-social.jpg", "publishedAt": "2020-03-08T13:38:30Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "67 more people infected with coronavirus in UK - taking total to 273", "description": "The total number of confirmed cases of coronavirus in the UK is now 273 - a rise of 67.", "url": "https://news.sky.com/story/67-more-people-infected-with-coronavirus-in-uk-taking-total-to-273-11952874", "urlToImage": "https://e3.365dm.com/19/09/1600x900/skynews-breaking-news_4781018.jpg?20200306164658", "publishedAt": "2020-03-08T13:29:00Z", "content": null}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Ryan Schwartz", "title": "Daniel Craig Hosts SNL: Watch Video of the Best & Worst Sketches", "description": "What do Elizabeth Warren, Debbie Downer and James Bond have in common? They all popped up in some of Saturday Night Live‘s most memorable sketches this weekend — some for better… and some for worse. It was Bond himself, Daniel Craig, who presided over Season …", "url": "https://tvline.com/2020/03/08/snl-recap-daniel-craig-best-worst-sketches-video/", "urlToImage": "https://pmctvline2.files.wordpress.com/2020/03/snl-daniel-craig-debbie-downer-season-45.jpg?w=620", "publishedAt": "2020-03-08T14:06:10Z", "content": "What do Elizabeth Warren, Debbie Downer and James Bond have in common? They all popped up in some of Saturday Night Live‘s most memorable sketches this weekend — some for better… and some for worse.\r\nIt was Bond himself, Daniel Craig, who presided over Season… [+2883 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Gabija Gataveckaite", "title": "HSE boss 'cannot dispute' that up to 1.9m may be infected by coronavirus in Ireland", "description": "The HSE “cannot dispute” that up to 1.9m people in Ireland may be infected by the coronavirus.", "url": "https://www.independent.ie/irish-news/hse-boss-cannot-dispute-that-up-to-19m-may-be-infected-by-coronavirus-in-ireland-39025232.html", "urlToImage": "https://www.independent.ie/incoming/d502c/39020088.ece/AUTOCROP/w1240h700/UPDATE-_3190452644.jpg", "publishedAt": "2020-03-08T13:56:08Z", "content": "The HSE cannot dispute that up to 1.9m people in Ireland may be infected by the coronavirus.\r\nSpeaking on RTÉ Radio one, CEO of the HSE Paul Reid said that the health service is working to contain the virus and is putting together significant plans.\r\nThe phas… [+1936 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "UK seeks to 'deliver on promises' in first post-Brexit budget", "description": "LONDON: Britain unveils its first post-Brexit budget on Wednesday (Mar 11), with Prime Minister Boris Johnson expected to press ahead with major spending on infrastructure while also addressing the fallout from the coronavirus outbreak. Finance minister Rishi…", "url": "https://www.channelnewsasia.com/news/world/uk-seeks-to-deliver-on-promises-in-first-post-brexit-budget-12515964", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12515704/16x9/991/557/e0afc056e5864fa80ea06e530bae8e79/wN/file-photo--britain-s-chancellor-of-the-exchequer-rishi-sunak-is-seen-outside-downing-street-in-london-1.jpg", "publishedAt": "2020-03-08T13:34:31Z", "content": "LONDON: Britain unveils its first post-Brexit budget on Wednesday (Mar 11), with Prime Minister Boris Johnson expected to press ahead with major spending on infrastructure while also addressing the fallout from the coronavirus outbreak.\r\nFinance minister Rish… [+4016 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Serie A match delayed minutes before kickoff amid calls for league suspension", "description": "ROME: Italian football was plunged into a state of chaos and confusion on Sunday when the kickoff to a Serie A match between Parma and SPAL faced a last-minute delay following a call from Italy’s Minister for Sport to suspend the league during the coronavirus…", "url": "https://www.channelnewsasia.com/news/sport/serie-a-match-delayed-minutes-before-kickoff-amid-calls-for-league-suspension-12516012", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/8696096/16x9/991/557/a8d6d3290493335c3da84e6260e34509/tf/sports.png", "publishedAt": "2020-03-08T13:35:27Z", "content": "ROME: Italian football was plunged into a state of chaos and confusion on Sunday when the kickoff to a Serie A match between Parma and SPAL faced a last-minute delay following a call from Italys Minister for Sport to suspend the league during the coronavirus … [+1514 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "At Harvard forum, three who know warn of 'most daunting virus' in half a century (Andrew Joseph/STAT)", "description": "Andrew Joseph / STAT : At Harvard forum, three who know warn of ‘most daunting virus’ in half a century — CAMBRIDGE, Mass. — For a veteran epidemiologist, an authority on homeland security, and a global health reporter, the outbreak of the novel coronavirus i…", "url": "https://www.memeorandum.com/200308/p14", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/03/IOP7-1024x576.jpg", "publishedAt": "2020-03-08T13:35:02Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Associated Press", "title": "Ciara postpones Texas concert over coronavirus concerns", "description": "The pregnant singer was set to perform in Texas at the grand opening of the new Fort Hood USO on March 19.", "url": "https://pagesix.com/2020/03/08/ciara-postpones-texas-concert-over-coronavirus-concerns/", "urlToImage": "https://nyppagesix.files.wordpress.com/2020/03/30720-ciara-feature.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-08T13:31:00Z", "content": "Grammy-winning singer Ciara is the latest musician to postpone a concert because of the rapidly spreading coronavirus.\r\nCiara, who is pregnant, was set to perform in Texas at the grand opening of the new Fort Hood USO on March 19 but announced Saturday that t… [+1357 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "Danielle Turchiano, Variety", "title": "Elizabeth Warren surprises on ‘Saturday Night Live’ in coronavirus opening", "description": "A lot can happen in a short week’s time. Last weekend, “Saturday Night Live” opened its episode with a press conference about COVID-19 that turned into an impromptu democratic presidential hopefuls press conference because the primaries were the bigger story.…", "url": "https://www.chicagotribune.com/entertainment/ct-ent-snl-coronavirus-elizabeth-warren-20200308-vvzwf53znjcb3hm24apoeragtq-story.html", "urlToImage": "https://www.chicagotribune.com/resizer/p35zFVXAelMKDFfc-MQEtS9-Orw=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/RCCD4T7RRNC4PKYYHGTEF6BHHA.png", "publishedAt": "2020-03-08T13:17:09Z", "content": null}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Tim O'Donnell", "title": "10 things you need to know today: March 8, 2020", "description": "1. The Italian government Sunday announced the drastic measure of shutting down much of the country's north in an effort to curb the spread of the novel coronavirus, COVID-19, restricting movement of around 16 million people in places like Milan and Venice un…", "url": "https://theweek.com/10things/900724/10-things-need-know-today-march-8-2020", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/gettyimages-1211114344.jpg?itok=DjBesyRe", "publishedAt": "2020-03-08T13:16:00Z", "content": "The Italian government Sunday announced the drastic measure of shutting down much of the country's north in an effort to curb the spread of the novel coronavirus, COVID-19, restricting movement of around 16 million people in places like Milan and Venice until… [+725 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Trade Setup for Monday: Top 15 things to know before Opening Bell", "description": "According to the pivot charts, the key support level for Nifty is placed at 10,866.23, followed by 10,742.97. If the index moves up, key resistance levels to watch out for are 11,073.93 and 11,158.37.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-83-5013791.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/03/Sensex1.Reuters-1-770x433.jpg", "publishedAt": "2020-03-08T13:31:13Z", "content": "A steep sell-off swept Dalal Street, forcing equity indices to settle with deep cuts on March 6 after the Reserve Bank of India (RBI) placed Yes Bank under a moratorium.\r\nWeak global cues fanned by coronavirus fears persisted, making the situation worse. Most… [+4710 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": "Rosemary Rossi", "title": "Watch Elizabeth Warren Mimic Kate McKinnon Mimicking Elizabeth Warren That Even AOC Calls ‘Legendary’ (Video)", "description": "Elizabeth Warren pulled off a surprise appearance on this week’s “SNL” cold open, but the fun continued behind-the-scenes when Kate McKinnon flipped on her smartphone and recorded the former Democratic presidential candidate impersonating McKinnon impersonati…", "url": "http://www.thewrap.com/watch-elizabeth-warren-mimic-kate-mckinnon-mimicking-elizabeth-warren-aoc-calls-legendary/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2020/03/Elizabeth-Warren-Kate-McKinnon-SNL.jpg", "publishedAt": "2020-03-08T14:00:25Z", "content": "Elizabeth Warren pulled off a surprise appearance on this week’s “SNL” cold open, but the fun continued behind-the-scenes when Kate McKinnon flipped on her smartphone and recorded the former Democratic presidential candidate impersonating McKinnon impersonati… [+6088 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Zack Budryk", "title": "Fauci on shutting down coronavirus epicenters: 'Anything's possible'", "description": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that he doubted the U.S. would have to impose measures as \"draconian\" as total shutdowns ordered in some regions in nor...", "url": "https://thehill.com/homenews/sunday-talk-shows/486492-fauci-on-idea-of-shutting-down-epicenters-of-coronavirus-anythings", "urlToImage": "https://thehill.com/sites/default/files/faucianthony_030320gn2_lead.jpg", "publishedAt": "2020-03-08T14:06:28Z", "content": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that he doubted the U.S. would have to impose measures as draconian as total shutdowns ordered in some regions in northern Italy to halt the spread of corona… [+1744 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Rishi Sunak casts himself as UK finance director, with PM Boris Johnson as CEO", "description": "In an interview with #39;The Sunday Telegraph#39;, Sunak sought to downplay that implication and indicated that he and Johnson were well aligned.", "url": "https://www.moneycontrol.com/news/world/rishi-sunak-casts-himself-as-uk-finance-director-with-pm-boris-johnson-as-ceo-5014881.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/Rishi-Sunak-770x433.jpg", "publishedAt": "2020-03-08T14:01:06Z", "content": "Rishi Sunak, the UK's first Indian-origin finance minister, has cast himself as the country's finance director with British Prime Minister Boris Johnson as the CEO.\r\nThe 39-year-old Chancellor of the Exchequer, who is putting the finishing touches to his maid… [+2598 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Rebecca Klar", "title": "Sanders says campaign is in communication with health officials about rallies amid coronavirus outbreak", "description": "Sen. Bernie Sanders (I-Vt.) said Sunday his presidential campaign is in contact with public health officials in every place he has planned rallies as the coronavirus outbreak continues to spread....", "url": "https://thehill.com/homenews/campaign/486488-sanders-says-campaign-is-in-communication-with-health-officials-over", "urlToImage": "https://thehill.com/sites/default/files/newsletter-sanders_030320getty.jpg", "publishedAt": "2020-03-08T13:52:12Z", "content": "Sen. Bernie SandersBernie SandersBiden racks up union endorsements ahead of crucial primaries Sanders releases reproductive health-care planBiden campaign unveils biggest ad purchase of 2020 cycleMORE (I-Vt.) said Sunday his presidential campaign is in contac… [+1775 chars]"}, {"source": {"id": null, "name": "Catholicnewsagency.com"}, "author": "Courtney Mares", "title": "Pope Francis: Be strong in faith amid coronavirus trial", "description": "Vatican City, Mar 8, 2020 / 07:30 am ( CNA ).- In a video streamed live to St. Peter’s Square, Pope Francis prayed for those suffering from the \"coronavirus epidemic\" and encouraged Catholics to live through this trial with the strength of faith. “I join my b…", "url": "https://www.catholicnewsagency.com/news/pope-francis-be-strong-in-faith-amid-coronavirus-trial-68834", "urlToImage": "http://www.catholicnewsagency.com/images/Pilgrims_in_St_Peters_Square_March82020_900600.jpg", "publishedAt": "2020-03-08T13:30:00Z", "content": "Vatican City, Mar 8, 2020 / 07:30 am (CNA).- In a video streamed live to St. Peters Square, Pope Francis prayed for those suffering from the \"coronavirus epidemic\" and encouraged Catholics to live through this trial with the strength of faith.\r\nI join my brot… [+2654 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JOE McDONALD and ANGELA CHARLTON / AP", "title": "Italy Implements Sweeping COVID-19 Quarantine, Affecting a Quarter of Its Population", "description": "Italy's prime minister announced a sweeping coronavirus quarantine, restricting the movement of about a quarter of the country's population.", "url": "https://time.com/5799107/italy-coronavirus-quarantine/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/italy-quarantine-coronavirus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-08T13:32:53Z", "content": "(BEIJING) — Italy’s prime minister announced a sweeping coronavirus quarantine early Sunday, restricting the movements of about a quarter of the country’s population in a bid to limit contagions at the epicenter of Europe’s outbreak.\r\nShortly after midnight, … [+7544 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DAISY NGUYEN and JANIE HAR / AP", "title": "Hit With COVID-19, ‘Grand Princess’ Cruise Ship Headed to California Port", "description": "A cruise ship hit by the new coronavirus is headed to the port of Oakland, Calif., the captain told passengers.", "url": "https://time.com/5799114/grand-princess-cruise-ship-oakland-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/grand-princess-cruise-ship-port.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-08T13:37:39Z", "content": "(SAN FRANCISCO) — A cruise ship hit by the new coronavirus is headed to the port of Oakland, California, the captain told passengers, though they were destined to stay aboard the ship for at least another day.\r\nGrand Princess Capt. John Smith, in a recording … [+4543 chars]"}, {"source": {"id": "rte", "name": "RTE"}, "author": "Sandra Hurley", "title": "FF TD would 'go along' with idea of national government", "description": "Fianna Fáil TD Jim O'Callaghan has said that Fianna Fáil may have been too definitive in ruling out a government with Sinn Féin.", "url": "https://www.rte.ie/news/politics/2020/0308/1120949-government-formation/", "urlToImage": "https://img.rasset.ie/000f0153-1600.jpg", "publishedAt": "2020-03-08T13:22:24Z", "content": "Fianna Fáil TD Jim O'Callaghan has said that Fianna Fáil may have been too definitive in ruling out a government with Sinn Féin and said he would \"go along\" with the idea of a national government to deal with the coronavirus. \r\nFine Gael TD Martin Heydon insi… [+1535 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "US Christian pilgrims quarantined near Bethlehem turn to prayer, kinship", "description": "'It’s not a great situation, but we’re trying to make the best of it,' says Alabama pastor whose group is in isolation in the West Bank", "url": "https://www.timesofisrael.com/us-christian-pilgrims-quarantined-near-bethlehem-turn-to-prayer-kinship/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/AP20066492859661-1024x640.jpg", "publishedAt": "2020-03-08T13:42:32Z", "content": "AP — A group of US Christian pilgrims is turning to prayer and positive thinking as they cope with an open-ended coronavirus quarantine, confined to their West Bank hotel rooms while they wait for clearance to return to the United States.\r\nChris Bell, the lea… [+4054 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Lee Brown", "title": "Pope Francis livestreams Sunday prayers amid Italy’s coronavirus outbreak", "description": "Pope Francis livestreamed his prayers to giant screens in St. Peter’s Square on Sunday — breaking centuries of tradition because of Italy’s deadly spread of the novel coronavirus. The 83-year-old pope — who tested negative for COVID-19 after suffering from a …", "url": "https://nypost.com/2020/03/08/pope-francis-livestreams-sunday-prayers-amid-italys-coronavirus-outbreak/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/pope-francis-sunday-prayer-coronavirus-live-stream.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-08T14:07:35Z", "content": "Pope Francis livestreamed his prayers to giant screens in St. Peters Square on Sunday — breaking centuries of tradition because of Italy’s deadly spread of the novel coronavirus.\r\nThe 83-year-old pope — who tested negative for COVID-19 after suffering from a … [+1515 chars]"}, {"source": {"id": null, "name": "Blogspot.com"}, "author": "suman", "title": "Coronavirus: CNBC Editor Apologizes For Proposing Mass-Infections To Protect Health Of Markets", "description": "Long-time CNBC editor Rick Santelli has apologized for suggesting that everyone should be exposed to the coronavirus — to get it over with now — in order to protect the health of global and domestic markets.", "url": "http://postnewsd2.blogspot.com/2020/03/coronavirus-cnbc-editor-apologizes-for.html", "urlToImage": null, "publishedAt": "2020-03-08T14:08:04Z", "content": ""}, {"source": {"id": null, "name": "Legalinsurrection.com"}, "author": "Kemberlee Kaye", "title": "Airlines Flying Empty “Ghost” Flights During Coronavirus Outbreak to Avoid Losing Flight Spots", "description": "Does anyone care about the climate?!", "url": "https://legalinsurrection.com/2020/03/airlines-flying-empty-ghost-flights-during-coronavirus-outbreak-to-avoid-losing-flight-spots/", "urlToImage": "https://legalinsurrection.com/wp-content/uploads/2020/03/Airlines-Flying-Empty-22Ghost22-Flights-During-Coronavirus-Outbreak-to-Avoid-Losing-Flight-Spots-e1583615235569.png", "publishedAt": "2020-03-08T14:00:12Z", "content": "This is bureaucracy at its finest (or worst).With the coronavirus prompting many to stay in their own germy homes, airlines are wasting thousands of gallons of jet fuel flying empty flights in order to hold their flight slots.Europe’s use it or lose it policy… [+1252 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "‘There Has to be a Plan.’ For Relatives of Nursing Home Residents, Anger and Worry as the Coronavirus Spreads", "description": "No bingo, restrictions on visitors, and worry. Coronavirus has put nursing home residents in the U.S. in an especially scary and vulnerable position.", "url": "https://time.com/5799096/coronavirus-nursing-homes-elderly/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/Life-Care-Covid-19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-08T13:40:51Z", "content": "Kevin Connolly says his father-in-law credits the Life Care Center of Kirkland, Washington with “giving him his life back.” It’s where he recovered from hospice care, flirted with nurses and enjoyed eating chicken pot pie. But now, it’s where Connolly worries… [+12014 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "August Brown, Los Angeles Times", "title": "Amid growing coronavirus concerns, residents are torn over Coachella festival coming to their California town", "description": "At the Empire Polo Club in Indio, six weeks before the Coachella Valley Music and Arts Festival is set to kick off, the peaked white tents are going up across the rolling green lawns. The rainbow-tinted \"Spectra\" observation deck looms over the field, ready f…", "url": "https://www.chicagotribune.com/entertainment/music/ct-ent-coronavirus-coachella-0309-20200308-muazroihgrdzlkopk7whjvseeq-story.html", "urlToImage": "https://www.chicagotribune.com/resizer/c51g1gfiTAARYN0d7ygaLkOxQRw=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/OSVPXADTEZCBFDBL74545DVIZU.JPG", "publishedAt": "2020-03-08T13:38:17Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ap  Reporter Cian Cheesbrough For Mailonline", "title": "Italy sports minister says country should consider stopping all football prompting Serie A delay", "description": "Italy's sports minister has said that the country should consider suspending all football until the coronavirus is under control games just minutes before Serie A games were about to kick off.", "url": "https://www.dailymail.co.uk/sport/football/article-8088569/Italy-sports-minister-says-country-consider-stopping-football-prompting-Serie-delay.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/08/13/25693386-0-image-a-19_1583673249256.jpg", "publishedAt": "2020-03-08T13:17:42Z", "content": "2020 OLYMPIC GAMES \r\nIn doubt \r\nThe scale of the outbreak in Japan saw senior International Olympic Committee member Dick Pound describe the disease as 'the new war' threatening Tokyo 2020 and he warned the Games may have to be cancelled if the virus was stil… [+14028 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Number of Scottish coronavirus cases rises to 18", "description": "The Scottish government says two more cases of Covid-19 have been confirmed since Saturday.", "url": "https://www.bbc.co.uk/news/uk-scotland-51792637", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12AA9/production/_111175467_testsigns_pa.jpg", "publishedAt": "2020-03-08T14:09:24Z", "content": "Image copyrightPA Media\r\nThe total number of people who have tested positive for coronavirus now stands at 18, according to the Scottish government.\r\nIt means two additional people have been found to be carrying the virus since Saturday, when the figure stood… [+788 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Lessons from the 1918 flu pandemic", "description": "The outbreak of Spanish flu during World War I infected about one-third of the Earth's population, causing at least 50 million deaths, including more than a half-million in the United States, where news reports on the epidemic were prohibited", "url": "https://www.cbsnews.com/news/the-1918-flu-pandemic-a-cautionary-tale/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/08/21c3fd53-f388-4ebd-afa6-5fbf5900e2f3/thumbnail/1200x630/6fa6a78908e0ab75e0e1ade60aa1b3b5/sm-h4-teichner-pandemic-cu-copy-01-consolidated-01-frame-824.jpg", "publishedAt": "2020-03-08T13:51:39Z", "content": "If the outbreak of COVID-19 has a bullseye in the U.S., it's Washington State. Schools and universities closed, a gauge of alarm here. Seen in Seattle: a lot of masks.\r\nBut not for the first time. Substitute Spanish flu for coronavirus, 1918 for 2020, and the… [+4649 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Justine Coleman", "title": "Carson declines to 'preview' plan for virus-plagued ship's docking: 'We shouldn't have 16 people saying what the plan is'", "description": "Housing and Urban Development (HUD) Secretary Ben Carson on Sunday declined to \"preview\" the plan for the docking of the Grand Princess cruise ship, which is carrying at least 21 passengers who contracted coronavir...", "url": "https://thehill.com/homenews/sunday-talk-shows/486490-carson-declines-to-preview-plan-for-cruise-ship-docking-we", "urlToImage": "https://thehill.com/sites/default/files/carsonben_091019gn_lead.jpg", "publishedAt": "2020-03-08T13:57:40Z", "content": "Housing and Urban Development (HUD) Secretary Ben CarsonBenjamin (Ben) Solomon CarsonSunday shows preview: Trump administration gears up for new week of coronavirus response; Sanders prepares for next phase of primariesOn The Money: Coronavirus threatens reco… [+2954 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Temisan Amoye", "title": "COVID-19: Egypt records 33 new cases on Cruise ship", "description": "Egypt has recorded 33 new cases of the coronavirus. Health minister Hala Zayed told the media on Saturday that the cases were recorded aboard a cruise ship on the Nile river in Luxor, Southern Egypt. “Out of the 12, 11 are negative. Then we found 33 new posit…", "url": "https://www.vanguardngr.com/2020/03/covid-19-egypt-records-33-new-cases-on-cruise-ship/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/03/5240C80E-6747-4A98-9FF2-8E4D1A1DEB8F.jpeg?fit=750%2C394&ssl=1", "publishedAt": "2020-03-08T14:05:10Z", "content": "Egypt has recorded 33 new cases of the coronavirus. Health minister Hala Zayed told the media on Saturday that the cases were recorded aboard a cruise ship on the Nile river in Luxor, Southern Egypt.\r\nOut of the 12, 11 are negative. Then we found 33 new posit… [+742 chars]"}, {"source": {"id": null, "name": "Bitcoinist.com"}, "author": "Luke Whelan", "title": "3 Things Holding Bitcoin Price Back Right Now", "description": "The crypto market has slumped $13 billion in the past 24hrs, leaving a vast majority of digital assets deep in the red, including Bitcoin price. Here are 3 things holding it back right now. Over the course of today and yesterday, anyone with bitcoin probably …", "url": "https://bitcoinist.com/3-things-holding-bitcoin-price-back-right-now/", "urlToImage": "https://bitcoinist.com/wp-content/uploads/2019/08/shutterstock_283744568-1920x1200.jpg", "publishedAt": "2020-03-08T13:16:49Z", "content": "The crypto market has slumped $13 billion in the past 24hrs, leaving a vast majority of digital assets deep in the red, including Bitcoin price. Here are 3 things holding it back right now.\r\nOver the course of today and yesterday, anyone with bitcoin probably… [+3690 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jackie Salo", "title": "100-year-old Chinese man recovers from coronavirus, the oldest patient to beat illness", "description": "A 100-year-old Chinese man has fully recovered from the coronavirus, making him the oldest known patient to pull through the deadly illness, state media reported. The centenarian patient, who marked his milestone birthday last month, was discharged Saturday f…", "url": "https://nypost.com/2020/03/08/100-year-old-chinese-man-recovers-from-coronavirus-the-oldest-patient-to-beat-illness/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/health-coronavirus_southkorea-daegu.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-08T13:32:42Z", "content": "A 100-year-old Chinese man has fully recovered from the coronavirus, making him the oldest known patient to pull through the deadly illness, state media reported.\r\nThe centenarian patient, who marked his milestone birthday last month, was discharged Saturday … [+866 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Phil Thomas", "title": "Coronavirus: California cruise ship passengers to disembark despite Trump wanting them to stay on board", "description": "A cruise ship on which at least 21 people are infected with coronavirus will dock in Carlifornia and unload its passengers – despite Donald Trump saying he wanted them to stay on board to keep the number of US cases down.The Grand Princess is expected to arri…", "url": "https://news.yahoo.com/coronavirus-california-cruise-ship-passengers-135500128.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Ca2P9y77GV6NK8OCn.MlUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MDI-/https://s.yimg.com/uu/api/res/1.2/ZT8ZrAqltk_egRpSrB2EMw--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/565071bf291e07f34d7746952d57c239", "publishedAt": "2020-03-08T13:55:00Z", "content": "The Grand Princess cruise ship anchored off San Francisco, California: REUTERS\r\nA cruise ship on which at least 21 people are infected with coronavirus will dock in Carlifornia and unload its passengers despite Donald Trump saying he wanted them to stay on bo… [+2878 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Rida Morwa", "title": "Turning Panic Into Income", "description": "There's a saying \"slow is smooth, smooth is fast.\" Those who react quickly without thought will make mistakes.In the span of a week, the market went from all-time highs to a full panic.We accumulated some cash and are now looking to take advantage.During a pa…", "url": "https://seekingalpha.com/article/4329314-turning-panic-income", "urlToImage": "https://static3.seekingalpha.com/uploads/2020/2/29/saupload_bde8184757f5cff247e653850f8e2cb2.png", "publishedAt": "2020-03-08T13:40:00Z", "content": "Co-produced with Beyond Saving\r\nSlow is smooth, smooth is fast. A saying that originated in the US military, it has a core concept that applies to a wide variety of situations. The idea is that when we rush and try to do something quickly, we will find oursel… [+11504 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tim O'Donnell", "title": "10 things you need to know today: March 8, 2020", "description": "1.The Italian government Sunday announced the drastic measure of shutting down much of the country's north in an effort to curb the spread of the novel c...", "url": "https://news.yahoo.com/10-things-know-today-march-131600731.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-03-08T13:16:00Z", "content": "1.\r\nThe Italian government Sunday announced the drastic measure of shutting down much of the country's north in an effort to curb the spread of the novel coronavirus, COVID-19, restricting movement of around 16 million people in places like Milan and Venice u… [+7381 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Reuters, Reuters", "title": "Coronavirus: Singapore confirms 12 new cases, taking total number of infections to 150", "description": "Singapore on Sunday confirmed 12 new cases of the coronavirus, taking the total number of infections in the city state to 150.Nine of the new cases are linked to a private dinner at a function centre near Jurong Central Park on February 15. There now 30 cases…", "url": "https://www.scmp.com/news/asia/southeast-asia/article/3074164/coronavirus-singapore-confirms-12-new-cases-taking-total", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/08/dee68a84-613d-11ea-be3e-43af5536d789_image_hires_214804.jpg?itok=XYWTjaig&v=1583675291", "publishedAt": "2020-03-08T13:42:02Z", "content": "Published: 9:42pm, 8 Mar, 2020\r\nUpdated: 9:48pm, 8 Mar, 2020"}, {"source": {"id": null, "name": "Bizjournals.com"}, "author": "Michelle Caffrey", "title": "'There's a fear of the unknown': Local manufacturers brace for disruptions as coronavirus spreads", "description": "Manufacturers in the Philadelphia region are preparing for disruptions to their supply chains and reduced staffing levels as the COVID-19 strain of the coronavirus continues to spread across the United States and abroad. A survey from Horsham-based accounting…", "url": "https://www.bizjournals.com/philadelphia/news/2020/03/08/theres-a-fear-of-the-unknown-local-manufacturers.html?ana=RSS&s=article_search&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_philadelphia+%28Philadelphia+Business+Journal%29", "urlToImage": null, "publishedAt": "2020-03-08T13:42:22Z", "content": null}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "LAURAN NEERGAARD AP Medical Writer", "title": "Behind the scenes, scientists prep for COVID-19 vaccine test", "description": "Dozens of research groups around the world are racing to create a vaccine as coronavirus cases continue to grow", "url": "https://abcnews.go.com/Health/wireStory/scenes-scientists-prep-covid-19-vaccine-test-69467049", "urlToImage": "null", "publishedAt": "2020-03-08T13:34:04Z", "content": "WASHINGTON -- \r\nA team of scientists jostled for a view of the lab dish, staring impatiently for the first clue that an experimental vaccine against the new coronavirus just might work. \r\nAfter weeks of round-the-clock research at the National Institutes of H… [+7825 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters Videos", "title": "AC Milan host Genoa in a Serie A match without spectators at San Siro", "description": "VIDEO SHOWS: AC MILAN AND GENOA BUSES ARRIVING, VARIOUS OF CLOSED STADIUM, MEDICS CHECKING MAN'S TEMPERATURE \n              RESENDING WITH FULL STORY  \n              SHOWS: MILAN, ITALY (MARCH 8, 2020) (REUTERS - ACCESS ALL) \n              1. AC MILAN TEAM BU…", "url": "https://ca.news.yahoo.com/ac-milan-host-genoa-serie-140123720.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/qOXIjXWXu1Ed4zgdwFistQ--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/08/5e64fe5ab1172c645e16b9a6/5e64fe5ab1172c645e16b9a7_o_U_v2.jpg", "publishedAt": "2020-03-08T14:01:23Z", "content": "VIDEO SHOWS: AC MILAN AND GENOA BUSES ARRIVING, VARIOUS OF CLOSED STADIUM, MEDICS CHECKING MAN'S TEMPERATURE\r\nRESENDING WITH FULL STORY\r\nSHOWS: MILAN, ITALY (MARCH 8, 2020) (REUTERS - ACCESS ALL)\r\n1. AC MILAN TEAM BUS ARRIVING AT THE SAN SIRO STADIUM\r\n2. SIGN… [+1207 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": "https://www.facebook.com/zionsanvin", "title": "Vivo’s revised Android 10 update schedule revealed - gizmochina", "description": "Vivo’s revised Android 10 update schedule revealed gizmochina Vivo Has Announced Its Android 10 Beta Update Roadmap Which Starts With Vivo Nex 3 on March 14 Gadgets 360 Here’s when these Vivo phones will get the latest Android update Times of India Vivo Funto…", "url": "https://www.gizmochina.com/2020/03/08/vivos-revised-android-10-update-schedule-revealed/", "urlToImage": "https://www.gizmochina.com/wp-content/uploads/2018/12/Vivo-NEX-Dual-Display-Edition-hands-on-7.jpg", "publishedAt": "2020-03-08T13:22:00Z", "content": "Vivo had initially planned to start with the testing of beta version of FunTouch OS 10 based Android 10 upgrade in February. However, the update was delayed due to the COVID-19 Coronavirus outbreak. On Feb. 17, the company had confirmed that it will soon shar… [+1334 chars]"}]