[{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Connie Loizos", "title": "Andreessen Horowitz has backed Run The World, a startup with a timely offering: live online events", "description": "Every day, there’s another event-related cancellation owing to concern around the coronavirus. Just today Microsoft announced it will not have a presence at the Game Developers Conference in mid-March “out of an abundance of caution.” Facebook also said today…", "url": "http://techcrunch.com/2020/02/27/andreessen-horowitz-has-backed-run-the-world-a-startup-with-a-timely-offering-live-online-events/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/WechatIMG69.jpeg?w=533", "publishedAt": "2020-02-27T21:24:39Z", "content": "Every day, there’s another event-related cancellation owing to concern around the coronavirus. Just today Microsoft announced it will not have a presence at the Game Developers Conference in mid-March “out of an abundance of caution.” Facebook also said today… [+6301 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "The Dow Jones drops nearly 1200 points as coronavirus fears batter stock markets", "description": "The Dow Jones Industrial Average dropped nearly 1200 points today to close at 25,766.64, marking the single worst week for the index since 2011. The Nasdaq stock market fell over 400 points. Behind the collapse was a growing realization that COVID-19, the cor…", "url": "http://techcrunch.com/2020/02/27/the-dow-jones-drops-nearly-1200-points-as-coronavirus-fears-batter-stock-markets/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1150825123.jpeg?w=600", "publishedAt": "2020-02-27T22:04:56Z", "content": "The Dow Jones Industrial Average dropped nearly 1200 points today to close at 25,766.64, marking the single worst week for the index since 2011. The Nasdaq stock market fell over 400 points.\r\nBehind the collapse was a growing realization that COVID-19, the co… [+1909 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Caitlin McGarry", "title": "Coronavirus Concerns Lead to the Cancellation of One of Tech's Biggest Developer Conferences", "description": "The spread of coronavirus is prompting companies to cancel nonessential travel. That includes trade shows like the smartphone-centric Mobile World Congress, which was scheduled to be held in Barcelona this week but was called off. Now Facebook has canceled it…", "url": "https://gizmodo.com/coronavirus-concerns-lead-to-the-cancellation-of-one-of-1841959065", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fxgpij4kqpgr79cqvxpi.jpg", "publishedAt": "2020-02-27T21:21:00Z", "content": "The spread of coronavirus is prompting companies to cancel nonessential travel. That includes trade shows like the smartphone-centric Mobile World Congress, which was scheduled to be held in Barcelona this week but was called off. Now Facebook has canceled it… [+2257 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Pasley", "title": "The CDC outlined an ominous hypothetical scenario about what could happen in the US as the coronavirus spreads. Here's what to expect.", "description": "The US now has 60 confirmed cases of the coronavirus, and it's highly likely there will be more. The Centers for Disease Control and Prevention has outlined a hypothetical scenario of what could happen in America as the coronavirus spreads. It predicts more c…", "url": "https://www.businessinsider.com/what-could-happen-as-coronavirus-spreads-america-cdc-prediction-2020-2", "urlToImage": "https://i.insider.com/5e57e5eafee23d59c2184446?width=1200&format=jpeg", "publishedAt": "2020-02-27T21:46:33Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump reportedly put Pence in charge of coronavirus because the VP didn't 'have anything else to do'", "description": "Vice President Mike Pence was tapped to lead the government's response to coronavirus because President Donald Trump said he didn't \"have anything else to do,\" the New York Times reported. The Trump administration's approach to coronavirus so far has faced bi…", "url": "https://www.businessinsider.com/trump-put-pence-charge-coronavirus-because-had-nothing-to-do-2020-2", "urlToImage": "https://i.insider.com/5e5838c2fee23d3fed739754?width=1200&format=jpeg", "publishedAt": "2020-02-27T21:49:11Z", "content": "President Donald Trump told people he put Vice President Mike Pence in charge of the government's response to coronavirus because he didn't \"have anything else to do,\" the New York Times reported, per people familiar with the president's comments. \r\nThe Trump… [+1633 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aaron Holmes", "title": "Uber drivers scared of coronavirus are avoiding airport pickups (UBER)", "description": "Some Uber drivers, anxious about the coronavirus outbreak, say they've taking matters into their own hands to avoid exposure to the illness. On web forums and in interviews with Business Insider, drivers said they're avoiding picking up passengers from airpor…", "url": "https://www.businessinsider.com/uber-drivers-coronavirus-avoiding-airport-pickups-2020-2", "urlToImage": "https://i.insider.com/5e5827effee23d322607a935?width=1200&format=jpeg", "publishedAt": "2020-02-27T22:02:42Z", "content": "For Uber drivers, letting dozens of travelers into their personal vehicles every day is routine. Coronavirus may be changing that.\r\nUS experts and government agencies have warned that an outbreak of COVID-19, the coronavirus disease, could be imminent, but Ub… [+2476 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Coronavirus patients over age 80 have a 15% chance of dying. Here's the mortality rate for every age bracket.", "description": "A study of more than 44,000 coronavirus patients found that patients over age 80 have a 15% chance of dying. Patients in their 50s were about three times more likely to die than patients in their 40s. Here's the mortality rate for every age bracket. For the l…", "url": "https://www.businessinsider.com/coronavirus-death-age-older-people-higher-risk-2020-2", "urlToImage": "https://i.insider.com/5e57f83bfee23d6b7c04a0e3?width=1200&format=jpeg", "publishedAt": "2020-02-27T21:19:00Z", "content": "The coronavirus has reached every continent except Antarctica, but it doesn't infect all patients equally.\r\nA recent study from the Chinese Center for Disease Control and Prevention found that the virus most seriously affects older people with preexisting hea… [+2221 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Mike Pence will reportedly control the information scientists and health officials release about the coronavirus", "description": "Vice President Mike Pence's office will coordinate all public messaging and appearances by government officials concerning the Wuhan coronavirus, The New York Times reported Thursday. Officials told The Times the new approach would help streamline the adminis…", "url": "https://www.businessinsider.com/pence-will-have-control-over-government-information-about-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5ccd8784021b4c260c78f0b3?width=1200&format=jpeg", "publishedAt": "2020-02-27T22:03:23Z", "content": "Vice President Mike Pence's office will coordinate all public messaging and appearances by government officials concerning the Wuhan coronavirus, The New York Times reported Thursday. \r\nOfficials familiar with the strategy told The Times that the new approach… [+2960 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "California bracing for spread of coronavirus", "description": "California said Thursday it was monitoring some 8,400 people for the new coronavirus, after officials confirmed a woman had contracted the disease without traveling to outbreak-hit regions. Governor Gavin Newsom said travelers arriving from affected areas wer…", "url": "https://news.yahoo.com/california-bracing-spread-coronavirus-212128258.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5BTt2CrXvPNW_FfQaawiMQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/g0lvAuESUVGEUDW4OgT3rQ--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/caebd12b9ece121e0163c4cb4585950c979867e3.jpg", "publishedAt": "2020-02-27T21:21:28Z", "content": "Los Angeles (AFP) - California said Thursday it was monitoring some 8,400 people for the new coronavirus, after officials confirmed a woman had contracted the disease without traveling to outbreak-hit regions.\r\nGovernor Gavin Newsom said travelers arriving fr… [+2173 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (James Pasley)", "title": "The CDC outlined an ominous hypothetical scenario about what could happen in the US as the coronavirus spreads. Here's what to expect.", "description": "Here's what the US could face in the coming months if the coronavirus spreads, according to the CDC.", "url": "https://news.yahoo.com/cdc-outlined-ominous-hypothetical-scenario-214633263.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/dgBlfz14i7blH9d3z4wPuw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/dYwhcF0omqAdt_A4NZR0cw--~B/aD0xMzgyO3c9MTg0MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/88b8b27cb09af6e498dc7d730d185dad", "publishedAt": "2020-02-27T21:46:33Z", "content": "People take precautions for the coronavirus in New York.\r\nJohannes Eisele / AFP / Getty\r\n<ul><li>The US now has 60 confirmed cases of the coronavirus, and it's highly likely there will be more.\r\n</li><li>The Centers for Disease Control and Prevention has outl… [+12288 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sonam Sheth", "title": "A government whistleblower alleges US health workers treated coronavirus evacuees without proper protective gear or training", "description": "A government whistleblower alleges that the Department of Health and Human Services sent workers to help evacuees from Wuhan, China — the center of the coronavirus — without giving them proper protective gear or training. According to The Washington Post and …", "url": "https://www.businessinsider.com/whistleblower-us-workers-treated-coronavirus-without-gear-training-2020-2", "urlToImage": "https://i.insider.com/5cbf785eb14bf428016a8fc7?width=1200&format=jpeg", "publishedAt": "2020-02-27T21:57:37Z", "content": "A whistleblower from the Department of Health and Human Services has alleged that the US sent more than a dozen government workers to assist Americans who were evacuated from Wuhan, China without giving them proper training or protective gear, The Washington … [+3764 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vera Bergengruen and Brian Bennett", "title": "The Trump Administration’s Many Vacancies Could Complicate its Coronavirus Response", "description": "On Thursday, as the U.S. was facing its first possible case of community-spread coronavirus, President Donald Trump brought in a long-time public health official to help manage the White House response to the spread of deadly disease. Ambassador Debbie Birx, …", "url": "https://time.com/5792015/trump-coronavirus-vacancies/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/GettyImages-1203674055.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-02-27T22:05:25Z", "content": "On Thursday, as the U.S. was facing its first possible case of community-spread coronavirus, President Donald Trump brought in a long-time public health official to help manage the White House response to the spread of deadly disease. Ambassador Debbie Birx, … [+7685 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Coronavirus Cases Soar in Italy and Iran; 48 Countries Now Report Infections", "description": "The fight to contain the coronavirus entered an alarming new phase on Thursday as caseloads soared in Europe and the Middle East, and health officials in the United States and Germany dealt with patients with no known connection to others with the infection. …", "url": "https://science.slashdot.org/story/20/02/27/2059229/coronavirus-cases-soar-in-italy-and-iran-48-countries-now-report-infections", "urlToImage": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now", "publishedAt": "2020-02-27T21:20:00Z", "content": "Anybody paying any real attention to what's been happening in China - if via the CCP's response only - should have realized that what was being said and what were being done were at massive odds.\r\nThe nicest thing that I think someone can say about the narrat… [+252 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "John Parkinson", "title": "Efforts to strike coronavirus funding agreement undermined by partisanship", "description": "As urgent as the coronavirus crisis might seem, Congress might not take up emergency funding for two weeks.", "url": "https://abcnews.go.com/Politics/congressional-efforts-strike-coronavirus-funding-agreement-plagued-partisanship/story?id=69262987", "urlToImage": "https://s.abcnews.com/images/Politics/speaker-pelosi-presser-ap-jc-200227_hpMain_16x9_992.jpg", "publishedAt": "2020-02-27T21:29:44Z", "content": "Republicans and Democrats on Thursday expressed a shared desire to avoid partisan bickering and congressional dysfunction in efforts to pass emergency funding to address the coronavirus crisis, but lawmakers have yet to demonstrate much urgency or progress to… [+6576 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "As Diamond Princess crew members finally leave the coronavirus-stricken cruise ship, Japanese officials admit the quarantine 'may not have been perfect'", "description": "Crew members began leaving the coronavirus-stricken Diamond Princess cruise ship after weeks of quarantine on Thursday. Japanese officials admitted that the quarantine \"may not have been perfect\" and said they could not isolate workers properly because they n…", "url": "https://www.businessinsider.com/diamond-princess-cruise-workers-leave-coronavirus-quarantine-2020-2", "urlToImage": "https://i.insider.com/5e583704fee23d43d36a0d53?width=1200&format=jpeg", "publishedAt": "2020-02-27T21:41:00Z", "content": "Crew members have finally begun to leave the coronavirus-stricken Diamond Princess cruise ship, after a weeks-long quarantine that many experts called unethical and ineffective.\r\nAbout 240 workers who tested negative for the virus began to disembark on Thursd… [+4498 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tessa Berenson", "title": "Meet HHS Secretary Alex Azar, the Official Chairing the Coronavirus Task Force", "description": "President Donald Trump often likes to refer to Alex Azar, his Secretary of Health and Human Services (HHS), as a “killer.” That’s high praise from Trump: ‘Killer’ is one of his favorite compliments, and a sign of respect. “The president has been very deferent…", "url": "https://time.com/5791798/alex-azar-hhs-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/Alex-Azar-coronavirus-HHS.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-02-27T22:07:26Z", "content": "President Donald Trump often likes to refer to Alex Azar, his Secretary of Health and Human Services (HHS), as a “killer.”\r\nThat’s high praise from Trump: ‘Killer’ is one of his favorite compliments, and a sign of respect. “The president has been very deferen… [+7372 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Xeni Jardin", "title": "AT&T, T-Mobile, Sprint, Verizon face FCC fines after probe finds they failed to protect user location data", "description": "AT&T, T-Mobile, Sprint, and Verizon are among the telecommunications carriers facing hundreds of millions of dollars in fines from the Federal Communications Commission after a federal investigation found the companies didn't do enough to protect the location…", "url": "https://boingboing.net/2020/02/27/att-t-mobile-sprint-verizo.html", "urlToImage": "https://i2.wp.com/media.boingboing.net/wp-content/uploads/2016/02/download.jpeg?fit=644%2C435&ssl=1", "publishedAt": "2020-02-27T22:02:04Z", "content": "AT&amp;T, T-Mobile, Sprint, and Verizon are among the telecommunications carriers facing hundreds of millions of dollars in fines from the Federal Communications Commission after a federal investigation found the companies didn't do enough to protect the loca… [+3493 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Emma Lord", "title": "Here's What You Should — And Shouldn't — Include In A Coronavirus Preparedness Kit", "description": "The CDC has warned that the spread of coronavirus is less of an \"if\" and more of a \"when.\" View Entire Post ›", "url": "https://www.buzzfeed.com/emmalord9/tk-things-you-should-and-shouldnt-get-for-a-c-9jzy7s4t16", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-02/27/21/campaign_images/f296f4eb0e48/heres-what-you-should-and-shouldnt-include-in-a-c-2-1766-1582839408-0_dblbig.jpg", "publishedAt": "2020-02-27T21:38:27Z", "content": "There are more than 82,000 confirmed cases worldwide as of Thursday, including 60 in the US (including 43 people repatriated to the US after the outbreak on the Diamond Princess cruise ship in the Chinese province of Hubei). But with outbreaks occurring in mo… [+2129 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Clarissa-Jan Lim", "title": "Surgical Masks? Hand Sanitizers? Facial Hair? Your Questions On The Coronavirus, Answered.", "description": "Should you run out and buy a mask? Why is everyone telling you to wash your hands? And are you gonna have to shave that beautiful beard?! View Entire Post ›", "url": "https://www.buzzfeednews.com/article/clarissajanlim/coronavirus-questions-masks-hand-sanitizers", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-02/27/18/asset/2881c1f2b073/sub-buzz-439-1582828862-22.jpg?crop=3000:1570;0,215", "publishedAt": "2020-02-27T21:38:27Z", "content": "COVID-19, the disease caused by the new coronavirus, has spread faster than global health officials have been able to contain. Even the Centers for Disease Control and Prevention (CDC) warned this week that the American public should prepare for outbreaks acr… [+7246 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "MarketWatch", "title": "NewsWatch: How bad is the coronavirus-sparked stock-market selloff? — the Dow industrials weekly skid would rank within its top 15 in its 124-year history", "description": "The depth of the slide for stocks this week can perhaps best be illustrated by the severity of the skid for the 124-year-old Dow Jones Industrial Average.", "url": "https://www.marketwatch.com/story/how-bad-is-the-coronavirus-sparked-stock-market-selloff-the-dow-industrials-weekly-skid-would-rank-within-its-top-15-in-its-124-year-history-2020-02-27", "urlToImage": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "publishedAt": "2020-02-27T22:00:08Z", "content": "The depth of the slide for stocks this week can perhaps best be illustrated by the severity of the skid for the 124-year-old Dow Jones Industrial Average. See full story.\r\nWant to prepare for the coronavirus? You can start by washing your hands the right way\r… [+1210 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Patrick Klepek, Emanuel Maiberg", "title": "Microsoft, Epic Among Companies Dropping Out of GDC Amid Coronavirus Fears", "description": "Epic and Microsoft join a chorus of other companies deciding to avoid the annual Game Developers Conference, as complications elsewhere rise.", "url": "https://www.vice.com/en_us/article/g5x8qm/microsoft-epic-among-companies-dropping-out-of-gdc-amid-coronavirus-fears", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5e582fbebe0f7a009c5ad25d/lede/1582838003911-47430326131_999fc0f3de_k.jpeg?crop=1xw:0.8432xh;0xw,0.1568xh&resize=1200:*", "publishedAt": "2020-02-27T21:29:28Z", "content": "Fears over the ongoing spread of the now-global novel coronavirus have led to an escalating series of cancellations for the video game industry. After Sony dropped out of PAX East, an event happening now in Boston, the company announced it would no longer be … [+4617 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Helen Branswell, STAT", "title": "Latest U.S. Coronavirus Case Suggests True Scope of Undetected Spread is Unknown", "description": "A California woman may have been infected locally, but few Americans are being tested -- Read more on ScientificAmerican.com", "url": "https://www.scientificamerican.com/article/latest-u-s-coronavirus-case-suggests-true-scope-of-undetected-spread-is-unknown/", "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/A51B9F09-F1C6-4392-B71E90E6D55B35FF.jpg", "publishedAt": "2020-02-27T21:45:00Z", "content": "The discovery that a California woman was likely infected with the novel coronavirus by a previously unrecognized case in her community is proof of an enormous problem the country is facing at the moment, according to public health experts. It’s clear that th… [+6501 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Joy Wiltermuth", "title": "Energy junk-bonds tumble as coronavirus fears drag oil, natural gas lower", "description": "Falling West Texas Intermediate crude prices, as the COVID-19 epidemic spreads and threatens global growth, are adding to the troubles of high-yield energy companies.", "url": "https://www.marketwatch.com/story/energy-junk-bonds-tumble-as-coronavirus-fears-drag-oil-natural-gas-lower-2020-02-27", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-IB079_Corona_ZG_20200227152214.jpg", "publishedAt": "2020-02-27T21:13:11Z", "content": "Energy company debt tumbled Thursday, as fears of the spread of the coronavirus pulled commodity prices lower and pushed bonds of several oil and gas producers deeper into distressed, or junk, territory.\r\nWhiting Petroleum Corp. \r\nWLL, -24.34%\r\n led the energ… [+3687 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Rebecca Heilweil", "title": "Coronavirus is the first big test for futuristic tech that can prevent pandemics", "description": "The coronavirus is putting a lot of new tech, including robots and artificial intelligence, on display.", "url": "https://www.vox.com/recode/2020/2/27/21156358/surveillance-tech-coronavirus-china-facial-recognition", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6jMIHS9FIV2sg7_RlUv7KX2n-RM=/0x196:8070x4421/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19751966/GettyImages_1200309119.jpg", "publishedAt": "2020-02-27T21:30:00Z", "content": "A health care worker uses a touch-free thermometer to take a Chinese worker’s temperature. | Kevin Frayer/Getty Images The coronavirus is putting a lot of new tech, including robots and artificial intelligence, on display. The novel coronavirus that first app… [+8947 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "U.S. CDC aggressively evaluating whether coronavirus survives on surfaces: agency chief", "description": "\"On copper and steel its pretty typical, it's pretty much about 2 hours,\" Redfield said at a House of Representatives hearing on the government...", "url": "https://news.yahoo.com/u-cdc-chief-says-aggressively-221028136.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-02-27T22:10:28Z", "content": "(Reuters) - U.S. Centers for Disease Control and Prevention (CDC) director Robert Redfield told the U.S. Congress on Thursday that his agency is aggressively evaluating how long coronavirus can survive and be infectious on surfaces.\r\n\"On copper and steel its … [+1344 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Thomas Claburn", "title": "F8 accompli: Facebook, Epic Games, Microsoft, Unity abandon conference plans over Wuhan coronavirus fears", "description": "Big names drop out of GDC, HP axes partner event, stock markets in free fall Growing concern over the spread of the novel Wuhan coronavirus has prompted Epic Games, Microsoft, and Unity to announce on Thursday that they are withdrawing from the Game Developer…", "url": "https://www.theregister.co.uk/2020/02/27/coronavirus_conference_cancellation/", "urlToImage": "https://regmedia.co.uk/2020/02/27/shutterstock_coronavirus_map.jpg", "publishedAt": "2020-02-27T21:47:58Z", "content": "Growing concern over the spread of the novel Wuhan coronavirus has prompted Epic Games, Microsoft, and Unity to announce on Thursday that they are withdrawing from the Game Developers Conference in San Francisco next month. Facebook has also cancelled the mee… [+4958 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "Japan just closed all of its schools to contain coronavirus outbreak", "description": "The new coronavirus, also called COVID-19, already has the world on edge. Even as health officials around the globe fight to contain the spread, nobody is sure exactly how long this whole scare will last, or how much damage it will do before it finally subsid…", "url": "https://bgr.com/2020/02/27/coronavirus-news-japan-school-closure-updates/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/01/10535898e-e1579701511906.jpg?quality=98&strip=all", "publishedAt": "2020-02-27T22:01:35Z", "content": "The new coronavirus, also called COVID-19, already has the world on edge. Even as health officials around the globe fight to contain the spread, nobody is sure exactly how long this whole scare will last, or how much damage it will do before it finally subsid… [+2162 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Elizabeth Blackstock", "title": "The Vietnam Grand Prix Might Happen, But Italian F1 Teams Could Suffer Due To Coronavirus", "description": "Formula One ’s Chinese Grand Prix has already been postponed as the coronavirus (COVID-19) epidemic continues to impact the health of people around the world. And while the FIA is still confident that no other events will be affected, the Italian-based F1 tea…", "url": "https://jalopnik.com/the-vietnam-grand-prix-might-happen-but-italian-f1-tea-1841955294", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/zqoqmpofkva1lgesfw1w.jpg", "publishedAt": "2020-02-27T21:25:00Z", "content": "Formula Ones Chinese Grand Prix has already been postponed as the coronavirus (COVID-19) epidemic continues to impact the health of people around the world. And while the FIA is still confident that no other events will be affected, the Italian-based F1 teams… [+2285 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Preparing for Potential Coronavirus U.S. Outbreak (Podcast)", "description": null, "url": "https://www.bloomberg.com/news/audio/2020-02-27/preparing-for-potential-coronavirus-u-s-outbreak-podcast", "urlToImage": null, "publishedAt": "2020-02-27T21:40:54Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Juve-Inter among games without fans", "description": "Five Serie A matches including the clash between Juventus and Inter Milan will be played without fans due to the coronavirus emergency.", "url": "https://www.skysports.com/football/news/11854/11944930/coronavirus-juventus-vs-inter-milan-among-five-serie-a-matches-to-be-played-behind-closed-doors", "urlToImage": "https://e0.365dm.com/20/02/1600x900/skysports-serie-a-football_4928257.jpg", "publishedAt": "2020-02-27T21:27:00Z", "content": "Five Serie A matches including the clash between Juventus and Inter Milan have been postponed due to the coronavirus emergency.\r\nThe other matches are Udinese vs Fiorentina, AC Milan vs Genoa, Parma vs SPAL and Sassuolo vs Brescia.\r\nMore to follow..."}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "CA Gov Says State Only Has 200 Testing Kits...", "description": "CA Gov Says State Only Has 200 Testing Kits... (Top headline, 4th story, link ) Related stories: First case of UNKNOWN ORIGIN confirmed in Northern California... WAS NOT TESTED FOR DAYS... Medical staff exposed? Experts: Should be prepared to see overnight bo…", "url": "https://sanfrancisco.cbslocal.com/2020/02/27/gov-newsom-coronavirus-testing-kits-shortage/", "urlToImage": "https://sanfrancisco.cbslocal.com/wp-content/uploads/sites/15116056/2020/02/Newsom-coronavirus.jpg?w=1024", "publishedAt": "2020-02-27T22:01:36Z", "content": "SACRAMENTO (CBS SF) — California Gov. Gavin Newsom said Thursday the state is monitoring about 8,400 people for the coronavirus, a day after a Solano County patient was identified as the first coronavirus case in the U.S. from unknown origin.\r\nAt a news confe… [+3094 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ebola czar calls White House's move an 'outrage' - CNN", "description": "Ebola czar calls White House's move an 'outrage' CNN Trump to talk coronavirus in just 2nd White House briefing room visit New York Post Trump: Coronavirus Poses 'Very Low' Risk To Americans | NBC News NBC News Trump says coronavirus could affect economic gro…", "url": "https://www.youtube.com/watch?v=Br2JgJkPdkM", "urlToImage": "https://i.ytimg.com/vi/Br2JgJkPdkM/maxresdefault.jpg", "publishedAt": "2020-02-27T22:07:06Z", "content": "The White House is requiring health officials to get approval before making public statements about the coronavirus, sources tell CNN. Ron Klain, who served as the Ebola response coordinator under President Obama, discusses the decision.\r\n#CNN#News"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "India's Fragile Economic Rebound Faces New Risk From Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/india-s-fragile-economic-rebound-faces-new-risk-from-coronavirus", "urlToImage": null, "publishedAt": "2020-02-27T22:00:00Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Singtel Counting on Budget Stimulus to Soften Coronavirus Blow", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/singtel-counting-on-budget-stimulus-to-soften-coronavirus-blow", "urlToImage": null, "publishedAt": "2020-02-27T22:00:00Z", "content": null}, {"source": {"id": "politico", "name": "Politico"}, "author": "Victoria Colliver", "title": "Dozens possibly exposed to coronavirus at small California hospital long before diagnosis", "description": "The patient first arrived at NorthBay VacaValley Hospital’s emergency department on the evening of Feb. 15 and spent three days there.", "url": "https://www.politico.com/states/california/story/2020/02/27/dozens-possibly-exposed-to-coronavirus-at-small-california-hospital-long-before-diagnosis-9421490", "urlToImage": "https://static.politico.com/5e/31/95abf9e44dd1a9dd3ebed3dad3c3/uc-davis-medical-center-900-ap.jpg", "publishedAt": "2020-02-27T21:19:18Z", "content": "University of California, Davis Medical Center in Sacramento, Calif. | AP Photo\r\nOAKLAND A California woman potentially exposed dozens of people at a small Vacaville hospital more than a week before she was diagnosed as the first patient likely to have contra… [+1869 chars]"}, {"source": {"id": null, "name": "Clickorlando.com"}, "author": null, "title": "Florida police agency offers to test drugs for coronavirus - WKMG News 6 & ClickOrlando", "description": "Florida police agency offers to test drugs for coronavirus WKMG News 6 & ClickOrlando Arkansas cops offer to 'test' meth for coronavirus New York Post Think your meth is infected with the coronavirus? These police are here to help! KOLD Kansas sheriff’s offic…", "url": "https://www.clickorlando.com/news/local/2020/02/27/florida-police-agency-offers-to-test-drugs-for-coronavirus/", "urlToImage": "https://www.clickorlando.com/resizer/8VlVQqPKnWm2ADgLIyE36yu8zQI=/541x417/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/QQ2OFLWV6RDX3J6AHPV4WXO2UQ.jpg", "publishedAt": "2020-02-27T21:41:00Z", "content": "TAVARES, Fla. The Tavares Police Department is offering to test narcotics amid the coronavirus outbreak.\r\nAccording to the Centers for Disease Control and Prevention, the respiratory infection, known as COVID-19, is spread through coughing or sneezing -- not … [+881 chars]"}, {"source": {"id": null, "name": "Wowt.com"}, "author": "6 News", "title": "Bennington Police tap into coronavirus fears to catch meth users - WOWT", "description": "Bennington Police tap into coronavirus fears to catch meth users WOWT Wisconsin police warn recently bought meth may contain ‘Corona Virus,’ offer to test it for free KTLA Kansas sheriff’s office will test your meth for coronavirus KMBC Kansas City Johnson Ci…", "url": "https://www.wowt.com/content/news/Bennington-Police-tap-into-coronavirus-fears-to-catch-meth-users-568256041.html", "urlToImage": "https://media.graytvinc.com/images/BENNINGTON-METH-CORONAVIRUS-20200227.jpg", "publishedAt": "2020-02-27T21:46:23Z", "content": "BENNINGTON, Neb. (WOWT) -- The Bennington Police Department posted a photo on its Facebook page with a \"warning\" about a possible local meth \"contamination.\"\r\nRELATED: Texas police say local meth is contaminated with coronavirus, offer to test it\r\nWednesday's… [+380 chars]"}, {"source": {"id": null, "name": "Wral.com"}, "author": "WRAL", "title": "Wake schools officials tell parents not to panic over coronavirus - WRAL.com", "description": "Wake schools officials tell parents not to panic over coronavirus WRAL.com Coronavirus prep ongoing at NC hospitals, companies and CLT as officials urge calm Charlotte Observer Wake County schools following guidelines from CDC, health department for coronavir…", "url": "https://www.wral.com/wake-schools-officials-tell-parents-not-to-panic-over-coronavirus/18980203/", "urlToImage": "https://wwwcache.wral.com/asset/news/education/wake_county_schools/2020/02/27/18980292/8TB9_0AM-DMID1-5lzgmpthw-640x480.jpg", "publishedAt": "2020-02-27T21:30:00Z", "content": "By Adam Owens, WRAL anchor/reporter\r\nCary, N.C. — As fears over a coronavirus outbreak expand around the world, Wake County Public School System officials tried to calm area parents on Thursday.\r\nThe school district posted information on school websites stati… [+1801 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Cycling: UAE Tour canceled over coronavirus, say teams", "description": "The UAE Tour featuring some of the world's leading riders has been canceled with two stages remaining due to the coronavirus outbreak, according to several teams on Thursday.", "url": "https://www.reuters.com/article/us-china-health-cycling-idUSKCN20L333", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T21:16:56Z", "content": "BERLIN (Reuters) - The UAE Tour featuring some of the world’s leading riders has been canceled with two stages remaining due to the coronavirus outbreak, according to several teams on Thursday. \r\n“We have taken note of the cancellation of the UAE Tour due to … [+503 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": null, "title": "The Dow Jones drops nearly 1200 points as coronavirus fears batter stock markets", "description": "The Dow Jones Industrial Average dropped nearly 1200 points today to close at 25,766.64, marking the single worst week for the index since 2011. The Nasdaq stock market fell over 400 points. Morning trading showed that economists and investors were not assuag…", "url": "https://techcrunch.com/2020/02/27/the-dow-jones-drops-nearly-1200-points-as-coronavirus-fears-batter-stock-markets/", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jVI0yrlT7fDRGXuzJOoe6Q--~B/aD0yNzI3O3c9NDA4OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/ac940292f54b9449f1a13abff5dfbbdd", "publishedAt": "2020-02-27T22:04:56Z", "content": "The Dow Jones Industrial Average dropped nearly 1200 points today to close at 25,766.64, marking the single worst week for the index since 2011. The Nasdaq stock market fell over 400 points.\r\nBehind the collapse was a growing realization that COVID-19, the co… [+1912 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "ENS Economic Bureau", "title": "Sensex loses 1,577.34 points in 5 days on coronavirus woes", "description": "The expiry of February series derivatives contracts too kept the domestic markets volatile, traders said. After plunging over 465.69 points during the day, the 30-share BSE Sensex finally settled 143.30 points, or 0.36 per cent, lower at 39,745.66.", "url": "https://indianexpress.com/article/business/market/sensex-loses-1577-34-points-in-5-days-on-coronavirus-woes-6290177/", "urlToImage": "https://images.indianexpress.com/2020/01/sensex-stock-market-759.jpg?w=759", "publishedAt": "2020-02-27T21:42:02Z", "content": "The Sensex has now lost 1,577.34 points in five days, while the Nifty has shed 492.60 points. (File Photo)Equity indices reeled for the fifth straight session on Thursday, pressured by a sell-off in bank, IT and energy counters, as the global markets grappled… [+1929 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": null, "title": "Andreessen Horowitz has backed Run The World, a startup with a timely offering: live online events", "description": "Just today Microsoft announced it will not have a presence at the Game Developers Conference in mid-March \"out of an abundance of caution.\" Facebook also said today that it is canceling its annual F8 conference scheduled for May over coronavirus-outbreak conc…", "url": "https://techcrunch.com/2020/02/27/andreessen-horowitz-has-backed-run-the-world-a-startup-with-a-timely-offering-live-online-events/", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/3W_qmZ3iKMTag45seUsk_A--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/985e0a816746e4debd9d05ca4b97916f", "publishedAt": "2020-02-27T21:24:39Z", "content": "Every day, there's another event-related cancellation owing to concern around the coronavirus. Just today Microsoft announced it will not have a presence at the Game Developers Conference in mid-March \"out of an abundance of caution.\" Facebook also said today… [+6186 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Elizabeth Kim", "title": "Coronavirus Update: CDC Goes Dark As California Reports First Possible Case Of Community Spread", "description": "\"This is worrisome,\" said Dr. Irwin Redlener, the director of Columbia University's National Center for Disaster Preparedness. [ more › ]", "url": "https://gothamist.com/news/coronavirus-update-cdc-goes-dark-california-reports-first-possible-case-community-spread", "urlToImage": "https://cms.prod.nypr.digital/images/301358/fill-1200x650/", "publishedAt": "2020-02-27T21:47:00Z", "content": "The White House is clamping down on communication issued from government health officials and scientists about the spread of coronavirus following a decision by President Trump to put Vice President Mike Pence in charge of the U.S. task force addressing the p… [+3844 chars]"}, {"source": {"id": null, "name": "Metrowestdailynews.com"}, "author": "Henry Schwan", "title": "Coronavirus: Hospitals, schools, businesses brace for potential virus arrival - MetroWest Daily News", "description": "Coronavirus risk is low in Massachusetts, but that's not stopping hospitals and others from being ready in case the potentially deadly virus hits", "url": "https://www.metrowestdailynews.com/article/20200227/NEWS/200227753", "urlToImage": "https://www.metrowestdailynews.com/storyimage/WL/20200227/NEWS/200227753/AR/0/AR-200227753.jpg", "publishedAt": "2020-02-27T22:02:00Z", "content": "Coronavirus risk is low in Massachusetts, but that's not stopping hospitals and others from being ready in case the potentially deadly virus hits MetroWest.\r\nMILFORD - As coronavirus spreads worldwide, at least one local businessman can't help but think about… [+5871 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Associated Press", "title": "Coronavirus wrecks markets, business plans, and conferences as panic worsens - Fox Business", "description": "The spread of the new coronavirus around the world is hitting companies hard as they suspend production, meetings, events and business travel.", "url": "https://www.foxbusiness.com/markets/coronavirus-wrecks-markets-business-plans-and-conferences-as-panic-worsens", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/AP20058674321158.jpg?ve=1&tl=1", "publishedAt": "2020-02-27T21:17:42Z", "content": "The spread of the new coronavirus around the world is hitting companies hard as they suspend production, meetings, events and business travel. Here's a look at the latest developments:\r\nMARKETS: Markets are down sharply again. The Dow and S&amp;P were down ov… [+3536 chars]"}, {"source": {"id": null, "name": "Aol.com"}, "author": "Jennifer Starks", "title": "Dow plunges nearly 1200 points as coronavirus fears send markets diving - AOL", "description": "Dow plunges nearly 1200 points as coronavirus fears send markets diving AOL Coronavuirus fears devastate Dow Jones by 4.4 per cent Sky News Australia The S&P 500 Enters Correction, Coronavirus Fear Grows, Consumer Data Still Solid FX Empire Here's how long st…", "url": "https://www.aol.com/article/finance/2020/02/27/dow-plunges-nearly-1200-points-virus-fears-send-markets-diving/23935638/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-02%2F7cf69740-59a6-11ea-b8fe-957d6f289f13", "publishedAt": "2020-02-27T21:23:58Z", "content": "Wall Street suffered brutal losses on Thursday, with the Dow Jones Industrial Average swinging wildly through more than 600 points before closing with a loss of 1,200 points for the worst week since the financial crisis.\r\nThe Dow has now lost more than 3,000 … [+2781 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Stephen Simpson, CFA", "title": "Ternium Hammered On Risk Aversion And Economic Uncertainty", "description": "Ternium missed fourth quarter expectations on higher costs, leading to the worst steel EBITDA/ton number in about five years.\n        The 2020 outlook has a lot of uncertainty, particularly with respect to construction spending/investment in Mexico, and the c…", "url": "https://seekingalpha.com/article/4327895-ternium-hammered-on-risk-aversion-and-economic-uncertainty", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-27T21:19:14Z", "content": "Terniums (TX) performance since my last update has not been good, with the shares down about 17%. Thats better than the performance of steel peers like ArcelorMittal (MT), Nucor (NUE), and Steel Dynamics (STLD), but less bad is only worth so much. Honestly, I… [+6824 chars]"}, {"source": {"id": null, "name": "News9.com"}, "author": null, "title": "2 People Tested For Coronavirus In Oklahoma, State Health Department Reports - news9.com KWTV", "description": "2 People Tested For Coronavirus In Oklahoma, State Health Department Reports news9.com KWTV Government Measures To Stop COVID-19 Triggering Pandemic Of Market Fear Investing.com Coronavirus outbreak: WHO advisor says countries \"must continue to do what they c…", "url": "https://www.news9.com/story/41828246/2-people-tested-for-coronavirus-in-oklahoma-state-health-department-reports", "urlToImage": "https://KWTV.images.worldnow.com/images/19149075_G.jpeg?lastEditedDate=1580391273000", "publishedAt": "2020-02-27T21:56:34Z", "content": "Travelers returning to the United States from China in the last 14 days are urged to seek medical advice if they feel sick with fever, cough or difficulty breathing. It is important to call ahead before going to a doctor’s office or emergency room and advise … [+171 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Ali Gostanian", "title": "Small businesses feel effects of coronavirus outbreak", "description": "Small businesses are feeling the effects of the coronavirus outbreak on their supply chains, forcing owners to decide whether to shut up shop, pass the price hike onto their customers, or seek out alternative suppliers.", "url": "https://www.nbcnews.com/business/consumer/it-s-not-just-apple-small-businesses-are-feeling-effects-n1142786", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_09/3243681/200225-nick-arin-oliver-al-1432_50f88352846197af6888bf72bd9e308f.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-27T21:50:17Z", "content": "Wall Street is having its worst week since the financial crisis but it's not just major companies such as Apple and Boeing who are reporting gigantic losses and feeling the effects of the coronavirus epidemic. \r\nNick and Arin Oliver of Oregon, Illinois fulfil… [+4127 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "jillg366", "title": "AMC Entertainment Swings To Loss On One-Time Charges", "description": "Giant theater chain AMC Entertainment’s revenue reached $1.4 billion, up 2.4%, as it swung to a net loss of $13.5 million in the fourth quarter. The loss was due to one-time items of close to $100 million to write down “lease right of use” assets and other ch…", "url": "https://deadline.com/2020/02/amc-entertainment-posts-loss-on-charges-1202870030/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/11/amc-entertainment-2.jpg?w=1000", "publishedAt": "2020-02-27T21:40:29Z", "content": "Giant theater chain AMC Entertainment’s revenue reached $1.4 billion, up 2.4%, as it swung to a net loss of $13.5 million in the fourth quarter.\r\nThe loss was due to one-time items of close to $100 million to  write down “lease right of use” assets and other … [+2230 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Eric Abent", "title": "Microsoft is the latest company to drop from GDC amid coronavirus outbreak", "description": "The hits just keep on coming for GDC 2020. Earlier today, Unity Technologies announced that it would be skipping the show, which is scheduled to happen from March 16th to the 20th. Just a short time after Unity made its announcement, Microsoft has confirmed t…", "url": "https://www.slashgear.com/microsoft-is-the-latest-company-to-drop-from-gdc-amid-coronavirus-outbreak-27611495/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/02/Microsoft-GDC-2020.jpg", "publishedAt": "2020-02-27T21:25:33Z", "content": "The hits just keep on coming for GDC 2020. Earlier today, Unity Technologies announced that it would be skipping the show, which is scheduled to happen from March 16th to the 20th. Just a short time after Unity made its announcement, Microsoft has confirmed t… [+1687 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Trending Ticker: VIR Surges as Coronavirus fears persist", "description": "As the markets continue to fall, the biotech field is seeing a boost as companies race to develop vaccines and a cure. Vir Biotechnology Inc. shares surged over 60%, while Gilead Sciences stocks saw a bump of 4%. Yahoo Finance's Alexis Christoforous and Brian…", "url": "https://finance.yahoo.com/video/trending-ticker-vir-surges-coronavirus-212920240.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/3807wStcKuQdUJArviSmhw--~B/aD0yNTQ2O3c9NDUzMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/27/5e5834b1cbde736af98d033f/5e5834b1cbde736af98d0340_o_U_v2.jpg", "publishedAt": "2020-02-27T21:29:20Z", "content": "As the markets continue to fall, the biotech field is seeing a boost as companies race to develop vaccines and a cure. Vir Biotechnology Inc. shares surged over 60%, while Gilead Sciences stocks saw a bump of 4%. Yahoo Finance's Alexis Christoforous and Brian… [+39 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Market Watcher: Over six months we will see the markets higher", "description": "Fairlead Strategies Founder and Managing Partner Katie Stockton, and Oxbow Advisors Managing Partner Ted Oakley, break down the latest market action amid the coronavirus uncertainty with Yahoo Finance's Dan Roberts, Kristin Myers, and BigEyedWish Founder, Ian…", "url": "https://finance.yahoo.com/video/market-watcher-over-six-months-215823769.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/K_oGlEV3DSa1BwEMRYkS0w--~B/aD0zMjQ3O3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/28/5e583b8169e6c51d61e0f29d/5e591f65da8e834b4bf4a24f_o_U_v3.jpg", "publishedAt": "2020-02-27T21:58:23Z", "content": "Fairlead Strategies Founder and Managing Partner Katie Stockton, and Oxbow Advisors Managing Partner Ted Oakley, break down the latest market action amid the coronavirus uncertainty with Yahoo Finance's Dan Roberts, Kristin Myers, and BigEyedWish Founder, Ian… [+11 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Shawn Knight", "title": "Facebook cancels F8 developer conference over coronavirus scare", "description": "The social networking giant on Thursday said it was canceling the in-person component of its upcoming F8 developer conference. The mostly-annual conference for devs and entrepreneurs was originally scheduled for May 5-6, 2020, at the McEnery Convention Center…", "url": "https://www.techspot.com/news/84194-facebook-cancels-f8-developer-conference-over-coronavirus-scare.html", "urlToImage": "https://static.techspot.com/images2/news/ts3_thumbs/2020/02/2020-02-27-ts3_thumbs-436.jpg", "publishedAt": "2020-02-27T21:45:00Z", "content": "What just happened? Facebook has canceled its second appearance at a developer-focused conference in as many weeks due to concerns over COVID-19, more commonly known as the coronavirus. \r\nThe social networking giant on Thursday said it was canceling the in-pe… [+1497 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "christina capatides", "title": "The No. 1 way to prevent coronavirus isn't wearing a face mask", "description": "Coronavirus masks are expensive, they only last a few hours – and they may not even help.", "url": "https://www.cbsnews.com/news/coronavirus-prevention-face-mask-not-helpful-wash-hands/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/02/27/f0f844dd-54e3-4644-92ee-987d18154cdb/thumbnail/1200x630g2/6559cfd89d04ac2297c1d039f791744a/gettyimages-1203705302.jpg", "publishedAt": "2020-02-27T21:47:27Z", "content": "As fears over the coronavirus outbreak spread, thousands of Americans are clamoring to buy face masks in an effort to protect themselves, sending prices soaring and leading manufacturers like 3M to ramp up production. However, experts say stocking up on face … [+6138 chars]"}, {"source": {"id": null, "name": "Cyclingtips.com"}, "author": "wade wallace", "title": "Breaking: UAE Tour reportedly cancelled amid coronavirus concerns", "description": "Supported by United Arab Emirates (CT) – Due to concerns over coronavirus, the UAE Tour is reported to have been cancelled. As of Thursday night, authorities have asked teams, staff and media at the race to remain in their hotels.The race has apparently been …", "url": "https://cyclingtips.com/2020/02/uae-tour-cancelled-amid-coronavirus-concerns/", "urlToImage": "https://cdn-cyclingtips.pressidium.com/wp-content/uploads/2020/02/CORVOS_00032097-055.jpg", "publishedAt": "2020-02-27T21:26:04Z", "content": "United Arab Emirates (CT) – Due to concerns over coronavirus, the UAE Tour is reported to have been cancelled.\r\nAs of Thursday night, authorities have asked teams, staff and media at the race to remain in their hotels. The race has apparently been cancelled o… [+2227 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Alex Wigglesworth, Taryn Luna", "title": "No coronavirus emergency in California, but state will expand testing, Newsom says", "description": "In the state, 33 people have been diagnosed with COVID-19, and of those, 24 either were evacuated from the Diamond Princess cruise ship or returned on repatriation flights from China.", "url": "https://www.latimes.com/california/story/2020-02-27/no-coronavirus-emergency-in-california-but-state-will-expand-testing-newsom-says", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/ae4b5a4/2147483647/strip/true/crop/8256x4334+0+585/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2F0b%2Ff8dab6bb4713996e6535d621c52b%2Fnewsom-coronavirus-72099.jpg", "publishedAt": "2020-02-27T21:14:13Z", "content": "California is working with federal officials to expand the testing of possible coronavirus patients, Gov. Gavin Newsom announced Thursday.\r\nWe are currently in deep partnership with the CDC on one overriding protocol that drives our principal focus right now,… [+6291 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Cycling: UAE Tour canceled over coronavirus, say teams", "description": "The UAE Tour featuring some of the world's leading riders has been canceled with two stages remaining due to the coronavirus outbreak, according to several teams on Thursday.", "url": "https://www.reuters.com/article/us-china-health-cycling-idUSKCN20L333", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T21:16:56Z", "content": "BERLIN (Reuters) - The UAE Tour featuring some of the world’s leading riders has been canceled with two stages remaining due to the coronavirus outbreak, according to several teams on Thursday. \r\n“We have taken note of the cancellation of the UAE Tour due to … [+503 chars]"}, {"source": {"id": null, "name": "Dailysignal.com"}, "author": "James Carafano", "title": "Coronavirus Spreads to Europe and Middle East. What That Means for This Global Health Crisis.", "description": "Now that the coronavirus has broken out of China and established a foothold in Europe and the Middle East, many are on edge. This week, the stock... Read More The post Coronavirus Spreads to Europe and Middle East. What That Means for This Global Health Crisi…", "url": "https://www.dailysignal.com/2020/02/27/coronavirus-spreads-to-europe-and-middle-east-what-that-means-for-this-global-health-crisis/", "urlToImage": "https://www.dailysignal.com/wp-content/uploads/200227_coronavirus.jpg", "publishedAt": "2020-02-27T21:18:07Z", "content": "Now that the coronavirus has broken out of China and established a foothold in Europe and the Middle East, many are on edge. This week, the stock market, for one, jumped off a cliffsomething it is wont to do when faced with global uncertainty.\r\nWhile nothing … [+2716 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Judy Stone, Contributor, Judy Stone, Contributor https://www.forbes.com/sites/judystone/", "title": "Pence Panned As Corona Czar-Adds Physician Debbie Birx To Team", "description": "As an infectious disease physician, I (and many others) was shocked at last night’s announcement that Vice President Mike Pence was appointed to oversee the Coronavirus-19 (COVID19) response.", "url": "https://www.forbes.com/sites/judystone/2020/02/27/pence-panned-as-corona-czar-adds-physician-debbie-birx-to-team/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1203604925%2F960x0.jpg", "publishedAt": "2020-02-27T21:50:03Z", "content": "WASHINGTON DC, USA - FEBRUARY 26: U.S. President Donald Trump holds a press conference announcing ... [+] U.S. Vice President Mike Pence to lead the effort combating the spread of the coronavirus in Washington DC, United States on February 26, 2020. Pence nee… [+12651 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Jeff Spross", "title": "How to fight a coronavirus recession", "description": "At this point, the spreading COVID-19 coronavirus is not just a clear and present danger to American lives, but to our economy as well. The major quarantines in China have curtailed both the country's exports of goods and parts, as well as its imports from th…", "url": "https://theweek.com/articles/898603/how-fight-coronavirus-recession", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_9_4/public/virus_scale2.jpg?itok=GTY_5NJo", "publishedAt": "2020-02-27T21:17:54Z", "content": "At this point, the spreading COVID-19 coronavirus is not just a clear and present danger to American lives, but to our economy as well. The major quarantines in China have curtailed both the country's exports of goods and parts, as well as its imports from th… [+6278 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jeff Spross", "title": "How to fight a coronavirus recession", "description": "At this point, the spreading COVID-19 coronavirus is not just a clear and present danger to American lives, but to our economy as well. The major quarantines in China have curtailed both the country's exports of goods and parts, as well as its imports from th…", "url": "https://news.yahoo.com/fight-coronavirus-recession-211754077.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jUSDR6Z5zojROqTKUNhzIg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eKlxyiCPWDDqUfZ3sqDtQg--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/a5a41a9f78e8c469c920d3ec20337170", "publishedAt": "2020-02-27T21:17:54Z", "content": "At this point, the spreading COVID-19 coronavirus is not just a clear and present danger to American lives, but to our economy as well. The major quarantines in China have curtailed both the country's exports of goods and parts, as well as its imports from th… [+6490 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ali Gostanian", "title": "Small businesses feel effects of coronavirus outbreak", "description": "“What used to take a couple of weeks to get...might take six weeks now,” said one small business owner who sources her material from China.", "url": "https://news.yahoo.com/small-businesses-feel-effects-coronavirus-215017123.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/mFkK2qgT7PFsZOIWPq1FIw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xMDE0LjQ-/https://s.yimg.com/uu/api/res/1.2/zvCvFfgjgR62XQZwuWRS3g--~B/aD0xOTgxO3c9MjUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/nbc_news_122/7550d9b074ad798d4731fc1ae4d003bb", "publishedAt": "2020-02-27T21:50:17Z", "content": ""}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. CDC chief says all suspected coronavirus cases should be tested", "description": "The U.S. Centers for Disease Control and Prevention on Thursday revised its criteria for who should be tested for the coronavirus and is shipping more test kits out to states including California, the agency's director told lawmakers.", "url": "https://www.reuters.com/article/us-china-health-usa-kits-idUSKCN20L31B", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T21:33:29Z", "content": "WASHINGTON (Reuters) - The U.S. Centers for Disease Control and Prevention on Thursday revised its criteria for who should be tested for the coronavirus and is shipping more test kits out to states including California, the agency’s director told lawmakers. \r… [+402 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "TheBlaze Staff", "title": "Here's why Dems should be more interested in contracting coronavirus than voting for Pete Buttigieg", "description": "On Thursday's episode of \"Stu Does America,\" Stu explained why Democrats ought to be more interested in contracting coronavirus than voting for former South Bend, Indiana, Mayor Pete Buttigieg in the Democratic presidential primary election. Watch the video b…", "url": "https://www.theblaze.com/stu-does-america/petebuttigieg", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgzMzYxNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYwNDgzMTg2OX0.FJ9JUpP8AiLDQxDJD0i3WUQYq5xPCxYp5JhhGQrNYxo/img.jpg?width=1200&coordinates=0%2C24%2C0%2C24&height=600", "publishedAt": "2020-02-27T21:46:34Z", "content": "On Thursday's episode of \"Stu Does America,\" Stu explained why Democrats ought to be more interested in contracting coronavirus than voting for former South Bend, Indiana, Mayor Pete Buttigieg in the Democratic presidential primary election. Watch the video b… [+238 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The U.S. Stock Market is Down Big -- What Should Investors Do? - The Motley Fool", "description": "The U.S. Stock Market is Down Big -- What Should Investors Do? The Motley Fool We Just Witnessed The Fastest Stock Market Correction on Record Bloomberg Here’s how low stocks could go in a coronavirus ‘growth scare’ MarketWatch Stock Selloff: Dow Jones and S&…", "url": "https://www.youtube.com/watch?v=EDfbYEqCCHU", "urlToImage": "https://i.ytimg.com/vi/EDfbYEqCCHU/maxresdefault.jpg", "publishedAt": "2020-02-27T21:15:24Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. CDC chief says aggressively evaluating whether coronavirus survives on surfaces", "description": "Robert Redfield, director of the U.S. Centers for Disease Control and Prevention (CDC), told the U.S. Congress on Thursday that his agency is aggressively evaluating how long coronavirus can survive and be infectious on surfaces.", "url": "https://www.reuters.com/article/us-china-health-usa-cdc-idUSKCN20L37L", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T22:11:11Z", "content": "(Reuters) - Robert Redfield, director of the U.S. Centers for Disease Control and Prevention (CDC), told the U.S. Congress on Thursday that his agency is aggressively evaluating how long coronavirus can survive and be infectious on surfaces. \r\n“On copper and … [+485 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Jake Lahut)", "title": "6 ways the Trump administration has already botched responding to the coronavirus", "description": "From purging \"disloyal\" officials to cutting funding for the CDC, the Trump administration has fallen short preparing for the epidemic.", "url": "https://news.yahoo.com/6-ways-trump-administration-already-211228365.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_sh3pH.XKrjMWLHqos1rUA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/YIL9AnMctKbfFjF92i4HKw--~B/aD0yMDE2O3c9MjY4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/f8dba971bf6105084f2c0f27c99a5fd0", "publishedAt": "2020-02-27T21:12:28Z", "content": "U.S. President Trump holds news conference on the coronavirus outbreak at the White House in Washington\r\nReuters\r\n<ul><li>Basic preparedness for a pandemic in the United States has been hampered by the Trump administration's handling of key agencies, faulty t… [+5039 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": "KCRA staff", "title": "2 college students in Sacramento area exposed to coronavirus patient", "description": "Two Sacramento-area college students were exposed to a person who has tested positive for the novel coronavirus, according to school officials.", "url": "https://www.kcra.com/article/2-sacramento-area-college-students-exposed-coronavirus-patient/31138209", "urlToImage": "https://s.hdnux.com/photos/75/11/55/16030575/3/rawImage.jpg", "publishedAt": "2020-02-27T21:54:39Z", "content": "<ul><li>FILE PHOTO - Two Sacramento-area college students were exposed to a person who has tested positive for the novel coronavirus, according to school officials.\r\nFILE PHOTO - Two Sacramento-area college students were exposed to a person who has tested pos… [+1396 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Julie Steenhuysen, Andrew Hay and Brad Brooks", "title": "Mixed messages, test delays hamper U.S. coronavirus response", "description": "Barely more than a handful of public health departments across the country are able to test for the novel virus, which began in China and has spread to at least 44 countries. The federal government has less than 10% of the protective masks required to protect…", "url": "https://news.yahoo.com/mixed-messages-test-delays-hamper-220429298.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j4aOydnlGSvpOxiQyJn25A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NjQ-/https://s.yimg.com/uu/api/res/1.2/4w5xn8qJ7lhgs7Q7pRDQDg--~B/aD01NDA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/a70ad10f2718bf4d96084b0109ef1fdb", "publishedAt": "2020-02-27T22:04:29Z", "content": "By Julie Steenhuysen, Andrew Hay and Brad Brooks\r\n(Reuters) - Even as U.S. officials warn of an inevitable outbreak of coronavirus in the United States, and are alerting Americans to take precautions, some health agencies charged with protecting the public ap… [+8476 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Pete Schroeder", "title": "Financial firms discussing coronavirus contingency plans with regulators - official", "description": "U.S.-based banks and brokers are in discussions with federal regulators about allowing staff to work from home and other business continuity arrangements amid the spread of the coronavirus, the head of a top financial trade group said on Thursday. The industr…", "url": "https://finance.yahoo.com/news/financial-firms-discussing-coronavirus-contingency-214317160.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/YFTuEV2JdYLfMAgd1aBY6w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/P9YXYaI544OvCyCqbc.xng--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/02aea2d7c4fdcc5a99a07b13aa2c24b8", "publishedAt": "2020-02-27T21:43:17Z", "content": "By Pete Schroeder\r\nWASHINGTON (Reuters) - U.S.-based banks and brokers are in discussions with federal regulators about allowing staff to work from home and other business continuity arrangements amid the spread of the coronavirus, the head of a top financial… [+3141 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak... | UNICEF - UNICEF", "description": "Coronavirus outbreak... | UNICEF UNICEF With WHO warning of Covid-19’s “pandemic potential”, India and other world nations mustn’t be caught Economic Times Important Discovery in COVID-19 Coronavirus Vaccine Development SciTechDaily NCSU economist: Coronaviru…", "url": "https://www.youtube.com/watch?v=ujWFj_6FaMY", "urlToImage": "https://i.ytimg.com/vi/ujWFj_6FaMY/hqdefault.jpg", "publishedAt": "2020-02-27T22:00:37Z", "content": "As Coronavirus spreads, these are six things parents need to know.\r\n#COVID19\r\nSubscribe to UNICEF here: http://bit.ly/1ltTE3m\r\nThe official UNICEF YouTube channel is your primary destination for the latest news updates from the frontline, documentaries, celeb… [+511 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nikki McCann Ramírez, Opinion contributor", "title": "Coronavirus: How Fox News and other right-wing media endanger our health", "description": "Despite steady warnings from health organizations worldwide, right-wing media are clogging airwaves with conspiracy theories and inaccurate reporting.", "url": "https://news.yahoo.com/coronavirus-fox-news-other-wing-202100444.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5VIs4iz_7eY_X__Bb_FDtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDAuMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/.sNjp2k14xAK4lvndA3m0w--~B/aD0yNjQ3O3c9Mzc2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_opinion_532/208df56f2e9ee27371f2ec3fca9b29ce", "publishedAt": "2020-02-27T22:08:12Z", "content": "The Centers for Disease Control and Prevention announced on Tuesday that Americans should prepare for a significant disruption to everyday life as the spread of COVID-19 (known colloquially as the coronavirus) into the United States becomes not so much a ques… [+6297 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Week Staff", "title": "Stock market enters 'fastest' correction in history", "description": "Coronavirus fears sent U.S. markets into correction territory on Thursday, down more than 10 percent from record highs after days of losses, reports CNBC.The Dow Jones Industrial Average closed Thursday down almost 1,200 points, or over 4.4 percent, while the…", "url": "https://news.yahoo.com/stock-market-enters-fastest-correction-212700762.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7jXKmXoFxQndZc45mM9eGg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/OjzQ8opkXzY4fwPLkU.PgA--~B/aD01NjA7dz04NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_week_574/8ae6ca6b28796f550703b80d5ead5f3b", "publishedAt": "2020-02-27T21:27:00Z", "content": "Coronavirus fears sent U.S. markets into correction territory on Thursday, down more than 10 percent from record highs after days of losses, reports CNBC.\r\nThe Dow Jones Industrial Average closed Thursday down almost 1,200 points, or over 4.4 percent, while t… [+923 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Yasemin Saplakoglu", "title": "How will the coronavirus outbreak end? - Livescience.com", "description": "How will the coronavirus outbreak end? Livescience.com Coronavirus Live Updates: Cases Soar in Italy, Iran and South Korea as Alarm Grows The New York Times After CDC confirms the first US coronavirus case of 'unknown' origin, it sends out new testing guideli…", "url": "https://www.livescience.com/coronavirus-outbreak-end.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CxM2vg7QrmDehGastqpkz-1200-80.jpg", "publishedAt": "2020-02-27T22:05:00Z", "content": "Despite worldwide efforts to contain the new coronavirus\r\n, hotspots continue to emerge, and the number of cases is on the rise.\r\nIt's been only a couple of months since the virus, called SARS-CoV-2, made its first public appearance in a seafood-and-live-anim… [+12256 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Matt Novak", "title": "20 Countries Report First Cases Of Coronavirus This Week As Infections Skyrocket", "description": "Twenty countries have reported their first cases of the new coronavirus this week, bringing the total number of confirmed cases to over 82,000 in 50 countries since the outbreak began in December. At least 2,800 people have died worldwide. More »", "url": "https://www.gizmodo.com.au/2020/02/20-countries-report-first-cases-of-coronavirus-this-week-as-infections-skyrocket/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ostvpuze6hzwx3zlgnkt.jpg", "publishedAt": "2020-02-27T21:37:00Z", "content": "Twenty countries have reported their first cases of the new coronavirus this week, bringing the total number of confirmed cases to over 82,000 in 50 countries since the outbreak began in December. At least 2,800 people have died worldwide.\r\nThe number of COVI… [+11020 chars]"}, {"source": {"id": null, "name": "Wgno.com"}, "author": null, "title": "How to prepare for coronavirus in the United States: 10 questions answered - WGHP FOX 8 Greensboro", "description": "How to prepare for coronavirus in the United States: 10 questions answered WGHP FOX 8 Greensboro Coronavirus: Gov. Newsom says Calif. is prepared for first COVID-19 case with unknown origin KABC-TV Busting COVID-19 coronavirus myths: Facts from the Centers fo…", "url": "https://wgno.com/news/how-to-prepare-for-coronavirus-in-the-united-states-10-questions-answered/", "urlToImage": "https://myfox8.com/wp-content/uploads/sites/17/2020/02/GettyImages-1205213495.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-02-27T21:22:00Z", "content": "Officials at the US Centers for Disease Control and Prevention have warned that the novel coronavirus will spread in US communities, and a case announced on Wednesday might be the countrys first instance of it.\r\nOur aggressive containment strategy here in the… [+11255 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "What is the coronavirus and what are the symptoms?", "description": "Ali Velshi takes a closer look at symptoms of the coronavirus and how it compares to other major respiratory diseases.", "url": "https://www.msnbc.com/ali-velshi/watch/what-is-the-coronavirus-and-what-are-the-symptoms-79558213577", "urlToImage": "https://media13.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_velshi_corona_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-27T21:19:32Z", "content": null}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Coronavirus: Symptoms, prevention, and how to prepare for a COVID-19 outbreak in the US - WLS-TV", "description": "How can Americans prepare for an outbreak? Is it time to buy face masks? Here's everything you need to know about the new coronavirus.", "url": "https://abc7chicago.com/5971803", "urlToImage": "https://cdn.abcotvs.com/dip/images/5971867_022720-cc-ap-coronavirus-img.jpg?w=1600", "publishedAt": "2020-02-27T21:22:37Z", "content": "The new coronavirus that originated in China has spread globally, killing thousands and infecting tens of thousands more.The pandemic has affected the economy, travel and politics and sparked fear among Americans as health officials warn the public to prepare… [+4146 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Lauryn Overhultz", "title": "REPORT: SiriusXM Quarantines Top Executive, Group Of Staffers After Coronavirus Scare", "description": "SiriusXM reportedly has requested a group of staffers and a top executive quarantine themselves to help prevent the spread of the coronavirus.", "url": "https://dailycaller.com/2020/02/27/siriusxm-staff-memo-coronavirus-executive/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/SiriusXM-e1582833828117.jpg", "publishedAt": "2020-02-27T21:46:59Z", "content": "SiriusXM reportedly has requested a group of staffers and a top executive quarantine themselves to help prevent the spread of the coronavirus.\r\nThe quarantine comes after it was realized that attendees of a meeting held Wednesday by Senior Vice President of C… [+1230 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Ebola czar calls White House's move an 'outrage'", "description": "The White House is requiring health officials to get approval before making public statements about the coronavirus, sources tell CNN. Ron Klain, who served as the Ebola response coordinator under President Obama, discusses the decision.", "url": "https://www.cnn.com/videos/politics/2020/02/27/coronavirus-ebola-czar-ron-klain-lead-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200226191357-03-trump-coronavirus-presser-0226-super-tease.jpg", "publishedAt": "2020-02-27T21:34:56Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Carl Surran", "title": "Stocks end near day's lows, plunging firmly into correction territory - Seeking Alpha", "description": "<ul><li>The stock market extended this week's rout in a volatile trading, as investors accelerated their exit from risk exposure due to rising uncertainty about the effects of the coronavirus on business and the economy.</li><li>The Dow, S&P 500 and Nasdaq al…", "url": "https://seekingalpha.com/news/3546812-stocks-end-near-days-lows-plunging-firmly-correction-territory", "urlToImage": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "publishedAt": "2020-02-27T21:45:00Z", "content": "The stock market extended this week's rout in a volatile trading, as investors accelerated their exit from risk exposure due to rising uncertainty about the effects of the coronavirus on business and the economy.\r\nThe Dow, S&amp;P 500 and Nasdaq all fell roug… [+1018 chars]"}, {"source": {"id": null, "name": "Japantoday.com"}, "author": null, "title": "Pence tries to project calm as virus response coordinator", "description": "U.S. Vice President Mike Pence moved Thursday to project calm in the role of chief coordinator of the government's response to the new coronavirus, as the Trump administration rushed to contain mounting public concerns and steep stock market declines. Pence c…", "url": "https://japantoday.com/category/world/pence-tries-to-project-calm-as-virus-response-coordinator", "urlToImage": null, "publishedAt": "2020-02-27T22:06:28Z", "content": "U.S. Vice President Mike Pence moved Thursday to project calm in the role of chief coordinator of the government's response to the new coronavirus, as the Trump administration rushed to contain mounting public concerns and steep stock market declines.\r\nPence … [+3839 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Peter Kenyon", "title": "Coronavirus Outbreak In Iran Has Tehran Residents Doubting Government Response", "description": "On the street in Tehran, people are wondering if their country has the capacity to deal with the coronavirus outbreak — and whether news of it was suppressed.", "url": "https://www.npr.org/2020/02/27/810095446/coronavirus-outbreak-in-iran-has-tehran-residents-doubting-government-response", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-02-27T21:19:46Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus in US: 'We're not over-reacting nor under-reacting'", "description": "What has been the reaction from authorities to the person who contracted the virus in California?", "url": "https://www.bbc.co.uk/news/av/world-us-canada-51652781/coronavirus-in-us-we-re-not-over-reacting-nor-under-reacting", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7FDF/production/_111053723_p0850mhp.jpg", "publishedAt": "2020-02-27T21:11:39Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "IFAB Q&A: Football laws changing?", "description": "Football lawmakers – the International Football Association Board (IFAB) – will hold their annual general meeting in Belfast on Saturday. Sky Sports News' chief reporter Bryan Swanson reviews what is on the agenda.", "url": "https://www.skysports.com/football/news/11095/11944838/ifab-qa-what-is-on-the-agenda-at-the-football-lawmakers-upcoming-agm", "urlToImage": "https://e0.365dm.com/20/02/1600x900/skysports-var-monitor-referee_4910624.jpg", "publishedAt": "2020-02-27T22:00:00Z", "content": "Football lawmakers – the International Football Association Board (IFAB) – will hold their annual general meeting in Belfast on Saturday. Sky Sports News' chief reporter Bryan Swanson reviews what is on the agenda.\r\nIs this about Arsene Wenger's offside plans… [+3690 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": "Jacqueline  Luqman, Sean Blackmon. Sputnik International", "title": "Coronavirus Finally Hits as Dem Elites Conspire to Control Nomination", "description": "US health system unprepared for Coronavirus; Will pipelines cleave Appalachian Trail?; Attacks on Sanders reveal US fear of Cuba, socialism", "url": "https://sputniknews.com/radio_by_any_means/202002271078423114-coronavirus-finally-hits-as-dem-elites-conspire-to-control-nomination/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107839/90/1078399048.jpg", "publishedAt": "2020-02-27T22:07:31Z", "content": "US health system unprepared for Coronavirus; Will pipelines cleave Appalachian Trail?; Attacks on Sanders reveal US fear of Cuba, socialism\r\nOn this episode of By Any Means Necessary, hosts Sean Blackmon and Jacquie Luqman are joined by Dr. Margaret Flowers, … [+3210 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "Jeva Lange", "title": "Disney+ announces Proud Family reboot", "description": "The Lizzie McGuire reboot might be dead in the water, but that isn't stopping Disney+ from going forward with its other nostalgic revivals.\nOn Thursday, the streamer announced it will be bringing back the animated sitcom The Proud Family with its original voi…", "url": "https://theweek.com/speedreads/898738/disney-announces-proud-family-reboot", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/the_proud_family_concept_art_20b10d41.jpeg?itok=j5K-QVkz", "publishedAt": "2020-02-27T21:33:01Z", "content": "More than 8,000 people are being monitored for the coronavirus in California, and 33 people have tested positive, the state's governor says.\r\nIn a news conference on Thursday, Gov. Gavin Newsom (D) provided these new numbers, saying that at least 8,400 people… [+944 chars]"}, {"source": {"id": null, "name": "Theweek.com"}, "author": "The Week Staff", "title": "Stock market enters 'fastest' correction in history", "description": "Coronavirus fears sent U.S. markets into correction territory on Thursday, down more than 10 percent from record highs after days of losses, reports CNBC.\nThe Dow Jones Industrial Average closed Thursday down almost 1,200 points, or over 4.4 percent, while th…", "url": "https://theweek.com/speedreads/898745/stock-market-enters-fastest-correction-history", "urlToImage": "https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1161832016.jpg?itok=i6WM-ABe", "publishedAt": "2020-02-27T21:27:00Z", "content": "More than 8,000 people are being monitored for the coronavirus in California, and 33 people have tested positive, the state's governor says.\r\nIn a news conference on Thursday, Gov. Gavin Newsom (D) provided these new numbers, saying that at least 8,400 people… [+944 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "insider@insider.com (Jessica Snouwaert)", "title": "Hong Kong's government is giving $1,284 to every permanent resident over 18", "description": "The relief measures, which cost $15.4 billion, have resulted in Hong Kong's first budget deficit in 15 years — $4.85 billion for the 2019-2020 fiscal yea...", "url": "https://news.yahoo.com/hong-kongs-government-giving-1-214700820.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/RQHptuN5yqNKL2_z8_0XUg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/U6zurZLeo7OwgRUZEpqteg--~B/aD0zNjU0O3c9NDg3MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/9ae27289207da310555c67172c97aabc", "publishedAt": "2020-02-27T21:47:00Z", "content": "A woman in the Kowloon district of Hong Kong in September 2018.\r\nGetty Images\r\n<ul><li>Hong Kong announced it will give permanent residents 18 years and older a one-time payment of $1,284 as a result of coronavirus's economic damage.\r\n</li><li>The payments to… [+1963 chars]"}, {"source": {"id": null, "name": "Politicalwire.com"}, "author": "Taegan Goddard", "title": "Whistleblower Says Officials Mishandled Coronavirus", "description": "\"Federal health employees interacted with Americans quarantined for possible exposure to the coronavirus without proper medical training or protective gear, then scattered into the general population, according to a government whistle-blower,\" the New York Ti…", "url": "https://politicalwire.com/2020/02/27/whistleblower-says-officials-mishandled-coronavirus-evacuees/", "urlToImage": "https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg", "publishedAt": "2020-02-27T21:58:26Z", "content": "\"There are a lot of blogs and news sites claiming to understand politics, but only a few actually do. Political Wire is one of them.\"\r\n-- Chuck Todd, host of \"Meet the Press\"\r\n\"Concise. Relevant. To the point. Political Wire is the first site I check when Im … [+545 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jennifer Jacobs, Jordan Fabian and Ryan Beene", "title": "Pence Says He’s in Charge of U.S. Virus Response, Not HHS’s Azar", "description": "(Bloomberg) -- Vice President Mike Pence said he is now leading the government’s coronavirus task force instead of Health and Human Services Secretary Alex Azar.“I’m leading the task force,” Pence said Thursday at a meeting on the virus at HHS headquarters. “…", "url": "https://news.yahoo.com/pence-charge-u-virus-response-203554704.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/H7Cw.yQ.hUMjX3wIsnfGZA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/n4keVAg2RGRwlHdEgd8EPw--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/d79c83a535c6db33d40321b82b4af910", "publishedAt": "2020-02-27T21:38:57Z", "content": "(Bloomberg) -- Vice President Mike Pence said he is now leading the governments coronavirus task force instead of Health and Human Services Secretary Alex Azar.\r\nIm leading the task force, Pence said Thursday at a meeting on the virus at HHS headquarters. Wel… [+4354 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Michael D. Shear, Maggie Haberman", "title": "Pence will control all coronavirus messaging from health officials", "description": "The White House moved on Thursday to tighten control of coronavirus messaging by government health officials and scientists, directing them to clear all statements and public appearance with the office of Vice President Mike Pence, according to several offici…", "url": "https://www.bostonglobe.com/news/nation/2020/02/27/pence-will-control-all-coronavirus-messaging-from-health-officials/9gbJLoHbLr7TachNaGswuL/story.html", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/B2XDXdVmJmpY7n1upHpmxbWFaJU=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/QTFONOSZUYI6VD3V3UEVD54RKI.jpg", "publishedAt": "2020-02-27T21:53:10Z", "content": "Pence said on Thursday that he had selected Dr. Deborah Birx, the director of the US effort to combat HIV and AIDS, to serve as the Coronavirus Response Coordinator for the White House, enlisting an experienced scientist and physician to manage the response t… [+3979 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "ZEKE MILLER, DARLENE SUPERVILLE", "title": "Pence tries to project calm as coronavirus response coordinator", "description": "Vice President Mike Pence moved Thursday to project calm in the role of chief coordinator of the government's response to the new coronovirus, as the Trump administration rushed to contain mounting public concerns and steep stock market declines.", "url": "https://www.bostonglobe.com/2020/02/27/nation/pence-tries-project-calm-virus-response-coordinator/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/taYg5X5V-Djytk5H6eu_5MXuItc=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/XJTMVSPN5ZHCPNCRPMXJHXN6NI.jpg", "publishedAt": "2020-02-27T21:52:10Z", "content": "WASHINGTON (AP) Vice President Mike Pence moved Thursday to project calm in the role of chief coordinator of the government's response to the new coronovirus, as the Trump administration rushed to contain mounting public concerns and steep stock market declin… [+3735 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Rob Stein", "title": "CDC Resolves Coronavirus Test Problem, Meaning Wider And Quicker Testing", "description": "The U.S. government says it has resolved a problem with its test for the new coronavirus, which should resolve a testing bottleneck and provide a powerful tool for slowing its spread in the U.S.", "url": "https://www.npr.org/2020/02/27/810095393/cdc-resolves-coronavirus-test-problem-meaning-wider-and-quicker-testing", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-02-27T21:19:46Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Baidu’s Outlook Lags Estimates Due to Virus Outbreak", "description": "(Bloomberg) -- Baidu Inc. predicted revenue may slide as much as 13% this quarter, joining its fellow Chinese technology giants in warning about the uncertain impact of the deadly coronavirus.China’s internet search leader forecast a 5% to 13% plunge in sales…", "url": "https://finance.yahoo.com/news/baidu-outlook-lags-estimates-due-214552649.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T21:45:52Z", "content": "(Bloomberg) -- Baidu Inc. predicted revenue may slide as much as 13% this quarter, joining its fellow Chinese technology giants in warning about the uncertain impact of the deadly coronavirus.\r\nChinas internet search leader forecast a 5% to 13% plunge in sale… [+2894 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jake Harper", "title": "Reexamining Mike Pence's Record On Health Care As Indiana Governor", "description": "Vice President Pence is now in charge of U.S. coronavirus response, prompting a look back at his health record as Indiana governor facing an HIV outbreak, a drug epidemic and Medicaid expansion.", "url": "https://www.npr.org/2020/02/27/810095474/reexamining-mike-pences-record-on-health-care-as-indiana-governor", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-02-27T21:19:46Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Seema Mody", "title": "Marriott, Booking Holdings see drop in demand from coronavirus", "description": "Marriott International and Booking Holdings are bracing for a pullback as consumers think twice about that spring break getaway.", "url": "https://www.cnbc.com/2020/02/27/marriott-booking-holdings-see-drop-in-demand-from-coronavirus.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105602997-1543611673812gettyimages-1066848494.jpeg?v=1582748680", "publishedAt": "2020-02-27T21:28:15Z", "content": "Marriott International and Booking Holdings are bracing for a pullback as consumers think twice about that spring break getaway.\r\nMarriott Chief Financial Officer Leeny Oberg told CNBC on Wednesday that it is seeing a notable drop in demand for hotel rooms in… [+2185 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "We Just Witnessed The Fastest Stock Market Correction on Record - Bloomberg", "description": "We Just Witnessed The Fastest Stock Market Correction on Record Bloomberg Stock Selloff: Dow Jones and S&P 500 Reach Correction Levels on Coronavirus Fears Bloomberg Markets and Finance S&P 500 stages quickest correction since the Great Depression Financial T…", "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=2d3ae5a0-59c7-11ea-b814-df5b41f6db2e&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wMi0yNy93ZS1qdXN0LXdpdG5lc3NlZC10aGUtZmFzdGVzdC1zdG9jay1tYXJrZXQtY29ycmVjdGlvbi1vbi1yZWNvcmQ=", "urlToImage": null, "publishedAt": "2020-02-27T21:53:00Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Elizabeth Blackstock", "title": "The Vietnam Grand Prix Might Happen, But Italian F1 Teams Could Suffer Due To Coronavirus", "description": "Formula One’s Chinese Grand Prix has already been postponed as the coronavirus (COVID-19) epidemic continues to impact the health of people around the world. And while the FIA is still confident that no other events will be affected, the Italian-based F1 team…", "url": "https://www.gizmodo.com.au/2020/02/the-vietnam-grand-prix-might-happen-but-italian-f1-teams-could-suffer-due-to-coronavirus/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zqoqmpofkva1lgesfw1w.jpg", "publishedAt": "2020-02-27T21:25:00Z", "content": "Formula Ones Chinese Grand Prix has already been postponed as the coronavirus (COVID-19) epidemic continues to impact the health of people around the world. And while the FIA is still confident that no other events will be affected, the Italian-based F1 teams… [+2284 chars]"}]