[{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Tim Cook says Apple is reopening factories as China gets ‘coronavirus under control’", "description": "In an interview with Fox Business, Apple CEO Tim Cook said that the company is reopening factories in China and that he feels that China “is getting the coronavirus under control.”", "url": "https://www.theverge.com/2020/2/27/21156458/apple-ceo-tim-cook-reopening-factories-china-coronavirus-outbreak", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RUKTbWHieQx-e8bGi2-Ugt46QwY=/0x0:1020x534/fit-in/1200x630/cdn.vox-cdn.com/assets/2737631/d11cook_0020.jpg", "publishedAt": "2020-02-27T20:53:38Z", "content": "He made the comments in a new interview\r\nApple CEO Tim Cook said today that factories in China that manufacture the companys products are reopening as China is getting the coronavirus under control. The comments came from a preview of an upcoming interview wi… [+2048 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "European Parliament considering virtual meetings, plenary due to virus", "description": "The European Parliament is considering whether to hold its meetings and plenary sessions by teleconference instead of in person due to growing concerns about the fast-spreading coronavirus that originated in China, a spokesman said.", "url": "https://www.reuters.com/article/us-china-health-eu-idUSKCN20L30M", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496147659&w=1200&r=LYNXNPEG1Q1WG", "publishedAt": "2020-02-27T20:45:17Z", "content": "(Reuters) - The European Parliament is considering whether to hold its meetings and plenary sessions by teleconference instead of in person due to growing concerns about the fast-spreading coronavirus that originated in China, a spokesman said. \r\n“It’s being … [+368 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "ZEKE MILLER and DARLENE SUPERVILLE", "title": "Pence tries to project calm as virus response coordinator", "description": "Vice President Mike Pence sought to project calm Thursday in his new role as chief coordinator of the government's response to the coronavirus as the Trump administration rushed to contain mounting public concerns and some of the worst stock market declines i…", "url": "https://news.yahoo.com/pence-tries-project-calm-virus-204719522.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/d0N9.T36K1jHZpb_JID01g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/ebnI6dWRTZpyK7VSypZKvQ--~B/aD0zNDgxO3c9NTIyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/9af205dd749d2dd07e5a1cffbdecee76", "publishedAt": "2020-02-27T20:47:19Z", "content": "WASHINGTON (AP) Vice President Mike Pence sought to project calm Thursday in his new role as chief coordinator of the government's response to the coronavirus as the Trump administration rushed to contain mounting public concerns and some of the worst stock m… [+5412 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Tim Cook says he believes China is getting coronavirus ‘under control’", "description": "While Apple has acknowledged the impact of coronavirus on its supply chain and product demand in China, CEO Tim Cook seems to think the situation is improving in China. In an interview with Fox Business this afternoon, Cook explained his thinking as well as A…", "url": "https://9to5mac.com/2020/02/27/tim-cook-china-coronavirus/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/04/tim-cook-thumbs-up-smile.jpeg?resize=1024,512", "publishedAt": "2020-02-27T20:12:19Z", "content": "While Apple has acknowledged the impact of coronavirus on its supply chain and product demand in China, CEO Tim Cook seems to think the situation is improving in China. In an interview with Fox Business this afternoon, Cook explained his thinking as well as A… [+1648 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Akin Oyedele", "title": "PRESENTING: 20 top Wall Street experts share the most important charts in markets — and point to where you should be investing now", "description": "We asked 20 top experts to share the must-know trends that are shaping financial markets and driving investment returns. Chief investment officers, Nobel Prize winners, and many others explained what these trends mean and how to profit from them. Click here t…", "url": "https://www.businessinsider.com/markets-finance-charts-investing-advice-from-top-investors-strategists-economists-2020-2", "urlToImage": "https://i.insider.com/5e557bfbfee23d482b10dbf2?width=1200&format=jpeg", "publishedAt": "2020-02-27T20:28:58Z", "content": "Global markets have rediscovered volatility due to the novel coronavirus outbreak. \r\nIn chaotic periods like this — and even when all is calm — it is important to take a step back and consider what really matters in the grand scheme of things.   \r\nWho better … [+799 chars]"}, {"source": {"id": null, "name": "Newyorker.com"}, "author": "Krish Raghav", "title": "Quarantine Cooking: Finding Relief from Coronavirus Anxiety in the Kitchen", "description": "Krish Raghav illustrates panels that describe how, under the coronavirus quarantine, people in China are substituting the social act of sharing a meal by sharing online recipes, blog posts, and videos about cooking.", "url": "https://www.newyorker.com/culture/cultural-comment/quarantine-cooking-finding-relief-from-coronavirus-anxiety-in-the-kitchen", "urlToImage": "https://media.newyorker.com/photos/5e570d058d05040009341683/16:9/w_1280,c_limit/Raghav-Promo.jpg", "publishedAt": "2020-02-27T21:10:41Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Brian Cooley", "title": "New tech coming to rid your car of viruses - Roadshow", "description": "The global coronavirus outbreak is a reminder that cars can be germ-filled places. Here are some precautions you can take now.", "url": "https://www.cnet.com/roadshow/news/coronavirus-covid-19-virus-car-tech-germs-hepa-ultraviolet/", "urlToImage": "https://cnet2.cbsistatic.com/img/Rx1lq32qNDHp-jGKlFvovULLjp8=/756x567/2020/02/26/39017cc1-f3e1-4add-abdd-53a3d0df2486/cv-in-car.jpg", "publishedAt": "2020-02-27T20:50:00Z", "content": "Land Rover Wikipedia\r\nIt didn't take the latest coronavirus outbreak to make people aware of germs lurking in cars: Recent headlines have trumpeted, perhaps hyperbolically, that Uber and Lyft cars are dirtier than a toilet seat. And there's nothing special ab… [+4365 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Szymkowski", "title": "Tesla China has more to worry about than coronavirus - Roadshow", "description": "Sales data shows buyers hadn't flocked to the brand even before COVID-19 put the brakes on local car buying.", "url": "https://www.cnet.com/roadshow/news/tesla-china-coronavirus-electric-car-sales/", "urlToImage": "https://cnet4.cbsistatic.com/img/sXPC3CqFkh_QDf5DW4LTH-F79U0=/2019/12/30/c7f79e9c-77ed-4cfb-b276-e4dc845ce605/ogi-tesla-china.jpg", "publishedAt": "2020-02-27T20:48:56Z", "content": "It's certainly not the big start Tesla likely wanted in China.\r\nTwitter\r\nTesla's downright impressive gains in recent weeks hinged on pretty much one thing: the start of local Tesla production in China to boost sales.\r\nHowever, it appears local buyers weren't… [+1802 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Retail Stocks Whipsawed Today", "description": "The retail investing sector remained volatile as investors absorbed more negative coronavirus news.", "url": "https://www.fool.com/investing/2020/02/27/why-retail-stocks-whipsawed-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560283/intro-slide-shopping-mall-scene-source-getty.jpg", "publishedAt": "2020-02-27T20:31:56Z", "content": "What happened\r\nShares of retail stocks were tumbling again Thursday morning as investors sold off companies that were particularly at risk due to the coronavirus outbreak, which government and financial officials are saying could seriously impact the United S… [+4244 chars]"}, {"source": {"id": null, "name": "Theintercept.com"}, "author": "Ryan Grim", "title": "Surveillance Critics in Congress Warned that Coronavirus Spending Bill Could be Used to Cement Spying Powers", "description": "The congressional effort to rein in the government’s surveillance powers before a looming deadline on March 15 could run up against a new opponent: the coronavirus. The post Surveillance Critics in Congress Warned that Coronavirus Spending Bill Could be Used …", "url": "https://theintercept.com/2020/02/27/coronavirus-spending-bill-surveillance-patriot-act/", "urlToImage": "https://theintercept.imgix.net/wp-uploads/sites/1/2020/02/Patriotic-Pandemic-illustration-theintercept-1582830312.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800", "publishedAt": "2020-02-27T20:33:36Z", "content": "The Trump administrations request for $2.5 billion to mitigate the coronavirus pandemic is likely to become an unstoppable legislative vehicle as must-pass legislation that congressional leaders of both parties could use to ram through a reauthorization of th… [+5419 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus quarantines could be \"new normal\" in U.S., medical expert says - CBS News", "description": "Coronavirus quarantines could be \"new normal\" in U.S., medical expert says CBS News The Hill's 12:30 Report: Pence taps health official to aid coronavirus response | TheHill The Hill Sanjay Gupta fact-checks Trump's coronavirus claims CNN 'Daily Show' Host Tr…", "url": "https://www.youtube.com/watch?v=oEQHmmJJImg", "urlToImage": "https://i.ytimg.com/vi/oEQHmmJJImg/maxresdefault.jpg", "publishedAt": "2020-02-27T20:12:48Z", "content": "\"We're going to see a significant increase in the number of cases\" of coronavirus in the United States, says CBS News medical contributor Dr. David Agus. He joined CBSN's Vladimir Duthiers with more on the impact of the outbreak."}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Evan Niu, CFA)", "title": "Why Sabre Stock Dropped Today", "description": "The travel tech company reported fourth-quarter results and warned of a \"material impact\" in 2020 from the coronavirus outbreak.", "url": "https://www.fool.com/investing/2020/02/27/why-sabre-stock-dropped-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560382/gettyimages-1204387350.jpg", "publishedAt": "2020-02-27T20:54:06Z", "content": "What happened\r\nShares of Sabre (NASDAQ:SABR) have dropped today, down by 9% as of 3:10 p.m. EST, after the company reported fourth-quarter earnings. The travel tech specialist also announced strategic initiatives that it hopes will expand its addressable mark… [+1798 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch live: VP Pence leads coronavirus task force meeting - CBS News", "description": "Watch live: VP Pence leads coronavirus task force meeting CBS News Coronavirus case with potential unknown origin in California CBS News As coronavirus spreads, how to protect yourself from the outbreak CBS News Trump downplays coronavirus threat in U.S. whil…", "url": "https://www.youtube.com/watch?v=yswBoMPLaPw", "urlToImage": null, "publishedAt": "2020-02-27T20:32:34Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Shows Scale of Task to Fix China's Flawed Healthcare", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-02-27/coronavirus-shows-scale-of-task-to-fix-china-s-flawed-healthcare", "urlToImage": null, "publishedAt": "2020-02-27T21:00:00Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Outbreak at 'decisive point' as WHO urges action - BBC News", "description": "Coronavirus: Outbreak at 'decisive point' as WHO urges action BBC News Live updates: Fears grow of a coronavirus pandemic as markets stumble again; Japan shuts schools The Washington Post South Korea Reports Faster Coronavirus Spread Than in China The Wall St…", "url": "https://www.bbc.com/news/world-51665631", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/AF38/production/_111065844_mediaitem111065843.jpg", "publishedAt": "2020-02-27T20:48:45Z", "content": "Image copyrightEPAImage caption\r\n Italy and Iran have become hotbeds of coronavirus infections\r\nThe coronavirus outbreak has reached a \"decisive point\" and has \"pandemic potential\", World Health Organization head Dr Tedros Ghebreyesus says.\r\nHis comments come… [+7492 chars]"}, {"source": {"id": null, "name": "Capradio.org"}, "author": "Sammy Caiola", "title": "California Pushes For More Coronavirus Testing After First Case Of Community Transmission - Capital Public Radio News", "description": "California Pushes For More Coronavirus Testing After First Case Of Community Transmission Capital Public Radio News California is monitoring at least 8,400 people for the coronavirus CNBC 'This case … marks a turning point.' California health officer on new c…", "url": "http://www.capradio.org/articles/2020/02/27/watch-live-gov-newsom-gives-an-update-on-california-coronavirus-response/", "urlToImage": "https://www.capradio.org/media/12250435/022720newsomcoronavirus-p.jpg", "publishedAt": "2020-02-27T20:37:30Z", "content": "Updated 12:37 p.m.\r\nCalifornia Gov. Gavin Newsom said he is confident California can respond to the spread of COVID-19, including the first possible case of community transmission in the U.S., which is being treated at UC Davis Medical Center in Sacramento.\r\n… [+3236 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Ash", "title": "Plague Inc. removed from the App Store in China", "description": "Popular pandemic simulator Plague Inc. has been removed from the China App Store after the creators were informed that the game “includes content that is illegal in China as determined by the Cyberspace Administration of China.” A blog post on Ndemic Creation…", "url": "https://mspoweruser.com/plague-inc-removed-china-app-store/", "urlToImage": null, "publishedAt": "2020-02-27T20:27:49Z", "content": "Popular pandemic simulator Plague Inc. has been removed from the China App Store after the creators were informed that the game “includes content that is illegal in China as determined by the Cyberspace Administration of China.”\r\nA blog post on Ndemic Creatio… [+1627 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Biocontainment expert on coronavirus: There's no need for average people to panic yet - Yahoo Finance", "description": "Biocontainment expert on coronavirus: There's no need for average people to panic yet Yahoo Finance Coronavirus now spreading faster outside of China - amid pandemic fears Channel 4 News Coronavirus Sparks Talk of Global Recession and 'Economic Pandemic' as S…", "url": "https://finance.yahoo.com/news/coronavirus-expert-no-need-to-panic-yet-203125069.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wsXOU0fyd5YnhGNwWSAfKw--~B/aD00MDAwO3c9NjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/8630dd90-5995-11ea-a9fd-41cf4c407a83", "publishedAt": "2020-02-27T20:31:00Z", "content": "America may now be facing 60 cases of the coronavirus, or COVID-19, but one expert says theres no need to panic just yet.\r\nI dont think were at the level yet where the average person needs to be panicking about this, Dr. Brian Garibaldi, medical director of J… [+3245 chars]"}, {"source": {"id": null, "name": "Militarytimes.com"}, "author": "J.D. Simkins", "title": "Coronavirus is here to ruin all hope for beards in the military - Military Times", "description": "Coronavirus is here to ruin all hope for beards in the military Military Times View Full Coverage on Google News", "url": "https://www.militarytimes.com/off-duty/military-culture/2020/02/27/coronavirus-is-here-to-ruin-all-hope-for-beards-in-the-military/", "urlToImage": "https://www.armytimes.com/resizer/tgSuozI8SCOgbArleDJLYov6cXA=/1200x630/filters:quality(100)/arc-anglerfish-arc2-prod-mco.s3.amazonaws.com/public/OYTY2MVHZ5GCRLFSXIDKHG7ETI.png", "publishedAt": "2020-02-27T21:09:02Z", "content": "Military sticklers for clean shaves and proponents of stingy no-shave chit distribution now have a surplus of ammunition to support their respective stances after guidance issued by the Centers for Disease Control and Prevention advised on acceptable forms of… [+1865 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Lessons learned from addressing myths about Zika and yellow fever outbreaks in Brazil", "description": "When disease epidemics and outbreaks occur, conspiracy theories often emerge that compete with the information provided by public health officials. A new study finds that information used to counter myths about Zika in Brazil not only failed to reduce misperc…", "url": "https://www.sciencedaily.com/releases/2020/02/200227160554.htm", "urlToImage": null, "publishedAt": "2020-02-27T21:05:54Z", "content": "When disease epidemics and outbreaks occur, conspiracy theories often emerge that compete with the information provided by public health officials. A Dartmouth-led study in Science Advances finds that information used to counter myths about Zika in Brazil not… [+1859 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier, Contributor, Dave Thier, Contributor https://www.forbes.com/sites/davidthier/", "title": "Analyst: Coronavirus Could Impact Xbox Series X And PS5 Production", "description": "The continued spread of the novel coronavirus could impact the production of the Xbox Series X and PlayStation 5, according to an analyst statement.", "url": "https://www.forbes.com/sites/davidthier/2020/02/27/analyst-coronavirus-could-impact-xbox-series-x-and-ps5-production/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e58286bd378190007f477af%2F960x0.jpg", "publishedAt": "2020-02-27T20:40:31Z", "content": "Microscopic view of Coronavirus, a pathogen that attacks the respiratory tract. Analysis and test, ... [+] experimentation. Sars. 3d render\r\nGetty\r\nThe continued spread of the novel coronavirus could impact the production of next-gen consoles, according to an… [+4840 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kurtz weighs in on Trump's libel lawsuit against the New York Times - Fox News", "description": "Kurtz weighs in on Trump's libel lawsuit against the New York Times Fox News Laurence Tribe: Trump campaign's lawsuit against New York Times \"designed to chill the free press\" Salon New York Times ripped for column saying coronavirus should be called 'Trumpvi…", "url": "https://www.youtube.com/watch?v=PbXkwGal2m4", "urlToImage": "https://i.ytimg.com/vi/PbXkwGal2m4/maxresdefault.jpg", "publishedAt": "2020-02-27T21:05:14Z", "content": "The Trump campaign files a libel lawsuit against New York Times for the paper's March 27, 2019 op-ed titled The Real Trump-Russia Quid Pro Quo; reaction and analysis from Media Buzz host Howard Kurtz. #FoxNews\r\nFOX News operates the FOX News Channel (FNC), FO… [+1711 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Far-right parties in Italy's neighbors call for border checks over coronavirus", "description": "Far-right parties in countries bordering Italy have seized on Europe's biggest coronavirus outbreak to call for checks at the Italian frontier, despite medical experts saying that would do little to stop the disease spreading.", "url": "https://www.reuters.com/article/us-china-health-italy-neighbours-idUSKCN20L2ZE", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496144331&w=1200&r=LYNXNPEG1Q1V0", "publishedAt": "2020-02-27T20:32:01Z", "content": "VIENNA (Reuters) - Far-right parties in countries bordering Italy have seized on Europe’s biggest coronavirus outbreak to call for checks at the Italian frontier, despite medical experts saying that would do little to stop the disease spreading. \r\nItalian aut… [+2541 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Nicholas G. Evans", "title": "Where the Coronavirus Bioweapon Conspiracy Theories Really Come From", "description": "The rumors of a lab escape or a bioweapon stem from historical amnesia, a caricatured villain, and good old-fashioned racism.", "url": "https://slate.com/technology/2020/02/coronavirus-bioweapon-conspiracy-theories.html", "urlToImage": "https://compote.slate.com/images/04ab18bf-3e72-4079-b02a-1a96cf1e9c1a.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2020-02-27T21:09:30Z", "content": "Concerned about the spread of COVID-19, students wear masks as they wait for Bernie Sanders to speak at a rally in Winston-Salem, North Carolina, on Thursday.\r\n<ol><li>\r\nFirst Coronavirus Case in U.S. Reported Without Clear Link to Global Outbreak\r\n </li><li>… [+10472 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Factbox: U.S. business forecasts earnings pressure as coronavirus spreads", "description": "As the coronavirus epidemic spreads in China and beyond, U.S. companies will see profits stagnate in 2020, according to a Goldman Sachs report.", "url": "https://www.reuters.com/article/us-china-health-us-companies-factbox-idUSKCN20L2YW", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496139751&w=1200&r=LYNXNPEG1Q1US", "publishedAt": "2020-02-27T20:21:02Z", "content": "(Reuters) - As the coronavirus epidemic spreads in China and beyond, U.S. companies will see profits stagnate in 2020, according to a Goldman Sachs report. \r\nSeveral big names in the U.S. consumer and tech sectors have already warned of a hit from the rapid s… [+1588 chars]"}, {"source": {"id": null, "name": "Wfsb.com"}, "author": "", "title": "Local business owners worried about the impact of the coronavirus - WFSB", "description": "As the coronavirus continues to spread, not only is it impacting the health of thousands around the world, but also the economy.", "url": "https://www.wfsb.com/news/local-business-owners-worried-about-the-impact-of-the-coronavirus/article_55675196-59a2-11ea-a18f-1f12e78df8ba.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wfsb.com/content/tncms/assets/v3/editorial/9/83/983f6bdf-34c1-5360-9d51-ef088ac14993/5e503e624fce9.image.jpg?resize=909%2C630", "publishedAt": "2020-02-27T20:47:00Z", "content": "ORANGE, CT (WFSB) As the coronavirus continues to spread, not only is it impacting the health of thousands around the world, but also the economy.\r\nSo many of the produce people use in their daily lives and items people buy, even many of the active ingredient… [+2026 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Staff, Jason Moser, Chris Hill, and Benjamin Ra)", "title": "The U.S. Stock Market is Down Big -- Here's What Investors Should Do Right Now", "description": "The headlines might be scary, but you shouldn't panic.", "url": "https://www.fool.com/investing/2020/02/27/the-us-stock-market-is-down-big-what-should-invest.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/560380/stocks-down-big2x.png", "publishedAt": "2020-02-27T20:27:00Z", "content": "As the coronavirus has continued to spread and the number of affected individuals continues to climb, the stock market has begun to feel the pain of uncertainty. The S&amp;P 500 is down over 8% this week alone.\r\nThese are legitimate concerns. There are still … [+482 chars]"}, {"source": {"id": null, "name": "Ucdavis.edu"}, "author": null, "title": "Message to Campus Community on COVID-19 - UC Davis", "description": "Message to Campus Community on COVID-19 UC Davis Single coronavirus case exposes a bigger failure to track spread STAT The US' newest coronavirus patient had no known exposure to anyone sick and hadn't gone to China, which sugges Business Insider India Corona…", "url": "https://www.ucdavis.edu/news/message-campus-community-covid-19/", "urlToImage": "https://www.ucdavis.edu/sites/default/files/images/article/mrak-hall-uc-davis-1200.jpg", "publishedAt": "2020-02-27T20:49:00Z", "content": "Chancellor Gary S. May and UC Davis Health Vice Chancellor and CEO David Lubarsky issued the following statement today (Feb. 27):\r\nDear UC Davis Community:\r\nAs you may be aware, a confirmed case of COVID-19 has been documented in a Solano County resident who … [+3622 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Megan Davies", "title": "Investment advisors worry U.S. response to coronavirus is too little too late", "description": "Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets.", "url": "https://www.reuters.com/article/us-china-health-investors-response-idUSKCN20L31F", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496152465&w=1200&r=LYNXNPEG1Q1XQ", "publishedAt": "2020-02-27T21:01:06Z", "content": "NEW YORK (Reuters) - Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets.  \r\nTheir criticism… [+4702 chars]"}, {"source": {"id": null, "name": "Thurrott.com"}, "author": "Mehedi Hassan", "title": "Facebook Cancels Its Annual Developer Conference Amid Coronavirus Concerns", "description": "Facebook is cancelling its annual developer conference, F8, due to concerns over coronavirus. It will instead host local events and live-streamed content. The post Facebook Cancels Its Annual Developer Conference Amid Coronavirus Concerns appeared first on Th…", "url": "https://www.thurrott.com/cloud/social/230876/facebook-cancels-its-annual-developer-conference-amid-coronavirus-concerns", "urlToImage": "https://www.thurrott.com/wp-content/uploads/sites/2/2018/05/facebook.jpg", "publishedAt": "2020-02-27T20:52:31Z", "content": "Facebook is cancelling its annual developer conference, F8, due to concerns over coronavirus. The company today announced that it is cancelling the “in-person” component of F8, which usually takes place in San Jose.\r\nFacebook isn’t the only company cancelling… [+1342 chars]"}, {"source": {"id": null, "name": "Mytwintiers.com"}, "author": null, "title": "Markets down, Facebook cancels show: Virus hits businesses - WETM - MyTwinTiers.com", "description": "(AP) – The spread of the new coronavirus around the world is hitting companies hard as they suspend production, meetings, events and business travel. Here’s a look at the latest developments: MARKE…", "url": "https://www.mytwintiers.com/news-cat/international/markets-down-facebook-cancels-show-virus-hits-businesses/", "urlToImage": "https://www.mytwintiers.com/wp-content/uploads/sites/89/2020/02/bus.jpeg?w=800&h=533&crop=1&resize=1280,720", "publishedAt": "2020-02-27T20:50:00Z", "content": "(AP) The spread of the new coronavirus around the world is hitting companies hard as they suspend production, meetings, events and business travel. Heres a look at the latest developments:\r\nMARKETS: Markets are down sharply again. The Dow and S&amp;P were dow… [+3430 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Burns", "title": "COVID19 pushes investors to “stay at home” stocks like Netflix and Blizzard", "description": "The rising tide of novel coronavirus (COVID19) fear is generating an interesting effect on investor dollars. Where this week we’ve already seen major dips in oil prices* and the DOW Jones Industrial Average*, your average “stay at home” company seems to be fa…", "url": "https://www.slashgear.com/covid19-pushes-investors-to-stay-at-home-stocks-like-netflix-and-blizzard-27611492/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/02/wallstreet_pic.jpg", "publishedAt": "2020-02-27T20:16:29Z", "content": "The rising tide of novel coronavirus (COVID19) fear is generating an interesting effect on investor dollars. Where this week we’ve already seen major dips in oil prices* and the DOW Jones Industrial Average*, your average “stay at home” company seems to be fa… [+1876 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Beth Skwarecki", "title": "What To Do If You Think You Have COVID-19", "description": "With the news that the coronavirus is spreading, it’s only a matter of time before people start to think—wait, do I have the coronavirus? At this point it’s still extremely rare, and your cough is far more likely to be a cold or flu. Still, here’s what you sh…", "url": "https://www.lifehacker.com.au/2020/02/what-to-do-if-you-think-you-have-covid-19/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/rr8tbd7e0zx0wnrnwidn.jpg", "publishedAt": "2020-02-27T21:04:00Z", "content": "With the news that the coronavirus is spreading, its only a matter of time before people start to thinkwait, do I have the coronavirus? At this point its still extremely rare, and your cough is far more likely to be a cold or flu. Still, heres what you should… [+4941 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Jon Lockett", "title": "Panicked passengers get family kicked off flight over coughing daughter...", "description": "Panicked passengers get family kicked off flight over coughing daughter... (Top headline, 11th story, link ) Related stories: First case of UNKNOWN ORIGIN confirmed in Northern California... WAS NOT TESTED FOR DAYS... Medical staff exposed? Experts: Should be…", "url": "http://www.the-sun.com/news/463636/family-kicked-off-flight-coronavirus/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2020/02/CM-US-COMP-PLANE.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-02-27T20:52:36Z", "content": "A FAMILY of five say they were kicked off a plane just before takeoff over fears their coughing toddler could be infected with coronavirus.\r\nCanadian Emmanuel Faug, his wife Clémentine Ferraton and their three kids boarded a flight from Quebec City to Paris o… [+3183 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Amazon bars one million products for false coronavirus claims", "description": "Amazon also removed tens of thousands of deals from merchants that it said attempted to price-gouge customers. The coronavirus has caused at least 2,797 deaths globally. One offer comparison site showed recent examples of higher-than-usual prices for masks on…", "url": "https://finance.yahoo.com/news/amazon-bars-one-million-products-203426825.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/HPtRap75JdqQfApQcH0XCA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/f5809bb82472c65f4721dbe76a087d19", "publishedAt": "2020-02-27T20:34:26Z", "content": "By Jeffrey Dastin\r\n(Reuters) - Amazon.com Inc has barred more than 1 million products from sale in recent weeks that had inaccurately claimed to cure or defend against the coronavirus, the company told Reuters on Thursday.\r\nAmazon also removed tens of thousan… [+2037 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Amazon bars 1 million products for false coronavirus claims", "description": "Amazon.com Inc has barred more than 1 million products from sale in recent weeks that had inaccurately claimed to cure or defend against the coronavirus, the company told Reuters on Thursday. Amazon also removed tens of thousands of deals from merchants that …", "url": "https://finance.yahoo.com/news/amazon-bars-1-million-products-202949614.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-02-27T20:34:53Z", "content": "By Jeffrey Dastin\r\nFeb 27 (Reuters) - Amazon.com Inc has barred more than 1 million products from sale in recent weeks that had inaccurately claimed to cure or defend against the coronavirus, the company told Reuters on Thursday.\r\nAmazon also removed tens of … [+1974 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP Relax News", "title": "Coronavirus: latest developments worldwide", "description": "The list of countries hit by the coronavirus grows. Mecca suspends entry for pilgrims. Several countries close their schools, stock exchanges plunge.", "url": "https://news.yahoo.com/coronavirus-latest-developments-worldwide-205452306.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/z9UTho2aqLbNevOC.XTzyQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/7Bl1G8nhAAsL99vLeF997w--~B/aD0zMTczO3c9NDc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/000_1p99ys.ad978203759.original.jpg", "publishedAt": "2020-02-27T20:54:52Z", "content": "The list of countries hit by the coronavirus grows. Mecca suspends entry for pilgrims. Several countries close their schools, stock exchanges plunge.\r\nHere are the latest developments in the coronavirus crisis.\r\n- 50 countries hit -\r\nSome 82,560 people have b… [+2289 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Adam K. Raymond", "title": "Experts Simulated a Coronavirus Pandemic Last Year and It Killed 65 Million", "description": "The mock virus, modeled by public-health experts, revealed major challenges to responding to a coronavirus pandemic.", "url": "http://nymag.com/intelligencer/2020/02/a-simulated-coronavirus-pandemic-in-2019-killed-65-million.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/02/27/27-coronavirus-doctors.w1200.h630.jpg", "publishedAt": "2020-02-27T20:33:01Z", "content": "Last October, two months before the coronavirus that causes COVID-19 emerged in central China, a group of public-health experts gathered in New York City for a simulation. Their objective was to determine how industry, national governments, and international … [+2476 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "New JACEP Open Analyses Explore Coronavirus Risk Factors and Public Health Concerns", "description": "New JACEP Open Analyses Explore Coronavirus Risk Factors and Public Health ConcernsPR NewswireWASHINGTON, Feb. 27, 2020 /PRNewswire/ -- Emergency physician-led teams are on the frontlines of coronavirus treatment, prevention and response.", "url": "https://news.yahoo.com/jacep-open-analyses-explore-coronavirus-205500363.html", "urlToImage": null, "publishedAt": "2020-02-27T20:55:00Z", "content": null}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Aaron Colen", "title": "Coronavirus response in Iran hindered by government disinformation and economic sanctions", "description": "The coronavirus outbreak in Iran may be much worse than officials are letting on, and doctors in the country believe the virus has been there for weeks longer than previously disclosed by the government, according to Time. Iranian officials have attempted to …", "url": "https://www.theblaze.com/news/coronavirus-response-in-iran-hindered-by-government-disinformation-and-economic-sanctions", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgzMzE3Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU5OTkxNDQ5NX0.Yr-__2cdAhLGSZo00RyZA0JmOMh2fyRxgy1kwPhGNso/img.jpg?width=1200&coordinates=0%2C181%2C0%2C181&height=600", "publishedAt": "2020-02-27T20:58:05Z", "content": "The coronavirus outbreak in Iran may be much worse than officials are letting on, and doctors in the country believe the virus has been there for weeks longer than previously disclosed by the government, according to Time.\r\nIranian officials have attempted to… [+2248 chars]"}, {"source": {"id": null, "name": "Gamesindustry.biz"}, "author": null, "title": "IEM Katowice will go on without an audience", "description": "Esports tournament sees permission to hold a mass event revoked due to COVID-19 coronavirus concerns", "url": "https://www.gamesindustry.biz/articles/2020-02-27-iem-katowice-will-go-on-without-an-audience", "urlToImage": "https://images.eurogamer.net/2020/articles/2020-02-27-20-32/iem_katowice.jpg", "publishedAt": "2020-02-27T20:30:00Z", "content": "Share this article\r\nCompanies in this article\r\nESL\r\nThis weekend's Intel Extreme Masters Katowice tournaments will go on despite COVID-19 novel coronavirus concerns, but they will do so without an audience on-site.\r\nOrganizer ESL said it was informed Thursday… [+1031 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "CATHERINE THORBECKE", "title": "Dow Jones plummets more than 1,000 points amid coronavirus uncertainty", "description": "The Dow Jones Industrial Average plummeted 1,190 points Thursday, or more than 4%, as economic uncertainty over the spread of the novel coronavirus continued to rattle markets.MORE: Dow Jones plunges for 2nd straight day on coronavirus fearsThe losses mark th…", "url": "https://www.yahoo.com/gma/dow-jones-plummets-more-1-000-points-amid-211000934.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8aASDc93aF6m.f6xIqd96Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/djy.6aIOP2Nl6DKyftkyqg--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/new-york-stock-exchange-ap-jc-200227_hpMain_16x9_992.jpg", "publishedAt": "2020-02-27T21:10:00Z", "content": "The Dow Jones Industrial Average plummeted 1,190 points Thursday, or more than 4%, as economic uncertainty over the spread of the novel coronavirus continued to rattle markets.\r\nMORE: Dow Jones plunges for 2nd straight day on coronavirus fears\r\nThe losses mar… [+239 chars]"}, {"source": {"id": null, "name": "Towleroad.com"}, "author": "John Wright", "title": "Coronavirus, Mike Pence, AOC, Elizabeth Warren, Pete Buttigieg, ‘Drag Race,’ Matthew Mitcham, Ricky Dillon, Lady Gaga: HOT LINKS", "description": "#PENCEDEMIC: Mike Pence was criticized for his handling of Indiana’s HIV outbreak. He will lead the U.S. coronavirus response. The worst HIV outbreak in the state’s history happened on his watch in 2015, which critics blamed on Pence’s belated response and hi…", "url": "https://www.towleroad.com/2020/02/coronavirus-mike-pence-aoc-elizabeth-warren-pete-buttigieg-drag-race-matthew-mitcham-ricky-dillon-lady-gaga-hot-links/", "urlToImage": "https://i1.wp.com/www.towleroad.com/wp-content/uploads/2020/02/ThursdayFeatured.png?fit=600%2C408&ssl=1", "publishedAt": "2020-02-27T20:29:37Z", "content": "#PENCEDEMIC: Mike Pence was criticized for his handling of Indianas HIV outbreak. He will lead the U.S. coronavirus response. The worst HIV outbreak in the states history happened on his watch in 2015, which critics blamed on Pences belated response and his o… [+2727 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The Trump administration says the coronavirus vaccine might not be affordable for all Americans via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_dc81c986491be0ab4a13d46f273bdcfc", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T21:00:16Z", "content": "YouTube TV, Fox Sports Networks, Regional sports network, Sinclair Broadcast...\r\nIf you subscribe to YouTube TV to get live sports without a pricey cable or league package, you might be in for a disappointment. YouTube TV is..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " The 31 wildest lines from Donald Trump's self-congratulatory coronavirus press conference - CNN via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_166b846cdd55807df2726242be53d32d", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-02-27T21:00:16Z", "content": "YouTube TV, Fox Sports Networks, Regional sports network, Sinclair Broadcast...\r\nIf you subscribe to YouTube TV to get live sports without a pricey cable or league package, you might be in for a disappointment. YouTube TV is..."}, {"source": {"id": null, "name": "Investors.com"}, "author": "Investor's Business Daily", "title": "Tesla Stock Leads Top Tech Play To Big Gains Despite Market Sell-Off - Investor's Business Daily", "description": "The stock market is selling off as coronavirus fears escalate, but a leading tech ETF with a big stake in Tesla stock is finding key support.", "url": "https://www.investors.com/etfs-and-funds/etf-leaders/tesla-stock-leads-top-tech-etf-big-gains-despite-market-sell-off/", "urlToImage": "https://www.investors.com/wp-content/uploads/2019/11/stock-tesla-Cybertruck-02-company.jpg", "publishedAt": "2020-02-27T20:39:00Z", "content": "The stock market is selling off as coronavirus fears escalate, but a leading tech ETF with a big stake in Tesla (TSLA) stock is finding key support.\r\nXARK Next Generation Internet (ARKW), which marked a record high Feb. 19, has pulled back the past week as th… [+2522 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "First Dutch coronavirus infection confirmed: health authorities", "description": "A patient in the Netherlands has been diagnosed with the new coronavirus Covid-19, Dutch health authorities said on Thursday, the first confirmed case in the country.", "url": "https://www.reuters.com/article/us-china-health-netherlands-idUSKCN20L2ZM", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T20:33:45Z", "content": "AMSTERDAM (Reuters) - A patient in the Netherlands has been diagnosed with the new coronavirus Covid-19, Dutch health authorities said on Thursday, the first confirmed case in the country. \r\nThe Dutch National Institute for Public Health said in a statement t… [+179 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus is sparking fears it could become a pandemic - here's why | Just The FAQs - USA TODAY", "description": "Coronavirus is sparking fears it could become a pandemic - here's why | Just The FAQs USA TODAY Coronavirus Live Updates: New Cases Light Up the Map as Countries Brace for Outbreaks msnNOW Trump says US is 'ready' for novel coronavirus outbreak as cases sprea…", "url": "https://www.youtube.com/watch?v=Hndhc-c425U", "urlToImage": "https://i.ytimg.com/vi/Hndhc-c425U/maxresdefault.jpg", "publishedAt": "2020-02-27T20:35:14Z", "content": "As the coronavirus continues to spread, many fear it will soon rise to the level of a pandemic. What is a pandemic - and are we prepared to fight one? RELATED: Coronavirus explained https://youtu.be/D31NoaxXgbU\r\nA California coronavirus patient believed to be… [+947 chars]"}, {"source": {"id": null, "name": "Thoughtcatalog.com"}, "author": "Chrissy Stockton", "title": "Unpopular Opinion: Now Is A Good Time To Rewatch ‘Contagion’", "description": "You can rent the movie and stock up on flu supplies and face masks at the same time.", "url": "https://thoughtcatalog.com/christine-stockton/2020/02/unpopular-opinion-now-is-a-good-time-to-rewatch-contagion/", "urlToImage": "https://thoughtcatalog.files.wordpress.com/2020/02/screen-shot-2020-02-27-at-1.50.37-pm.png?w=1200&resize=1200,629&quality=95&strip=all&crop=1", "publishedAt": "2020-02-27T20:21:26Z", "content": "Contagion\r\nAs true crime grows in popularity I sometimes stumble across people on the internet having the conversation that every true crime and horror fan has had with themselves from a young age: why are we attracted to the things that scare us? If violence… [+3121 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Gavin Sheehan", "title": "Microsoft Drops Out Of GDC 2020 Over Coronavirus Concerns", "description": "Microsoft has become the latest company to announce they've pulled out of GDC 2020 over concerns regarding the coronavirus. We apologize if this is starting to sound like a broken record, but the company issued a statement (which we have a bit of it for you b…", "url": "https://www.bleedingcool.com/2020/02/27/microsoft-drops-out-of-gdc-2020-over-coronavirus-concerns/", "urlToImage": "https://www.bleedingcool.com/wp-content/uploads/2020/02/microsoft-logo-black-1200x628.jpg", "publishedAt": "2020-02-27T20:40:22Z", "content": "Microsoft has become the latest company to announce they've pulled out of GDC 2020 over concerns regarding the coronavirus. We apologize if this is starting to sound like a broken record, but the company issued a statement (which we have a bit of it for you b… [+1780 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Alex Henderson, AlterNet", "title": "Coronavirus is exposing the ‘pathologies’ and ‘sheer incompetence’ of Trump’s administration: conservative", "description": "In Northern California, the Centers for Disease Control and Prevention (CDC) has been investigating what appears to be the United States’ first example of someone being diagnosed with coronavirus despite having never left the country; everyone previously trea…", "url": "https://www.rawstory.com/2020/02/coronavirus-is-exposing-the-pathologies-and-sheer-incompetence-of-trumps-administration-conservative/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2016/12/donald-trump-and-mike-pence-afp.jpg", "publishedAt": "2020-02-27T20:18:10Z", "content": "In Northern California, the Centers for Disease Control and Prevention (CDC) has been investigating what appears to be the United States first example of someone being diagnosed with coronavirus despite having never left the country; everyone previously treat… [+2763 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Adrian Potoroaca", "title": "Apple loses two veteran executives from manufacturing and iPhone operations", "description": "According to a Bloomberg report, Apple is losing two key people with long histories at the company. One of the veteran executives is Nick Forlenza, vice president of manufacturing design, who has decided to retire. The second is Duco Pasmooji, also a vice pre…", "url": "https://www.techspot.com/news/84189-apple-loses-two-veteran-executives-manufacturing-iphone-operations.html", "urlToImage": "https://static.techspot.com/images2/news/ts3_thumbs/2019/10/2019-10-28-ts3_thumbs-499.jpg", "publishedAt": "2020-02-27T20:22:00Z", "content": "In brief: Two of Apple's key executives are moving on from the company, and while both departures had been planned in advance, they come at a time when Apple's supply chain is seriously disrupted by the coronavirus crisis. \r\nAccording to a Bloomberg report, A… [+1365 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kathryn Watson", "title": "Who's in charge of the White House's coronavirus response?", "description": "Three people are tasked with leading the administration's response, and their exact roles are unclear.", "url": "https://www.cbsnews.com/news/whos-in-charge-of-the-trump-administrations-coronavirus-response-2020-02-27/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/07/01/47b9efa4-c0eb-403b-9adb-66d0ab75ae43/thumbnail/1200x630g2/3add7b7bb15a057331c50b399a732144/ap-19182768057124.jpg", "publishedAt": "2020-02-27T21:09:23Z", "content": "President Trump tapped Health and Human Services Secretary Alex Azar in January to head up the coronavirus response task force.  Then, after the White House repeatedly denied reporting that he might select a coronavirus \"czar,\" the president announced in a We… [+3188 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "Coronavirus Dow Sell-Off Tops 1,190 Points; Silicon Valley Big Tech Battered As Stocks Tumble - CBS San Francisco", "description": "Shares of streaming giant Netflix soared for several hours Thursday before joining the steep drop in Silicon Valley tech stocks as Wall Street dropped more than 1,190 points over fears of the coronavirus.", "url": "https://sanfrancisco.cbslocal.com/2020/02/27/coronavirus-fears-rock-wall-street-netflix-shares-silicon-valley-apple-google-facebook/", "urlToImage": "https://sanfrancisco.cbslocal.com/wp-content/uploads/sites/15116056/2018/02/wall-street-getty-images.jpg?w=720", "publishedAt": "2020-02-27T21:05:00Z", "content": "SAN JOSE (CBS SF) — Shares of streaming giant Netflix soared for several hours Thursday before joining the steep drop in Silicon Valley tech stocks as Wall Street dropped more than 1,190 points over fears of the coronavirus.\r\nInvestors turned to Netflix stock… [+2173 chars]"}, {"source": {"id": null, "name": "Roadtovr.com"}, "author": "Scott Hayden", "title": "Facebook Cancels F8 Developer Conference Over Coronavirus Concerns", "description": "Facebook today announced that its annual F8 developer conference isn’t happening this year due to concerns over the novel coronavirus (COVID-19). Facebook’s Konstantinos Papamiltiadis released word today via a Facebook blog post, stating that the company has …", "url": "https://www.roadtovr.com/facebook-cancels-f8-developer-conference-coronavirus-concerns/", "urlToImage": "https://roadtovrlive-5ea0.kxcdn.com/wp-content/uploads/2019/07/mark-zuckerberg.jpg", "publishedAt": "2020-02-27T20:40:39Z", "content": "Facebook today announced that its annual F8 developer conference isn’t happening this year due to concerns over the novel coronavirus (COVID-19).\r\nFacebook’s Konstantinos Papamiltiadis released word today via a Facebook blog post, stating that the company has… [+2093 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "SHOCKER: Coronavirus Slowing China’s Auto Market, Europe Starting to Feel Effects….", "description": "SHOCKER: Coronavirus Slowing China’s Auto Market, Europe Starting to Feel Effects.", "url": "https://pjmedia.com/instapundit/359656/", "urlToImage": null, "publishedAt": "2020-02-27T21:00:45Z", "content": "As an Amazon Associate,I earn from qualifying purchases."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Garber", "title": "Stock losses steepen after falling into correction territory", "description": "U.S. equity markets plunged into correction territory Thursday as President Trump’s announcement of a coronavirus task force did little to assuage investors’ fears of a deepening crisis.", "url": "https://finance.yahoo.com/news/dow-nasdaq-plunge-correction-territory-143244840.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/zJHaUqQPYPjmfcbjL8Gveg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/tXybvMmQ1Mwepku2sYUQgg--~B/aD0yMzU5O3c9NDIwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/prod/2020-02/27/5e57e76cde7e2726cc4de636/5e57e76cde7e2726cc4de637_o_U_v2.jpg", "publishedAt": "2020-02-27T20:19:44Z", "content": "U.S. equity markets plunged into correction territory Thursday before bouncing off the worst levels of the session as President Trumps announcement of a coronavirus task force did little to assuage investors fears of a deepening crisis.\r\nThe early selling had… [+2776 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chelsea Ritschel", "title": "Coronavirus: Four times Mike Pence denied health-related science", "description": "Following the announcement that Mike Pence would be leading the United States’ response to the coronavirus threat, concerns have been raised over the vice president’s ability to handle a health crisis.On Wednesday, President Trump made a rare appearance in th…", "url": "https://news.yahoo.com/coronavirus-four-times-mike-pence-205907029.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/h99oavxNaUsCdOHClTrxCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03MDI-/https://s.yimg.com/uu/api/res/1.2/TyfAhm7J.jJosf.NCbxJkg--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/c682dc76dd3458d081bd98c0f2c8dac5", "publishedAt": "2020-02-27T20:59:07Z", "content": "Following the announcement that Mike Pence would be leading the United States response to the coronavirus threat, concerns have been raised over the vice presidents ability to handle a health crisis.\r\nOn Wednesday, President Trump made a rare appearance in th… [+6394 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "David Pierini", "title": "Pandemic-themed game Plague Inc. pulled from App Store in China", "description": "Apple was forced to pull one of the world’s most popular games from the App Store in China by order of the country’s Cyberspace Administration. The creators of Plague Inc. say it is unclear whether their pandemic-themed game was removed because of China’s ong…", "url": "https://www.cultofmac.com/687933/plague-inc-app-store-china-apple/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2020/02/PlagueInc001.jpg", "publishedAt": "2020-02-27T20:22:23Z", "content": "Apple was forced to pull one of the worlds most popular games from the App Store in China by order of the countrys Cyberspace Administration.\r\nThe creators of Plague Inc. say it is unclear whether their pandemic-themed game was removed because of Chinas ongoi… [+2068 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Jaclyn Reiss", "title": "What are the symptoms of coronavirus, and how is it treated?", "description": "As public awareness of the coronavirus rises, some people might have a fairly basic question: What exactly are the symptoms of coronavirus, anyway? Is it deadly? How worried should I be? Here are some answers.", "url": "https://www.bostonglobe.com/2020/02/27/nation/what-are-symptoms-coronavirus-how-is-it-treated/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/dgF8ZPvyZuedWyDuVuiI6UvkxAA=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/UHHSAO22QRBGNOZ3VP5HJAFQNA.jpg", "publishedAt": "2020-02-27T20:37:45Z", "content": "According to the CDCs website, the symptoms are pretty straightforward:\r\n<ul><li>Fever</li><li>Cough</li><li>Shortness of breath</li></ul>The symptoms could appear in as few as two days or as long as 14 days after exposure, according to the CDC.\r\nSevere compl… [+2274 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "The right way to wash your hands", "description": "People around the world are clamoring to buy face masks amidst fears that the coronavirus will continue spreading, but washing your hands is actually the best way to prevent the spread of disease.", "url": "https://www.cbsnews.com/video/the-right-way-to-wash-your-hands/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/02/27/3a6f2448-d4ff-4178-b9cb-1e6d1053faa9/thumbnail/1200x630/21bb77902eae5597f75c795edc0919f7/0227-cbsn-washyourhands-lapook-2036465-640x360.jpg", "publishedAt": "2020-02-27T20:24:02Z", "content": null}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Eric Lutz", "title": "Elizabeth Warren Has A Plan For Coronavirus: Defund Trump’s “Racist Wall”", "description": "The Massachusetts senator and 2020 hopeful thinks $10 billion would be better spent on public health and science than “a monument to hate and division” at the U.S.-Mexico border.", "url": "https://www.vanityfair.com/news/2020/02/warren-has-a-plan-for-coronavirus-defund-trumps-racist-wall", "urlToImage": "https://media.vanityfair.com/photos/5e5804c29f4dd300088c15a3/16:9/w_1280,c_limit/Warren6.jpg", "publishedAt": "2020-02-27T20:46:31Z", "content": "Elizabeth Warren has a plan to combat coronavirusand it involves defunding Donald Trumps border wall. The Massachusetts senator and presidential candidate on Thursday trolled the president over his poor handling of the public health crisis, introducing a bill… [+4132 chars]"}, {"source": {"id": null, "name": "Gotechdaily.com"}, "author": null, "title": "[Coronavirus: China's new challenge as situations confirmed on pretty much every continent] - gotech daily", "description": "[Coronavirus: China's new challenge as situations confirmed on pretty much every continent] gotech daily Coronavirus: What you need to know to prepare for a covid-19 pandemic New Scientist News Three ways coronavirus can affect markets ThePrint Covid-19 is no…", "url": "https://gotechdaily.com/coronavirus-chinas-new-challenge-as-situations-confirmed-on-pretty-much-every-continent/", "urlToImage": "https://gotechdaily.com/wp-content/uploads/2020/02/66184/coronavirus-chinas-new-challenge-as-situations-confirmed-on-pretty-much-every-continent.jpg", "publishedAt": "2020-02-27T20:53:00Z", "content": "The coronavirus has now been detected on just about every continent on Earth besides Antarctica, main to new fears in China about how to preserve the virus out.\r\n With Brazil confirming Latin America’s initial scenario, the likely deadly condition has now arr… [+3746 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Ethan Huff", "title": "Chinese state media finally admitting official coronavirus count is a lie", "description": "(Natural News) In a shocking turn of events, Caixin, a state-run media outlet in communist China, has finally fessed up about the mass underreporting of coronavirus deaths in Wuhan, ground-zero for the Wuhan coronavirus (CoVid-19) pandemic. Confirming what we…", "url": "https://www.naturalnews.com/2020-02-27-chinese-state-media-admitting-official-coronavirus-count-is-lie.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2020/02/Coronavirus-Senior-Elderly-Old-Sick-Mask.jpg", "publishedAt": "2020-02-27T20:15:28Z", "content": null}, {"source": {"id": null, "name": "Adweek.com"}, "author": "Erik Oster", "title": "Dentsu Japan Headquarters Closes After 2 Employees Contract Coronavirus", "description": "Two employees in Japan were confirmed to have coronavirus, according to an internal email obtained by AgencySpy.", "url": "http://www.adweek.com/agencyspy/dentsu-japan-headquarters-closes-after-2-employees-contract-coronavirus/162554/", "urlToImage": "https://s3.amazonaws.com/abn-prod/wp-content/uploads/sites/7/2020/02/Dentsu-Aegis-Network.png", "publishedAt": "2020-02-27T20:40:10Z", "content": "Dentsu Aegis Network has updated travel guidance for employees across the network and closed Dentsu Japan headquarters after two employees were found to have tested positive for coronavirus.\r\nA screenshot from an internal email shared with AgencySpy explained… [+1720 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "8,400 people in Calif. are being monitored for coronavirus, Gov. Newsom says", "description": "California Governor Gavin Newsom said in a  press conference  Thursday that at least 8,400 people are being monitored for new coronavirus in the state.", "url": "https://www.sfgate.com/bayarea/article/Gavin-Newsom-coronavirus-California-people-monitor-15089928.php", "urlToImage": "https://s.hdnux.com/photos/01/10/43/01/19017840/3/rawImage.jpg", "publishedAt": "2020-02-27T20:56:13Z", "content": "<ul><li>FILE - This Oct. 8, 2019, file photo, shows California Gov. Gavin Newsom during an interview in his office at the Capitol in Sacramento, Calif.\r\nFILE - This Oct. 8, 2019, file photo, shows California Gov. Gavin Newsom during an interview in his office… [+3353 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Factbox: U.S. business forecasts earnings pressure as coronavirus spreads", "description": "Several big names in the U.S. consumer and tech sectors have already warned of a hit from the rapid spread of the epidemic that has disrupted supply chains, hurt global travel and led to temporary shutdowns of businesses. Here's a list of some big names from …", "url": "https://finance.yahoo.com/news/factbox-u-business-forecasts-earnings-202102134.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_VeBj93QjPcIv6bLptRm1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/EsVkg4Kl7IaXmF7ZNt0zKA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/59e285160443ec0ca46aeeb386b83337", "publishedAt": "2020-02-27T20:21:02Z", "content": "(Reuters) - As the coronavirus epidemic spreads in China and beyond, U.S. companies will see profits stagnate in 2020, according to a Goldman Sachs report.\r\nSeveral big names in the U.S. consumer and tech sectors have already warned of a hit from the rapid sp… [+1633 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Factbox: U.S. business forecasts earnings pressure as coronavirus spreads", "description": "Several big names in the U.S. consumer and tech sectors have already warned of a hit from the rapid spread of the epidemic that has disrupted supply chains, hurt global travel and led to temporary shutdowns of businesses. Here's a list of some big names from …", "url": "https://news.yahoo.com/factbox-u-business-forecasts-earnings-202102501.html", "urlToImage": null, "publishedAt": "2020-02-27T20:21:02Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Financial firms discussing coronavirus contingency plans with regulators: official", "description": "U.S.-based banks and brokers are in discussions with federal regulators about allowing staff to work from home and other business continuity arrangements amid the spread of the coronavirus, the head of a top financial trade group said on Thursday. The industr…", "url": "https://news.yahoo.com/financial-firms-discussing-coronavirus-contingency-204019997.html", "urlToImage": null, "publishedAt": "2020-02-27T20:40:19Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Pete Schroeder", "title": "Financial firms discussing coronavirus contingency plans with regulators: official", "description": "U.S.-based banks and brokers are in discussions with federal regulators about allowing staff to work from home and other business continuity arrangements amid the spread of the coronavirus, the head of a top financial trade group said on Thursday. The industr…", "url": "https://finance.yahoo.com/news/financial-firms-discussing-coronavirus-contingency-204019684.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pIRWY68TV7QWz2XPnZumWg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/f1z0QMy4QoVASNsHcH_hVA--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/7e4eb5750b5aef607d2b0654855ba97b", "publishedAt": "2020-02-27T20:40:19Z", "content": "By Pete Schroeder\r\nWASHINGTON (Reuters) - U.S.-based banks and brokers are in discussions with federal regulators about allowing staff to work from home and other business continuity arrangements amid the spread of the coronavirus, the head of a top financial… [+3141 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Oliver O'Connell", "title": "'It's a bloodbath': Stocks plummet even further as coronavirus chokes US economy", "description": "The Dow Jones continued its week-long plunge on Thursday, down a massive 1,192 points, or 4.42% to 25,762, as fears about the impact of the coronavirus on the economy continued.", "url": "https://www.independent.co.uk/news/world/americas/dow-jones-coronavirus-market-drops-bloodbath-a9364061.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "publishedAt": "2020-02-27T21:11:21Z", "content": "The Dow Jones Industrial Average continued to plunge on Thursday, down a massive 1,192 points, or 4.42% to 25,762, as fears about the impact of the coronavirus on the economy continued.\r\nThe S&amp;P 500 fell 4.4% while the Nasdaq dropped 4.6%.\r\nAttempts by th… [+906 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pence says virus poses low-level threat in U.S., working with Congress on spending bill", "description": "U.S. Vice President Mike Pence said on Thursday the threat from coronavirus to the American public remains low, and the White House has begun discussions with leaders of the U.S. Congress on a supplemental spending bill to fighting the spread of the deadly in…", "url": "https://www.reuters.com/article/us-china-health-pence-idUSKCN20L2ZC", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200227&t=2&i=1496144325&w=1200&r=LYNXNPEG1Q1V1", "publishedAt": "2020-02-27T20:31:56Z", "content": "WASHINGTON (Reuters) - U.S. Vice President Mike Pence said on Thursday the threat from coronavirus to the American public remains low, and the White House has begun discussions with leaders of the U.S. Congress on a supplemental spending bill to fighting the … [+534 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Amy Graff", "title": "What you need to know about coronavirus in the Bay Area", "description": "As coronavirus fears spread through the Bay Area and beyond, Californians have myriad questions about the outbreak. \n The viral respiratory illness spreading rapidly in China is a new kind of coronavirus that scientists have never observed in humans before. C…", "url": "https://www.sfgate.com/bayarea/article/coronavirus-news-patients-Bay-Area-San-Francisco-15089212.php", "urlToImage": "https://s.hdnux.com/photos/01/10/23/30/18953754/5/rawImage.jpg", "publishedAt": "2020-02-27T20:36:10Z", "content": "<ul><li>Passengers wear face masks as they arrive on a flight from Asia at Los Angeles International Airport on January 29, 2020.\r\nPassengers wear face masks as they arrive on a flight from Asia at Los Angeles International Airport on January 29, 2020.\r\n Phot… [+9195 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Investment advisors worry U.S. response to coronavirus is too little too late", "description": "Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets.", "url": "https://news.yahoo.com/investment-advisors-worry-u-response-210106881.html", "urlToImage": null, "publishedAt": "2020-02-27T21:01:06Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Megan Davies", "title": "Investment advisors worry U.S. response to coronavirus is too little too late", "description": "Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets.", "url": "https://finance.yahoo.com/news/investment-advisors-worry-u-response-210106235.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/31iHBXotXI2cD1pElKSehg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/5.tlc.Gn0MG4S6Cd8mebYw--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/9e12324e78a753466101675ad3ff9b01", "publishedAt": "2020-02-27T21:01:06Z", "content": "By Megan Davies\r\nNEW YORK (Reuters) - Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets. \r… [+4698 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Dana Goldstein and Julie Bosman", "title": "What Would a Coronavirus Outbreak in the U.S. Mean for Schools?", "description": "Schools in the United States prepare for all manner of disasters and threats, whether hurricanes, mass shooters, tornadoes, influenza or head lice.But this week, a stark new order came from the Centers for Disease Control and Prevention: Get ready for the cor…", "url": "https://news.yahoo.com/coronavirus-outbreak-u-mean-schools-201345757.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HgvzJAstxoKnJ_DcC.IrNQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/mg.M2DRARtxB._3vU0re5w--~B/aD0zMzc1O3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/004f034aa2a807fca070c118b23f0a31", "publishedAt": "2020-02-27T20:13:45Z", "content": "Meg Conley with her daughters Margaret, left, and Bronte, at Park Hill Elementary School in Denver on Feb. 26, 2020. (Benjamin Rasmussen/The New York Times)\r\nSchools in the United States prepare for all manner of disasters and threats, whether hurricanes, mas… [+7571 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Investment advisors worry U.S. response to coronavirus is too little too late - Investing.com", "description": "Investment advisors worry U.S. response to coronavirus is too little too late Investing.com Pandemic: what does it mean and does it matter? RFI Latest coronavirus case is province’s first instance of human-to-human spread CityNews Husband of Ontario's fifth C…", "url": "https://www.investing.com/news/economy/investment-advisors-worry-us-response-to-coronavirus-is-too-little-too-late-2096327", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEG1Q1XQ_L.jpg", "publishedAt": "2020-02-27T21:04:00Z", "content": "By Megan Davies\r\nNEW YORK (Reuters) - Investment-advisors are increasingly worried that U.S. authorities are not be doing enough to prevent a widespread outbreak of coronavirus in the country, potentially adding further downside to already-battered markets. \r… [+4603 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Homo Coronavirus' - FRANCE 24 English", "description": "Fears of a Coronavirus epidemic play into the hands of those who for political, ideological reasons would like to see a return of hard borders in Europe. Els...", "url": "https://www.youtube.com/watch?v=Oy24vgmsIvw", "urlToImage": "https://i.ytimg.com/vi/Oy24vgmsIvw/hqdefault.jpg", "publishedAt": "2020-02-27T21:00:59Z", "content": "Fears of a Coronavirus epidemic play into the hands of those who for political, ideological reasons would like to see a return of hard borders in Europe. Elsewhere, the virus is becoming a political football in the US. Finally, sales of Corona beer have slump… [+348 chars]"}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Bess Levin", "title": "Cool: Health Officials, Scientists Banned From Speaking About Coronavirus Without Mike Pence’s Approval", "description": "In equally terrifying news, Trump’s always-wrong economic adviser, Larry Kudlow, has been added to the response team.", "url": "https://www.vanityfair.com/news/2020/02/mike-pence-coronavirus-gag-rule", "urlToImage": "https://media.vanityfair.com/photos/5e10c9479d364d000875e708/16:9/w_1280,c_limit/mike-pence.jpg", "publishedAt": "2020-02-27T20:54:29Z", "content": "On Wednesday night, in an effort to allay fears about the rapidly spreading coronavirus, Donald Trumpheld a press conference designed to convince the American public that hes totally got everything under control. While this sort of effort might have worked un… [+1937 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Facebook cancels conference, Microsoft withdraws from another on coronavirus", "description": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference due to fears over the coronavirus outbreak and Microsoft Corp followed suit by withdrawing from a gaming conference scheduled for next month. The post Facebook cancels c…", "url": "https://www.firstpost.com/business/facebook-cancels-conference-microsoft-withdraws-from-another-on-coronavirus-8095511.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/28/2020-02-27T183535Z_1_LYNXNPEG1Q1OY_RTROPTP_2_EUROPE-PRIVACY-FACEBOOK.jpg", "publishedAt": "2020-02-27T20:38:17Z", "content": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference due to fears over the coronavirus outbreak and Microsoft Corp followed suit by withdrawing from a gaming conference scheduled for next month.\r\n\"In place of the in-person… [+1806 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Oil prices dive to lowest in over a year on coronavirus fears", "description": "By Devika Krishna Kumar NEW YORK (Reuters) - Oil prices tumbled for a fifth day on Thursday to their lowest since January 2019, as further novel coronavirus cases outside China fanned fears that a pandemic could slow the global economy and erode demand for cr…", "url": "https://www.firstpost.com/business/oil-prices-dive-to-lowest-in-over-a-year-on-coronavirus-fears-8095501.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/28/2020-02-27T131728Z_3_LYNXNPEG1P065_RTROPTP_2_GLOBAL-OIL.jpg", "publishedAt": "2020-02-27T20:37:54Z", "content": "By Devika Krishna Kumar\r\nNEW YORK (Reuters) - Oil prices tumbled for a fifth day on Thursday to their lowest since January 2019, as further novel coronavirus cases outside China fanned fears that a pandemic could slow the global economy and erode demand for c… [+3465 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Blowout fear for FX markets as coronavirus stirs dormant vol trades", "description": "By Olga Cotaga LONDON (Reuters) - With this week's coronavirus-driven rout having shaken awake previously slumbering euro-dollar markets, the spotlight is back on the \"short volatility\" trades that some regulators fear could trigger a blowup on world markets.…", "url": "https://www.firstpost.com/business/blowout-fear-for-fx-markets-as-coronavirus-stirs-dormant-vol-trades-8095491.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/28/2020-02-27T190059Z_1_LYNXNPEG1Q1RD_RTROPTP_2_US-GLOBAL-FOREX.jpg", "publishedAt": "2020-02-27T20:37:32Z", "content": "By Olga Cotaga\r\nLONDON (Reuters) - With this week's coronavirus-driven rout having shaken awake previously slumbering euro-dollar markets, the spotlight is back on the \"short volatility\" trades that some regulators fear could trigger a blowup on world markets… [+5628 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": "Francois Aure", "title": "This Is Why the Dow Jones Just Crashed for a 4th Straight Day", "description": "The Dow Jones crashed for a fourth straight day on Thursday after Goldman Sachs revealed why Trump's reelection is in jeopardy. The post This Is Why the Dow Jones Just Crashed for a 4th Straight Day appeared first on CCN.com", "url": "https://www.ccn.com/this-is-why-the-dow-jones-just-crashed-for-a-4th-straight-day/", "urlToImage": "https://www.ccn.com/wp-content/uploads/2020/02/dow-jones-chart-trader-crash-reuters.jpg", "publishedAt": "2020-02-27T20:16:02Z", "content": "<ul><li>The Dow Jones crashed another 700 points on Thursday.</li><li>A brief Dow recovery was ended as California Governor Gavin Newsom announced 8,400 potential coronavirus cases are being monitored in the state.</li><li>Further spooking the stock market, G… [+4288 chars]"}, {"source": {"id": "msnbc", "name": "MSNBC"}, "author": "MSNBC.com", "title": "Markets plunge again amid coronavirus fears", "description": "The markets on Wall Street are rebounding from a steep drop of nearly 1,000 points. The Dow and S&P 500 are down for the sixth straight day, losing about half of the big gains made last year. NBC News’ Stephanie Ruhle reports from the New York Stock Exchange …", "url": "https://www.msnbc.com/ali-velshi/watch/markets-plunge-again-amid-coronavirus-fears-79556165754", "urlToImage": "https://media12.s-nbcnews.com/j/MSNBC/Components/Video/202002/n_velshi_stocks_plunge_b44_200227_1920x1080.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-27T21:02:24Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Caroline Hroncich", "title": "I survived swine flu as a teenager, and it taught me one crucial lesson about life during an epidemic: don't panic", "description": "I was diagnosed with swine flu during the 2009 pandemic, which killed 12,469 people in the US and between 151,700 and 575,400 people worldwide, according to the CDC. The swine flu generated a similar level of panic to what we're seeing with the coronavirus to…", "url": "https://www.businessinsider.com/what-having-swine-flu-taught-me-about-the-coronavirus-2020-2", "urlToImage": "https://i.insider.com/5e580e93fee23d0dee716e22?width=1200&format=jpeg", "publishedAt": "2020-02-27T20:50:51Z", "content": "\"You have swine flu\" were words that in 2009 would have struck fear into pretty much any American.\r\nI was diagnosed with the illness as a 16-year-old high-school sophomore in June of that year.\r\nThe swine flu, or H1N1 virus, was a pandemic that generated glob… [+4501 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Michelle Grattan", "title": "Coronavirus and climate are problems in need of a political message and Scott Morrison is hard at work", "description": "Coronavirus and climate are presenting the Government with two fast-moving targets in need of a response and Scott Morrison, a meister of the art of messaging, is hard at work, writes Michelle Grattan", "url": "https://www.abc.net.au/news/2020-02-28/coronavirus-and-climate-need-morrison-to-frame-political-message/12009416", "urlToImage": "https://www.abc.net.au/news/image/10191312-16x9-700x394.jpg", "publishedAt": "2020-02-27T21:09:08Z", "content": "Posted \r\nFebruary 28, 2020 08:09:08\r\nTwo issues are currently presenting the Morrison Government with fast-moving targets. \r\nOne is the fallout from the coronavirus, where the picture has been altering on a near-daily basis. \r\nThe other is very different the … [+6603 chars]"}, {"source": {"id": null, "name": "Macdailynews.com"}, "author": "MacDailyNews", "title": "Apple CEO Cook optimistic China is getting the coronavirus under control", "description": "In an interview with Susan Li for FOX Business, Apple CEO Tim Cook say he sees China is getting the coronavirus under control and how Apple is… The post Apple CEO Cook optimistic China is getting the coronavirus under control appeared first on MacDailyNews.", "url": "https://macdailynews.com/2020/02/27/apple-ceo-cook-optimistic-china-is-getting-the-coronavirus-under-control/", "urlToImage": "https://149359564.v2.pressablecdn.com/wp-content/uploads/2020/02/2002126_covid_19.jpg", "publishedAt": "2020-02-27T20:27:11Z", "content": "In an interview with Susan Li for FOX Business, Apple CEO Tim Cook say he sees China is getting the COVID-19 coronavirus under control and how Apple is managing product supply and production.It feels to me that, uh, China is getting, uh, the coronavirus under… [+1075 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Emergency Physicians and Emergency Nurses Need More Resources to Fight Coronavirus", "description": "Emergency Physicians and Emergency Nurses Need More Resources to Fight CoronavirusPR NewswireWASHINGTON, Feb. \"More can and should be done to minimize the risk of coronavirus in the United States,\" said William Jaquis, MD, FACEP, president of the American Col…", "url": "https://news.yahoo.com/emergency-physicians-emergency-nurses-more-203800388.html", "urlToImage": null, "publishedAt": "2020-02-27T20:38:00Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Facebook, Microsoft shelve conference plans as coronavirus fears spread", "description": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference due to fears over the coronavirus outbreak and Microsoft Corp followed suit by withdrawing from a gaming conference scheduled for next month. \"In place of the in-person …", "url": "https://www.firstpost.com/business/facebook-microsoft-shelve-conference-plans-as-coronavirus-fears-spread-8095471.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/28/2020-02-27T183535Z_1_LYNXNPEG1Q1OY_RTROPTP_2_EUROPE-PRIVACY-FACEBOOK.jpg", "publishedAt": "2020-02-27T20:36:45Z", "content": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference due to fears over the coronavirus outbreak and Microsoft Corp followed suit by withdrawing from a gaming conference scheduled for next month.\r\n\"In place of the in-person… [+1806 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "US Stocks Plunge 1,100-Plus Points as Coronavirus Fears Force Four-Day Dive", "description": "US stocks took another dive on Thursday, closing the day more than 1,100 points in the red as massive sell-offs continue over prolonged fears of the COVID-19 coronavirus’s effects on the global economy.", "url": "https://sputniknews.com/business/202002271078422776-us-stocks-plunge-1100-plus-points-as-coronavirus-fears-force-four-day-dive/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107109/98/1071099819.jpg", "publishedAt": "2020-02-27T21:00:07Z", "content": "US stocks took another dive on Thursday, closing the day more than 1,100 points in the red as massive sell-offs continue over prolonged fears of the COVID-19 coronaviruss effects on the global economy.The Dow Jones Industrial Average Index wrapped the day wit… [+3082 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Priyanka McCluskey", "title": "Hospital leaders prepare for possible surge in coronavirus patients", "description": "Boston hospitals are training workers, monitoring medical supplies, and readying rooms and beds in preparation for the possible spread of the new coronavirus — including the chance of a sudden spike in sick patients.", "url": "https://www.bostonglobe.com/2020/02/27/business/hospital-leaders-prepare-possible-surge-coronavirus-patients/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/t0RtgYJ-d0UTYouRcxIgAApGLsM=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/LIZDYQQNI4I6VNI5JO7YRLZ35U.jpg", "publishedAt": "2020-02-27T20:36:16Z", "content": "Boston hospitals are training workers, monitoring medical supplies, and readying rooms and beds in preparation for the possible spread of the new coronavirus including the chance of a sudden spike in sick patients.\r\nWere anticipating the possibility of a surg… [+3638 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Carmen Reinicke", "title": "Guggenheim's Scott Minerd says coronavirus is possibly the worst thing he's seen in his career — and that the Fed is powerless to stop the market fallout", "description": "Scott Minerd of Guggenheim called the coronavirus \"possibly the worst thing I've ever seen in my career\" in an interview with Bloomberg Television on Thursday. He also said that the Federal Reserve is \"fairly impotent\" to stop the market damage as \"lowering i…", "url": "https://markets.businessinsider.com/news/stocks/guggenheim-scott-minerd-coronavirus-calls-worst-thing-seen-fed-rates-2020-2-1028947647", "urlToImage": "https://images.markets.businessinsider.com/image/5e582b5cfee23d2f1c643e43-2048/2693744418792eb96205fk.jpg", "publishedAt": "2020-02-27T21:09:33Z", "content": "Milken Institute\r\n<ul><li>Scott Minerd of Guggenheim called the coronavirus \"possibly the worst thing I've ever seen in my career\" in an interview with Bloomberg Television on Thursday. </li><li>He also said that the Federal Reserve is \"fairly impotent\" to st… [+2390 chars]"}, {"source": {"id": null, "name": "Mymoneyblog.com"}, "author": "Jonathan Ping", "title": "Coronavirus Fears + Mortgage Rates at 8-Year Lows = Good Time To Refinance?", "description": "If you’re looking for some good news to distract you right now, check out refinancing your mortgage. In November 2018, the average 30-year mortgage rate was nearly 5%. Right now, you can find 30-year rates at around 3.25% to 3.375% with zero points. Mortgage …", "url": "https://www.mymoneyblog.com/mortgage-rate-refinance-2020.html", "urlToImage": "https://www.mymoneyblog.com/wordpress/wp-content/uploads/2020/02/refi2020b.gif", "publishedAt": "2020-02-27T20:20:36Z", "content": "If you’re looking for some good news to distract you right now, check out refinancing your mortgage. In November 2018, the average 30-year mortgage rate was nearly 5%. Right now, you can find 30-year rates at around 3.25% to 3.375% with zero points. Mortgage … [+1023 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. FDA says no medical device shortages due to virus outbreak", "description": "The U.S. Food and Drug Administration said on Thursday there were no reported shortages of medical devices within the country due to the ongoing coronavirus outbreak.", "url": "https://www.reuters.com/article/us-china-health-usa-fda-idUSKCN20L30B", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-27T20:44:56Z", "content": "(Reuters) - The U.S. Food and Drug Administration said on Thursday there were no reported shortages of medical devices within the country due to the ongoing coronavirus outbreak. \r\nThe FDA said it had contacted 63 companies, having 72 manufacturing facilities… [+202 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Man Returned From Iran With Coronavirus Disease Symptoms Quarantined in Vienna - Reports", "description": "VIENNA (Sputnik) - A man with coronavirus disease symptoms who has recently returned from infection-hit Iran to Austria has been hospitalized in Vienna, media reported on Thursday.", "url": "https://sputniknews.com/world/202002271078422747-man-returned-from-iran-with-coronavirus-disease-symptoms-quarantined-in-vienna---reports/", "urlToImage": "https://cdn3.img.sputniknews.com/images/107819/36/1078193629.jpg", "publishedAt": "2020-02-27T20:54:42Z", "content": null}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Annie Karni, Michael Crowley, Maggie Haberman", "title": "For Trump, coronavirus could be a moment of reckoning about his credibility", "description": "As the coronavirus begins to threaten the United States, President Trump could face a moment of reckoning. A calm and orderly response during an epidemic requires that the president be a reliable public messenger.", "url": "https://www.bostonglobe.com/news/nation/2020/02/27/for-trump-coronavirus-could-moment-reckoning-about-his-credibility/7fNS7mHm95sC7KUDfS4XtK/story.html", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/8iKsc5XQcDXgc0a7yU8RRn1mlD8=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/ZSNSUWSZSYI6VD3V3UEVD54RKI.jpg", "publishedAt": "2020-02-27T20:54:57Z", "content": "I think the president has a unique opportunity to dispel fears and calm the situation if people believe he is telling the truth, said Kathleen Sebelius, who served as secretary of health and human services in the Obama administration. And I think thats really… [+4356 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Curtis Tate, USA TODAY", "title": "What travel insurance covers for coronavirus — and what it doesn't", "description": "The most important thing to remember is that standard travel insurance does not cover you if you decide not to travel because of the outbreak.", "url": "https://www.usatoday.com/story/travel/2020/02/27/coronavirus-travel-insurance-what-covers-and-what-doesnt/4884216002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/26/USAT/ed2177be-c0a1-40d9-bb01-88eaa0add396-AP_Italy_Alitalia_Etihad.JPG?crop=3118,1754,x0,y247&width=1600&height=800&fit=bounds", "publishedAt": "2020-02-27T21:05:35Z", "content": "As the coronavirus continues to spread, many fear it will soon rise to the level of a pandemic. What is a pandemic - and are we prepared to fight one?\r\nUSA TODAY\r\nAmericans planning to travel abroad may be looking nervously as coronavirus spreads to multiple … [+4730 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Caroline Bologna", "title": "What To Do If You're Anxious About Coronavirus", "description": "Here are some ways to cope if you feel weighed down by COVID-19 concerns.", "url": "https://www.huffpost.com/entry/coronavirus-anxiety-what-to-do_l_5e55aaaac5b649ec432f152d", "urlToImage": "https://img.huffingtonpost.com/asset/5e5820d5260000cc11b5fe18.jpeg?cache=v0DFetua5W&ops=1200_630", "publishedAt": "2020-02-27T21:02:57Z", "content": "With the rise in reported cases of the new coronavirus around the world, many people are feeling anxious and afraid about a looming pandemic. For those in China, the disease’s epicenter, its toll on mental health is well-documented. But even in areas not yet … [+5700 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Curtis Tate, USA TODAY", "title": "What travel insurance covers for coronavirus — and what it doesn't", "description": "The most important thing to remember is that standard travel insurance does not cover you if you decide not to travel because of the outbreak.", "url": "https://www.usatoday.com/story/travel/news/2020/02/27/coronavirus-travel-insurance-what-covers-and-what-doesnt/4884216002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/27/USAT/e582d7ca-5196-42bf-b715-1898f6acbfc6-Day_in_pictures_Feb._27_2020_03.JPG?crop=5555,3125,x0,y282&width=3200&height=1680&fit=bounds", "publishedAt": "2020-02-27T21:07:18Z", "content": "As the coronavirus continues to spread, many fear it will soon rise to the level of a pandemic. What is a pandemic - and are we prepared to fight one?\r\nUSA TODAY\r\nAmericans planning to travel abroad may be looking nervously as coronavirus spreads to multiple … [+4735 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Facebook cancels annual developer conference amid coronavirus fears", "description": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference, F8 2020, amid rising concerns of the coronavirus outbreak. \"In place of the in-person F8 event, we're planning other ways for our community to get together through a co…", "url": "https://www.firstpost.com/business/facebook-cancels-annual-developer-conference-amid-coronavirus-fears-8095481.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/02-2020/28/2020-02-27T183535Z_1_LYNXNPEG1Q1OY_RTROPTP_2_EUROPE-PRIVACY-FACEBOOK.jpg", "publishedAt": "2020-02-27T20:37:09Z", "content": "(Reuters) - Facebook Inc said on Thursday it would cancel its annual developer conference, F8 2020, amid rising concerns of the coronavirus outbreak.\r\n\"In place of the in-person F8 event, we're planning other ways for our community to get together through a c… [+632 chars]"}]