[{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: South Korea sees its largest rise in coronavirus cases", "description": "The country has almost 600 new confirmed coronavirus cases, bringing the total to 2,931.", "url": "https://www.bbc.co.uk/news/world-51685908", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0F62/production/_111083930_gettyimages-1201959519.jpg", "publishedAt": "2020-02-29T03:33:50Z", "content": "Image copyrightGetty ImagesImage caption\r\n The outbreak has been linked to the south-eastern city of Daegu\r\nSouth Korea has recorded its largest rise in coronavirus infections in a single day, with 594 new cases confirmed on Friday.\r\nThe increase brings the t… [+4145 chars]"}, {"source": {"id": null, "name": "Kwch.com"}, "author": "KWCH", "title": "Oregon has 1st presumptive coronavirus case: elementary school employee - KWCH", "description": "Oregon has 1st presumptive coronavirus case: elementary school employee KWCH Oregon coronavirus patient is grade-school employee; school closed for deep cleaning, officials say Fox News Oregon coronavirus case shuts Lake Oswego elementary school OregonLive Ma…", "url": "https://www.kwch.com/content/news/Oregon-has-1st-coronavirus-case-elementary-school-employee-568317411.html", "urlToImage": "https://media.graytvinc.com/images/0228_Coronavirus_MGN.jpg", "publishedAt": "2020-02-29T03:35:08Z", "content": "SALEM, Ore. (AP) Oregon's first presumptive corinavirus case emerged on Friday. The infected person worked at an elementary school in the Portland area, which will be closed for three days. \r\nThe Lake Oswego School District sent robocalls to parents saying th… [+1372 chars]"}, {"source": {"id": null, "name": "Oregon.gov"}, "author": null, "title": "Oregon has first confirmed Covid-19 case", "description": "Learn more about novel Coronavirus (COVID-19), Enterovirus D68, H7N9 Influenza A and  Middle East Respiratory Syndrome (MERS-CoV)", "url": "https://www.oregon.gov/oha/PH/DISEASESCONDITIONS/DISEASESAZ/Pages/emerging-respiratory-infections.aspx", "urlToImage": null, "publishedAt": "2020-02-29T03:51:02Z", "content": "Information from CDC\r\nThe U.S. Centers for Disease Control and Prevention (CDC) provides information about novel coronavirus disease, signs and symptoms, how to protect yourself and when to seek care, along with the latest news from CDC.\r\nCDC Coronavirus Webs… [+10659 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Sarah Ruiz-Grossman", "title": "Trump Touts Border Wall In Face Of Coronavirus: ‘Border Security Is Health Security’", "description": "Health experts told HuffPost that a wall at the southern U.S. border is “not going to keep [the virus] out.”", "url": "https://www.huffpost.com/entry/trump-border-wall-coronavirus-rally_n_5e59c9d8c5b601022110dd75", "urlToImage": "https://img.huffingtonpost.com/asset/5e59ca4a230000c00bdddc39.jpeg?cache=1sUO8l4KO4&ops=1200_630", "publishedAt": "2020-02-29T03:39:50Z", "content": "President Donald Trump boasted about the wall at the U.S.-Mexico border as he spoke about the threat of the new coronavirus on Friday, saying at a rally: “Border security is also health security.” \r\nHealth experts told HuffPost a wall at the southern border i… [+4041 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "William Hughes on News, shared by William Hughes to The A.V. Club", "title": "Hey kids, it's the coronavirus cancellation round-up!", "description": "Hey folks: It’s that time once again, as we do our dangedest here at The A.V. Club to give you a quick heads-up about all the exciting events, concerts, and other gatherings of warm and friendly transmission vectors that won’t be happening any time soon, on a…", "url": "https://news.avclub.com/hey-kids-its-the-coronavirus-cancellation-round-up-1841986122", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qcgbwmrakdrgdbbvgrln.jpg", "publishedAt": "2020-02-29T03:46:00Z", "content": "Hey folks: Its that time once again, as we do our dangedest here at The A.V. Club to give you a quick heads-up about all the exciting events, concerts, and other gatherings of warm and friendly transmission vectors that wont be happening any time soon, on acc… [+1666 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "RAW: Oregon announces first presumed case of coronavirus - KGW News", "description": "RAW: Oregon announces first presumed case of coronavirus KGW News Oregon coronavirus patient is grade-school employee; school closed for deep cleaning, officials say Fox News OHA declares state’s 1st ‘presumptive’ coronavirus case KOIN.com Health officials an…", "url": "https://www.youtube.com/watch?v=bY3A-gfUHV8", "urlToImage": "https://i.ytimg.com/vi/bY3A-gfUHV8/hqdefault.jpg", "publishedAt": "2020-02-29T03:15:49Z", "content": "Oregon has its first presumed case of novel coronavirus, also known as COVID-19.\r\nThe person who is believed to be infected lives in Washington County and is an employee at Forest Hills Elementary School in Lake Oswego, according to Oregon Health Authority.\r\n… [+418 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: U.S. braces for rise in COVID-19 cases as WHO raises threat to \"highest level\" - Global News", "description": "Coronavirus outbreak: U.S. braces for rise in COVID-19 cases as WHO raises threat to \"highest level\" Global News Coronavirus: Live Coverage and Updates The New York Times Coronavirus: Worst-hit countries boost containment efforts - BBC News BBC News Liberty V…", "url": "https://www.youtube.com/watch?v=F_Jq7ItdHtA", "urlToImage": "https://i.ytimg.com/vi/F_Jq7ItdHtA/maxresdefault.jpg", "publishedAt": "2020-02-29T03:17:01Z", "content": null}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Lydia Moynihan", "title": "NYSE, Wall Street firms test for coronavirus preparedness - Fox Business", "description": "Wall Street is preparing for the worst that the coronavirus can bring it", "url": "https://www.foxbusiness.com/economy/market-volatility-preparedness", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/02/0/0/Markets-coronavirus.jpg?ve=1&tl=1", "publishedAt": "2020-02-29T03:12:20Z", "content": "Many on Wall Street believe the market’s volatility from the coronavirus contagion is overblown, but that doesn’t mean the big firms are taking any chances. FOX Business has learned every major financial firm is putting contingency work plans in place should … [+5552 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Amazon warns not to overcharge for this product", "description": "The coronavirus epidemic has reached alarming levels, not just in China but all over the world. Cases have been reported from several parts of the world, including Italy, South Korea and Thailand. Now, one of the precautions that people can take — or rather a…", "url": "https://www.gadgetsnow.com/tech-news/amazon-is-warning-sellers-not-to-overcharge-for-this-product/articleshow/74330868.cms", "urlToImage": "https://static.toiimg.com/photo/74330866.cms", "publishedAt": "2020-02-29T03:51:52Z", "content": null}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Tracy Connor", "title": "Oregon School Employee Tests Positive for Coronavirus", "description": "Kena Betancur/Getty An Oregon elementary school employee in Clackamas County has tested positive for the new coronavirus and may have exposed other people to it at work, health officials said Friday night. The announcement raised two key questions: how the pa…", "url": "https://www.thedailybeast.com/oregon-school-employee-tests-positive-for-coronavirus", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1566,w_2785,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1582945535/GettyImages-1204040227_guvxgh", "publishedAt": "2020-02-29T03:13:36Z", "content": "An Oregon elementary school employee in Clackamas County has tested positive for the new coronavirus and may have exposed other people to it at work, health officials said Friday night.\r\nThe announcement raised two key questions: how the patient contracted th… [+1006 chars]"}, {"source": {"id": null, "name": "Q13fox.com"}, "author": "https://www.facebook.com/Q13FOX", "title": "Oregon officials announce state’s 1st presumed coronavirus case: An elementary school employee - Q13 News Seattle", "description": "Oregon officials announce state’s 1st presumed coronavirus case: An elementary school employee Q13 News Seattle Oregon coronavirus patient is grade-school employee; school closed for deep cleaning, officials say Fox News Oregon Health Officials Confirm First …", "url": "https://q13fox.com/2020/02/28/oregon-officials-announce-states-1st-presumed-coronavirus-case-an-elementary-school-employee/", "urlToImage": "https://tribkcpq.files.wordpress.com/2020/02/hypatia-h_be0e3f2f5b557c02ce7daf9bcc112208-h_e2f4df6c025f8efe75a1fa25b82b5166.jpg?quality=85&strip=all&w=1200", "publishedAt": "2020-02-29T03:19:00Z", "content": "SALEM, Ore.  Oregon’s first presumed coronavirus case emerged on Friday. The infected person worked at an elementary school in the Portland area, which will be closed for three days, officials said.\r\nThe Lake Oswego School District sent robocalls to parents s… [+789 chars]"}, {"source": {"id": null, "name": "Thedenverchannel.com"}, "author": "", "title": "Oregon confirms case of coronavirus with no known travel connection - The Denver Channel", "description": "Oregon confirms case of coronavirus with no known travel connection The Denver Channel Oregon coronavirus patient is grade-school employee; school closed for deep cleaning, officials say Fox News Oregon reports its first coronavirus case. Here’s the latest or…", "url": "https://www.thedenverchannel.com/news/coronavirus/oregon-confirms-case-of-coronavirus-with-no-known-travel-connection", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/945549a/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fa6%2F89%2Fbfabdef044fcb2c45c3cabf23711%2Fcoronavirus-1.jpg", "publishedAt": "2020-02-29T03:30:00Z", "content": "Oregon officials confirmed on Friday a case of coronavirus from someone who has no known travel exposure to the disease.\r\nThe announcement came as two similar cases in California have been confirmed in the last 24 hours. \r\nAdding to the concern is that this p… [+581 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Trish Regan", "title": "Trish Regan: Democrats politicize coronavirus and blame Trump - Fox Business", "description": "The swine flu crisis 10 years ago is a perfect example of why the government shouldn't have sole control over medical resources.", "url": "https://www.foxbusiness.com/politics/trish-regan-democrats-politicize-coronavirus-and-blame-trump", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/12/0/0/854081161001_6100510930001_6100511029001-vs.jpg?ve=1&tl=1", "publishedAt": "2020-02-29T03:13:50Z", "content": "Another whistleblower? Really? Is Adam Schiff on the case? As global markets plummet and the world remains on edge, the Democrats are sticking to their political playbook: Coronavirus is all President Trump’s fault.\r\nA whistleblower from the Health and Human … [+6194 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Slovakia election: Double murder haunts voters", "description": "The murder of journalist Jan Kuciak and his fiancée convulsed Slovak politics.", "url": "https://www.bbc.co.uk/news/world-europe-51657803", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p061dv6x.jpg", "publishedAt": "2020-02-29T03:51:18Z", "content": "Media captionTens of thousands march in Slovakia calling for early elections in 2018\r\nSlovakia votes on Saturday in its first general election since an investigative journalist and his fiancée were murdered in 2018.\r\nThe shooting of Jan Kuciak and Martina Kus… [+5425 chars]"}, {"source": {"id": null, "name": "Kwwl.com"}, "author": "Associated Press", "title": "Oregon has 1st coronavirus case: elementary school employee - kwwl.com", "description": "Oregon has 1st coronavirus case: elementary school employee kwwl.com Oregon coronavirus patient lives in Washington County, works at Lake Oswego elementary school OregonLive OHA declares state’s 1st ‘presumptive’ coronavirus case KOIN.com First Coronavirus Ca…", "url": "https://kwwl.com/2020/02/28/oregon-has-1st-coronavirus-case-elementary-school-employee/", "urlToImage": "https://quincy-network.s3.ca-central-1.amazonaws.com/wp-content/uploads/sites/6/2020/02/CORONAVIRUS-2.jpg", "publishedAt": "2020-02-29T03:19:30Z", "content": "SALEM, Ore. (AP) -- Oregon's first coronavirus case emerged on Friday. The infected person worked at an elementary school in the Portland area, which will be closed for three days. \r\nThe Lake Oswego School District sent robocalls to parents saying that Forest… [+462 chars]"}, {"source": {"id": "new-york-magazine", "name": "New York Magazine"}, "author": "Chas Danner", "title": "Second Coronavirus Case of Unknown Origin Confirmed in Northern California", "description": "The coronavirus appears to be spreading among people in three separate communities. The new cases were confirmed Friday in  California and Oregon.", "url": "http://nymag.com/intelligencer/2020/02/two-new-us-coronavirus-cases-unknown-origin-california-oregon.html", "urlToImage": "https://pixel.nymag.com/imgs/daily/intelligencer/2020/02/28/28-santa-clara-county-public-health-announcement-coronavirus.w1200.h630.jpg", "publishedAt": "2020-02-29T03:14:25Z", "content": "A woman in Santa Clara County in Northern California and a resident in northwest Oregon have become the second and third confirmed coronavirus cases with in the U.S. with no known link to any other outbreak or infected person  indicating there is likely to be… [+3731 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Reporting of coronavirus cases uneven as virus spreads globally - CBC News: The National", "description": "Reporting of coronavirus cases uneven as virus spreads globally CBC News: The National Second Unexplained Coronavirus Case Found in California: Live Coverage The New York Times Coronavirus live updates: Fears fuel sell-off, new California case, United postpon…", "url": "https://www.youtube.com/watch?v=RcVZ8Fg4ifo", "urlToImage": "https://i.ytimg.com/vi/RcVZ8Fg4ifo/maxresdefault.jpg", "publishedAt": "2020-02-29T03:39:10Z", "content": null}, {"source": {"id": null, "name": "Ksltv.com"}, "author": "", "title": "St. George Man Diagnosed With Coronavirus Outside Utah Being Treated In Murray - ksltv.com", "description": "St. George Man Diagnosed With Coronavirus Outside Utah Being Treated In Murray ksltv.com Utah preparing for COVID-19 outbreak FOX 13 News Utah Opinion: A simple coronavirus PSA Deseret News St. George man being treated for coronavirus at Utah's Intermountain …", "url": "https://ksltv.com/432138/coronavirus-utah-treatment-mark-jorgensen-st-george/?", "urlToImage": "https://ksltv.com/wp-content/uploads/2020/02/EP_EpmfUcAAEPJk.jpg", "publishedAt": "2020-02-29T03:33:45Z", "content": "MURRAY, Utah – Officials with the Centers for Disease Control and Prevention have requested that Intermountain Healthcare provide care for St. George resident Mark Jorgensen, who was diagnosed with COVID-19 outside the state of Utah.\r\nJorgensen will be treate… [+4153 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Novel coronavirus patient from Solano County shares how it feels to be infected - KGO-TV", "description": "Novel coronavirus patient from Solano County shares how it feels to be infected KGO-TV Coronavirus outbreak: U.S. braces for rise in COVID-19 cases as WHO raises threat to \"highest level\" Global News New Unexplained Cases Reported in Oregon and California The…", "url": "https://abc7news.com/5974970", "urlToImage": "https://cdn.abcotvs.com/dip/images/5949421_021920-kgo-travis-air-force-base-sky7-img_Image_11-01-37,12.jpg?w=1600", "publishedAt": "2020-02-29T03:45:08Z", "content": "SAN FRANCISCO (KGO) -- Solano County is now responsible for the care of two additional people with the Coronavirus. Both live in the county, and until Friday was the responsibility of the Centers for Disease Control.The two patients were aboard the Diamond Pr… [+1910 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus fears empty store shelves of toilet paper, bottled water, masks as shoppers stock up", "description": "With concerns of the coronavirus growing into a pandemic and shoppers stocking up, experts say consumers will find more empty shelves by mid-April.", "url": "https://news.yahoo.com/coronavirus-fears-empty-store-shelves-035137885.html", "urlToImage": null, "publishedAt": "2020-02-29T04:01:16Z", "content": null}, {"source": {"id": null, "name": "Wcvb.com"}, "author": null, "title": "Massachusetts state health lab given approval to test for coronavirus - WCVB Boston", "description": "Massachusetts state health lab given approval to test for coronavirus WCVB Boston Coronavirus outbreak: U.S. braces for rise in COVID-19 cases as WHO raises threat to \"highest level\" Global News What is COVID-19 and what should a person with symptoms do? The …", "url": "https://www.wcvb.com/article/massachusetts-state-health-lab-given-approval-to-test-for-coronavirus/31162654", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/coronavirus-file-image-0124-1580394844.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-02-29T03:42:00Z", "content": "BOSTON —The U.S. Food and Drug Administration has given approval to the Massachusetts State Public Health Laboratory to begin testing patients for COVID-19, the state health department announced Friday. \r\nThe approval means any clinicians who have patients th… [+846 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New coronvirus case in Oregon is of unknown origin: Oregon Health Authority", "description": "The latest confirmed case of Coronavirus in Oregon is of unknown origin said Oregon health authority when it declared its first confirmed presumptive case of novel coronavirus on Friday.", "url": "https://www.reuters.com/article/us-china-health-oregonoregon-idUSKBN20N05H", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-02-29T03:37:05Z", "content": "(Reuters) - The latest confirmed case of Coronavirus in Oregon is of unknown origin said Oregon health authority when it declared its first confirmed presumptive case of novel coronavirus on Friday. \r\nAccording to the statement, the infected individual identi… [+415 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Noel Randewich", "title": "Think the S&P 500 is in bad shape? Its components look worse", "description": "Wall Street's worst week since 2008, sparked by fears about the fast-spreading coronavirus, has left almost half of the S&P 500's stocks in bear market territory, just nine days after the leading benchmark closed at a record high. With the world preparing for…", "url": "https://finance.yahoo.com/news/think-p-500-bad-shape-033047964.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rWjugoPdqPbBm4R1Y8Z4HQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/pmCAiI9ZSqs7rALv9Cc_5Q--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/d17ee35958ab1d29740f00e2714843ac", "publishedAt": "2020-02-29T03:30:47Z", "content": "By Noel Randewich\r\nSAN FRANCISCO (Reuters) - Wall Street's worst week since 2008, sparked by fears about the fast-spreading coronavirus, has left almost half of the S&amp;P 500's stocks in bear market territory, just nine days after the leading benchmark clos… [+2371 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "The Associated Press", "title": "US postpones southeast Asian leaders’ March meeting due to coronavirus spread, say reports", "description": "The United States has postponed a meeting of leaders of southeast Asian nations that was set for Las Vegas in mid-March due to the spread of the coronavirus, a senior Trump administration official said Friday The post US postpones southeast Asian leaders’ Mar…", "url": "https://www.firstpost.com/india/us-postpones-southeast-asian-leaders-march-meeting-due-to-coronavirus-spread-say-reports-8100351.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/Trump-AP-social.jpg", "publishedAt": "2020-02-29T03:41:57Z", "content": "Washington: The United States has postponed a meeting of leaders of southeast Asian nations that was set for Las Vegas in mid-March due to the spread of the coronavirus, a senior Trump administration official said Friday.\r\nFile image of US president Donald Tr… [+1220 chars]"}, {"source": {"id": null, "name": "Checkyourfact.com"}, "author": "Elias Atienza", "title": "FACT CHECK: Did A Survey Find 38% Of Americans Won’t Drink Corona Beer Over Coronavirus Concerns?", "description": "The Daily Mail published a headline claiming a survey found 38% of Americans won’t drink Corona as \"coronavirus fear sparks Corona BEER boycott.\"", "url": "https://checkyourfact.com/2020/02/28/fact-check-survey-38-percent-americans-corona-beer-coronavirus/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/shutterstock_1383580457-e1582916214767.jpg", "publishedAt": "2020-02-29T03:42:28Z", "content": "The Daily Mail published an article Feb. 28 with the headline claiming a survey found 38 percent of Americans won’t drink Corona beer as “coronavirus fear sparks Corona BEER boycott.”\r\n“More than 38 percent of American say they will no longer drink Corona bee… [+3056 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "US Democratic presidential contenders Bernie Sanders, Joe Biden, Mike Bloomberg blast Donald Trump over handling of coronavirus outbreak", "description": "US Democratic presidential contenders blasted the Republican Trump administration’s handling of the coronavirus outbreak on the eve of South Carolina’s fourth-in-the-nation nominating contest on Saturday. The post US Democratic presidential contenders Bernie …", "url": "https://www.firstpost.com/world/us-democratic-presidential-contenders-bernie-sanders-joe-biden-mike-bloomberg-blast-donald-trump-over-handling-of-coronavirus-outbreak-8100391.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/02/screencapture-headtopics-images-2020-2-11-ap-china-s-daily-death-toll-from-virus-tops-100-for-first-time-1227031986704912390-webp-2020-02-11-08_52_44.jpg", "publishedAt": "2020-02-29T03:19:30Z", "content": "Sumter: US Democratic presidential contenders blasted the Republican Trump administrations handling of the coronavirus outbreak on the eve of South Carolinas fourth-in-the-nation nominating contest on Saturday.\r\nFormer Vice President Joe Biden is banking on t… [+5856 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump calls coronavirus Democrats' 'new hoax' (Lauren Egan/NBC News)", "description": "Lauren Egan / NBC News : Trump calls coronavirus Democrats' ‘new hoax’ — “Now the Democrats are politicizing the coronavirus,” Trump said at a rally on Friday. — NORTH CHARLESTON, S.C. — President Donald Trump accused Democrats of “politicizing” the deadly co…", "url": "https://www.memeorandum.com/200228/p146", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_09/3249561/200228-donald-trump-maga-rally-south-carolina-ac-732p_f6c39d434bd113524795711dc481a0f6.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-02-29T03:20:05Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Josh Feldman", "title": "Bill Maher Panel Gets Heated Over Trump Coronavirus Response: ‘We’re Not Rooting for Failure!’", "description": "Bill Maher tonight got heated with Buck Sexton over President Donald Trump's response to coronavirus, with Maher saying, \"I think the coronavirus is going to change people's views of Donald Trump, finally. Not for the better.\"", "url": "https://www.mediaite.com/tv/bill-maher-panel-gets-heated-over-trump-coronavirus-response-were-not-rooting-for-failure/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/02/maher-1.jpg", "publishedAt": "2020-02-29T04:02:29Z", "content": "Bill Maher tonight got heated with Buck Sexton over President Donald Trump’s response to coronavirus, with Maher saying, “I think the coronavirus is going to change people’s views of Donald Trump, finally. Not for the better.”\r\nSexton said this should be an i… [+1205 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Michelle Nichols", "title": "U.N. chief recommends ministers, diplomats skip meeting due to coronavirus risks: letter", "description": "U.N. Secretary-General Antonio Guterres has recommended that ministers and diplomats skip a meeting in New York next month of the Commission on the Status of Women due to the coronavirus outbreak, according to a letter seen by Reuters on Friday. \"He also stro…", "url": "https://news.yahoo.com/u-n-chief-recommends-ministers-040321769.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/PVwz37qy.c1DAUu24qCuig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuOA--/https://s.yimg.com/uu/api/res/1.2/mL29utaAPrUjpBxrYvG9RQ--~B/aD01MzM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/302f0dbfabe7e0cb00b1c2d09e57a9ce", "publishedAt": "2020-02-29T04:03:21Z", "content": "By Michelle Nichols\r\nWASHINGTON (Reuters) - U.N. Secretary-General Antonio Guterres has recommended that ministers and diplomats skip a meeting in New York next month of the Commission on the Status of Women due to the coronavirus outbreak, according to a let… [+1420 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Andrew Selsky", "title": "Oregon has 1st coronavirus case: elementary school employee", "description": "Oregon's first corinavirus case emerged on Friday, and the infected person worked at an elementary school in the Portland area, which will be temporarily closed, authorities said.", "url": "https://www.bostonglobe.com/2020/02/29/nation/oregon-has-1st-coronavirus-case-elementary-school-employee/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/TmnDoIIc8BsNUenexRO3v4y0yqs=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/L5PSGTVG7JGJJPXSQO5VHCPDWE.jpg", "publishedAt": "2020-02-29T03:15:30Z", "content": "Health authorities planned to spend the weekend scrambling to find everyone the unidentified person, who has been hospitalized, had been in contact with.\r\nHours before the case emerged, the state ramped up efforts to combat an outbreak amid potential challeng… [+3227 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Dominiq R.", "title": "Coronavirus Detainee Coughs On Daughter During Interview", "description": "An American citizen who was quarantined due to the coronavirus coughed on his daughter during a Fox News interview. https://www.hotnewhiphop.com/coronavirus-detainee-coughs-on-daughter-during-interview-news.105057.html", "url": "https://www.hotnewhiphop.com/coronavirus-detainee-coughs-on-daughter-during-interview-news.105057.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1582948651_3e2f0384540ebfe0fc09e066e6104f9b.jpg/11c8a657769cd12545923947360bad3d/1582948651_a9b90c2079045663d56bbdcaa93636ad.jpg", "publishedAt": "2020-02-29T04:09:51Z", "content": "A Pennsylvania native who was recently quarantined and detained at a military base after returning from China was interviewed on Fox News, but couldn't help himself from coughing on his toddler daughter. The man by the name of Frank Wucinski, and his three-ye… [+1814 chars]"}, {"source": {"id": null, "name": "Kidsactivitiesblog.com"}, "author": "Brittanie", "title": "The Hand Washing Trick That Can Help Protect Your Kids Against Coronavirus", "description": "It’s cold and flu season and now with Coronavirus cases on the rise, it’s only a matter of time before it hits someone near us. That also means it’s more important now than EVER to teach your kids how to wash their hands the right way. In fact, the CDC says t…", "url": "https://kidsactivitiesblog.com/134975/the-hand-washing-trick-protect-against-coronavirus/", "urlToImage": "https://kidsactivitiesblog.com/wp-content/uploads/2020/02/adult-child-cooperation-daylight-1097496-1024x683.jpg", "publishedAt": "2020-02-29T03:24:34Z", "content": "February 28, 2020 by BrittanieLeave a Comment\r\nIt’s cold and flu season and now with Coronavirus cases on the rise, it’s only a matter of time before it hits someone near us. That also means it’s more important now than EVER to teach your kids how to wash the… [+1970 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump Didn't Just Botch the Coronavirus Response. He Enabled Its Spread. (Michael Daly/The Daily Beast)", "description": "Michael Daly / The Daily Beast : Trump Didn't Just Botch the Coronavirus Response. He Enabled Its Spread. — Thanks to our president, not even a thousand miles of border wall can keep out what may be already spreading amongst us. — Even as China was announcing…", "url": "https://www.memeorandum.com/200228/p152", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_779,w_1384,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1582865358/200227-daly-trump-cornavierus-tease_imtdfp", "publishedAt": "2020-02-29T04:05:06Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "How Iran Became a New Epicenter of the Coronavirus Outbreak (Robin Wright/New Yorker)", "description": "Robin Wright / New Yorker : How Iran Became a New Epicenter of the Coronavirus Outbreak — Iran's deputy health minister, Iraj Harirchi, was pale and drenched in sweat during a press conference on Monday as he told reporters that the Islamic Republic had “almo…", "url": "https://www.memeorandum.com/200228/p149", "urlToImage": "https://media.newyorker.com/photos/5e59447d53a7e200088ad478/16:9/w_1280,c_limit/Wright-CoronavirusinIran-Primary.jpg", "publishedAt": "2020-02-29T03:40:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Nick Miroff", "title": "DHS employee went to work in Newark after China travel, in violation of coronavirus quarantine period", "description": "A Department of Homeland Security employee who returned from travel to China was told by her supervisor to report to her workplace in early February in apparent violation of a mandatory 14-day coronavirus quarantine period, according to complaints filed Frida…", "url": "https://www.bostonglobe.com/2020/02/29/nation/dhs-employee-went-work-newark-after-china-travel-violation-coronavirus-quarantine-period/", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/kOKlz8j4Zpsaap-9hYc1Fk7FB3E=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/UFTSNRMWT5HDNK4BEMW564LKBE.jpg", "publishedAt": "2020-02-29T03:27:38Z", "content": "A Department of Homeland Security employee who returned from travel to China was told by her supervisor to report to her workplace in early February in apparent violation of a mandatory 14-day coronavirus quarantine period, according to complaints filed Frida… [+2344 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Oregon coronavirus case shuts Lake Oswego elementary school (Fedor Zarkhin/Oregonian)", "description": "Fedor Zarkhin / Oregonian : Oregon coronavirus case shuts Lake Oswego elementary school — A Washington County adult is sick with the first presumptive case of the new coronavirus in the state, Oregon health officials said Friday. — The case needs to be confir…", "url": "https://www.memeorandum.com/200228/p147", "urlToImage": "https://www.oregonlive.com/resizer/sCTSWShks4kVSCELrC06vy_WRiY=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/N2RRLC55YNC6XPRWBT5MXG4SRQ.jpg", "publishedAt": "2020-02-29T03:25:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus fears empty store shelves of toilet paper, bottled water, masks as shoppers stock up", "description": "With concerns of the coronavirus growing into a pandemic and shoppers stocking up, experts say consumers will find more empty shelves by mid-April.", "url": "https://finance.yahoo.com/news/coronavirus-fears-empty-store-shelves-035137885.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Iy8fzyuvUryyWbd11quidQ--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/7db0082d639c351c605b30c8e11d53b1", "publishedAt": "2020-02-29T04:01:16Z", "content": "On Thursday afternoon when Ryan Ozawa hit the Iwilei Costco next door to his office in Hawaii, he ran straight into a long line of carts stretching the length of the store as shoppers waited for toilet paper and paper towels.\r\nCostco employees were limiting s… [+4017 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Coronavirus hammers China's February economic activity: Data", "description": "BEIJING: China's manufacturing activity fell to its lowest level on record in February as official data on Saturday (Feb 29) confirmed the massive damage the deadly coronavirus epidemic has caused to the world's second-largest economy. The announcement comes …", "url": "https://www.channelnewsasia.com/news/business/coronavirus-hammers-china-february-economic-activity-data-12484908", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12484626/16x9/991/557/d52a8c87918f0720854a88b0d87a7913/qI/china-s-economy-has-been-battered-by-the-coronavirus-outbreak-1582941219806-2.jpg", "publishedAt": "2020-02-29T03:30:37Z", "content": "BEIJING: China's manufacturing activity fell to its lowest level on record in February as official data on Saturday (Feb 29) confirmed the massive damage the deadly coronavirus epidemic has caused to the world's second-largest economy.\r\nThe announcement comes… [+2255 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Novel Coronavirus Death Toll in Mainland China Rises to 2,835", "description": "BEIJING (Sputnik) - The death toll from the novel coronavirus disease (COVID-19) in mainland China has risen by 47 to 2,835, the number of confirmed cases has increased by 427 to 79,251, the state health committee said Saturday.", "url": "https://sputniknews.com/asia/202002291078436028-novel-coronavirus-death-toll-in-mainland-china-rises-to-2835/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107832/01/1078320147.jpg", "publishedAt": "2020-02-29T04:00:43Z", "content": null}, {"source": {"id": null, "name": "Iphoneincanada.ca"}, "author": "Gary Ng", "title": "GDC 2020 in San Francisco Cancelled Over Coronavirus Concerns", "description": "The Game Developers Conference has been cancelled for March, due to coronavirus concerns.", "url": "https://www.iphoneincanada.ca/news/gdc-2020-san-francisco-cancelled-coronavirus/", "urlToImage": "https://cdn.iphoneincanada.ca/wp-content/uploads/2020/02/gamer-developers-conference.jpg", "publishedAt": "2020-02-29T03:37:02Z", "content": "The annual Game Developers Conference (GDC), set to take place from March 16-20 in San Francisco, California, has been postponed. The world’s largest professional gaming conference brings together the industrys biggest companies to announce new technologies a… [+1736 chars]"}, {"source": {"id": null, "name": "Malaysiakini.com"}, "author": "Reuters", "title": "How long can coronavirus survive on surfaces?", "description": "Similar viruses can remain infectious on inanimate surfaces for up to nine days at room temperature.", "url": "https://www.malaysiakini.com/news/512657", "urlToImage": "https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2020/02/861571dc25c8b0eb09d4f82c2e773f33.jpg", "publishedAt": "2020-02-29T04:02:24Z", "content": "As a new coronavirus spreads quickly around the world, US health officials say they are aggressively assessing how long it can survive on surfaces to better understand the risk of transmission.\r\nBased on what is known about similar coronaviruses, disease expe… [+2369 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Americans who believe Trump’s spin on coronavirus will get ‘what they deserve’: former Ebola Czar", "description": "President Donald Trump’s credibility deficit is coming into play as Americans wonder whether to listen to his debunked claims or facts from medical experts on the COVID-19 coronavirus epidemic. Former U.S. Ebola response coordinator Ron Klain, who was known a…", "url": "https://www.rawstory.com/2020/02/americans-who-believes-trumps-spin-on-coronavirus-will-get-what-they-deserve-former-ebola-czar/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Ron-Klain.png", "publishedAt": "2020-02-29T04:10:51Z", "content": "President Donald Trump’s credibility deficit is coming into play as Americans wonder whether to listen to his debunked claims or facts from medical experts on the COVID-19 coronavirus epidemic.\r\nFormer U.S. Ebola response coordinator Ron Klain, who was known … [+519 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Bob Brigham", "title": "Maddow guest predicts one-third of Congress will catch coronavirus — and Capitol Hill will close", "description": "The host of “The Rachel Maddow Show” on MSNBC interviewed an expert on the spread of plagues and pestilences on Friday. Maddow was joined by New York Times science and health reporter Donald G. McNeil, Jr. to discuss the latest on the spread of the COVID-19 c…", "url": "https://www.rawstory.com/2020/02/maddow-guest-predicts-one-third-of-congress-will-catch-coronavirus-and-capitol-hill-will-close/", "urlToImage": "https://www.rawstory.com/wp-content/uploads/2020/02/Donald-McNeil.png", "publishedAt": "2020-02-29T03:40:53Z", "content": "The host of “The Rachel Maddow Show” on MSNBC interviewed an expert on the spread of plagues and pestilences on Friday.\r\nMaddow was joined by New York Times science and health reporter Donald G. McNeil, Jr. to discuss the latest on the spread of the COVID-19 … [+519 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "The Republic | azcentral.com, The Republic | azcentral.com", "title": "Out of stock: Phoenix-area stores run low on coronavirus prevention products", "description": "Locals stock up on face masks and other coronavirus prevention supplies at stores around Phoenix.", "url": "https://www.azcentral.com/picture-gallery/news/local/phoenix/2020/02/29/phoenix-stores-struggle-stock-face-masks-hand-sanitizer-coronavirus-concerns-grow-photo-gallery/4910587002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/29/PPHX/495a8e8f-e326-468d-a3fa-ab3360bd3831-DFFDFB6B-4137-4943-9AB9-3435CEE13E17.jpeg?crop=4031,2268,x0,y0?width=1200", "publishedAt": "2020-02-29T03:40:33Z", "content": null}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "BQ Desk", "title": "Weekly Wrap: Investors Lost Rs 11 Lakh Crore In Worst Week For Stocks In Over Nine Years - BloombergQuint", "description": "Weekly Wrap: Investors Lost Rs 11 Lakh Crore In Worst Week For Stocks In Over Nine Years BloombergQuint Sensex crashes 1,448 points; Rs 5.50 lakh crore gone in a day! Economic Times Blackest Friday for DStreet, investor wealth on BSE down by 5.53 lakh crores …", "url": "https://www.bloombergquint.com/markets/weekly-wrap-investors-lost-rs-11-lakh-crore-in-worst-week-for-stocks-in-over-nine-years", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-02%2F3fef4d48-4167-4d73-852c-984b62e05314%2F359640613.jpg?rect=0%2C259%2C7972%2C4185&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-02-29T03:50:15Z", "content": "Investors lost nearly Rs 11.5 lakh crore in the last week of February as stocks tumbled, tracking a selloff in global equities, amid rising concerns over the novel coronavirus outbreak.Of this, Rs ..."}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Carnivals, cars, concerts: Swiss crack down on coronavirus", "description": "GENEVA: Switzerland on Friday (Feb 28) cancelled football matches, carnival celebrations, concerts and the Geneva International Motor Show in a drastic bid to stem the country's new coronavirus outbreak in its early stages. The government announced it was sus…", "url": "https://www.channelnewsasia.com/news/world/covid19-switzerland-ban-events-carnivals-concerts-coronavirus-12484814", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12484888/16x9/991/557/e681a4a5260e9693dde74a5699812350/tZ/workers-are-seen-at-the-stand-of-german-carmaker-audi-on-feb-28--2020-at-the-geneva-international-motor-show.jpg", "publishedAt": "2020-02-29T03:20:37Z", "content": "GENEVA: Switzerland on Friday (Feb 28) cancelled football matches, carnival celebrations, concerts and the Geneva International Motor Show in a drastic bid to stem the country's new coronavirus outbreak in its early stages.\r\nThe government announced it was su… [+4408 chars]"}, {"source": {"id": null, "name": "Malaysiakini.com"}, "author": "Reuters", "title": "Trump postpones summit with Asean leaders amid coronavirus fears: sources", "description": "President Trump had invited leaders of the 10-member Asean to meet in Las Vegas on March 14.", "url": "https://www.malaysiakini.com/news/512654", "urlToImage": "https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2020/01/ad58015263e598808afee29b391d08a1.jpg", "publishedAt": "2020-02-29T03:53:48Z", "content": "The United States has decided to postpone a meeting with leaders of Southeast Asian countries it had planned to host on March 14 due to worries about the coronavirus outbreak, two US officials familiar with the matter said on Friday.\r\nPresident Donald Trump h… [+2491 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "US reports third COVID-19 case of unknown origin", "description": "LOS ANGELES: US health officials on Friday (Feb 28) reported a third case of the new coronavirus transmitted to a person who did not travel overseas or come in contact with anyone known to be ill, indicating the disease was spreading in the country. Authoriti…", "url": "https://www.channelnewsasia.com/news/world/covid19-united-states-third-unknown-case-oregon-12484910", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12484918/16x9/991/557/ae84604b557dfbd1c3ff444276277056/SF/united-states-covid-19-testing.jpg", "publishedAt": "2020-02-29T03:35:23Z", "content": "LOS ANGELES: US health officials on Friday (Feb 28) reported a third case of the new coronavirus transmitted to a person who did not travel overseas or come in contact with anyone known to be ill, indicating the disease was spreading in the country.\r\nAuthorit… [+435 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "The Republic | azcentral.com, Chelsea Hofmann, The Republic | azcentral.com", "title": "Phoenix stores struggle to keep face masks, hand sanitizer stocked as coronavirus concerns grow", "description": "The Center for Disease Control and Prevention announced Tuesday that the spread of the coronavirus in the United States is inevitable.", "url": "https://www.azcentral.com/story/news/local/phoenix/2020/02/29/phoenix-stores-struggle-stock-face-masks-hand-sanitizer-coronavirus-concerns-grow/4907000002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/29/PPHX/dbf9af4a-3960-4f70-bb51-f24a6b146b31-5775F102-059B-486E-AF04-C5AD95E53C98.jpeg?crop=4031,2268,x0,y604&width=3200&height=1680&fit=bounds", "publishedAt": "2020-02-29T03:43:01Z", "content": "Phoenix pharmacies are struggling to keep hand sanitizer and surgical face masks on shelves following warnings from the Center for Disease Control and Prevention that the spread of new coronavirus cases in the United States is inevitable. \r\nAs of Friday, ther… [+4159 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Keegan Elmer, Keegan Elmer", "title": "Has coronavirus prompted rise in racist incidents across Europe?", "description": "The Covid-19 outbreak has prompted a string of complaints about racist behaviour targeted members of the Chinese diaspora across Europe, prompting calls to do more to tackle “stigma and discrimination”.A radio DJ broadcast on February 6 sparked national outra…", "url": "https://www.scmp.com/news/china/society/article/3052961/has-coronavirus-prompted-rise-racist-incidents-across-europe", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/28/4e813c56-5a11-11ea-b438-8452af50d521_image_hires_225930.JPG?itok=iFvI-IIL&v=1582901975", "publishedAt": "2020-02-29T04:00:22Z", "content": null}, {"source": {"id": null, "name": "Startribune.com"}, "author": "ADAM GELLER, PAUL WISEMAN and CHRISTOPHER RUGABER", "title": "Outbreak starts to look more like worldwide economic crisis", "description": "The coronavirus outbreak began to look more like a worldwide economic crisis Friday as anxiety about the infection emptied shops and amusement parks, canceled events, cut trade and travel and dragged already slumping financial markets even lower.", "url": "http://www.startribune.com/virus-epidemic-growing-by-day-hits-schools-concerts-parks/568273852/", "urlToImage": "http://assets.startribune.com/static/img/branding/logos/strib-social-card.png?d=1582740040", "publishedAt": "2020-02-29T03:21:17Z", "content": "NEW YORK — The coronavirus outbreak began to look more like a worldwide economic crisis Friday as anxiety about the infection emptied shops and amusement parks, canceled events, cut trade and travel and dragged already slumping financial markets even lower.\r\n… [+7570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, CNN", "title": "Millions of children across the world aren't going to school. It's not just their education that could suffer", "description": "China is battling a deadly coronavirus outbreak that has killed more than 2,700 in the country alone. In a bid to stop the spread of the disease, schools across the country are closed, leaving about 180 million school-aged children in China stuck at home.", "url": "https://www.cnn.com/2020/02/28/asia/remote-school-education-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200228160535-coronavirus-schools-2-super-tease.jpg", "publishedAt": "2020-02-29T03:21:21Z", "content": "Hong Kong (CNN)For 18-year-old Huang Yiyang, school starts when she opens up her laptop. \r\nOver the past two weeks, there have been no school bells, bustling corridors, busy canteens or uniforms. Instead of physically traveling to her public school in Shangha… [+11608 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Shayan Ghosh", "title": "Coronavirus likely to have mixed impact on corporates, says India Ratings - Livemint", "description": "Rating agency analysed December quarter results of 412 listed companies across 14 key debt-heavy sectors.WHO has asked nations to be prepare for pandemic as new cases are being reported from around the world", "url": "https://www.livemint.com/companies/news/coronavirus-likely-to-have-mixed-impact-on-corporates-says-india-ratings-11582947657677.html", "urlToImage": "https://images.livemint.com/img/2020/02/29/600x338/2020-02-27T081351Z_394828704_RC2W8F94F42E_RTRMADP_3_CHINA-HEALTH-JAPAN_1582803806678_1582948951099.JPG", "publishedAt": "2020-02-29T04:08:18Z", "content": "MUMBAI: The impact of COVID-19, more commonly referred to as coronavirus, will play out differently on corporates, India Ratings and Research has said.For instance, factors like availability of key raw materials could be a constrain pharmaceutical and auto an… [+2713 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Jessica Guynn, Mike Snider and Kelly Tyko, USA TODAY", "title": "Coronavirus fears empty store shelves of toilet paper, bottled water, masks as shoppers stock up", "description": "With concerns of the coronavirus growing into a pandemic and shoppers stocking up, experts say consumers will find more empty shelves by mid-April.", "url": "https://www.usatoday.com/story/money/2020/02/28/coronavirus-2020-preparation-more-supply-shortages-expected/4903322002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/02/29/PPHX/9fafad66-3081-4f4d-a164-b69f6f9951c4-76BC9427-E3F4-46B1-9E41-FEFDD2F3C205.jpeg?crop=4031,2268,x0,y373&width=3200&height=1680&fit=bounds", "publishedAt": "2020-02-29T03:51:37Z", "content": "Northern Italy residents cleared the shelves at a supermarket amid fears around the coronavirus outbreak.\r\nUSA TODAY\r\nOn Thursday afternoon when Ryan Ozawa hit the Iwilei Costco next door to his office in Hawaii, he ran straight into a long line of carts stre… [+4913 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Death toll of coronavirus in China climbs to 2,835 with 47 more fatalities - The Tribune India", "description": "Death toll of coronavirus in China climbs to 2,835 with 47 more fatalities The Tribune India Coronavirus: Deaths in Iran Rise to 54 as Global Outbreak Worsens News18 New virus: Over 86,000 infected globally, over 2,900 deaths Washington Post What Small Busine…", "url": "https://www.tribuneindia.com/news/death-toll-of-coronavirus-in-china-climbs-to-2-835-with-47-more-fatalities-48890", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/2/2020_2$largeimg_53076050.JPG", "publishedAt": "2020-02-29T04:08:00Z", "content": "Beijing, February 29\r\nForty-seven more people died of the deadly coronavirus, rasing the death toll in the country to 2,835 while the number of confirmed cases climbed to 79,251, Chinese health officials said on Saturday.\r\nChina’s National Health Commission (… [+2789 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "CDC's First Press Briefing Since Pence Took Charge Of Coronavirus Was Full Of Praise For Trump's Response (Elizabeth Kim/Gothamist)", "description": "Elizabeth Kim / Gothamist : CDC's First Press Briefing Since Pence Took Charge Of Coronavirus Was Full Of Praise For Trump's Response — Employing a distinct shift in tone from a prior press briefing on Tuesday, a director at the Centers for Disease Control an…", "url": "https://www.memeorandum.com/200228/p150", "urlToImage": "https://cms.prod.nypr.digital/images/301468/fill-1200x650/", "publishedAt": "2020-02-29T03:45:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Trump rallies his base to treat coronavirus as a 'hoax' (Politico)", "description": "Politico : Trump rallies his base to treat coronavirus as a ‘hoax’ — At a South Carolina rally on the eve of the Democratic primary, the president also sought to manage expectations about the White House's response to the outbreak. — President Donald Trump sp…", "url": "https://www.memeorandum.com/200228/p148", "urlToImage": "https://static.politico.com/d3/e5/65c5a1124b2ba03566e0fc31fc5f/200228-trumprally-ap-773.jpg", "publishedAt": "2020-02-29T03:35:01Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "CBC News", "title": "Ontario confirms 8th case of coronavirus", "description": "Health officials have confirmed an eight case of coronavirus in Toronto.", "url": "https://www.cbc.ca/news/canada/toronto/toronto-coronavirus-eight-case-1.5481000", "urlToImage": "https://i.cbc.ca/1.3002735.1426857899!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/dr-david-williams.JPG", "publishedAt": "2020-02-29T03:21:01Z", "content": "Health officials have confirmed an eighth case of coronavirus in Toronto.\r\nChief Medical Officer of Health Dr. David Williams said after arriving in Toronto on Feb. 20, a man in his 80s presented himself at Scarborough Health Network's General Hospital's emer… [+1385 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Coronavirus Quarantine Survivor Keeps Coughing on TV", "description": null, "url": "https://governmentslaves.news/2020/02/28/coronavirus-quarantine-survivor-keeps-coughing-on-tv/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2019/01/cropped-G-1.png", "publishedAt": "2020-02-29T03:51:26Z", "content": "Press \"Enter\" to skip to contentSearch\r\nopen menu\r\n<ul><li>Man Keeps Rock For Years, Hoping It’s Gold. It Turned Out to Be Far More Valuable99,752 views</li><li>New Bill Will Make it Illegal for Citizens to Pump Their Own Gas To Keep You Safe75,949 views</li>… [+1554 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "The big news: Over 600 held for Delhi violence, 42 dead, and nine other top stories - Scroll.in", "description": "The big news: Over 600 held for Delhi violence, 42 dead, and nine other top stories Scroll.in 167 FIRs registered for violence in northeast Delhi: Latest developments Times of India Delhi Violence: 167 FIRs Registered, 885 People Arrested or Detained, Say Pol…", "url": "https://scroll.in/latest/954695/the-big-news-over-600-held-for-delhi-violence-42-dead-and-nine-other-top-stories", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/137437-utdewdnoxu-1582947256.jpg", "publishedAt": "2020-02-29T03:39:00Z", "content": "A look at the headlines right now: \r\n<ol><li>Opposition instigating riots, spreading misinformation about Citizenship Act, says Amit Shah: The Shiv Sena said Amit Shah was nowhere to be seen during clashes. The UN chief said spirit of Gandhi needed now more t… [+2338 chars]"}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "Ashwini Phadnis", "title": "Operation Wuhan, an Air India evacuation like no other", "description": "Here’s how the Maharaja ‘rescued’ its citizens from the coronavirus epicentre", "url": "https://www.thehindubusinessline.com/specials/pulse/operation-wuhan-an-air-india-evacuation-like-no-other/article30944670.ece", "urlToImage": "https://www.thehindubusinessline.com/specials/pulse/a2olk2/article30944668.ece/ALTERNATES/LANDSCAPE_615/Pulse-Wuhan1", "publishedAt": "2020-02-29T04:10:23Z", "content": "Air India has brought Indians back from war-torn Kuwait, Iraq and Jordan, so operating evacuation flights is not new for the national carrier. But the Wuhan operation was different.\r\nEarlier, we landed at an airport close to the conflict zone and, once the pa… [+3234 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Aaron Perine", "title": "Mulan's Chinese Release Delayed Indefinitely Over Coronavirus Concerns", "description": "Coronavirus is a growing concern all over the world and now it's effecting entertainment even more. Disney's Mulan will now have to look for a new release date in China after some concerns about the virus led decision-makers to scuttle the March release date …", "url": "https://comicbook.com/movies/2020/02/29/mulan-coronavirus-chinese-release-delayed-indefinitely-over-concerns/", "urlToImage": "https://media.comicbook.com/2019/12/mulan-movie-pster-1198670-640x320.jpeg", "publishedAt": "2020-02-29T04:09:00Z", "content": "Coronavirus is a growing concern all over the world and now it’s effecting entertainment even more. Disney’s Mulanwill now have to look for a new release date in China after some concerns about the virus led decision-makers to scuttle the March release date t… [+2445 chars]"}, {"source": {"id": null, "name": "Thegatewaypundit.com"}, "author": "Kristinn Taylor", "title": "SICK! Media Falsely Accuses Trump of Saying Coronavirus is a Hoax", "description": "In yet another example of why President Trump calls the media the ‘enemy of the people, the media is falsely accusing Trump of calling the coronavirus a hoax in a speech at a campaign rally in North Charleston, South Carolina Friday night. Politico: “Presiden…", "url": "https://www.thegatewaypundit.com/2020/02/sick-media-falsely-accuses-trump-of-saying-coronavirus-is-a-hoax/", "urlToImage": "https://www.thegatewaypundit.com/wp-content/uploads/Trump-Rally-North-Charleston-South-Carolina-Screen-Image-02282020-1200x630.jpg", "publishedAt": "2020-02-29T03:37:10Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "Heritage Insurance Holdings (HRTG) Q4 2019 Earnings Call Transcript", "description": "HRTG earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/28/heritage-insurance-holdings-hrtg-q4-2019-earnings.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-29T04:01:02Z", "content": "Image source: The Motley Fool.\r\nHeritage Insurance Holdings (NYSE:HRTG)Q4 2019 Earnings CallFeb 28, 2020, 8:30 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nArash Soleimani\r\nGo… [+25649 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "The number of people infected with coronavirus has exceeded 85 thousand people - The KXAN 36 News", "description": "The number of people infected with coronavirus has exceeded 85 thousand people The KXAN 36 News Coronavirus: Who is Most at Risk of Dying? A Profile Comes Into Focus News18 What Small Businesses Need to Know About Coronavirus, and What to Do Small Business Tr…", "url": "http://www.kxan36news.com/the-number-of-people-infected-with-coronavirus-has-exceeded-85-thousand-people", "urlToImage": null, "publishedAt": "2020-02-29T04:00:00Z", "content": "the Total number of infected with a new type of coronavirus in the world is increasing and by the morning of 29 February was 85153 man. This was reported by the newspaper South China Morning Post.\r\nChina confirmed 79251 infection COVID-19. And outside mainlan… [+637 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Amazon tells all 798,000 employees to halt travel, in US and internationally, over coronavirus fears", "description": "Amazon has instructed its 798,000 employees to avoid “non-essential travel” domestically and internationally because of concerns about the coronavirus outbreak, a spokesperson confirmed to Business…", "url": "https://governmentslaves.news/2020/02/28/amazon-tells-all-798000-employees-to-halt-travel-in-us-and-internationally-over-coronavirus-fears/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/01/CORONAVIRUS.png", "publishedAt": "2020-02-29T03:52:09Z", "content": "<ul><li>Amazon has instructed its 798,000 employees to avoid “non-essential travel” domestically and internationally because of concerns about the coronavirus outbreak, a spokesperson confirmed to Business Insider.</li><li>Earlier, The New York Times reported… [+1862 chars]"}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "The Hindu BusinessLine", "title": "Coronavirus update: No travel or trade restrictions", "description": "Amid the coronavirus disease (Covid-19) outbreak, the World Health Organisation (WHO) and the World Tourism Organisation (UNWTO) are committed to working together in guiding the travel and tourism se", "url": "https://www.thehindubusinessline.com/specials/pulse/coronavirus-update-no-travel-or-trade-restrictions/article30944845.ece", "urlToImage": "https://www.thehindubusinessline.com/news/world/5vnt7y/article30940195.ece/ALTERNATES/LANDSCAPE_615/SKOREA-CORONAVIRUS", "publishedAt": "2020-02-29T04:03:18Z", "content": "Amid the coronavirus disease (Covid-19) outbreak, the World Health Organisation (WHO) and the World Tourism Organisation (UNWTO) are committed to working together in guiding the travel and tourism sectors response to the issue, the organisations said in a joi… [+426 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Deserted airports around the world show how coronavirus has decimated air travel", "description": "Thousands of flights around the world have been canceled due to the novel coronavirus. This has decreased the number of people that can be found in international airports in countries like South Korea…", "url": "https://governmentslaves.news/2020/02/28/deserted-airports-around-the-world-show-how-coronavirus-has-decimated-air-travel/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/02/coronavirus-4833467_640.jpg", "publishedAt": "2020-02-29T03:29:00Z", "content": "International airports around the world have become increasingly empty as flights have been canceled and more travel warnings have been issued during the coronavirus outbreak.\r\nThe novel coronavirus which originated in Wuhan, China has now killed 2,810 people… [+825 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Coronavirus: Iran’s deaths at least 210, hospital sources say", "description": "At least 210 people in Iran have died as a result of the new coronavirus disease, sources in the country’s health system have told BBC Persian. Most of the victims are from the capital, Tehran…", "url": "https://governmentslaves.news/2020/02/28/coronavirus-irans-deaths-at-least-210-hospital-sources-say/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/01/iran-1151139_1920-1200x686.jpg", "publishedAt": "2020-02-29T04:02:56Z", "content": "At least 210 people in Iran have died as a result of the new coronavirus disease, sources in the country’s health system have told BBC Persian.\r\nMost of the victims are from the capital, Tehran, and the city of Qom, where cases of Covid-19 first emerged.\r\nThe… [+1072 chars]"}, {"source": {"id": null, "name": "Catchnews.com"}, "author": null, "title": "Coronavirus: Death toll rises to 2,835 in China - Catch News", "description": "Coronavirus has spread to more than 45 other countries including the US, UK, Singapore, Italy, France, Russia, Spain, and India.", "url": "http://www.catchnews.com/international-news/coronavirus-death-toll-rises-to-2-835-in-china-185699.html", "urlToImage": "http://images.catchnews.com/upload/2020/02/14/Corona_Virus_185699_730x419.jpg", "publishedAt": "2020-02-29T03:50:00Z", "content": "The death toll from coronavirus in China has mounted to 2,835, officials said on Saturday. The number of confirmed cases has increased to 79,251, Sputnik quoted state health committee as saying.\r\n\"The state health committee received from 31 provinces (areas, … [+622 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Virginia Kruta", "title": "Matt Gaetz Jokes That Kimberly Guilfoyle Could Handle Any Threat From Rep. Garamendi", "description": "Florida Republican Matt Gaetz joked Friday that any threats made by his colleague, California Democrat John Garamendi, could be handled by Kimberly Guilfoyle.", "url": "https://dailycaller.com/2020/02/28/matt-gaetz-joke-kimberly-guilfoyle-handle-rep-garamendi/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2020/02/gaetz-e1582945709784.png", "publishedAt": "2020-02-29T03:22:27Z", "content": "Florida Republican Rep. Matt Gaetz joked Friday that any threats made by his colleague, California Democratic Rep. John Garamendi, could be handled by Kimberly Guilfoyle.\r\nGaetz’s comments were the latest in a series of barbs exchanged by Garamendi and Donald… [+1703 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "It Begins: Americans are canceling their domestic travel over coronavirus fears", "description": "Major companies are beginning to cancel conferences and travel plans within the United States due to the coronavirus, which analysts warn will have cascading impacts on the country’s hotels…", "url": "https://governmentslaves.news/2020/02/28/it-begins-americans-are-canceling-their-domestic-travel-over-coronavirus-fears/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/01/airplane-749542_640.jpg", "publishedAt": "2020-02-29T03:16:44Z", "content": "Major companies are beginning to cancel conferences and travel plans within the United States due to the coronavirus, which analysts warn will have cascading impacts on the countrys hotels, airlines and convention centers.\r\nInternational travel particularly t… [+1937 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "Oregon coronavirus infection becomes third case of unknown origin in U.S.", "description": "A northwest Oregon resident has tested positive for coronavirus with no known history of travel to countries severely affected by the outbreak and no known contact with infected individuals…", "url": "https://governmentslaves.news/2020/02/28/oregon-coronavirus-infection-becomes-third-case-of-unknown-origin-in-u-s/", "urlToImage": "https://governmentslaves.news/wp-content/uploads/2020/02/Coronavirus-Concept-Virus-Blood.jpg", "publishedAt": "2020-02-29T03:36:58Z", "content": "The adult patient, whose age and gender were not disclosed, is at Kaiser Permanente Westside Medical Center in Hillsboro, officials said.\r\nOregon Health Authority Director Patrick Allen said the case is considered presumptive while the state awaits confirmati… [+1366 chars]"}, {"source": {"id": null, "name": "Governmentslaves.news"}, "author": "newsguy76", "title": "China Reports Catastrophic Data: PMIs Crash To Record Low, Confirming Coronavirus Collapse", "description": "One week ago, ahead of today’s Chinese data release which would for the first time capture the devastation from the coronavirus pandemic, we wrote that “to those who have been following our series of…", "url": "https://governmentslaves.news/2020/02/28/china-reports-catastrophic-data-pmis-crash-to-record-low-confirming-coronavirus-collapse/", "urlToImage": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/inline-images/china%20EPMI%202.png", "publishedAt": "2020-02-29T03:40:46Z", "content": "One week ago, ahead of today’s Chinese data release which would for the first time capture the devastation from the coronavirus pandemic, we wrote that “to those who have been following our series of high-frequency, daily indicators of China’s economy, it wil… [+4227 chars]"}, {"source": {"id": null, "name": "Lewrockwell.com"}, "author": "Patrick J. Buchanan", "title": "Coronavirus Crisis Is Trump’s Time To Lead", "description": "Shop all books by Pat Buchanan Not until well into the Democratic debate Tuesday night did the COVID-19 coronavirus come up, and it was Mike Bloomberg, not a CBS moderator, who raised it: “The president fired the pandemic specialist in this country two years …", "url": "https://www.lewrockwell.com/2020/02/patrick-j-buchanan/coronavirus-crisis-is-trumps-time-to-lead/", "urlToImage": "https://www.lewrockwell.com/wp-content/themes/lrc/images/logo-med.png", "publishedAt": "2020-02-29T04:01:00Z", "content": "Shop all books by Pat Buchanan\r\nNot until well into the Democratic debate Tuesday night did the COVID-19 coronavirus come up, and it was Mike Bloomberg, not a CBS moderator, who raised it:\r\n“The president fired the pandemic specialist in this country two year… [+4873 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Alan Friedman", "title": "A mysterious rally in Nokia's stock could mean that a new 5G challenger to Huawei is coming", "description": "On Wednesday, despite a global stock market sell-off related to the spreading coronavirus, the shares of Nokia soared as much as 6.1% higher. What prompted the rally was a rumor that the company was considering a merger with rival Ericsson or another company.…", "url": "https://www.phonearena.com/news/nokia-could-be-bought-out-and-challenge-huawei-in-delivering-5g-networking-gear_id122631", "urlToImage": "https://i-cdn.phonearena.com/images/article/122631-two/A-mysterious-rally-in-Nokias-stock-could-mean-that-a-new-5G-challenger-to-Huawei-is-coming.jpg", "publishedAt": "2020-02-29T03:15:00Z", "content": "A discussion is a place, where people can voice their opinion, no matter if it is positive, neutral or negative. However, when posting, one must stay true to the topic, and not just share some random thoughts, which are not directly related to the matter.\r\nTh… [+691 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Adam Barnhardt", "title": "The Falcon and The Winter Soldier Faces Rumored Script Rewrites Due to Coronavirus Outbreak", "description": "By now, filming on The Falcon and The Winter Soldier is likely on the downward slope of principal photography, likely leading to a wrap on filming in a matter of weeks. At one point, the production was supposed to shift to Puerto Rico, something that changed …", "url": "https://comicbook.com/marvel/2020/02/29/the-falcon-the-winter-soldier-script-rewrites-coronavirus-outbreak/", "urlToImage": "https://media.comicbook.com/2020/02/the-falcon-and-the-winter-soldier-1205584-640x320.jpeg", "publishedAt": "2020-02-29T03:45:00Z", "content": "By now, filming on The Falcon and The Winter Soldier is likely on the downward slope of principal photography, likely leading to a wrap on filming in a matter of weeks. At one point, the production was supposed to shift to Puerto Rico, something that changed … [+2285 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tracy Connor", "title": "Coronavirus Spreads in Oregon, California, Washington. How Many Are Already Infected?", "description": "It’s spreading.Over the course of several hours on Friday, officials in three states announced that residents with no known risk factors, such as travel to global hot spots, had tested positive for the new coronavirus.In each case, health authorities believe …", "url": "https://news.yahoo.com/oregon-school-employee-tests-positive-031336242.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/K4wNirnRS_tR6j6fW3RMbQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/jrWqPgMhgQLhZ_2NMvMiQA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/1260ae4041832c9c85b769947c0c83b5", "publishedAt": "2020-02-29T03:13:36Z", "content": "Kena Betancur/Getty\r\nIts spreading.\r\nOver the course of several hours on Friday, officials in three states announced that residents with no known risk factors, such as travel to global hot spots, had tested positive for the new coronavirus.\r\nIn each case, hea… [+6214 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "Barings BDC, Inc. (BBDC) Q4 2019 Earnings Call Transcript", "description": "BBDC earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/28/barings-bdc-inc-bbdc-q4-2019-earnings-call-transcr.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-29T04:01:00Z", "content": "Image source: The Motley Fool.\r\nBarings BDC, Inc. (NYSE:BBDC)Q4 2019 Earnings CallFeb 28, 2020, 9:00 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nAt this time, I wou… [+49769 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "Ilya Bañares - Staff Reporter", "title": "Ontario confirms new case of coronavirus in Toronto", "description": "Dr. David Williams, Ontario’s chief medical officer of health, has confirmed another case of COVID-19 in Toronto.", "url": "https://www.thestar.com/news/gta/2020/02/28/ontario-confirms-new-case-of-coronavirus-in-toronto.html", "urlToImage": "https://images.thestar.com/0Aevb2V4XG2jQnDuQHHTyoCnbGk=/1200x800/smart/filters:cb(1582947064006)/https://www.thestar.com/content/dam/thestar/news/gta/2020/02/28/ontario-confirms-new-case-of-coronavirus-in-toronto/dr_david_williams.jpg", "publishedAt": "2020-02-29T03:31:00Z", "content": "Ontario has confirmed another case of the novel coronavirus in Toronto late Friday evening, bringing the province’s total to eight individuals, three of which have already been resolved.\r\nIn a statement, Ontario’s chief medical officer of health Dr. David Wil… [+1095 chars]"}, {"source": {"id": null, "name": "Newsbtc.com"}, "author": "Nick Chong", "title": "This One Headline Just Made Crypto Investors Astronomically Bullish on BTC", "description": "Bitcoin and the crypto market haven’t been the only assets falling over the past week or two. This week marked one of the stock markets and commodity market’s worst performances in history, with the S&P 500 and Dow Jones falling by around 12% from their all-t…", "url": "https://www.newsbtc.com/2020/02/29/this-one-headline-just-made-crypto-investors-bullish-btc/", "urlToImage": "https://www.newsbtc.com/wp-content/uploads/2020/02/shutterstock_731378545-1200x780.jpg", "publishedAt": "2020-02-29T04:00:00Z", "content": "Bitcoin and the crypto market haven’t been the only assets falling over the past week or two.\r\nThis week marked one of the stock markets and commodity market’s worst performances in history, with the S&amp;P 500 and Dow Jones falling by around 12% from their … [+2836 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "On Stage, Telangana Ministers Eat Chicken To Dispel Coronavirus Fears", "description": "A long line of ministers are seen eating succulent pieces of chicken on stage in Hyderabad. The ministers, all in white shirts, are seen holding chicken legs in one hand and paper plates on the other.", "url": "https://www.ndtv.com/telangana-news/on-stage-telangana-ministers-eat-chicken-to-dispel-coronavirus-fears-2187507", "urlToImage": "https://c.ndtvimg.com/2020-02/6cdq08l4_telangana-ministers_625x300_29_February_20.jpg", "publishedAt": "2020-02-29T03:43:56Z", "content": "The event was organised to dispel fears that coronavirus is spread by eating chicken and egg\r\nNew Delhi: A long line of ministers are seen eating succulent pieces of chicken on stage in Hyderabad. The ministers, all in white shirts, are seen holding chicken l… [+1462 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Lauren Frias), Lauren Frias", "title": "Trump accuses Democrats of politicizing the coronavirus, calling criticism of his handling of the outbreak their 'new hoax'", "description": "Patrick Semansky/AP President Donald Trump accused Democrats of \"politicizing\" the coronavirus, calling their criticism of how he has responded to the disease their \"new hoax.\" Trump held a rally on Friday in Charleston, South Carolina, for his presidential c…", "url": "https://www.businessinsider.com/trump-says-criticism-coronavirus-fears-new-hoax-of-the-democrats-2020-2", "urlToImage": "https://i.insider.com/5e59cf6cfee23d706366e962?width=1200&format=jpeg", "publishedAt": "2020-02-29T03:59:50Z", "content": "President Donald Trump said mounting fears of the coronavirus are the \"new hoax\" of the Democrats, accusing them of politicizing the disease.\r\nTrump held a rally on Friday in Charleston, South Carolina, for his presidential campaign, where he lambasted Democr… [+1789 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Motley Fool Transcribing)", "title": "Dril-Quip (DRQ) Q4 2019 Earnings Call Transcript", "description": "DRQ earnings call for the period ending December 31, 2019.", "url": "https://www.fool.com/earnings/call-transcripts/2020/02/28/dril-quip-drq-q4-2019-earnings-call-transcript.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/1/featured-transcript-logo-template.jpg", "publishedAt": "2020-02-29T04:00:57Z", "content": "Image source: The Motley Fool.\r\nDril-Quip (NYSE:DRQ)Q4 2019 Earnings CallFeb 28, 2020, 10:00 a.m. ET\r\nContents:\r\n<ul><li>Prepared Remarks</li><li>Questions and Answers</li><li>Call Participants</li></ul>Prepared Remarks:\r\nOperator\r\nLadies and gentlemen, thank… [+51211 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "U.S. Gas Export Pioneers Forced to Sell Shares to Satisfy Loan Requirements", "description": "(Bloomberg) -- Two pioneers of the U.S. natural gas export industry were forced to sell shares of the company they founded amid a global market rout and concern that a key supply deal won’t be finalized.Tellurian Inc. Chairman Charif Souki and Vice Chairman M…", "url": "https://finance.yahoo.com/news/u-gas-export-pioneers-forced-033020279.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/qyPxhpTFfu97QjMggp5Zxw--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/7aa8cf51d528d4d76aee89465510d18f", "publishedAt": "2020-02-29T03:30:20Z", "content": "(Bloomberg) -- Two pioneers of the U.S. natural gas export industry were forced to sell shares of the company they founded amid a global market rout and concern that a key supply deal wont be finalized.\r\nTellurian Inc. Chairman Charif Souki and Vice Chairman … [+2877 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": "Agence France-Presse, Agence France-Presse", "title": "Two South Koreans test positive for coronavirus posthumously, as cases hit nearly 3,000", "description": "South Korea on Saturday confirmed 594 more coronavirus cases, the biggest increase to date for the country and taking the national total to 2,931 infections with three additional deaths.More than 90 per cent of the new cases were in Daegu, the centre of the c…", "url": "https://www.scmp.com/news/asia/east-asia/article/3052990/two-south-koreans-test-positive-coronavirus-posthumously-cases", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/02/29/ea91b00a-5aa0-11ea-b438-8452af50d521_image_hires_120749.jpg?itok=SC5kLB_U&v=1582949278", "publishedAt": "2020-02-29T04:08:01Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Lauren Frias", "title": "Trump accuses Democrats of politicizing the coronavirus, calling criticism of his handling of the outbreak their 'new hoax'", "description": "President Donald Trump accused Democrats of \"politicizing\" the coronavirus, calling their criticism of how he has responded to the disease their \"new hoax.\" More »", "url": "https://www.businessinsider.com.au/trump-says-criticism-coronavirus-fears-new-hoax-of-the-democrats-2020-2", "urlToImage": "https://i.insider.com/5e59cf6cfee23d706366e962", "publishedAt": "2020-02-29T03:59:50Z", "content": "<ul><li>\r\nPresident Donald Trump accused Democrats of “politicizing” the coronavirus, calling their criticism of how he has responded to the disease their “new hoax.”\r\n</li><li>\r\nTrump held a rally on Friday in Charleston, South Carolina, for his presidential… [+2681 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "#39;Coronavirus a â\u0080\u0098black swanâ\u0080\u0099 event; next support for Nifty placed at 11,100 levels#39;", "description": "The Nifty is near the critical support zone of 11,200-11,100 and if it stabilises here then investors should start accumulating good quality stocks while traders can go long in stocks which have relative strength", "url": "https://www.moneycontrol.com/news/business/markets/coronavirus-a-black-swan-event-next-support-for-nifty-placed-at-11100-levels-4988281.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/05/AMIT-Gupta_-Co-Founder-TradingBells-1-770x435.jpg", "publishedAt": "2020-02-29T03:15:25Z", "content": "The market is going through one of the toughest phases because coronavirus (COVID-19) is becoming a pandemic from an epidemic, which is causing worries of a global recession, Amit Gupta, Co-Founder &amp; CEO, TradingBells tells Moneycontrols Kshitij Anand.\r\nQ… [+4190 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "steve lookner", "title": "Washington State Test reports two positive cases of coronavirus including a student", "description": "Washington state announces presumptive coronavirus case in a school-age adolescent at Jackson High. No travel history. Unknown origin of infection. ALSO in Washington state: new presumptive coronavirus case, woman in her 50s who was recently in South Korea", "url": "https://www.freerepublic.com/focus/f-news/3820443/posts", "urlToImage": null, "publishedAt": "2020-02-29T04:08:17Z", "content": "Skip to comments.\r\nWashington State Test reports two positive cases of coronavirus including a studentsteve lookner ^Posted on 02/28/2020 8:08:17 PM PST by janetjanet998\r\nWashington state announces presumptive coronavirus case in a school-age adolescent at Ja… [+3638 chars]"}, {"source": {"id": null, "name": "Seattletimes.com"}, "author": "Dwight Perry / Sideline Chatter", "title": "Sideline Chatter: Seattle: No. 1 in craft beers, No. 15 in the American League", "description": "A satirical look back at some of the quirkiest, most eyebrow-raising things that happened in the sports world this week.", "url": "https://www.seattletimes.com/sports/sideline-chatter-seattle-no-1-in-craft-beers-no-15-in-the-american-league/", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/02/5f71e434-5a98-11ea-a38d-cbe6e17a46ec-474x711.jpg", "publishedAt": "2020-02-29T03:31:00Z", "content": "Beer No. 1!\r\nSeattles T-Mobile Park came out on top (just ahead of San Diegos Petco Park) in The Athletics ranking of major-league ballparks according to their craft-beer offerings.\r\nConsidering Mariners fans havent experienced a playoff game since 2001, that… [+5335 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daily Mail Australia Reporter", "title": "Beautician with coronavirus could have exposed up to 40 people", "description": "A beautician who was diagnosed with coronavirus after she returned from Iran could have infected up to 40 people in Australia.", "url": "https://www.dailymail.co.uk/news/article-8058741/Beautician-coronavirus-exposed-40-people.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/02/29/03/25347586-0-image-a-8_1582947858603.jpg", "publishedAt": "2020-02-29T03:50:26Z", "content": "A beautician who was diagnosed with coronavirus after she returned from Iran could have infected up to 40 people in Australia.\r\nThe woman, who works at Hair Plus salon, in the Australia Fair shopping centre, is currently being treated at Gold Coast University… [+2678 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "US postpones ASEAN regional summit due to coronavirus: US official", "description": "\"As the international community works together to defeat the novel coronavirus, the United States, in consultation with ASEAN partners, has made the difficult decision to postpone the ASEAN leaders meeting,\" said the official on condition of not being named.", "url": "https://economictimes.indiatimes.com/news/international/business/us-postpones-asean-regional-summit-due-to-coronavirus-us-official/articleshow/74411042.cms", "urlToImage": "https://img.etimg.com/thumb/msid-74411041,width-1070,height-580,imgsize-1133652,overlay-economictimes/photo.jpg", "publishedAt": "2020-02-29T04:07:34Z", "content": "WASHINGTON: The United States has delayed a regional ASEAN summit scheduled to take place in Las Vegas next month due to fears of the coronavirus, a senior administration official said Friday.\r\n\"As the international community works together to defeat the nove… [+1518 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "CNN's Stelter on FOX News Coronavirus Coverage: I Wish I Could Laugh", "description": "CNN's Brian Stelter discusses how President Trump's media allies are downplaying the coronavirus.", "url": "https://www.realclearpolitics.com/video/2020/02/29/cnns_stelter_on_fox_news_coronavirus_coverage_i_wish_i_could_laugh.html", "urlToImage": "https://assets.realclear.com/images/50/502846.jpg", "publishedAt": "2020-02-29T03:39:10Z", "content": "CNN's Brian Stelter discusses how President Trump's media allies are downplaying the coronavirus."}, {"source": {"id": null, "name": "Cdc.gov"}, "author": "CDC", "title": "CDC Announces Additional COVID-19 Presumptive Positive Cases", "description": "The Centers for Disease Control and Prevention (CDC) is aware of four new presumptive positive cases of COVID-19 announced by state public health authorities who are currently conducting investigations.", "url": "https://www.cdc.gov/media/releases/2020/s0228-additional-COVID-19-cases.html", "urlToImage": "https://wwwdev.cdc.gov/media/dpk/diseases-and-conditions/coronavirus/images/corona-virus-2019-wuhan-600px.jpg", "publishedAt": "2020-02-29T03:50:00Z", "content": "The Centers for Disease Control and Prevention (CDC) is aware of four new presumptive positive cases of COVID-19 announced by state public health authorities who are currently conducting investigations.\r\n<ul><li>California has announced a second possible inst… [+1831 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Punjab to reduce govt employees' retirement age to 58 years, give free education - Livemint", "description": "Punjab to reduce govt employees' retirement age to 58 years, give free education Livemint Punjab Budget: Retirement age cut to 58; 6 pc of DA arrears in a week; no new taxes The Tribune Eye on 2022: Finance minister Manpreet Singh Badal starts spending, says …", "url": "https://www.livemint.com/news/india/punjab-to-reduce-govt-employees-retirement-age-to-58-years-11582946202316.html", "urlToImage": "https://images.livemint.com/img/2020/02/29/600x338/ER3ALfVU0AEeKAz_1582946518362.jpg", "publishedAt": "2020-02-29T03:23:44Z", "content": "Chandigarh: Reducing government employees' retirement age from 60 to 58, free education for all students up to Class 12 and a debt waiver for landless farmers were some of the major announcements made by Punjab Finance Minister Manpreet Singh Badal in the 202… [+5028 chars]"}, {"source": {"id": null, "name": "Slickdeals.net"}, "author": "ProfessorChaos", "title": "Cure for Coronavirus", "description": "https://www.alaraby.co.uk/english/news/2020/2/25/applying-essential-oil-to-anus-cures-coronavirus-iranian-cleric \n \n \nThose Iranian Ayatollahs do it again... \n \n \n“Ayatollah Tabrizian, a prominent c ...", "url": "https://slickdeals.net/f/13889522-cure-for-coronavirus", "urlToImage": "https://slickdeals.net/images/avatar/sd/new/sd-facebook-5-2.png", "publishedAt": "2020-02-29T03:11:47Z", "content": "https://www.alaraby.co.\r\nuk/english...ian-clericThose Iranian Ayatollahs do it again...\r\n\"Ayatollah Tabrizian, a prominent clergyman &amp; a self-proclaimed expert in \"Islamic medicine\", has published the following list on how to avoid #coronavirus:\r\n* Comb y… [+235 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "No Author, No Author", "title": "Kim warns top party officials of ‘serious consequences’ if coronavirus outbreak not prevented", "description": "North Korean leader Kim Jong Un warned top party officials of the “serious consequences” of failing to prevent an outbreak of the new coronavirus, state...", "url": "https://www.japantimes.co.jp/news/2020/02/29/asia-pacific/science-health-asia-pacific/north-korea-kim-jong-un-coronavirus/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/02/f-nkvirus-a-20200301-870x580.jpg", "publishedAt": "2020-02-29T03:35:11Z", "content": "SEOUL – North Korean leader Kim Jong Un warned top party officials of the “serious consequences” of failing to prevent an outbreak of the new coronavirus, state media reported Saturday.\r\nThe impoverished nation, with a weak and ill-equipped health care system… [+2916 chars]"}, {"source": {"id": null, "name": "Lewrockwell.com"}, "author": "Eric S. Margolis", "title": "Trump Does the Taj", "description": "Special for LewRockwell.com President Donald Trump’s 36-hour whirlwind visit to India this past week was designed to show Americans just how adored abroad their president really is. Unluckily for Trump, his campaign stop at this behemoth nation of 1.3 or 1.4 …", "url": "https://www.lewrockwell.com/2020/02/eric-margolis/trump-does-the-taj/", "urlToImage": "https://www.lewrockwell.com/wp-content/themes/lrc/images/logo-med.png", "publishedAt": "2020-02-29T04:01:00Z", "content": "Special for LewRockwell.com\r\nPresident Donald Trumps 36-hour whirlwind visit to India this past week was designed to show Americans just how adored abroad their president really is.\r\nUnluckily for Trump, his campaign stop at this behemoth nation of 1.3 or 1.4… [+4280 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Noel Randewich", "title": "Think the S&P 500 is in bad shape? Its components look worse", "description": "Wall Street's worst week since 2008, sparked by fears about the fast-spreading coronavirus, has left almost half of the S&P 500's stocks in bear market territory, just nine days after the leading benchmark closed at a record high.", "url": "https://in.reuters.com/article/china-health-s-p500-components-graphic-idINKBN20N05F", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200229&t=2&i=1496790989&w=1200&r=LYNXMPEG1S03G", "publishedAt": "2020-02-29T03:30:47Z", "content": "SAN FRANCISCO (Reuters) - Wall Street’s worst week since 2008, sparked by fears about the fast-spreading coronavirus, has left almost half of the S&amp;P 500’s stocks in bear market territory, just nine days after the leading benchmark closed at a record high… [+2088 chars]"}, {"source": {"id": null, "name": "Freerepublic.com"}, "author": "Breitbart", "title": "Pollak: 5 Reasons to Stop Freaking Out About Coronavirus", "description": "Coronavirus is an \u0093info-demic,\u0094 a panic caused by the spread of partial and often misleading information about a health risk, sometimes deliberately. The virus is real, and a small number of people have been infected. But it is going to pass. It is an unpleas…", "url": "https://www.freerepublic.com/focus/f-news/3820441/posts", "urlToImage": null, "publishedAt": "2020-02-29T03:58:49Z", "content": "Skip to comments.\r\nPollak: 5 Reasons to Stop Freaking Out About CoronavirusBreitbart ^\r\n | 28 Feb 2020\r\n | Joel Pollak\r\nPosted on 02/28/2020 7:58:49 PM PST by lasereye\r\nCoronavirus is an “info-demic,” a panic caused by the spread of partial and often misleadi… [+2785 chars]"}]