[{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nicole Dieker", "title": "Your Health Insurance May Waive Coronavirus Testing Copays", "description": "Many of us are asking ourselves what we can do to prevent the spread of the coronavirus. Some of us are also asking ourselves whether we can afford to get tested for COVID-19, should we come down with symptoms—and how much we’ll have to pay for treatment. Rea…", "url": "https://lifehacker.com/your-health-insurance-may-waive-coronavirus-testing-cop-1842238548", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/q5cd5q2im2l1eckmznkn.jpg", "publishedAt": "2020-03-10T17:00:00Z", "content": "Many of us are asking ourselves what we can do to prevent the spread of the coronavirus. Some of us are also asking ourselves whether we can afford to get tested for COVID-19, should we come down with symptomsand how much well have to pay for treatment.\r\nLuck… [+2173 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "It's Time to Assume COVID-19 Is Already In Your City", "description": "While thousands of cases of COVID-19 have been documented in other countries, most parts of the US are only now seeing a few positive tests pop up here and there. But we also haven’t been testing for the coronavirus as thoroughly as other countries have. I’d …", "url": "https://vitals.lifehacker.com/its-time-to-assume-covid-is-already-in-your-city-1842240068", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ua6boxxypciyghaavpnm.jpg", "publishedAt": "2020-03-10T16:30:00Z", "content": "While thousands of cases of COVID-19 have been documented in other countries, most parts of the US are only now seeing a few positive tests pop up here and there. But we also havent been testing for the coronavirus as thoroughly as other countries have. Id be… [+2281 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "It's time to get serious about coronavirus social distancing", "description": "Their faces plastered in blue makeup, some 3,500 people gathered in Western France over the weekend to break the record for the largest-ever crowd of Smurfs. The next day, the French government banned gatherings of more than 1,000 people, in an effort to cont…", "url": "https://mashable.com/article/coronavirus-social-distancing-prevention/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F10%252F1d%252Fbe0584e424c246e9bf2f8792331c8111.9ffef.png%252F1200x630.png?signature=jZxa5lkk99HNT3u8hyH6Ky0zTi8=", "publishedAt": "2020-03-10T16:23:41Z", "content": "Their faces plastered in blue makeup, some 3,500 people gathered in Western France over the weekend to break the record for the largest-ever crowd of Smurfs.\r\nThe next day, the French government banned gatherings of more than 1,000 people, in an effort to con… [+7354 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Serie A season may not finish, says Italian federation", "description": "The Italian football federation (FIGC) says after a meeting on Tuesday that the Serie A season may not finish because of the coronavirus outbreak.", "url": "https://www.bbc.co.uk/sport/football/51824172", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/13590/production/_97584297_breaking_news.png", "publishedAt": "2020-03-10T17:03:52Z", "content": "The Italian football federation (FIGC) said after a meeting on Tuesday that the Serie A season may not finish because of the coronavirus outbreak.\r\nA statement confirmed that Serie A would stop until 3 April following a government decree issued on Monday.\r\nFI… [+228 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan and Brian Ries, CNN", "title": "Harvard wants students to move out in 5 days over coronavirus fears", "description": "Harvard University is moving to virtual classes for the rest of the school year because of the novel coronavirus outbreak and students have five days to move out of their dorms.", "url": "https://www.cnn.com/2020/03/10/us/harvard-students-coronavirus-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190522155055-harvard-campus-super-tease.jpg", "publishedAt": "2020-03-10T17:08:03Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Could the US do what Italy has done?", "description": "Could the US lock down part, or even all, of its citizens to halt the spread of the deadly virus?", "url": "https://www.bbc.co.uk/news/world-us-canada-51804664", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/15111/production/_111198268_gettyimages-498619024.jpg", "publishedAt": "2020-03-10T17:01:42Z", "content": "Image copyrightGetty ImagesImage caption\r\n Could a lockdown of Seattle ever happen?\r\nAs coronavirus sweeps across the US, American officials have warned that mandatory prevention measures may be needed to stop its spread. But is the US willing to go as far as… [+7982 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New Jersey reports first coronavirus-related death", "description": "A 69-year-old male from New Jersey has died in the state's first coronavirus-related death, the state's health commissioner said on Tuesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-new-jersey-idUSKBN20X2JN", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T17:06:45Z", "content": "(Reuters) - A 69-year-old male from New Jersey has died in the state’s first coronavirus-related death, the state’s health commissioner said on Tuesday. \r\nNew Jersey health commissioner Judith Persichilli said the victim had a history of diabetes, hypertensio… [+107 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelly McLaughlin", "title": "As the coronavirus pandemic spreads, the CDC says 136 kids have died from the flu this season — the highest on record in a decade", "description": "In a report published on March 6 the Centers for Disease Control and Prevention said 136 children had died from influenza during the 2019-2020 flu season. It's the highest child death rate from the flu since 2009, the CDC said. Dr. Tara Narula told \"CBS This …", "url": "https://www.businessinsider.com/cdc-child-deaths-flu-record-number-amid-coronavirus-news-2020-3", "urlToImage": "https://i.insider.com/5e67bf9654f25c4477445b15?width=1200&format=jpeg", "publishedAt": "2020-03-10T17:07:16Z", "content": "The novel coronavirus continues to spread across the US and the world, but the Centers for Disease Control and Prevention says influenza has also affected thousands of Americans.\r\nIn a report published on March 6 with data from February 29, the CDC said there… [+1225 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Michelle Mark", "title": "A Florida couple who were stuck on the coronavirus-stricken Grand Princess is suing the cruise line, alleging gross negligence", "description": "A Florida couple aboard the Grand Princess sued the cruise line on Monday, alleging \"gross negligence\" in allowing passengers to be exposed to the novel coronavirus. Ronald and Eva Weissberger said in the lawsuit they would never have boarded the ship had the…", "url": "https://www.businessinsider.com/florida-couple-grand-princess-cruise-sues-over-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e67b752e4f9fe3b346a0e75?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:17:55Z", "content": "A Florida couple who spent days trapped aboard a coronavirus-stricken ship has sued the cruise line for allegedly allowing them to be exposed to the disease known as COVID-19.\r\nThe Grand Princess docked in Oakland, California, on Monday after circling the coa… [+3158 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "A Wells Fargo employee has coronavirus and Morgan Stanley, UBS, and Merrill Lynch all have offices in the same San Francisco skyscraper — here's what they're telling workers", "description": "Wells Fargo has confirmed an employee working in one of its San Francisco buildings tested positive for COVID-19, the novel coronavirus that's spread around the world. Rivals Morgan Stanley, UBS, and Merrill Lynch are also tenants in that building and are in …", "url": "https://www.businessinsider.com/morgan-stanley-ubs-merrill-lynch-on-san-francisco-coronavirus-case-2020-3", "urlToImage": "https://i.insider.com/5e66f2c554f25c3dfc610b33?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:26:10Z", "content": "Morgan Stanley, UBS, and Merrill Lynch are telling some of their San Francisco employees who work out of the same tower in San Francisco's financial district that it's business as usual after fellow building tenant Wells Fargo confirmed one of its employees t… [+6131 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "bwinck@businessinsider.com (Ben Winck), Ben Winck", "title": "5 charts that reveal the stunning depth of coronavirus-driven market carnage", "description": "Bryan R Smith/Reuters The convergence of escalating coronavirus fears and an oil-price war has driven market activity not seen since the financial crisis. Monday, March 9 featured a particularly vicious bout of volatility as the S&P 500 closed down nearly 8%,…", "url": "https://www.businessinsider.com/5-charts-stocks-bond-yields-oil-prices-volatility-gold-coronavirus-2020-3", "urlToImage": "", "publishedAt": "2020-03-10T16:42:40Z", "content": "Bryan R Smith/Reuters<ul><li>The convergence of escalating coronavirus fears and an oil-price war has driven market activity not seen since the financial crisis.</li><li>Monday, March 9 featured a particularly vicious bout of volatility as theS&amp;P 500 clos… [+4443 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Carmen Reinicke", "title": "'This is not 2008': BlackRock lays out a scenario it thinks could rescue the record-long economic expansion amid coronavirus fears", "description": "The coronavirus outbreak doesn't need to be the event that ends the longest-ever economic expansion in US history, BlackRock said in a note Monday. The US expansion could continue if a \"preemptive and coordinated policy response is delivered,\" BlackRock said.…", "url": "https://www.businessinsider.com/economic-expansion-rescued-coronavirus-blackrock-fiscal-monetary-policy-comparison-2008-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5db6c726dee0192686757c73-2000/gettyimages-1183767838.jpg", "publishedAt": "2020-03-10T16:20:55Z", "content": "Tasos Katopodis/Getty Images\r\n<ul><li>The coronavirus outbreak doesn't need to be the event that ends the longest-ever economic expansion in US history, BlackRock said in a note Monday. </li><li>The US expansion could continue if a \"preemptive and coordinated… [+2051 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Pimentel", "title": "Coronavirus fears could undermine Oracle's business in what's usually its strongest quarter, analyst warns (ORCL)", "description": "Oracle reports quarterly results on Thursday, and Wall Street will be paying close attention to what the tech giant says about the impact of the coronavirus crisis. Oracle's current quarter, which ends in May, is the tech giant's \"typically strongest\" period,…", "url": "https://www.businessinsider.com/coronavirus-oracle-strongest-quarter-analyst-2020-3", "urlToImage": "https://i.insider.com/5e67a7cee4f9fe25661f4fc7?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:20:05Z", "content": "Oracle's current quarter, which ends in May, is the tech giant's \"typically strongest\" — but the coronavirus crisis could drastically change that, a Wall Street analyst said Tuesday\r\nOracle is set to report fiscal third-quarter results on Thursday, and the fo… [+1732 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "5 charts that reveal the stunning depth of coronavirus-driven market carnage", "description": "The convergence of escalating coronavirus fears and an oil-price war has driven market activity not seen since the financial crisis. Monday, March 9 featured a particularly vicious bout of volatility as the S&P 500 closed down nearly 8%, while massive inflows…", "url": "https://markets.businessinsider.com/commodities/news/5-charts-stocks-bond-yields-oil-prices-volatility-gold-coronavirus-2020-3-1028982097", "urlToImage": null, "publishedAt": "2020-03-10T16:42:40Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Associated Press", "title": "Ivy League Makes Stunning Announcement Amid Coronavirus Fears", "description": "It is the first Division I conference to take that step in fighting the deadly outbreak.", "url": "https://www.huffpost.com/entry/ivy-league-cancels-basketball-tournaments-coronavirus_n_5e67c19ec5b68d61645bbe99", "urlToImage": "https://img.huffingtonpost.com/asset/5e67c7e92600001123b60932.jpeg?ops=1778_1000", "publishedAt": "2020-03-10T17:08:28Z", "content": "The Ivy League on Tuesday canceled its mens and womens basketball tournaments because of concerns about the spread of coronavirus.\r\nThe four-team tournaments were scheduled to be played Friday through Sunday at Lavietes Pavilion in Cambridge, Mass. The Ivy Le… [+2203 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "A 17-year-old high schooler built the viral website that's generating handwashing infographics to your favorite songs", "description": "William Gibson wanted to make handwashing memes using his favorite songs so he built a website to do it for him. The site, washyourlyrics, has since gone viral. More than 200,000 people have made handwashing posters on his site since Sunday. Visit Business In…", "url": "https://www.businessinsider.com/a-17-year-old-made-site-that-generates-handwashing-songs-2020-3", "urlToImage": "https://i.insider.com/5e67c6eee4f9fe50f733bbc2?width=1200&format=jpeg", "publishedAt": "2020-03-10T17:03:43Z", "content": "William Gibson, a high school student in Northamptonshire, UK, got a kick out of the meme that encouraged people to use Gucci Mane's \"Money Machine\" lyrics to ensure they're washing their hands long enough.\r\nThe 17-year-old, who has been building websites and… [+1907 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mia Jankowicz", "title": "The coronavirus outbreak has prompted people around the world to panic buy toilet paper. Here's what they're doing.", "description": "Fears over the novel coronavirus has prompted people around the world to clear supermarket shelves of daily necessities, especially toilet paper. The apparent stockpiling comes as governments and suppliers have warned citizens not to do exactly that. Photos b…", "url": "https://www.businessinsider.com/coronavirus-panic-buying-toilet-paper-stockpiling-photos-2020-3", "urlToImage": "https://i.insider.com/5e6761f7e4f9fe5ef0686ac2?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:38:27Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Griffin", "title": "Coronavirus: Sinister people are knocking on doors claiming to be part of official disease response, police warn", "description": "Scammers are knocking on people's doors and claiming to be part of the official response to the coronavirus, police in New Jersey have warned.The people could then try and take advantage of anxiety around the spread of the disease to sell products at inflated…", "url": "https://news.yahoo.com/coronavirus-sinister-people-knocking-doors-171111975.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5NdcJdlI7wIFuBnCBGO4VQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD02OTY-/https://s.yimg.com/uu/api/res/1.2/x5pZAFnvzLhsb6oUdtFmFw--~B/aD0zNDg7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/f95869d701157ea4254e99dff3dfd719", "publishedAt": "2020-03-10T17:11:11Z", "content": "A researcher works in a lab that is developing testing for the COVID-19 coronavirus at Hackensack Meridian Health Center for Discovery and Innovation on February 28, 2020 in Nutley, New Jersey: Kena Betancur/Getty Images\r\nScammers are knocking on people's doo… [+1989 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "James Crump", "title": "Coronavirus: Fox presenter claims criticism of Trump’s handling of outbreak is ‘impeachment all over again’", "description": "Fox Business host Trish Regan has claimed that criticism of Donald Trump over Covid-19 is an attempt to impeach the president.Ms Regan, who hosts “Trish Regan Primetime” on Fox Business started her show on Monday night by attacking those criticising Trump’s h…", "url": "https://news.yahoo.com/coronavirus-fox-presenter-claims-criticism-161814965.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hKZdOnrLxP5AFxKKJpKwoA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/qWuuqt_Swatqi50vxsrkuw--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/a541173aa5b9f409174b7e5f00d9c5a4", "publishedAt": "2020-03-10T16:18:14Z", "content": "Ms Regan was talking on her show: Fox News\r\nFox Business host Trish Regan has claimed that criticism of Donald Trump over Covid-19 is an attempt to impeach the president.\r\nMs Regan, who hosts Trish Regan Primetime on Fox Business started her show on Monday ni… [+1828 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Elise Foley", "title": "Immigration Courts Allowed To Post Coronavirus Flyers After Told To Remove Them", "description": "The Trump administration ordered court staffers to take down posters on fighting the outbreak, according to the judges union. Then it reversed course.", "url": "https://www.huffpost.com/entry/immigration-courts-coronavirus_n_5e67a965c5b6670e72ff3307", "urlToImage": "https://img.huffingtonpost.com/asset/5e67ab082600000423b6090f.png?cache=clpohe9mtm&ops=1778_1000", "publishedAt": "2020-03-10T17:11:02Z", "content": "The Trump administration told immigration court staffers on Tuesday to put up posters advising the public how to avoid contracting or spreading the new coronavirus, after abruptly ordering them to take down similar signage on Monday. \r\nThe Department of Justi… [+3988 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bradley Saacks", "title": "The world's biggest hedge fund just made a $9.5 billion bet against Europe's biggest public companies like Bayer, Santander and Adidas as the coronavirus puts Italy on lockdown", "description": "Bridgewater made a more than $9.5 billion bet against Europe with short positions in more than a dozen of the continent's most well-known companies. Companies include banks like Spain-based Santander and BBVA, France's BNP and Societe Generale, and Italy's In…", "url": "https://www.businessinsider.com/bridgewater-is-shorting-adidas-santander-bayer-siemens-bbva-bnp-2020-3", "urlToImage": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "publishedAt": "2020-03-10T16:14:39Z", "content": "Bridgewater believes some of Europe's biggest names are set to fall.\r\nAs the coronavirus deadlocks countries like Italy, and is spreading quickly to countries like Spain, the world's biggest hedge fund has made bets against some of the continent's most well-k… [+1513 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "kmclaughlin@businessinsider.com (Kelly McLaughlin)", "title": "As the coronavirus epidemic spreads, the CDC says 136 kids have died from the flu this season — the highest on record in a decade", "description": "The CDC said in a report published last week that there had been about 20,000 reported deaths in the 2019-2020 flu season, 136 of which were children.", "url": "https://news.yahoo.com/coronavirus-epidemic-spreads-cdc-says-170716366.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0YlbWlo1s9Z.U1TFQRYUqA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/T8nCrKRzeLXB7nk3Sb.mPA--~B/aD0xNzcyO3c9MjM2MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/EN/business_insider_articles_888/36a728f0a44288f9dc34887a661cc1b0", "publishedAt": "2020-03-10T17:07:16Z", "content": "Experts believe the increase in cases is because of a rise in influenza B-type cases.\r\nBSIP/UIG Via Getty Images\r\nThe novel coronavirus continues to spread across the US and the world, but the Centers for Disease Control and Prevention says influenza has also… [+1386 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Claire GOUNON", "title": "Coronavirus doesn't stop Purim party for Israel's haredi Jews", "description": "Israel has imposed some of the world's tightest restrictions to contain coronavirus, but that did not stop ultra-Orthodox Jews from hitting the streets Tuesday to celebrate a treasured religious custom: drinking on Purim. Sometimes dubbed the \"fun\" Jewish hol…", "url": "https://news.yahoo.com/coronavirus-doesnt-stop-purim-party-israels-haredi-jews-163421948.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/lSWsf2EHTW0Zx7H9Rsxr4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTYuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/JvsB4tBwbgpJEUMe5_z3Vg--~B/aD01MTQ7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/af34adb0e9987e7811a4acc6a2c2e80f44c03117.jpg", "publishedAt": "2020-03-10T16:34:21Z", "content": "Bnei Brak (Israel) (AFP) - Israel has imposed some of the world's tightest restrictions to contain coronavirus, but that did not stop ultra-Orthodox Jews from hitting the streets Tuesday to celebrate a treasured religious custom: drinking on Purim.\r\nSometimes… [+3166 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Ajani Bazile", "title": "People Are Tweeting About Cheap Flight Prices Because Of The Coronavirus And You Have To See It For Yourself", "description": "BRB, I'm going to Jamaica for brunch. View Entire Post ›", "url": "https://www.buzzfeed.com/ajanibazile/cheap-flights-coronavirus-tweets", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2020-03/10/16/enhanced/491b0f79188f/original-4518-1583857108-9.jpg?crop=1198:627;0,0", "publishedAt": "2020-03-10T16:36:32Z", "content": "Travelers should take extra precaution due to the current global outbreak of the coronavirus. Refer to government travel advisories before proceeding with travel plans, take routine hygiene precautions, and read the fine print on policies before booking trave… [+120 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Britt Hayes on News, shared by Britt Hayes to The A.V. Club", "title": "Peter Rabbit 2 release delayed 5 months due to coronavirus", "description": "First it came for the new Mission: Impossible sequel. Then it came for our toilet paper and beans. Not even James Fucking Bond was safe, and hasn’t he suffered enough?! It piggy-backed on the current state of American politics and obliterated what remained of…", "url": "https://news.avclub.com/peter-rabbit-2-release-delayed-5-months-due-to-coronavi-1842241511", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/c0bezt5vgetdux4plkl7.png", "publishedAt": "2020-03-10T16:43:00Z", "content": "First it came for the new Mission: Impossible sequel. Then it came for our toilet paper and beans. Not even James Fucking Bond was safe, and hasnt he suffered enough?! It piggy-backed on the current state of American politics and obliterated what remained of … [+1019 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Hoai-Tran Bui", "title": "Coronavirus Update: ‘Peter Rabbit 2’ Delayed Until August, Game Shows Filming Without Audiences, and More", "description": "Everything, from the stock market to businesses to the fragile state of various American institutions, has taken a hit from the coronavirus epidemic, which has continued to rapidly spread throughout the world. One of the industries to take a hit is the entert…", "url": "https://www.slashfilm.com/coronavirus-concerns-update-cannes-release-dates/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/amctheatres-seats-feet.jpg", "publishedAt": "2020-03-10T16:30:27Z", "content": "Everything, from the stock market to businesses to the fragile state of various American institutions, has taken a hit from the coronavirus epidemic, which has continued to rapidly spread throughout the world. One of the industries to take a hit is the entert… [+4081 chars]"}, {"source": {"id": null, "name": "Taskandpurpose.com"}, "author": "Task & Purpose", "title": "Watch the Army's new supergun hit a target from 40 miles away", "description": "US Army/Yuma Proving Ground The Army successfully tested its Extended Range Cannon Artillery system and the new XM1299 long-range precision projectile last week. In both tests at Yuma Proving Ground in Arizona, the projectile hit a target about 40 miles away.…", "url": "https://taskandpurpose.com/military-tech/army-extended-range-cannon-artillery-video", "urlToImage": "https://i.insider.com/5e67bf8b84159f46ed7c61de?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:33:29Z", "content": "The Army is putting its Extended Range Cannon Artillery system through its paces.\r\nThe service conducted a demonstration of its new XM1299 long-range precision fires prototype at the Yuma Proving Ground in Arizona on March 6, 2020, nailing a target from rough… [+1847 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Market mayhem", "description": "The global rout in equities amid the widening coronavirus outbreak portends more pain", "url": "https://www.thehindu.com/opinion/editorial/market-mayhem/article31033837.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-03-10T16:33:48Z", "content": "Manic Monday saw Indias bellwether S&amp;P BSE Sensex suffer its worst single-day fall in terms of points as the 30-stock gauge plunged 1,942 points, or 5.2%, to its lowest close in 52 weeks. While the proximate trigger for the headlong selling spree was the … [+2566 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "James Dudko", "title": "2020 Tokyo Olympics More Likely to Be Delayed Than Canceled, Says Board Member", "description": "The 2020 Tokyo Olympics won't be canceled because of the outbreak of the coronavirus, but the games reportedly could be delayed by as much as 24 months...", "url": "https://bleacherreport.com/articles/2880190-2020-tokyo-olympics-more-likely-to-be-delayed-than-canceled-says-board-member", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/856/773/hi-res-4ea2441f6eee19106e8d94ecc74ed403_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-10T16:42:51Z", "content": "CHARLY TRIBALLEAU/Getty Images\r\nThe 2020 Tokyo Olympics won't be canceled because of the outbreak of the coronavirus, but the games reportedly could be delayed by as much as 24 months. \r\nA member of the competition's executive board, Haruyuki Takahashi, told … [+505 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Get your first look at a real Pixel 4a prototype", "description": "The renders were right, and for a budget phone, this looks pretty great.", "url": "https://arstechnica.com/gadgets/2020/03/get-your-first-look-at-a-real-pixel-4a-prototype/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/03/no-emojies-760x380.png", "publishedAt": "2020-03-10T16:59:05Z", "content": "4 with 3 posters participating\r\n<ul><li>\r\n The Pixel 4a. It's looking pretty good for a budget phone. \r\n</li><li>\r\n Let's cut right to the good part. There's a headphone jack on the top! \r\n</li><li>\r\n The back, featuring a single camera and a fingerprint read… [+2771 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Mix of worry and hope: Italian newspapers on coronavirus lockdown", "description": "It's the first time in Italy's post-war history that sweeping peacetime restrictions on daily lives have been imposed.", "url": "https://www.aljazeera.com/news/2020/03/mix-worry-hope-italian-newspapers-coronavirus-lockdown-200310140139989.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/10/79be9f4d49e3458fa91d07dfba962ce4_18.jpg", "publishedAt": "2020-03-10T16:32:10Z", "content": "As Italy remains placed under quarantine in an extraordinary move to curb the spread of coronavirus, the country's newspapers marked Tuesday with a mix of worry and hope about the unprecedented curbs.\r\nWith 9,172 confirmed cases and 463 deaths, Italy is facin… [+3473 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Brian Orelli)", "title": "COVID-19 Nearing Pandemic Level, WHO Warns", "description": "The head of the World Health Organization describes the threat of the coronavirus outbreak reaching pandemic proportions as \"very real.\"", "url": "https://www.fool.com/investing/2020/03/10/covid-19-nearing-pandemic-level-who-warns.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562541/coronavirus-outbreak.jpg", "publishedAt": "2020-03-10T16:19:00Z", "content": "Though at the moment just four countries -- China, South Korea, Italy, and Iran -- account for a vast majority of confirmed COVID-19 cases, World Health Organization Director-General Tedros Adhanom Ghebreyesus thinks we're getting close to experiencing a pand… [+1375 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pence: Health care CEOs agreed to cover coronavirus treatment - Fox News", "description": "Pence: Health care CEOs agreed to cover coronavirus treatment Fox News Watch: Coronavirus task force holds press briefing as US outbreak expands CNBC Trump, Pence Meet With Health Insurance Executives About Coronavirus | NBC News (Live Stream) NBC News Pence:…", "url": "https://www.youtube.com/watch?v=Gpv6BHWj6NI", "urlToImage": "https://i.ytimg.com/vi/Gpv6BHWj6NI/maxresdefault.jpg", "publishedAt": "2020-03-10T16:54:12Z", "content": "President Trump and VP Pence meet with health insurance CEO's about the cost of coronavirus testing and treatment.\r\nFOX News operates the FOX News Channel (FNC), FOX Business Network (FBN), FOX News Radio, FOX News Headlines 24/7, FOXNews.com and the direct-t… [+1616 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Fenit Nirappil, Jenna Portnoy, Antonio Olivo", "title": "D.C., Md., Va. report 19 coronavirus cases, including 3 linked to church - The Washington Post", "description": "D.C., Md., Va. report 19 coronavirus cases, including 3 linked to church The Washington Post DC mayor asks hundreds of church members to quarantine after priest with coronavirus gave Communion Fox News DC church rector who gave Communion and shook hands with …", "url": "https://www.washingtonpost.com/local/dc-maryland-virginia-coronavirus-latest-news/2020/03/10/88eb6de4-62d6-11ea-acca-80c22bbee96f_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/cWlkIAX71z8z6zeAqj8bd-JvLns=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Q46WDXTC3EI6VLGKQDBCXPXJN4.jpg", "publishedAt": "2020-03-10T16:47:56Z", "content": "County Executive Angela D. Alsobrooks said a couple from Prince Georges who had been on a cruise overseas had tested positive for the coronavirus, and were quarantined at home.\r\nAlsobrooks had announced the countys first confirmed case of the virus late Monda… [+4658 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Matt Arco | NJ Advance Media for NJ.com, Jeff Goldman | NJ Advance Media for NJ.com", "title": "Coronavirus update: N.J. confirms 1st death, total cases in state rises to 15 - NJ.com", "description": "Coronavirus update: N.J. confirms 1st death, total cases in state rises to 15 NJ.com New Jersey's First Patient Diagnosed with Coronavirus Speaks Out from His Hospital Bed PEOPLE.com New Jersey's first coronavirus death confirmed New York Post Coronavirus sym…", "url": "https://www.nj.com/coronavirus/2020/03/coronavirus-update-nj-confirms-1st-death-4-new-positive-tests.html", "urlToImage": "https://www.nj.com/resizer/T26D2fI1FXkEZpNDDAxYkdBd_I4=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/2YTDMVA7YBFMLIOE5K5NYKPQYE.jpg", "publishedAt": "2020-03-10T16:58:04Z", "content": "State health officials on Tuesday announced the first coronavirus death in New Jersey as a 69-year-old man from Bergen County, while the total number of positive cases in the state increased to 15.\r\nWe are sad to report the first death in a case of COVID-19 i… [+5436 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Cory Renauer)", "title": "The Gates Foundation and Friends Launch COVID-19 Treatment Accelerator", "description": "Pharmaceutical companies and academics developing antivirals to fight the novel coronavirus will get a financial helping hand.", "url": "https://www.fool.com/investing/2020/03/10/gates-foundation-and-friends-launch-covid-19-treat.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562463/coronavirus-sample-getty.jpg", "publishedAt": "2020-03-10T17:11:00Z", "content": "On Tuesday, The Bill and Melinda Gates Foundation launched a $125 million research fund to support drugmakers and academics in the hunt for effective coronavirus treatments. The Gates Foundation and the Burroughs Wellcome Fund contributed $50 million each, an… [+1530 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Gap Reopens NYC Office After Coronavirus Case Was Inaccurate", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/gap-reopens-nyc-office-after-coronavirus-case-was-inaccurate", "urlToImage": null, "publishedAt": "2020-03-10T16:33:28Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "N.J. Reports First Death From Coronavirus, 15 Total Cases", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/new-jersey-reports-first-death-from-the-new-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T16:47:08Z", "content": null}, {"source": {"id": null, "name": "Vox.com"}, "author": "Brian Resnick", "title": "Italy and China used lockdowns to slow the coronavirus. Could we?", "description": "Italy is restricting the movement of millions of its citizens. A legal expert explains if that could happen here.", "url": "https://www.vox.com/science-and-health/2020/3/10/21171464/coronavirus-us-lock-down-travel-restriction-italy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/qE-saD7_7aQlSYzulRzQCppLRoo=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19782161/1211557861.jpg.jpg", "publishedAt": "2020-03-10T16:40:00Z", "content": "Italian State Police officers and Italian soldiers process passengers leaving from Milano Centrale train station on March 10, 2020, in Milan, Italy. | Emanuele Cremaschi/Getty Images Italy is restricting the movement of millions of its citizens. A legal exper… [+7976 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Rahul", "title": "Hands-on video reveals specifications of the Pixel 4a smartphone", "description": "Google was supposed to release its budget Pixel 4a smartphone at the I/O event, which is now canceled due to the Coronavirus outbreak. While the cancellation of the event raises a big question mark on the release date of the Pixel 4a, a hands-on video of the …", "url": "https://mspoweruser.com/google-pixel-4a-hands-on-video-leak/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2019/12/Google_Pixel_4a_5K_render_2-1200x675.jpg", "publishedAt": "2020-03-10T16:50:31Z", "content": "Google was supposed to release its budget Pixel 4a smartphone at the I/O event, which is now canceled due to the Coronavirus outbreak. While the cancellation of the event raises a big question mark on the release date of the Pixel 4a, a hands-on video of the … [+1291 chars]"}, {"source": {"id": null, "name": "Kottke.org"}, "author": "Jason Kottke", "title": "COVID-19 Empties Out Public Spaces", "description": "For the Atlantic, Alan Taylor compiled a bunch of photos of normally bustling places that are a lot emptier due to the COVID-19 cr", "url": "https://kottke.org/20/03/covid-19-empties-out-public-spaces", "urlToImage": "https://kottke.org/plus/misc/images/covid-19-empty-spaces-01.jpg", "publishedAt": "2020-03-10T16:32:48Z", "content": "For the Atlantic, Alan Taylor compiled a bunch of photos of normally bustling places that are a lot emptier due to the COVID-19 crisis. This is the Grand Mosque in Mecca: A Europa league football match played in an empty stadium (play in Italy’s Serie A leagu… [+257 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Covid-19: 6 more cases in Kerala, 3 in Karnataka", "description": "Twelve more people have tested positive for coronavirus - six in Kerala and three each in Karnataka and Pune, state authorities said on Tuesday as the total cases went up to 59 and amid COVID-19 scare, a combination of two anti-HIV drugs was used for the firs…", "url": "https://timesofindia.indiatimes.com/india/12-more-coronavirus-cases-in-kerala-karnataka-pune-58-indians-brought-back-from-iran/articleshow/74566386.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-74566389,width-1070,height-580,imgsize-477264,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-03-10T16:16:03Z", "content": "Copyright © 2020 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Apple shares first trailer for 'Central Park' animated series", "description": "Apple on Tuesday shared a trailer for &quot;Central Park,&quot; an upcoming animated series slated to make its Apple TV+ debut on May 29.", "url": "https://appleinsider.com/articles/20/03/10/apple-shares-first-trailer-for-central-park-animated-series", "urlToImage": "https://photos5.appleinsider.com/gallery/34853-63261-Central-Park-Apple-TV+-xl.jpg", "publishedAt": "2020-03-10T16:38:20Z", "content": "Apple on Tuesday shared a trailer for \"Central Park,\" an upcoming animated series slated to make its Apple TV+ debut on May 29.\"Central Park,\" created by Bob's Burgers creator Loren Bouchard, is described as a musical comedy that follows the adventures of a f… [+795 chars]"}, {"source": {"id": null, "name": "Investors.com"}, "author": null, "title": "Dow Jones Gives Up Huge Gains Amid Trump Payroll Tax Cut Confusion, As Coronavirus Stock Market Correction Continues - Investor's Business Daily", "description": "Dow Jones Gives Up Huge Gains Amid Trump Payroll Tax Cut Confusion, As Coronavirus Stock Market Correction Continues Investor's Business Daily How to stay financially stable amid coronavirus panic CBS This Morning Dow rallies more than 1,100 points in a wild …", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-trump-coronavirus-stock-market-correction-continues-apple-stock/", "urlToImage": null, "publishedAt": "2020-03-10T16:25:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mike Pence says health insurance companies will waive copays for coronavirus testing | ABC News - ABC News", "description": "Mike Pence says health insurance companies will waive copays for coronavirus testing | ABC News ABC News New ‘presumptive positive’ coronavirus cases reported in Denver, Eagle counties FOX 31 Denver Medicare will cover coronavirus tests. Here's how to get one…", "url": "https://www.youtube.com/watch?v=I1C1taeQyes", "urlToImage": "https://i.ytimg.com/vi/I1C1taeQyes/maxresdefault.jpg", "publishedAt": "2020-03-10T16:16:55Z", "content": "Vice Pres. Mike Pence at White House meeting with health insurance CEOs: \"All the insurance companies here...have agreed to waive all copays on coronavirus testing and extend coverage for coronavirus treatment in all of their benefit plans.\" abcn.ws/39xbJP8\r\n… [+254 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "msravindran", "title": "U.K.’s Royal Television Society Program Awards to Be Live Streamed Amid Coronavirus Concerns", "description": "The U.K.’s Royal Television Society (RTS) Program Awards is to live stream its annual awards — one of the most important domestic television events of the calendar year — after escalating concerns around the spread of coronavirus in the U.K. The organization …", "url": "https://variety.com/2020/biz/global/u-k-s-royal-television-society-program-awards-to-be-live-streamed-amid-coronavirus-concerns-1203528882/", "urlToImage": "https://pmcvariety.files.wordpress.com/2019/06/hbo-chernobyl-e1566487235575.jpg?w=700&h=393&crop=1", "publishedAt": "2020-03-10T16:55:15Z", "content": "The U.K.’s Royal Television Society (RTS) Program Awards is to live stream its annual awards — one of the most important domestic television events of the calendar year — after escalating concerns around the spread of coronavirus in the U.K.\r\nThe organization… [+1643 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "New York to Close Gathering Places in Suburb Hit By Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/new-york-to-close-gathering-places-in-suburb-hit-by-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T16:59:40Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus: There's no reason to play without fans, says Pep Guardiola", "description": "Manchester City manager Pep Guardiola says he would prefer matches to be postponed rather than played behind closed doors.", "url": "https://www.bbc.co.uk/sport/av/football/51825259", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/FD35/production/_111212846_p086741m.jpg", "publishedAt": "2020-03-10T16:47:34Z", "content": "Manchester City manager Pep Guardiola says he would prefer matches to be postponed rather than played behind closed doors, adding there \"is no reason to play without the people\".\r\nREAD MORE: Guardiola against closed-doors games"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Flash deal: Apple's latest iPad drops to $249 with coupon", "description": "With prices creeping up on Apple's latest 10.2-inch iPad, Nationwide Distributors via Google Shopping has the 32GB Wi-Fi model on sale for $249.99 (the lowest price available) with coupon.", "url": "https://appleinsider.com/articles/20/03/10/flash-deal-apples-latest-ipad-drops-to-249-with-coupon", "urlToImage": "https://photos5.appleinsider.com/gallery/34852-63258-apple-ipad-deal-march-2020-xl.jpg", "publishedAt": "2020-03-10T16:13:58Z", "content": "With prices creeping up on Apple's latest 10.2-inch iPad, Nationwide Distributors via Google Shopping has the 32GB Wi-Fi model on sale for $249.99 (the lowest price available) with coupon.AppleInsider proudly offers readers some of the best deals on Apple pro… [+1575 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Telegraph reporters", "title": "Coronavirus Q&A: How to help older people", "description": "The coronavirus poses a more serious risk for older people and those with underlying health conditions and Public Health England has advised those with coronavirus symptoms to stay away from their older relatives.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-qahow-help-older-people/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/03/10/TELEMMGLPICT000226911414-xlarge_trans_NvBQzQNjv4BqaRL1kC4G7DT9ZsZm6Pe3PehAFAI_f6ud569StXyOKH0.jpeg?imwidth=1200", "publishedAt": "2020-03-10T16:30:18Z", "content": "The coronavirus poses a more serious risk for older people and those with underlying health conditions and Public Health England has advised those with coronavirus symptoms to stay away from their older relatives. \r\nHowever, isolation and loneliness are alrea… [+1045 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Mariela Navas", "title": "Buckets for toilets, recycled gloves: Venezuelan hospitals await coronavirus unprepared", "description": "In a hospital in Venezuela's western city of Maracaibo, chronic water shortages have left staff using paint buckets as toilets. With medical gloves in short supply, workers use the same pair on multiple patients.", "url": "https://www.reuters.com/article/us-health-coronavirus-venezuela-idUSKBN20X2F1", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501320690&w=1200&r=LYNXMPEG291HQ", "publishedAt": "2020-03-10T16:43:49Z", "content": "MARACAIBO/SAN CRISTOBAL, Venezuela (Reuters) - In a hospital in Venezuela’s western city of Maracaibo, chronic water shortages have left staff using paint buckets as toilets. With medical gloves in short supply, workers use the same pair on multiple patients.… [+2867 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "In Saudi's Qatif region, residents adapt to coronavirus lockdown", "description": "Worshippers went online to listen to sermons. Families stocked up on groceries. And shoppers rushed to buy up hand sanitizers and masks.", "url": "https://www.reuters.com/article/us-health-coronavirus-saudi-qatif-idUSKBN20X2IT", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501326679&w=1200&r=LYNXMPEG291L0", "publishedAt": "2020-03-10T17:06:15Z", "content": "DUBAI (Reuters) - Worshippers went online to listen to sermons. Families stocked up on groceries. And shoppers rushed to buy up hand sanitizers and masks. \r\nFor the most part, though, residents in Saudi Arabia’s Qatif region are adapting to new restrictions a… [+3174 chars]"}, {"source": {"id": null, "name": "Thetruthaboutcars.com"}, "author": "Steph Willems", "title": "Cadillac Lyriq Sings Sad Song; Coming-out Party Kiboshed by Virus", "description": "The public debut of Cadillac’s first all-electric model has hit a snag in the form of the fast-growing coronavirus epidemic. A splashy (aren’t all reveals splashy?) unveiling scheduled to take place April 2 is now scrapped, Bloomberg reports. The article, whi…", "url": "https://www.thetruthaboutcars.com/2020/03/cadillac-lyriq-sings-sad-song-coming-out-party-kiboshed-by-virus/", "urlToImage": "https://www.thetruthaboutcars.com/wp-content/uploads/2019/01/Cadillac-EV-002-610x378.jpg", "publishedAt": "2020-03-10T16:20:37Z", "content": "The public debut of Cadillac’s first all-electric model has hit a snag in the form of the fast-growing coronavirus epidemic. A splashy (aren’t all reveals splashy?) unveiling scheduled to take place April 2 is now scrapped, Bloombergreports.\r\nThe article, whi… [+1525 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Jordan bars entry from West Bank, Israel, Iraq, Egypt due to coronavirus", "description": "Jordan on Tuesday closed border crossings with Israel and the Israeli-occupied West Bank and its seaports to shipping from Egypt as well as barred overland passenger traffic from Iraq to protect the kingdom from coronavirus, the health minister said.", "url": "https://www.reuters.com/article/us-health-coronavirus-jordan-idUSKBN20X2F5", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T16:45:13Z", "content": "AMMAN (Reuters) - Jordan on Tuesday closed border crossings with Israel and the Israeli-occupied West Bank and its seaports to shipping from Egypt as well as barred overland passenger traffic from Iraq to protect the kingdom from coronavirus, the health minis… [+1218 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Berlin shuts big state theater, opera, concert halls until April 19 over coronavirus", "description": "Berlin said on Tuesday performances will not be held from March 11-April 19 at large halls in state theaters, opera houses and concert halls in the German capital, with the aim of inhibiting the spread of the coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-berlin-idUSKBN20X2JL", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T17:06:47Z", "content": "BERLIN (Reuters) - Berlin said on Tuesday performances will not be held from March 11-April 19 at large halls in state theaters, opera houses and concert halls in the German capital, with the aim of inhibiting the spread of the coronavirus. \r\n“I also recommen… [+159 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Paris-Nice: Ivan Garcia Cortina claims shock stage three win over Peter Sagan", "description": "Spain's Ivan Garcia Cortina claims a shock win over Peter Sagan in a bunch sprint finish on stage three of Paris-Nice.", "url": "https://www.bbc.co.uk/sport/cycling/51824788", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/11577/production/_111213017_cortina_getty.jpg", "publishedAt": "2020-03-10T17:05:32Z", "content": "Ivan Garcia Cortina (far left) held off the challenge of Peter Sagan (left) on the uphill drag to the line\r\nSpain's Ivan Garcia Cortina claimed a shock win in a bunch sprint finish on stage three of Paris-Nice.\r\nThe Bahrain-McLaren rider, 24, kicked early and… [+2043 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Steven Zeitchik", "title": "For the entertainment business, coronavirus brings cancellations, confusion and chaos - The Washington Post", "description": "For the entertainment business, coronavirus brings cancellations, confusion and chaos The Washington Post", "url": "https://www.washingtonpost.com/business/2020/03/10/entertainment-business-coronavirus-brings-cancellations-confusion-chaos/", "urlToImage": "https://www.washingtonpost.com/resizer/fohC7UsKVR8KXiuJDTj7KzwgmG8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LZ4OZBTACQI6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-10T16:24:34Z", "content": "With the novel coronavirus spreading, companies are scrambling to reschedule and often cancel a wide range of events. Nearly every branch of the industry, from movies to music to theater, is facing a decision: what to do away with, and when to make that call.… [+7340 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gary Barker, Contributor, Gary Barker, Contributor https://www.forbes.com/sites/garybarker/", "title": "Coronavirus: How It Could Affect The Housing Market", "description": "Concerns continue to mount over the potential spread, duration and deadliness of the coronavirus and any effects it could have on global economies. But what does this mean for the U.K. property market?", "url": "https://www.forbes.com/sites/garybarker/2020/03/10/coronavirus-how-it-could-affect-the-housing-market/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1163450470%2F0x0.jpg", "publishedAt": "2020-03-10T16:53:19Z", "content": "The U.K. market has so far proven mostly resilient to the collateral impact of the coronavirus. \r\nGetty\r\nThe coronavirus, officially known as SARS-CoV-2, and which causes the disease COVID-19, has affected over 114,000 people and spread to over 115 countries … [+7810 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (John Rosevear)", "title": "General Motors Cancels Reveal of New Electric Cadillac Over Coronavirus Concerns", "description": "GM is mulling other ways to show off its new Tesla-fighter.", "url": "https://www.fool.com/investing/2020/03/10/general-motors-cancels-reveal-of-new-electric-cadi.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562561/2021-cadillac-lyriq.jpg", "publishedAt": "2020-03-10T17:03:00Z", "content": "General Motors (NYSE:GM) has cancelled an event at which it planned to reveal the upcoming Cadillac Lyriq battery-electric SUV due to the outbreak of the novel coronavirus.\r\nGM had planned to unveil the all-new Lyriq at a media event in Los Angeles on April 2… [+1434 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Sam Mintz", "title": "Travel slump worsens as airlines try to blame media", "description": "Health officials have warned, though, that it may not be safe for everyone to fly everywhere.", "url": "https://www.politico.com/news/2020/03/10/airlines-travel-slump-coronavirus-125016", "urlToImage": "https://static.politico.com/01/a2/1ef5e45b4443b4d88b82c381e826/200310-airport-getty-773.jpg", "publishedAt": "2020-03-10T16:43:58Z", "content": "The trade group's plea comes amid fresh warnings and widespread fear around the disease, along with new figures suggesting a worsening financial situation for the airline industry.\r\nYesterday, the credit rating agency Moody's downgraded the industry's outlook… [+771 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephen Wade and Graham Wade / AP", "title": "The Tokyo Olympics Are on for Now — But the Clock Is Ticking", "description": "The tentacles of canceling the Tokyo Olympics — or postponing or staging it in empty venues — would reach into every corner of the globe.", "url": "https://time.com/5800244/tokyo-olympics-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/tokyo-olympics-coronavirus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-10T17:01:05Z", "content": "(TOKYO) — The tentacles of canceling the Tokyo Olympics — or postponing or staging it in empty venues — would reach into every corner of the globe, much like the spreading virus that now imperils the opening ceremony on July 24.\r\nThe International Olympic Com… [+8895 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Chico Harlan and Stefano Pitrelli, The Washington Post", "title": "Italy's lockdown upends most basic routines and joys...", "description": "ROME - Italy on Tuesday was a country in quiet emergency: little chatter, few hugs, few cars, no sports, empty piazzas, vacated restaurants and a deepening sense that weeks of social isolation was the only way to slow the coronavirus. \n The government's histo…", "url": "http://www.washingtonpost.com/world/italy-coronavirus-lockdown/2020/03/10/f7ed95c4-5ff6-11ea-ac50-18701e14e06d_story.html", "urlToImage": "https://s.hdnux.com/photos/01/11/04/52/19155630/17/rawImage.jpg", "publishedAt": "2020-03-10T16:40:36Z", "content": "<ul><li>Few people walk around the Pantheon square, in Rome, Tuesday, March 10, 2020. Italy entered its first day under a nationwide lockdown after a government decree extended restrictions on movement from the hard-hit north to the rest of the country to pre… [+4551 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bill Conerly, Contributor, Bill Conerly, Contributor https://www.forbes.com/sites/billconerly/", "title": "Rolling Recessions Are The Likely Economic Impact Of New Coronavirus And COVID-19", "description": "The path of the coronavirus and its economic consequences are highly uncertain. Most likely, the world will see rolling recessions as the disease spreads to different areas, with economic recovery as the local epidemics die down.", "url": "https://www.forbes.com/sites/billconerly/2020/03/10/rolling-recessions-are-the-likely-economic-impact-of-new-coronavirus-and-covid-19/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67c92ae1e61700080e6a5d%2F0x0.jpg", "publishedAt": "2020-03-10T17:09:50Z", "content": "The new coronavirus, which causes the new disease COVID-19, is the major uncertainty in the global economy, with the potential to trigger a worldwide recession. The path of the disease and its economic consequences are highly uncertain. Most likely, the world… [+3967 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Jake Kanter", "title": "UK’s Royal Television Society Awards To Be Held Behind Closed Doors Amid Coronavirus Concerns", "description": "EXCLUSIVE: Britain’s prestigious Royal Television Society Programme Awards are to be held behind closed doors next week amid coronavirus concerns. The awards, one of the pinnacles of the RTS calendar, are due to take place on March 17 at central London’s Gros…", "url": "https://deadline.com/2020/03/rts-awards-canceled-coronavirus-1202878394/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/03/shutterstock_editorial_10160650p-e1583856421649.jpg?w=1024", "publishedAt": "2020-03-10T16:44:58Z", "content": "EXCLUSIVE: Britain’s prestigious Royal Television Society Programme Awards are to be held behind closed doors next week amid coronavirus concerns.\r\nThe awards, one of the pinnacles of the RTS calendar, are due to take place on March 17 at central London’s Gro… [+750 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus survivor reveals what it's like to have Covid-19 - Channel 4 News", "description": "Coronavirus survivor reveals what it's like to have Covid-19 Channel 4 News When to contact a doctor: Coronavirus (COVID-19) symptoms SILive.com Coronavirus outbreak: Is COVID-19 worse than the flu? Global News Battle Ground Academy closes Tuesday as student …", "url": "https://www.youtube.com/watch?v=G9oqvJ3iXGI", "urlToImage": "https://i.ytimg.com/vi/G9oqvJ3iXGI/maxresdefault.jpg", "publishedAt": "2020-03-10T16:35:46Z", "content": "Connor Reed, a British man who works at a school in Wuhan, explains how it felt to have the Covid-19 coronavirus, discusses what life is like after 40 days in lockdown and how he thinks people in the UK would cope in similar circumstances. (Subscribe: https:/… [+279 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Justin Timberlake and Anderson.Paak Connect for \"Don't Slack\" Single", "description": "Justin Timberlake and Anderson.Paak connect for the latest single from the ongoing Trolls World Tour Soundtrack with \"Don't Slack.\" The track comes complete with an accompanying lyric video featuring introductions to numerous characters from the upcoming movi…", "url": "https://hypebeast.com/2020/3/justin-timberlake-anderson-paak-dont-slack-trolls-world-tour-lyric-video", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fjustin-timberlake-anderson-paak-dont-slack-trolls-world-tour-song-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-10T17:01:44Z", "content": "Justin Timberlake and Anderson .Paak connect for the latest single from the ongoing Trolls World Tour Soundtrack with “Don’t Slack.” The track comes complete with an accompanying lyric video featuring introductions to numerous characters from the upcoming mov… [+815 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Daniel B. Kline)", "title": "Why I'm Holding Starbucks Stock No Matter What", "description": "The worst may be yet to come for the coffee chain.", "url": "https://www.fool.com/investing/2020/03/10/why-im-holding-starbucks-stock-no-matter-what.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562209/starbucks-now.jpg", "publishedAt": "2020-03-10T16:30:00Z", "content": "Starbucks (NASDAQ:SBUX) has already faced major business disruptions due to the coronavirus. The chain chose to close more than half of its stores in China, and it operated many others under strong restrictions, like only offering takeout.\r\nThose problems may… [+2795 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "Pep Guardiola expects games in England to be hit by coronavirus restrictions", "description": "\"It happened already in Italy, the league is suspended and in Spain the games behind closed doors. I think it's going to happen here,\" said Pep Guardiola.", "url": "https://indianexpress.com/article/sports/football/pep-guardiola-england-coronavirus-restrictions-6308395/", "urlToImage": "https://images.indianexpress.com/2020/02/guardiola-759.jpg?w=759", "publishedAt": "2020-03-10T16:54:55Z", "content": "By: Reuters | \r\nPublished: March 10, 2020 10:24:55 pm\r\nPep Guardiola’s Manchester City will face Arsenal in the midweek. (Source: File Photo)Manchester City manager Pep Guardiola believes soccer matches in England will soon have to be played in empty stadiums… [+1336 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NC governor declares state of emergency as state deals with coronavirus - Charlotte Observer", "description": "NC governor declares state of emergency as state deals with coronavirus Charlotte Observer Coronavirus NC: State leaders discuss coronavirus response as COVID-19 cases increase in Wake County ABC11 5 Wake County residents test positive for coronavirus after B…", "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3LmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2xvY2FsL2FydGljbGUyNDEwNTU3NTEuaHRtbNIBQmh0dHBzOi8vYW1wLmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2xvY2FsL2FydGljbGUyNDEwNTU3NTEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-03-10T16:12:46Z", "content": null}, {"source": {"id": null, "name": "People.com"}, "author": "Claudia Harmata", "title": "What Is 'Social Distancing' and How Does It Help Prevent the Spread of Coronavirus?", "description": "As health officials attempt to contain the rapidly spreading novel coronavirus (COVID-19 ), some experts are suggesting that communities practice “social distancing.” Social distancing for individuals is described by Harvard Health as “maintaining enough dist…", "url": "https://people.com/health/health-officials-begin-to-suggest-social-distancing-amid-coronavirus-outbreak/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Fgettyimages-1210144924.jpg%3Fcrop%3D0px%2C855px%2C6000px%2C3153px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T17:10:20Z", "content": "As health officials attempt to contain the rapidly spreading novel coronavirus (COVID-19), some experts are suggesting that communities practice “social distancing.”\r\nSocial distancing for individuals is described by Harvard Health as “maintaining enough dist… [+3726 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "Coronavirus panic leaves Madrid supermarket looking like 'end of the world'", "description": "Panic buying at supermarkets in central Madrid triggered by the spread of coronavirus led to long queues and empty shelves on Tuesday.", "url": "https://www.euronews.com/2020/03/10/coronavirus-panic-leaves-madrid-supermarket-looking-like-end-of-the-world", "urlToImage": "https://static.euronews.com/articles/stories/04/55/89/20/1000x563_cmsv2_a7fbc818-a07c-550c-b3f4-ec7c2e7d55cf-4558920.jpg", "publishedAt": "2020-03-10T16:19:23Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Jeremy Bowman)", "title": "Why Trivago Stock Was Gaining Today", "description": "Shares of the hotel-booking site jumped as investors seemed to believe the stock had been oversold.", "url": "https://www.fool.com/investing/2020/03/10/why-trivago-stock-was-gaining-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562547/trivago-2.jpeg", "publishedAt": "2020-03-10T16:34:00Z", "content": "What happened\r\nShares of Trivago (NASDAQ:TRVG) were bouncing back today as value hunters seemed to spy opportunity in the hotel metasearch company after the stock had fallen nearly 40% since the coronavirus sell-off first began. Shares jumped as much as 23% t… [+1716 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Airlines cancel thousands of flights", "description": "Ryanair, BA and Norwegian are among carriers cancelling services as demand collapses.", "url": "https://www.bbc.co.uk/news/business-51818492", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/03FD/production/_111212010_ryanair_reuters.jpg", "publishedAt": "2020-03-10T16:30:33Z", "content": "Image copyrightReuters\r\nThousands of flights have been cancelled worldwide as airlines struggle to cope with a slump in demand caused by the coronavirus outbreak.\r\nBritish Airways and Ryanair have both stopped all services to and from Italy until next month a… [+3490 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Abner Li", "title": "Google reschedules Games Dev Summit for March 23, working with GDC Relief Fund", "description": "Following GDC’s postponement due to the coronavirus, Google announced that it was planning a digital developer conference to replace its usual on-site presence. The Google for Games Dev Summit is now taking place a week later on March 23. more… The post Googl…", "url": "https://9to5google.com/2020/03/10/google-games-dev-summit/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/03/google-for-games-2020-livestream.jpeg?quality=82&strip=all", "publishedAt": "2020-03-10T16:54:40Z", "content": "Following GDC’s postponement due to the coronavirus, Google announced that it was planning a digital developer conference to replace its usual on-site presence. The Google for Games Dev Summit is now taking place a week later on March 23.\r\nGoogle for Games is… [+1760 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jessica DiNapoli", "title": "Spread of virus drives Corporate America into cyberspace for annual meetings", "description": "More U.S. companies are moving their annual shareholder meetings online to help contain the spread of coronavirus, raising concerns among corporate democracy advocates about investors losing access to top executives and board directors.", "url": "https://www.reuters.com/article/us-health-coronavirus-shareholdermeeting-idUSKBN20X2EK", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501311976&w=1200&r=LYNXMPEG291HM", "publishedAt": "2020-03-10T16:18:34Z", "content": "(Reuters) - More U.S. companies are moving their annual shareholder meetings online to help contain the spread of coronavirus, raising concerns among corporate democracy advocates about investors losing access to top executives and board directors. \r\nStarbuck… [+5197 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Alex Young", "title": "SXSW, Ultra Music Festival Are Not Offering Ticket Refunds", "description": "Neither Miami’s Ultra Music Festival nor Austin’s SXSW will be offering ticket refunds. Both events canceled in 2020 due to the coronavirus.", "url": "https://consequenceofsound.net/2020/03/sxsw-ultra-no-refunds/", "urlToImage": "https://consequenceofsound.net/wp-content/uploads/2020/03/SXSW-and-Ultra-Music-Festival.jpg?quality=80", "publishedAt": "2020-03-10T16:21:07Z", "content": "The 2020 editions of Miami’s Ultra Music Festival and Austin’s SXSW have beencanceled due to concerns over the coronavirus. As both events were scheduled to take place this month, their last-minute cancelations have undoubtely left many attendees in a financi… [+2604 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jono Bacon, Contributor, Jono Bacon, Contributor https://www.forbes.com/sites/jonobacon/", "title": "How To Switch To Remote Working Quickly, For Both Employers And Employees", "description": "Many companies are urgently switching to remote working due to the recent Coronavirus outbreak. How do you do this though?  Here is a practical guide for to make the switch to remote working for your company and staff quickly and efficiently.", "url": "https://www.forbes.com/sites/jonobacon/2020/03/10/how-to-switch-to-remote-working-quickly-for-both-employers-and-employees/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67c1b27d6f2600068f1ffc%2F0x0.jpg", "publishedAt": "2020-03-10T16:43:48Z", "content": "Scandinavian style working space.\r\nGetty\r\nWith the recent growth of COVID-19, commonly known as Coronavirus, many companies are asking their staff to work from home and avoid all non-essential traffic. This includes companies such as Amazon, Facebook, Microso… [+17442 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "San Francisco has set a 50-guest limit on City Hall weddings through March 20 to discourage mass gatherings, as 13 confirmed coronavirus cases have been detected in the city", "description": "San Francisco is capping the number of guests at its City Hall weddings at 50 people amid the coronavirus outbreak. The move is the result of a city order banning large events of 50 people or more at city-owned facilities, like City Hall and the San Francisco…", "url": "https://www.businessinsider.com/san-francisco-coronavirus-outbreak-city-hall-weddings-guest-limit-2020-3", "urlToImage": "https://i.insider.com/5e67a42884159f22e4199148?width=1200&format=jpeg", "publishedAt": "2020-03-10T16:27:19Z", "content": "If you want to get married at San Francisco's City Hall before March 20, you'll have to limit your guest list to no more than 50 people.\r\nThe city of San Francisco just placed a ban on city-owned facilities hosting non-essential group events exceeding 50 peop… [+1145 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson, Lena Sun, Andrew Freedman", "title": "Social distancing could buy U.S. valuable time against coronavirus - The Washington Post", "description": "The United States is at a make-or-break moment with coronavirus that will test of one of the most basic, but inconvenient and disruptive, public health tools in the book: social distancing.", "url": "https://www.washingtonpost.com/health/2020/03/10/social-distancing-coronavirus/", "urlToImage": "https://www.washingtonpost.com/resizer/dg3VytRoAJSSGisitpG_dqRzXM4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EHSMPZDAAYI6VLCQDBYB4FHANU.jpg", "publishedAt": "2020-03-10T16:37:21Z", "content": "The best way to prevent a catastrophic explosion of new cases in the next few weeks, many experts think, is to break potential chains of transmission by preventing sick people from coming in close contact with healthy ones, whether it means canceling conferen… [+7783 chars]"}, {"source": {"id": null, "name": "Ksdk.com"}, "author": null, "title": "3 steps to disinfect your tech to avoid coronavirus - KSDK.com", "description": "Technology Expert Burton Kelso shares three steps for disinfecting your tech to avoid coronavirus.", "url": "https://www.ksdk.com/article/entertainment/television/show-me-st-louis/3-steps-to-disinfect-tech-avoid-coronavirus/63-5b962ba2-136d-4dca-9288-f9b8ee3e8c53", "urlToImage": "https://media.ksdk.com/assets/KSDK/images/6ac6c60e-1aed-461d-8826-9e1659b82d24/6ac6c60e-1aed-461d-8826-9e1659b82d24_1140x641.jpg", "publishedAt": "2020-03-10T16:51:00Z", "content": "ST. LOUIS 1.) Use cleaning products designed for technology. You don't want to use harsh cleaning chemicals on your devices, including water. Remember these are delicate gadgets. While it's tempting to use anti-bacterial wipes or sprays on your computers, key… [+1658 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Annie Massa and Davide Scigliuzzo", "title": "BlackRock Employee in New York Tests Positive for Coronavirus", "description": "(Bloomberg) -- BlackRock Inc., the world’s biggest asset manager, said that an employee in New York City tested positive for coronavirus.The person worked at the firm’s 40 East 52nd Street office in Manhattan, near its headquarters, according to a statement. …", "url": "https://finance.yahoo.com/news/blackrock-employee-york-tests-positive-164931724.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/W4QLwNxIFQ4knT3ajPsBkQ--~B/aD02MDA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bloomberg_markets_842/05215ba7748da84ed8ff205e27f3ddd8", "publishedAt": "2020-03-10T16:49:31Z", "content": "(Bloomberg) -- BlackRock Inc., the worlds biggest asset manager, said that an employee in New York City tested positive for coronavirus.\r\nThe person worked at the firms 40 East 52nd Street office in Manhattan, near its headquarters, according to a statement. … [+1583 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "Airlines Slash Flights, Freeze Hiring as Coronavirus Impacts Travel", "description": "Delta Air Lines said travel demand has fallen so badly that it expects one-third of seats to be empty in March on flights within the United States.", "url": "https://www.snopes.com/ap/2020/03/10/airlines-slash-flights-freeze-hiring-as-coronavirus-impacts-travel/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/ap-airlines-slash-flights-e1583856913514.jpg?fit=1200,735", "publishedAt": "2020-03-10T16:16:29Z", "content": "Airlines are slashing flights and freezing hiring as they experience a sharp drop in bookings and a rise in cancellations in the face of the spreading coronavirus.\r\nDelta Air Lines said Tuesday that travel demand has fallen so badly in the past week that it e… [+3393 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jemma Carr For Mailonline", "title": "Four British skiers with coronavirus quarantined in Austrian house with no running water or soap", "description": "EXCLUSIVE The 'negatives' have been told to bring food to the 'positives' in the coronavirus quarantine house after being transported there from a hotel in Saalbach.", "url": "https://www.dailymail.co.uk/news/article-8095789/Four-British-skiers-coronavirus-quarantined-Austrian-house-no-running-water-soap.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/10/16/25782050-0-image-a-25_1583858439335.jpg", "publishedAt": "2020-03-10T16:43:24Z", "content": "Four skiers diagnosed with coronavirus have been quarantined in a 's***hole' Austrian house with no heating, running water or soap along with six other British holidaymakers who tested all clear for the killer bug.\r\nThe 'negatives' have been made to bring foo… [+8779 chars]"}, {"source": {"id": null, "name": "Fark.com"}, "author": null, "title": "Iran digs mass graves for its 27 alcohol poisoning dead that tried to cure themselves from coronavirus [Scary]", "description": "Iran digs mass graves for its 27 alcohol poisoning dead that tried to cure themselves from coronavirus", "url": "https://www.fark.com/comments/10738822/Iran-digs-mass-graves-for-its-27-alcohol-poisoning-dead-that-tried-to-cure-themselves-from-coronavirus", "urlToImage": "https://fark-usrimg-full.nyc3.digitaloceanspaces.com/l/lO/fark_lOfddsw3CecQqepvFDd-2Vgipxg.jpg?AWSAccessKeyId=HBAYEKZHGUB4NAYQBVSQ&Expires=1584331200&Signature=mhsOA3Vfh4Yh%2BATUnjaGpBlla1A%3D", "publishedAt": "2020-03-10T16:23:36Z", "content": "They better start digging mass graves cause they have hundreds of thousands of infected in the country...Good thing for Iran, the majority of their population is young.\r\n0-14 years: 24.23% (male 10,291,493 /female 9,823,838)15-24 years: 14.05% (male 5,973,320… [+252 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "COVID-19 index case from TS to be discharged soon", "description": "Youth may be discharged next Sunday if he tests negative a second time", "url": "https://www.thehindu.com/news/national/telangana/covid-19-index-case-from-ts-to-be-discharged-soon/article31033993.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-03-10T17:07:07Z", "content": "The 24-year-old index (first) COVID-19 case from Telangana would be discharged in four days if he tests negative in the second consecutive test. The youngster who was admitted to Gandhi Hospital with viral pneumonia on March 1, tested negative for coronavirus… [+1298 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PR Newswire", "title": "ARUP Rolls Out Coronavirus Testing", "description": "ARUP Laboratories today announced the launch of its new test for the novel coronavirus. ARUP will start COVID-19 testing on March 12, 2020.", "url": "https://news.yahoo.com/arup-rolls-coronavirus-testing-164200844.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hSrfUiX4KEm793X2A1YZoQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwMDtoPTE5Ng--/https://s.yimg.com/uu/api/res/1.2/pw50giau7WvmRKMkwb.ZZA--~B/aD05ODt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/c9b1b140cc8215000457552a1eee326e", "publishedAt": "2020-03-10T16:42:00Z", "content": "SALT LAKE CITY, March 10, 2020 /PRNewswire/ -- ARUP Laboratories today announced the launch of its new test for the novel coronavirus. ARUP will start COVID-19 testing on March 12, 2020.\r\n(PRNewsfoto/ARUP Laboratories)\r\nAs a leading national reference laborat… [+4218 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "Barcelona’s UCL decider against Napoli to be played without spectators", "description": "The other games in UEFA Champions League this week ⁠— Paris St Germain v Borussia Dortmund and Valencia v Atalanta ⁠— will also be played behind closed doors.", "url": "https://indianexpress.com/article/sports/football/barcelonas-ucl-decider-napoli-played-without-spectators-6308381/", "urlToImage": "https://images.indianexpress.com/2020/03/camp-nou.jpg?w=759", "publishedAt": "2020-03-10T16:30:41Z", "content": "By: Reuters | \r\nPublished: March 10, 2020 10:00:41 pm\r\nCamp Nou. (Source: FCB)Barcelona’s Champions League last-16 second leg match with Napoli scheduled for March 18 will take place without spectators due to fears over the spread of the coronavirus, the club… [+1589 chars]"}, {"source": {"id": null, "name": "Dcist.com"}, "author": "rsadon", "title": "Coronavirus Latest: The D.C. Area Now Has 18 Confirmed Cases", "description": "D.C. officials confirmed Monday night that the District is handling three additional presumptive positive cases, bringing the city’s total to five. The post Coronavirus Latest: The D.C. Area Now Has 18 Confirmed Cases appeared first on DCist.", "url": "https://dcist.com/story/20/03/10/coronavirus-latest-the-d-c-area-now-has-18-confirmed-coronavirus-cases/", "urlToImage": "https://s26961.pcdn.co/wp-content/uploads/sites/3/2020/03/coronavirus-1-1024x683.jpg", "publishedAt": "2020-03-10T16:52:18Z", "content": null}, {"source": {"id": null, "name": "Vanityfair.com"}, "author": "Bess Levin", "title": "Fox: Coronavirus Is a Liberal “Scam” to Hurt Trump", "description": "“This is yet another attempt to impeach the president,” host Trish Regan claimed the same day multiple Republican lawmakers self-quarantined over virus fears.", "url": "https://www.vanityfair.com/news/2020/03/fox-coronavirus-trish-regan", "urlToImage": "https://media.vanityfair.com/photos/5e67c30ea62e1100087d138b/16:9/w_1280,c_limit/trishreganfox.jpg", "publishedAt": "2020-03-10T16:45:32Z", "content": "Something you may have picked up on by now is that Fox News, and its sister network, Fox Business, are effectively state-run TV in the age of Trump. Theres little the president can do that wont get Sean Hannity or Jeanine Pirro or Stuart Varney or the barking… [+1979 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Carlie Porterfield, Forbes Staff, Carlie Porterfield, Forbes Staff https://www.forbes.com/sites/carlieporterfield/", "title": "Coronavirus ‘Likely To Get Worse Before It Gets Better’ U.S. Health Officials Say", "description": "“Not every community has an outbreak going on right now, but people should know that this is going to likely to get worse before it gets better.”", "url": "https://www.forbes.com/sites/carlieporterfield/2020/03/10/coronavirus-likely-to-get-worse-before-it-gets-better-us-health-officials-say/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1206290487%2F0x0.jpg", "publishedAt": "2020-03-10T16:17:50Z", "content": "U.S. Surgeon General Dr. Jerome Adams looks on as U.S. President Donald Trump speaks during a press ... [+] briefing Monday.\r\nGetty Images\r\nTopline: With nearly 800 confirmed coronavirus cases in the U.S. and counting, the countrys top health official said Tu… [+2074 chars]"}, {"source": {"id": null, "name": "Wxii12.com"}, "author": "WXII12.com Web Staff", "title": "North Carolina Gov. Roy Cooper declares state of emergency over coronavirus - WXII12 Winston-Salem", "description": "North Carolina Gov. Roy Cooper declares state of emergency over coronavirus WXII12 Winston-Salem Coronavirus NC: State leaders discuss coronavirus response as COVID-19 cases increase in Wake County ABC11 5 Wake County residents test positive for coronavirus a…", "url": "https://www.wxii12.com/article/north-carolina-gov-roy-cooper-declares-state-of-emergency-over-coronavirus/31345791", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/safe-image-1583787065.png?crop=0.930xw:1.00xh;0.0359xw,0&resize=1200:*", "publishedAt": "2020-03-10T16:12:49Z", "content": "RALEIGH, N.C. —North Carolina governor Roy Cooper declared a state of emergency over coronavirus at a media briefing Tuesday afternoon in Raleigh.\r\nFive more people in Wake County tested presumptively positive Monday for COVID-19, officials said.\r\nAccording t… [+1044 chars]"}, {"source": {"id": null, "name": "Eater.com"}, "author": "Serena Dai", "title": "Rising Coronavirus Fears Prompt Mass Event Cancellations at NYC Restaurants", "description": "Restaurateurs including Tom Colicchio report some sales losses and drops in customer traffic at locations across the city", "url": "https://ny.eater.com/2020/3/10/21172313/coronavirus-nyc-restaurants-reaction-sales", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QDvoYMTGHRSLMLwhLxud9tgaKKM=/0x294:5424x3134/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19782008/1193664265.jpg.jpg", "publishedAt": "2020-03-10T16:49:37Z", "content": "People walk across 42nd Street in Times Square | Photo by Johannes Eisele/AFP via Getty Images Owners including Tom Colicchio take extra steps to diffuse panic and protect against sales losses as the situation unfolds Chinatown restaurants are no longer the o… [+10205 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Pradeep", "title": "Microsoft Teams is now used by 91 of the 100 largest companies in the US", "description": "Back in July 2019, Microsoft announced that Teams collaboration service has reached 13 million daily active users. Later in November 2019, Microsoft announced that Teams has reached 20 million active users, a 7 million increase in just about 4 months. On the …", "url": "https://mspoweruser.com/microsoft-teams-91-of-the-100-largest-companies/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2018/08/Microsoft-Teams-Skype-for-Business.jpg", "publishedAt": "2020-03-10T16:15:45Z", "content": "Back in July 2019, Microsoft announced that Teams collaboration service has reached 13 million daily active users. Later in November 2019, Microsoft announced that Teams has reached 20 million active users, a 7 million increase in just about 4 months. On the … [+1437 chars]"}, {"source": {"id": null, "name": "Cartoonbrew.com"}, "author": "Alex Dudok de Wit", "title": "The Coronavirus Effect On Animation Events: FMX Is Cancelled, But Annecy, Stuttgart, Zagreb, Pictoplasma Still Happening", "description": "Read the latest statements on the disease from major animation festivals. The post The Coronavirus Effect On Animation Events: FMX Is Cancelled, But Annecy, Stuttgart, Zagreb, Pictoplasma Still Happening appeared first on Cartoon Brew.", "url": "https://www.cartoonbrew.com/festivals/the-coronavirus-effect-on-animation-events-fmx-is-cancelled-but-annecy-stuttgart-zagreb-pictoplasma-still-planned-to-go-on-187530.html", "urlToImage": "https://www.cartoonbrew.com/wp-content/uploads/2019/06/annecy2019.jpg", "publishedAt": "2020-03-10T16:36:00Z", "content": "Annecy Festival (June 1520, France), the worlds largest international animation festival, released a short statement on its website:\r\nThe Annecy Festival is carefully monitoring the developments and the latest guidelines provided by the local, national and in… [+4974 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Paul A. Eisenstein", "title": "Car makers — and car owners — could soon feel the impact of the coronavirus", "description": "While the U.S. auto industry hasn’t felt much of an impact yet from the coronavirus, analysts see troubling signs that the situation could get far worse in a hurry.", "url": "https://www.nbcnews.com/business/autos/car-makers-car-owners-could-soon-feel-impact-coronavirus-n1154231", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2020_11/3263626/200310-general-motors-manufacturing-se-1218p_799050e50459ee83859bc74b289ab434.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T16:25:00Z", "content": "When General Motors was hit by a six-week strike last fall, the impact was quickly felt not only at the automakers own plants and showrooms but at independent service shops, where repair parts for vehicles quickly fell into short supply. Now, the rapidly spre… [+4095 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Experts says a certain demographic are at higher risk of getting sick from the coronavirus via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_3730bb58f39a195d7caa779fdb9ba200", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T17:10:11Z", "content": "State of emergency, Coronavirus\r\nMaryland Gov. Larry Hogan signs emergency legislation allowing him to transfer $50 million from Rainy Day Fund for COVID-19 response, creates task..."}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "Chris Price", "title": "Tuesday evening news briefing: Coronavirus 'to peak within fortnight' in UK", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here.", "url": "https://www.telegraph.co.uk/news/2020/03/10/tuesday-evening-news-briefing-coronavirus-peak-within-fortnight/", "urlToImage": "https://img.youtube.com/vi/gU3qhuiozhU/mqdefault.jpg", "publishedAt": "2020-03-10T16:47:16Z", "content": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here. For two-minute audio updates, try The Briefing - on podcasts, smart speakers and WhatsApp.\r\nVirus peak expected in two weeks as sixth patient dies \r\nTh… [+6527 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Hedge Funds Snapped Up Snap Inc. (SNAP) At The Wrong Time", "description": "Coronavirus is probably the 1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). In…", "url": "https://news.yahoo.com/hedge-funds-snapped-snap-inc-162111853.html", "urlToImage": null, "publishedAt": "2020-03-10T16:21:11Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Debasis Saha", "title": "Hedge Funds Have Never Been This Bullish On RingCentral Inc (RNG)", "description": "Coronavirus is probably the 1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). In…", "url": "https://finance.yahoo.com/news/hedge-funds-never-bullish-ringcentral-161328316.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rOKMi8gQGY32esCtT0twiw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuMjEzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eywElp6fcvOcureCeu3EFA--~B/aD00MjI7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/insidermonkey.com/39b6c722038df9eb5cafa1eb0a91bffd", "publishedAt": "2020-03-10T16:13:28Z", "content": "Coronavirus is probably the #1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). I… [+6206 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Debasis Saha", "title": "Were Hedge Funds Right About Betting On Lennar Corporation (LEN)?", "description": "Coronavirus is probably the 1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). In…", "url": "https://finance.yahoo.com/news/were-hedge-funds-betting-lennar-161506694.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rOKMi8gQGY32esCtT0twiw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuMjEzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/eywElp6fcvOcureCeu3EFA--~B/aD00MjI7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/insidermonkey.com/39b6c722038df9eb5cafa1eb0a91bffd", "publishedAt": "2020-03-10T16:15:06Z", "content": "Coronavirus is probably the #1 concern in investors' minds right now. It should be. We estimate that COVID-19 will kill around 5 million people worldwide and there is a 3.3% probability that Donald Trump will die from the new coronavirus (read the details). I… [+6312 chars]"}]