[{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Czech Republic reports first cases of coronavirus", "description": "The Czech Republic has confirmed its first three cases of coronavirus, Health Minister Adam Vojtech said on Sunday.", "url": "https://www.reuters.com/article/us-china-health-czech-idUSKBN20O1XK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-01T15:26:26Z", "content": "PRAGUE (Reuters) - The Czech Republic has confirmed its first three cases of coronavirus, Health Minister Adam Vojtech said on Sunday. \r\nHealth officials said at a news conference the three patients showed mild symptoms and had traveled from places in norther… [+58 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Bahrain confirms six new coronavirus cases: state news agency", "description": "Bahrain's ministry of health on Sunday confirmed six new coronavirus cases, raising the total number to 47 cases, the state news agency said, citing a ministry statement.", "url": "https://www.reuters.com/article/us-china-health-bahrain-idUSKBN20O1YJ", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-01T16:11:27Z", "content": "DUBAI (Reuters) - Bahrain’s ministry of health on Sunday confirmed six new coronavirus cases, raising the total number to 47 cases, the state news agency said, citing a ministry statement. \r\nThe six cases are five Bahraini citizens and a Saudi national who ar… [+99 chars]"}, {"source": {"id": null, "name": "Kiro7.com"}, "author": "Bob D'Angelo, Cox Media Group National Content Desk", "title": "Comparing the coronavirus to the flu - KIRO Seattle", "description": "Comparing the coronavirus to the flu KIRO Seattle How Does the Coronavirus Compare With the Flu? The New York Times Facts Not Fear: Who is most at risk for severe coronavirus complications? 10TV Coronavirus latest: Germany's COVID-19 cases almost double DW (E…", "url": "https://www.kiro7.com/news/trending/comparing-coronavirus-flu/E4NZVS6BO5AABPCVVWDS222H7I/", "urlToImage": "https://www.kiro7.com/resizer/LDZ7OJZv7ouaz8HPDhixfhkA-7s=/1200x628/arc-anglerfish-arc2-prod-cmg.s3.amazonaws.com/public/UECUY76OAVHYJALUJAVUD4KUZI.jpg", "publishedAt": "2020-03-01T15:48:51Z", "content": "Fears continue to mount as the number of coronavirus cases rise worldwide, The United States recorded its first death from the coronavirus in Washington state Saturday,\r\nAccording to the World Health Organization statistics released Saturday, there are 85,403… [+3633 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Coronavirus fears close down France's iconic Louvre Museum - World News - Castanet.net", "description": "Coronavirus fears close down France's iconic Louvre Museum - World News Castanet.net Coronavirus: Staff force Louvre closure over infection fears BBC News With 100 COVID-19 cases, France closes the Louvre to visitors CP24 Toronto's Breaking News Paris' famed …", "url": "https://www.castanet.net/news/World/278325/Coronavirus-fears-close-down-France-s-iconic-Louvre-Museum", "urlToImage": "https://www.castanet.net/content/2020/3/PAR115-228_2020_132925_p3441969.jpg", "publishedAt": "2020-03-01T15:13:00Z", "content": "The spreading coronavirus epidemic shut down France's Louvre Museum on Sunday, with workers who guard its famous trove of artworks fearful of being contaminated by the museum's flow of visitors from around the world.\r\n“We are very worried because we have visi… [+1721 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Chance Miller", "title": "Apple sends care packages to employees stranded in China, including iPads, snacks, and more", "description": "Apple has sent care packages to its employees in China who are stranded in the country due to the coronavirus outbreak. The care package includes items like food, hand sanitizer, and a 10.2-inch iPad. Accompanying the items is a letter from Apple, which expla…", "url": "https://9to5mac.com/2020/03/01/apple-china-carekits/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/apple-china-carekits.jpg?resize=1024,529", "publishedAt": "2020-03-01T15:11:49Z", "content": "Apple has sent care packages to its employees in China who are stranded in the country due to the coronavirus outbreak. The care package includes items like food, hand sanitizer, and a 10.2-inch iPad.\r\nAccompanying the items is a letter from Apple, which expl… [+1698 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Matthew Choi", "title": "Biden on Trump: ‘This is a guy who doesn’t know what he’s doing’", "description": "He assails the president’s leadership on the coronavirus epidemic.", "url": "https://www.politico.com/news/2020/03/01/coronavirus-biden-trump-leadership-118391", "urlToImage": "https://static.politico.com/1b/56/d8bbca734a72a7285e3aea033864/20200301-joe-biden-gty-773.jpg", "publishedAt": "2020-03-01T16:03:35Z", "content": "Former Vice President Joe Biden. | Sean Rayford/Getty Images\r\nDemocratic presidential candidate Joe Biden criticized President Donald Trump's reaction to the coronavirus outbreak, using it as a rebuke to the president's derision toward the former vice preside… [+719 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "13 Canadian citizens remain detained in Ethiopia - Global News", "description": "13 Canadian citizens remain detained in Ethiopia Global News 13 Canadians with Alberta-based charity detained in Ethiopia CTV News 13 Canadian charity workers and volunteers detained in Ethiopia CBC.ca Global National: Feb. 29, 2020 | Canadian humanitarians d…", "url": "https://www.youtube.com/watch?v=Gy_9GuV_Jzk", "urlToImage": "https://i.ytimg.com/vi/Gy_9GuV_Jzk/maxresdefault.jpg", "publishedAt": "2020-03-01T15:47:09Z", "content": "Alberta-based NGO Canadian Humanitarian said that a total of 13 Canadians, including three staff members and 10 volunteers, have been detained in the Ethiopian city of Gondar after being accused of practicing medicine without permission and dispensing expired… [+384 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "Anmol", "title": "Amazon takes down 1 million products claiming to cure Coronavirus", "description": "The Novel Coronavirus outbreak has taken the world by storm and as countries scramble to fight the virus, the tech giants are fighting a totally different battle. Ever since the outbreak became global, tech companies are fighting to take down fake news and mi…", "url": "https://mspoweruser.com/amazon-1-m-products-claiming-to-cure-coronavirus/", "urlToImage": "https://mspoweruser.com/wp-content/uploads/2016/09/amazon.jpg", "publishedAt": "2020-03-01T15:56:08Z", "content": "The Novel Coronavirus outbreak has taken the world by storm and as countries scramble to fight the virus, the tech giants are fighting a totally different battle. Ever since the outbreak became global, tech companies are fighting to take down fake news and mi… [+1454 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Maya MacGuineas), Maya MacGuineas", "title": "Both Republicans and Democrats are ignoring a growing danger to our economy and national security: the national debt", "description": "President Trump, the Democratic presidential candidates, and Congress aren't taking the national debt seriously. But the rapidly expanding debt is a threat to America's economic and national security. Maya MacGuineas is the president of the bipartisan Committ…", "url": "https://www.businessinsider.com/trump-gop-democrats-ignoring-dangers-of-national-debt-deficit-2020-2", "urlToImage": "https://i.insider.com/5e598343fee23d372347bdcc?width=1200&format=jpeg", "publishedAt": "2020-03-01T15:23:00Z", "content": "Business Insider\r\nThe national debt is an issue that lawmakers are doing their best to ignore these days—as demonstrated by the President's non-serious budget, the House's plan to not even pass a budget, and the leading presidential candidates' not feeling th… [+4931 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Angiotensin converting enzyme 2 (ACE2) crucial in SARS-coronavirus lung injury", "description": "A crucial role of angiotensin converting enzyme 2 (ACE2) in SARS coronavirus&#8211;induced lung injury", "url": "https://www.nature.com/articles/nm1267?v=1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fnm1267/MediaObjects/41591_2005_Article_BFnm1267_Fig1_HTML.jpg", "publishedAt": "2020-03-01T15:32:18Z", "content": "<li></li>\r\n1Tsang, K.W. et al. A cluster of cases of severe acute respiratory syndrome in Hong Kong. N. Engl. J. Med.348, 19771985 (2003).\r\n<li></li>\r\n2Lee, N. et al. A major outbreak of severe acute respiratory syndrome in Hong Kong. N. Engl. J. Med.348, 198… [+4632 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Pope Francis Cancels Participation in Spiritual Retreat, Citing Cold", "description": "A coughing Pope Francis told pilgrims gathered for the traditional Sunday blessing that he is canceling his participation at a retreat.", "url": "https://time.com/5793140/coughing-pope-francis/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/pope-francis-sick.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-01T15:30:01Z", "content": "(VATICAN CITY) — A coughing Pope Francis told pilgrims gathered for the traditional Sunday blessing that he is canceling his participation at a week-long spiritual retreat in the Roman countryside because of a cold.\r\nIt is the first time in his seven-year pap… [+2030 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Dan Goldberg", "title": "Pence warns that more coronavirus cases are coming", "description": "Pence and HHS Secretary Alex Azar made the rounds of the Sunday morning shows, while top government scientists and public health experts have no television appearances scheduled.", "url": "https://www.politico.com/news/2020/03/01/pence-azar-coronavirus-morning-shows-118411", "urlToImage": "https://static.politico.com/ec/f1/c529c20a4f4e95868ab8ab14f154/20200301-mike-pence-vp-gty-773.jpg", "publishedAt": "2020-03-01T16:00:14Z", "content": "HHS Secretary Alex Azar. | Evan Vucci/AP Photo\r\nPence, who President Donald Trump tapped to lead the response to the outbreak, said the risk of contracting the virus in the United States remains low and that 15,000 testing kits are in the mail on their way to… [+2081 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Linus Unah", "title": "'Nigeria will deal with this': High alert after coronavirus case", "description": "Experts say Nigeria is prepared to contain new virus following a successful response to Ebola more than five years ago.", "url": "https://www.aljazeera.com/news/2020/03/deal-high-alert-coronavirus-case-200301140838366.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/1/d6eba923492d47399c658a58a587514c_18.jpg", "publishedAt": "2020-03-01T15:46:17Z", "content": "Abuja, Nigeria - Health authorities in Nigeria are ramping up efforts to detect and contain the new coronavirus after Africa's most populous country confirmed its first case, calling on citizens to avoid panicking or spreading unverified information about the… [+6904 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Rita Liao", "title": "China Roundup: Apple closes a 4-year-old App Store loophole", "description": "This week, Apple made some major moves that are telling of its increasingly compliant behavior in China where it has seen escalating competition, but investors are showing dissatisfaction with how it is approaching hot-button issues in the country.", "url": "http://techcrunch.com/2020/03/01/china-roundup-apple-closes-app-store-loophole/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2016/10/apple-china-e1582952669590.jpg?w=751", "publishedAt": "2020-03-01T15:19:42Z", "content": "Hello and welcome back to TechCrunchs China Roundup, a digest of recent events shaping the Chinese tech landscape and what they mean to people in the rest of the world. This week, Apple made some major moves that are telling of its increasingly compliant beha… [+5507 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How coronavirus has caused air pollution drop in China", "description": "The cleaner skies, however, mean the economy is not in a good shape. Here's why.", "url": "https://indianexpress.com/article/explained/explained-how-coronavirus-has-caused-air-pollution-drop-in-china-6294375/", "urlToImage": "https://images.indianexpress.com/2020/03/corona-759.jpg?w=759", "publishedAt": "2020-03-01T15:29:41Z", "content": "A couple takes a selfie near the barricaded Houhai Lake on March 1. Coronavirus has led to NO2 levels over China dropping. (Photo: AP)A NASA report Saturday (February 29) said nitrogen dioxide (NO2) levels over China had dropped dramatically in the wake of th… [+2970 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Chuck Bolotin, Contributor, Chuck Bolotin, Contributor https://www.forbes.com/sites/chuckbolotin/", "title": "Where Is It Better To Quarantine Because Of Coronavirus: The US Or Mexico?", "description": "If things get really bad with Coronavirus and you need to be quarantined, where would you be better off: in the US, or in the Central Mexican Highlands?", "url": "https://www.forbes.com/sites/chuckbolotin/2020/03/01/where-is-it-better-to-quarantine-because-of-coronavirus-the-us-or-mexico/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e5b14b1765d4500072d8e0e%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D2965%26cropY1%3D510%26cropY2%3D2177", "publishedAt": "2020-03-01T15:19:49Z", "content": "Writer's wife, Jet Metier in the airport in Mexico\r\nChuck Bolotin\r\nFew things focus the mind more than being confronted with the possibility of catching a deadly virus.&amp;nbsp;So when the director of the CDC's National Center for Immunization and Respirator… [+20215 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "At least 3,200 Amazon delivery drivers will be laid off by the end of April as the company keeps cutting ties with contractors", "description": "More than 3,200 Amazon delivery drivers will be laid off by the end of April, Buzzfeed News reported. Amazon's third-party delivery partners have announced thousands of layoffs in recent months as the company cuts ties with some of its contractors. The 3,200 …", "url": "https://www.businessinsider.com/amazon-delivery-drivers-layoffs", "urlToImage": "https://i.insider.com/5e5bcd63fee23d7a4274f104?width=1200&format=jpeg", "publishedAt": "2020-03-01T15:39:30Z", "content": "Thousands of Amazon delivery drivers have been laid off in recent months — and it looks like many more workers will lose their jobs come spring.\r\nMore than 3,200 delivery drivers for Amazon will be let go by the end of April, Buzzfeed News reported. \r\nAmazon … [+1668 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Matthew Choi", "title": "Alex Azar: War powers on the table to increase medical supplies", "description": "The Trump administration is requiring manufacturers to make their orders top priority.", "url": "https://www.politico.com/news/2020/03/01/coronavirus-azar-war-powers-medical-supplies-118392", "urlToImage": "https://static.politico.com/de/a3/2585ca434b40b98d9a046af7abf0/20200301-azar-ap-773.jpg", "publishedAt": "2020-03-01T16:00:06Z", "content": "The Trump administration reiterated on Sunday that it was taking the threat of the virus seriously, while also trying to temper any alarmist messaging. Vice President Mike Pence, whom President Donald Trump appointed to lead the administration's coronavirus e… [+1065 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jennifer Leigh Parker, Contributor, Jennifer Leigh Parker, Contributor https://www.forbes.com/sites/jenniferleighparker/", "title": "Don’t Expect Tech To Save Us From Coronavirus", "description": "The organizations best equipped to gather and analyze travelers’ health data during a pandemic aren’t doing it.", "url": "https://www.forbes.com/sites/jenniferleighparker/2020/03/01/dont-expect-tech-to-save-us-from-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1202452084%2F960x0.jpg", "publishedAt": "2020-03-01T16:03:03Z", "content": "The organizations best equipped to gather and analyze travelers health data during a pandemic arent doing it. Heres why. Travelers in the security line at San Francisco International Airport on Friday, Jan. 31, 2020. ... [+] Photographer: David Paul Morris/Bl… [+13949 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Japan warns against trips to some parts of South Korea, Italy due to coronavirus", "description": "Japan on Sunday raised its infectious disease advisory levels for parts of South Korea and Italy, urging its citizens not to take trips to South Korea's Daegu and Cheongdo regions and avoid non-urgent trips to three areas in Italy due to the coronavirus outbr…", "url": "https://www.reuters.com/article/us-china-health-japan-travel-idUSKBN20O1XA", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200301&t=2&i=1497420725&w=1200&r=LYNXMPEG201W2", "publishedAt": "2020-03-01T15:19:54Z", "content": "TOKYO (Reuters) - Japan on Sunday raised its infectious disease advisory levels for parts of South Korea and Italy, urging its citizens not to take trips to South Korea’s Daegu and Cheongdo regions and avoid non-urgent trips to three areas in Italy due to the… [+587 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus, jobs report, Super Tuesday: What to know in the week ahead", "description": "Coronavirus developments, February jobs report, Super Tuesday and Target earnings will keep investors busy in the week ahead.", "url": "https://finance.yahoo.com/news/coronavirus-jobs-report-target-earnings-what-to-know-in-the-week-ahead-152958868.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rEWSvFAU8acfevAqcgnzSA--~B/aD00MDI0O3c9NjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/21c168d0-5a48-11ea-bdfe-2cf312ab7fab", "publishedAt": "2020-03-01T15:29:58Z", "content": "Markets could face another volatile week ahead, as concerns over the deadly coronavirus weigh on sentiment around the world. There are more than 87,600 confirmed cases worldwide and just under 3,000 confirmed deaths, as of Sunday morning. The rapid spread and… [+7098 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Parisa Hafezi", "title": "Fear, distrust and disinfectant in the air amid Iran's coronavirus outbreak", "description": "As the new coronavirus spreads across Iran, the epicenter of the outbreak in the Middle East, so a feeling of anxiety grows among many Iranians, some of whom worry the clerical establishment has not got a firm grip on the illness.", "url": "https://www.reuters.com/article/us-china-health-iran-mood-idUSKBN20O1X1", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200301&t=2&i=1497418333&w=1200&r=LYNXMPEG201W1", "publishedAt": "2020-03-01T15:11:36Z", "content": "DUBAI (Reuters) - As the new coronavirus spreads across Iran, the epicenter of the outbreak in the Middle East, so a feeling of anxiety grows among many Iranians, some of whom worry the clerical establishment has not got a firm grip on the illness. \r\nEvery da… [+3854 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "maddie-mortell", "title": "Watch: ‘SNL’ warns of coronavirus in Cold Open - Boston.com", "description": "Watch: ‘SNL’ warns of coronavirus in Cold Open Boston.com Coronavirus Cold Open - SNL Saturday Night Live 'SNL' spoofs Mike Pence's new role leading coronavirus response CNN SNL's Democratic presidential candidates take over Mike Pence's coronavirus press con…", "url": "https://www.boston.com/culture/entertainment/2020/03/01/snl-cold-open-coronavirus", "urlToImage": "https://www.boston.com/wp-content/uploads/2020/03/SNLColdOpen-850x478.png", "publishedAt": "2020-03-01T15:35:09Z", "content": "Last nights SNL opened with a White House press conference held by none other than Vice President Mike Pence (Beck Bennett) to heed the general public about the spread of coronavirus.\r\nAn ensemble of familiar faces from the Beltway appear to field questions, … [+1035 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Christian Minister: God Showed Me “the End of the Coronavirus”", "description": "Considering the pandemic has barely begun, this seems like a stretch.", "url": "https://friendlyatheist.patheos.com/2020/03/01/christian-minister-god-showed-me-the-end-of-the-coronavirus/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2020/02/BolzShawnCoronavirus-768x429.png", "publishedAt": "2020-03-01T15:30:45Z", "content": "Washington has declared a “state of emergency” regarding the coronavirus strain that has now entered the U.S. One patient has already died in that state.\r\nThere have already been 2,978 deaths and 86,991 cases worldwide — and counting.\r\nAnd yet Christian minis… [+1208 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Bloomberg on Trump's coronavirus response", "description": "The Democratic presidential candidate is criticizing President Trump for how his administration is responding to the coronavirus outbreak. See the interview, tonight at 7 p.m. ET/PT", "url": "https://www.cbsnews.com/news/mike-bloomberg-2020-democratic-presidential-candidate-donald-trump-60-minutes-face-the-nation-2020-03-01/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/01/84c061b4-201f-4138-a2c0-98816f9c3d41/thumbnail/1200x630/c74785e0b93b68e9403d03641fb6fd9a/bloomberftn-web0.jpg", "publishedAt": "2020-03-01T15:47:09Z", "content": "Democratic presidential candidate Michael Bloomberg is criticizing President Trump's use of the word \"hoax\" to characterize the Democrats' response to the coronavirus pandemic. He tells Scott Pelley the president was being irresponsible and should have been m… [+952 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Isaiah Mayersen", "title": "Game Developers Conference postponed to the summer due to coronavirus", "description": "GDC has followed Mobile World Congress and Facebook’s F8 developer conference as the third technology expo to be canceled. Hopefully it’ll be the last. The GDC advisory board had no option other than to cancel the event.", "url": "https://www.techspot.com/news/84214-game-developers-conference-postponed-summer-due-coronavirus.html", "urlToImage": "https://static.techspot.com/images2/news/ts3_thumbs/2020/03/2020-03-01-ts3_thumbs-db6.jpg", "publishedAt": "2020-03-01T15:18:00Z", "content": "In a nutshell: GDC 2020 has been postponed to an indefinite summer date, following the withdrawal of most major exhibitors. A few key events will be livestreamed, including the Game Developers Choice Awards, and exhibitors will be able to submit videos of the… [+1396 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Canada Coronavirus Tally Rises With Ontario, Quebec, B.C. Cases", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-01/canada-coronavirus-tally-rises-with-ontario-quebec-b-c-cases", "urlToImage": null, "publishedAt": "2020-03-01T16:05:09Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fareed Zakaria: I want to talk about Bernie Sanders - CNN", "description": "Fareed Zakaria: I want to talk about Bernie Sanders CNN CNN Blasted for Segment Comparing Bernie Sanders' Rise to Coronavirus Newsweek CNN Host Seemingly Compares Bernie Sanders’ Campaign To Coronavirus Deadline Author: Trump campaign played the Facebook plat…", "url": "https://www.youtube.com/watch?v=5P4ubDTpjhI", "urlToImage": null, "publishedAt": "2020-03-01T15:45:51Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Melissa Quinn", "title": "Health secretary investigating allegations by coronavirus whistleblower", "description": "The HHS chief says he's \"aggressively looking\" to determine whether there is \"validity\" to concerns raised by a whistleblower about possible exposure.", "url": "https://www.cbsnews.com/news/coronavirus-whistleblower-alex-azar-overseeing-investigation-hhs-allegations/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/01/fa5b71e0-ae64-4bf9-b03e-c60f915a7358/thumbnail/1200x630/e918db0868cb6e8ebb1d6aa3ec31f2c1/azar1.png", "publishedAt": "2020-03-01T15:48:34Z", "content": "Washington — Health and Human Services (HHS) Secretary Alex Azar said he is personally involved in examining allegations raised by a whistleblower that agency employees who helped quarantined American evacuees from Wuhan, China, lacked the proper training and… [+3129 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Mike Bloomberg says President Trump \"irresponsible\" for hoax comment about Democrats and coronavirus", "description": "The Democratic presidential candidate is criticizing President Trump for how his administration is responding to the coronavirus outbreak. See the interview, tonight at 7 p.m. ET/PT", "url": "https://www.cbsnews.com/video/mike-bloomberg-2020-democratic-presidential-candidate-donald-trump-60-minutes-face-the-nation-2020-03-01/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/01/442cfe2a-f9d0-4726-8bfc-4eaff61219e8/thumbnail/1200x630/1dbd29d6f50bf4f602036dd4c0a4c6a3/bloomberftn-web0-2038957-640x360.jpg", "publishedAt": "2020-03-01T15:38:31Z", "content": null}, {"source": {"id": null, "name": "Crooksandliars.com"}, "author": "David", "title": "Mike Pence On COVID-19: 'With The Prayers Of Millions Of Americans We're Going To Get Through This'", "description": "Vice President Mike Pence said over the weekend that it is \"understandable\" that President Donald Trump's son, Donald Trump Jr., would say that Democrats want millions of Americans to die of the coronavirus. In an interview that aired on Sunday, CNN's Jake Ta…", "url": "https://crooksandliars.com/2020/03/mike-pence-coronavirus-prayers-millions", "urlToImage": "https://crooksandliars.com/files/primary_image/20/03/pence1.jpg", "publishedAt": "2020-03-01T15:34:00Z", "content": "Vice President Mike Pence said over the weekend that it is \"understandable\" that President Donald Trump's son, Donald Trump Jr., would say that Democrats want millions of Americans to die of the coronavirus.\r\nIn an interview that aired on Sunday, CNN's Jake T… [+1357 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Barbie Latza Nadeau", "title": "Coronavirus Fever: An Infected Priest, a Murder Charge, and a Shortage of Tests", "description": "Jason Cairnduff /Reuters ROME—It is, by now, impossible to keep up with the fast-changing coronavirus statistics: the number of confirmed cases in new countries seems to roll like ticker tape. The latest confirmations include an American student studying in I…", "url": "https://www.thedailybeast.com/coronavirus-fever-an-infected-priest-a-murder-charge-and-a-shortage-of-tests", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2068,w_3678,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583077631/RTS345XC_rozuzv", "publishedAt": "2020-03-01T15:54:11Z", "content": "ROMEIt is, by now, impossible to keep up with the fast-changing coronavirus statistics: the number of confirmed cases in new countries seems to roll like ticker tape. The latest confirmations include an American student studying in Italy who reportedly just t… [+2355 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Justin Baragona", "title": "Chuck Todd Grills Pence, Says It Feels Like Team Trump’s ‘Gaslighting’ on Dems’ Coronavirus Rhetoric", "description": "Meet the Press anchor Chuck Todd pressed Vice President Mike Pence on Sunday to “name some names” after the veep groused that there was “irresponsible rhetoric” from Democrats on the coronavirus, with Todd further telling Pence that it feels like Team Trump i…", "url": "https://www.thedailybeast.com/chuck-todd-grills-pence-says-it-feels-like-team-trumps-gaslighting-on-dems-coronavirus-rhetoric", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_360,w_640,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583075527/meet-press_3_a4lndv", "publishedAt": "2020-03-01T15:18:41Z", "content": "Meet the Press anchor Chuck Todd pressed Vice President Mike Pence on Sunday to name some names after the veep groused that there was irresponsible rhetoric from Democrats on the coronavirus, with Todd further telling Pence that it feels like Team Trump is ga… [+3372 chars]"}, {"source": {"id": null, "name": "Dailydot.com"}, "author": "Eilish O'Sullivan", "title": "CNN condemned for comparing Sanders to coronavirus", "description": "There is a long and ugly history of blaming Jewish people for creating and spreading diseases. The post CNN condemned for comparing Sanders to coronavirus appeared first on The Daily Dot.", "url": "https://www.dailydot.com/layer8/michael-smerconish-bernie-coronavirus/", "urlToImage": "https://www.dailydot.com/wp-content/uploads/2020/03/michael-smerconish-bernie-coronavirus.jpg", "publishedAt": "2020-03-01T15:37:05Z", "content": "MSNBC was under fire last week for its apparent negative coverage of Sen. Bernie Sanders (I-Vt.) during the Nevada caucuses. Viewers called on the network to fire host Chris Matthews after he compared Sanders Nevada victory to the Nazi invasion of France. The… [+3104 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Phil Thomas, Phil Thomas", "title": "Biden slams Trump over coronavirus 'hoax' claim: 'What in God's name is he talking about?'", "description": "Fresh from his victory in the South Carolina primary, former vice-president Joe Biden has slammed Donald Trump's reaction to the coronavirus crisis.", "url": "https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-trump-joe-biden-hoax-us-death-toll-outbreak-covid-19-a9367371.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/03/01/15/coronavirus-seattle-washington-united-states.jpg", "publishedAt": "2020-03-01T15:19:00Z", "content": "Fresh from his victory in the South Carolina primary, former vice-president Joe Biden has slammed Donald Trump's reaction to the coronavirus crisis.\r\nAddressing the president's reference to the crisis as a \"hoax\" during a political rally on Friday, Mr Biden s… [+3601 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Jamie White", "title": "Video: CNN Host Compares ‘Unstoppable’ Bernie Sanders to Deadly Coronavirus", "description": "MSM sets its fake news sights on Bernie.", "url": "https://www.infowars.com/video-cnn-host-compares-unstoppable-bernie-sanders-to-deadly-coronavirus/", "urlToImage": "https://assets.infowars.com/2020/02/020720berniesanders.jpg", "publishedAt": "2020-03-01T15:48:20Z", "content": "Radio personality and CNN host Michael Smerconish thought it fitting to compare Bernie Sanders and his surge in the Democratic polls to the coronavirus outbreak. The remark has sparked massive online anger and a storm of mockery.\r\nSmerconish made the outlandi… [+2842 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Gianni Verschueren", "title": "Tokyo Marathon Results 2020: Men's and Women's Top Finishers", "description": "Birhanu Legese and Lonah Chemtai Salpeter were the top finishers in a lightning-fast 2020 Tokyo Marathon on Sunday...", "url": "https://bleacherreport.com/articles/2878649-tokyo-marathon-results-2020-mens-and-womens-top-finishers", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/855/189/hi-res-b90092ec6fdb43ce5d24369b3da7d2b9_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-03-01T15:19:56Z", "content": "Takashi Aoyama/Getty Images\r\nBirhanu Legese and Lonah Chemtai Salpeter were the top finishers in a lightning-fast 2020 Tokyo Marathon on Sunday.\r\nBoth the men's and women's races were run at an intense pace, and no less than 17 runners ducked under the 2:08:0… [+3240 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Live and Let's Fly", "title": "Coronavirus Creating Opportunities for Brave Travelers", "description": "The novel Coronavirus-19 is spreading concern worldwide, but for those brave enough to travel during this period, it’s also creating opportunity. If you haven’t followed us on Facebook or Instagram, add us today. Coronavirus Spreading The Novel Coronavirus-19…", "url": "https://liveandletsfly.boardingarea.com/2020/03/01/coronavirus-creating-opportunities-for-brave-travelers/", "urlToImage": "https://liveandletsfly.boardingarea.com/wp-content/uploads/2020/03/coronavirus.png", "publishedAt": "2020-03-01T15:39:15Z", "content": "The novel Coronavirus-19 is spreading concern worldwide, but for those brave enough to travel during this period, it’s also creating opportunity.\r\nIf you havent followed us on Facebook or Instagram, add us today.\r\nCoronavirus Spreading\r\nThe Novel Coronavirus-… [+3307 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Open: This is \"Face the Nation,\" March 1", "description": "Today on \"Face the Nation,\" the White House scrambles to calm fears as coronavirus claims the life of an American inside the U.S. Plus, with South Carolina behind them, 2020 candidates set their eyes on the Super Tuesday contests.", "url": "https://www.cbsnews.com/video/open-this-is-face-the-nation-march-1-1/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/01/21373730-bd75-4fc0-b172-8b595dc2ae81/thumbnail/1200x630/20a2c40f207a1139d09780329156278d/0301-ftn-showopen-2038967-640x360.jpg", "publishedAt": "2020-03-01T15:56:58Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "Japan warns against trips to some parts of South Korea, Italy due to coronavirus", "description": "Japan on Sunday raised its infectious disease advisory levels for parts of South Korea and Italy, urging its citizens not to take trips to South Korea's Daegu and Cheongdo regions and avoid non-urgent trips to three areas in Italy due to the coronavirus outbr…", "url": "https://news.yahoo.com/japan-warns-against-trips-parts-151954889.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/G2LCmVhEFvPAzscJ8QkDbw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02NjAuOA--/https://s.yimg.com/uu/api/res/1.2/zXSytLxa0Oe7.DkCUJon0g--~B/aD00MTM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/478c7d505e2754bca259f83e5c365941", "publishedAt": "2020-03-01T15:19:54Z", "content": "TOKYO (Reuters) - Japan on Sunday raised its infectious disease advisory levels for parts of South Korea and Italy, urging its citizens not to take trips to South Korea's Daegu and Cheongdo regions and avoid non-urgent trips to three areas in Italy due to the… [+586 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "First ’presumptive positive’ coronavirus case confirmed in R.I. - The Providence Journal", "description": "First ’presumptive positive’ coronavirus case confirmed in R.I. The Providence Journal View Full Coverage on Google News", "url": "https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vd3d3LnByb3ZpZGVuY2Vqb3VybmFsLmNvbS9uZXdzLzIwMjAwMzAxL2ZpcnN0LXJzcXVvcHJlc3VtcHRpdmUtcG9zaXRpdmVyc3F1by1jb3JvbmF2aXJ1cy1jYXNlLWNvbmZpcm1lZC1pbi1yadIBhQFodHRwczovL3d3dy5wcm92aWRlbmNlam91cm5hbC5jb20vbmV3cy8yMDIwMDMwMS9maXJzdC1yc3F1b3ByZXN1bXB0aXZlLXBvc2l0aXZlcnNxdW8tY29yb25hdmlydXMtY2FzZS1jb25maXJtZWQtaW4tcmk_dGVtcGxhdGU9YW1wYXJ0?oc=5", "urlToImage": null, "publishedAt": "2020-03-01T15:47:00Z", "content": null}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": null, "title": "Trump reignites Bloomberg feud, says billionaire on 'a very dark and lonely path'", "description": "\"The real politicians ate them up and spit them out!\" he said of billionaires Bloomberg and Tom Steyer.", "url": "https://www.nbcnews.com/politics/2020-election/trump-reignites-bloomberg-feud-says-billionaire-very-dark-lonely-path-n1146441", "urlToImage": "https://static.euronews.com/articles/4537638/1000x563_nbc-200301-mike-bloomberg-cs-958a_15ea131d518bf93c8f889518ea6e4459.jpg", "publishedAt": "2020-03-01T15:32:00Z", "content": "President Donald Trump again targeted billionaire Democratic presidential candidate Mike Bloomberg Sunday, targeting his advisers in tweets overnight Saturday into Sunday morning.\r\n\"Mini Mike Bloomberg's consultants and so-called 'advisors'(how did that advic… [+2753 chars]"}, {"source": {"id": null, "name": "Wftv.com"}, "author": "Bob D'Angelo, Cox Media Group National Content Desk", "title": "Comparing the coronavirus to the flu - WFTV Orlando", "description": "Comparing the coronavirus to the flu WFTV Orlando Global coronavirus death toll tops 3,000 CNN International Coronavirus: death toll passes 3,000 worldwide as second person dies in US The Guardian Opinion: Are we facing a coronavirus epidemic or pandemic? DW …", "url": "https://www.wftv.com/news/trending/comparing-coronavirus-flu/E4NZVS6BO5AABPCVVWDS222H7I/", "urlToImage": "https://www.wftv.com/resizer/LDZ7OJZv7ouaz8HPDhixfhkA-7s=/1200x628/arc-anglerfish-arc2-prod-cmg.s3.amazonaws.com/public/UECUY76OAVHYJALUJAVUD4KUZI.jpg", "publishedAt": "2020-03-01T15:41:55Z", "content": "Fears continue to mount as the number of coronavirus cases rise worldwide, The United States recorded its first death from the coronavirus in Washington state Saturday,\r\nAccording to the World Health Organization statistics released Saturday, there are 85,403… [+3633 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Wenxin Fan", "title": "‘This Will Be a Long Battle’: More Countries Report First Coronavirus Deaths - The Wall Street Journal", "description": "‘This Will Be a Long Battle’: More Countries Report First Coronavirus Deaths The Wall Street Journal View Full Coverage on Google News", "url": "https://www.wsj.com/articles/this-will-be-a-long-battle-more-countries-report-first-coronavirus-deaths-11583056323", "urlToImage": "https://images.wsj.net/im-159279/social", "publishedAt": "2020-03-01T15:17:00Z", "content": "More countries reported their first coronavirus fatalities and the toll grew in places such as China, as the number of deaths from the epidemic globally nears 3,000.\r\nHours after the U.S. reported its first fatality, Australia on Sunday announced its first de… [+228 chars]"}, {"source": {"id": null, "name": "Talkingpointsmemo.com"}, "author": "Summer Concepcion", "title": "Pence Says Claim That Dems Are Politicizing Coronavirus Is ‘Justified’", "description": "Vice President Mike Pence re-upped the notion shared by both the Trump administration and its allies that Democrats are weaponizing coronavirus fears.", "url": "https://talkingpointsmemo.com/news/pence-democrats-politicize-coronavirus-trump", "urlToImage": "https://cdn.talkingpointsmemo.com/wp-content/uploads/2020/03/GettyImages-1203662311-804x536.jpg", "publishedAt": "2020-03-01T15:57:23Z", "content": "Vice President Mike Pence re-upped the notion shared by both the Trump administration and its allies that Democrats are weaponizing coronavirus fears to make the President look bad during Sunday morning TV news appearances. On CNN Sunday morning, Pence defend… [+3183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Pence says 15,000 additional testing kits in the mail for coronavirus", "description": "Vice President Mike Pence said the federal government is ready to combat coronavirus, stating that thousands of additional testing kits are in the mail to state and local clinics.", "url": "https://www.cnn.com/2020/03/01/politics/mike-pence-coronavirus-testing-kits-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191025043134-mike-pence-october-24-2019-super-tease.jpg", "publishedAt": "2020-03-01T15:29:55Z", "content": "Washington (CNN)Vice President Mike Pence said the federal government is ready to combat coronavirus, stating that thousands of additional testing kits are in the mail to state and local clinics.\r\n\"We're ready. And this is an all hands on deck effort,\" Pence … [+2936 chars]"}, {"source": {"id": null, "name": "Goodmenproject.com"}, "author": "Thaddeus Howze", "title": "Industrial Quiet: Climate Change by the Elements", "description": "What if we turned off the world for 30 days? The post Industrial Quiet: Climate Change by the Elements appeared first on The Good Men Project.", "url": "https://goodmenproject.com/environment-2/industrial-quiet-climate-change-by-the-elements-wcz/", "urlToImage": "https://goodmenproject.com/wp-content/uploads/2020/02/iStock-1146253431.jpg", "publishedAt": "2020-03-01T15:30:02Z", "content": "A conversation on the coronavirus, COVID-19, carbon emissions and the benefits/hazards of industrial shutdown across the planet.\r\nOne of the most devastating facts about the recent outbreak of the coronavirus COVID-19 is not just the 80,000+ people it has inf… [+4126 chars]"}, {"source": {"id": null, "name": "Memeorandum.com"}, "author": null, "title": "Coronavirus: Pence defends Trump Jr claim Democrats want 'millions' to die (The Guardian)", "description": "The Guardian : Coronavirus: Pence defends Trump Jr claim Democrats want ‘millions’ to die — When Donald Trump Jr said Democrats hope coronavirus “kills millions of people” in the US because they want to bring his father down, he was merely “pushing back” at p…", "url": "https://www.memeorandum.com/200301/p26", "urlToImage": "https://i.guim.co.uk/img/media/87bb9d4c39024bfb8905bf03c4c6a9a10f9488e7/0_141_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dc1f2fb039d24cd3fdbeaecb7b8a39fa", "publishedAt": "2020-03-01T15:50:00Z", "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Abeer Abu Omar", "title": "Stalling Saudi Economy Ripe for Stimulus While New Hurdles Mount", "description": "(Bloomberg) -- Saudi Arabia’s economy all but ground to a halt last year, raising the likelihood that the government will turn on the fiscal taps to deliver faster growth in 2020 in the face of disruptions from the coronavirus and the prospect of lower energy…", "url": "https://finance.yahoo.com/news/stalling-saudi-economy-ripe-stimulus-152241958.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-01T15:22:41Z", "content": "(Bloomberg) -- Saudi Arabias economy all but ground to a halt last year, raising the likelihood that the government will turn on the fiscal taps to deliver faster growth in 2020 in the face of disruptions from the coronavirus and the prospect of lower energy … [+2523 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Trump vows to screen travellers after first American dies of COVID-19", "description": "President Donald Trump on Sunday said travelers from countries at high risk of coronavirus would be screened before boarding and upon arrival as the government scrambled to reassure Americans after the first death in the United States.", "url": "https://www.channelnewsasia.com/news/world/coronavirus-trump-vows-to-screen-travellers-first-american-dies-12488752", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12488750/16x9/991/557/826ae4e6ccdb425ed09e692211521d04/uk/file-photo--u-s--president-trump-speaks-during-a-news-conference-on-the-coronavirus-outbreak-in-washington-1.jpg", "publishedAt": "2020-03-01T15:37:02Z", "content": "WASHINGTON: President Donald Trump on Sunday (Mar 1) said travellers from countries at high risk of coronavirus would be screened before boarding and upon arrival as the government scrambled to reassure Americans after the first death in the United States.\r\nO… [+2885 chars]"}, {"source": {"id": null, "name": "Activistpost.com"}, "author": "Activist Post", "title": "Coronavirus End Game: The Economic Crisis & Roll Out of the New Digital Financial System", "description": "By Spiro Skouras In this report, Spiro Skouras recaps the events leading up to the current global coronavirus outbreak, while looking ahead at the looming... Coronavirus End Game: The Economic Crisis & Roll Out of the New Digital Financial System", "url": "https://www.activistpost.com/2020/03/coronavirus-end-game-the-economic-crisis-roll-out-of-the-new-digital-financial-system.html", "urlToImage": "https://www.activistpost.com/wp-content/uploads/2020/03/cash-spiro-1024x576-1.png", "publishedAt": "2020-03-01T15:16:59Z", "content": "By Spiro Skouras\r\nIn this report, Spiro Skouras recaps the events leading up to the current global coronavirus outbreak, while looking ahead at the looming financial crisis and how the virus will likely be blamed, providing cover for the crimes committed by t… [+2139 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Washington state man becomes first US coronavirus fatality", "description": "A Washington state man in his 50s with underlying health issues became the United States' first fatality from the coronavirus, officials said on Saturday, as the Trump administration stepped up efforts to combat the spread of the global outbreak.", "url": "https://www.channelnewsasia.com/news/world/washington-state-man-becomes-first-us-coronavirus-fatality-12486808", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12487144/16x9/991/557/4a7793edefd856706f671eeeb1b970da/LB/washington-state-health-officials-speak-about-the-first-patient-death-from-novel-coronavirus-in-the-united-states-1.jpg", "publishedAt": "2020-03-01T15:37:03Z", "content": "REUTERS: A Washington state man in his 50s with underlying health issues became the United States' first fatality from the coronavirus, officials said on Saturday, as the Trump administration stepped up efforts to combat the spread of the global outbreak.\r\nTh… [+5150 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Lawal Sherifat", "title": "Coronavirus in Nigeria: 5 tips on what to do", "description": "By Lawal Sherifat Following the confirmation of the first case of Coronavirus also know as COVID 19 by the Federal Ministry of Health in Lagos State, Here are some useful tips on what to do. Keep Good Hygiene Just like Ebola, Coronavirus (COVID 19) is also hi…", "url": "https://www.vanguardngr.com/2020/03/coronavirus-in-nigeria-5-tips-on-what-to-do/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2020/02/Coronavirus11.jpg?fit=1200%2C630&ssl=1", "publishedAt": "2020-03-01T15:18:46Z", "content": "By Lawal Sherifat\r\nFollowing the confirmation of the first case of Coronavirus also know as COVID 19 by the Federal Ministry of Health in Lagos State, Here are some useful tips on what to do.\r\nKeep Good Hygiene\r\nJust like Ebola, Coronavirus (COVID 19) is also… [+1533 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Louvre museum in Paris closes over coronavirus fears", "description": "PARIS: The Louvre museum in Paris kept its doors closed to visitors on Sunday (Mar 1) as staff withheld labour citing fears over the coronavirus, a union representative told AFP. Some 300 staff of the world's most visited museum met in the morning and voted \"…", "url": "https://www.channelnewsasia.com/news/world/louvre-museum-in-paris-closes-over-coronavirus-fears-12488748", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12488746/16x9/991/557/a8075da72ec0e51ed13783bc7ac408ae/nM/the-louvre-the-world-s-most-visited-museum-did-not-open-on-sunday-due-to-staff-s-coronavirus-concerns-1583074464907-2.jpg", "publishedAt": "2020-03-01T15:19:22Z", "content": "PARIS: The Louvre museum in Paris kept its doors closed to visitors on Sunday (Mar 1) as staff withheld labour citing fears over the coronavirus, a union representative told AFP.\r\nSome 300 staff of the world's most visited museum met in the morning and voted … [+1065 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Health Ministry urges Israelis to vote, says no need to worry about coronavirus", "description": "16 special polling stations to serve the 5,630 people in quarantine; ministry, PM say outbreak 'under control'", "url": "https://www.timesofisrael.com/health-ministry-urges-israelis-to-vote-says-no-need-to-worry-about-coronavirus/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/03/F200228FFFF0001-1-1024x640.jpg", "publishedAt": "2020-03-01T15:55:58Z", "content": "The director-general of the Health Ministry on Sunday said Israelis should not hesitate to go out and vote in Monday’s national elections due to the deadly coronavirus.\r\nThe situation is under control. Everyone who was infected with the coronavirus, we know w… [+4478 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Ken Meyer", "title": "Mike Pence: Trump, CDC Misidentification of First U.S. Coronavirus Victim ‘Just a Miscommunication’", "description": "Vice President Mike Pence chalked things up to a \"miscommunication\" when asked about how the Center for Disease Control (CDC) mistakenly identified the first U.S. patient to die of the coronavirus.", "url": "https://www.mediaite.com/tv/mike-pence-trump-cdc-misidentification-of-first-u-s-coronavirus-victim-just-a-miscommunication/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-01-at-10.10.47-AM-1200x652.jpg", "publishedAt": "2020-03-01T15:21:01Z", "content": "Vice President Mike Pence chalked things up to a “miscommunication” when asked about how the Center for Disease Control (CDC) mistakenly identified the first U.S. patient to die of the coronavirus.\r\nPence joined CNN’s Jake Tapper on Sunday to defend President… [+1191 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jared S. Hopkins", "title": "Big Drugmakers Warn About Coronavirus Impact on Business - Wall Street Journal", "description": "Some companies have started looking for alternative sources of drug ingredients, industry officials and experts say", "url": "https://www.wsj.com/articles/big-drugmakers-warn-about-coronavirus-impact-on-business-11583078401", "urlToImage": "https://images.wsj.net/im-159195/social", "publishedAt": "2020-03-01T16:00:00Z", "content": "Some of the worlds biggest drugmakers have begun warning that their businesses could be affected by the spread of the coronavirus.\r\n AstraZeneca PLC, Merck &amp; Co. and Pfizer Inc. are among the companies that said recently the epidemic could affect supplies… [+86 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Urowayino Jeremiah", "title": "APC warns opposition against politicizing Coronavirus incident", "description": "ABUJA: The ruling All Progressives Congress APC has warned the opposition against politicizing the first incidence of Coronavirus in the country, saying the President Muhammadu Buhari led administration should be commended for acting swiftly to contain the di…", "url": "https://www.vanguardngr.com/2020/03/apc-warns-opposition-against-politicizing-coronavirus-incident/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2019/09/APC-logo-1024x923.jpg?fit=1024%2C923&ssl=1", "publishedAt": "2020-03-01T15:12:29Z", "content": "A Nigerian newspaper and Online version of the Vanguard, a daily publication in Nigeria covering Nigeria news, Niger delta, general national news, politics, business, energy, sports, entertainment, fashion,lifestyle human interest stories, etc"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jason Lemon", "title": "France's Louvre Museum Shuts Down Amid Coronavirus Concerns", "description": "\"We are very worried because we have visitors from everywhere,\" Andre Sacristin, a Louvre employee, told The Associated Press.", "url": "https://www.newsweek.com/frances-louvre-museum-shuts-down-amid-coronavirus-concerns-1489908", "urlToImage": "https://d.newsweek.com/en/full/1570490/louvre-museum.jpg", "publishedAt": "2020-03-01T16:10:51Z", "content": "France's famed Louvre Museum in Paris announced Sunday that it would be closed over fears of the spread of coronavirus (COVID-19), after the European nation's reported cases of the new virus rose to 100 on Saturday.\r\n\"An informational meeting on the public he… [+2613 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "‘Ebola Extra’?: 68 Percent of Americans Nervous About Buying Corona Beer Amid Virus Outbreak", "description": "The beverage enjoyed a surge of public interest in January, with Google Trends data revealing a major jump in “corona beer virus” and “beer virus” search terms. However, that interest appears to have turned to negativity amid the poorly educated and grossly m…", "url": "https://sputniknews.com/us/202003011078444818-ebola-extra-68-percent-of-americans-nervous-about-buying-corona-beer-amid-virus-outbreak/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107817/74/1078177407.jpg", "publishedAt": "2020-03-01T15:57:37Z", "content": "The beverage enjoyed a surge of public interest in January, with Google Trends data revealing a major jump in corona beer virus and beer virus search terms. However, that interest appears to have turned to negativity amid the poorly educated and grossly misin… [+2808 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "Amazon is fighting an unseen war against the coronavirus and ugly sellers", "description": "The coronavirus disease COVID-19 has evolved from a regional inconvenience to a worldwide threat in the span of only a couple of months. Lockdowns in China have spread to neighboring Japan, while new cases of the virus are seemingly popping up out of absolute…", "url": "https://bgr.com/2020/03/01/amazon-coronavirus-covid-19-seller-price-gouging/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2019/11/amazon-sign.jpg?quality=98&strip=all", "publishedAt": "2020-03-01T16:00:42Z", "content": "The coronavirus disease COVID-19 has evolved from a regional inconvenience to a worldwide threat in the span of only a couple of months. Lockdowns in China have spread to neighboring Japan, while new cases of the virus are seemingly popping up out of absolute… [+1938 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "COVID-19: many fishermen from State stranded in Iran", "description": "Pinarayi writes to Union Minister to arrange for their safe return", "url": "https://www.thehindu.com/news/national/kerala/covid-19-many-fishermen-from-state-stranded-in-iran/article30957577.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-03-01T15:26:51Z", "content": "Scores of fishermen from the State are among the large number of Indian fishermen feared trapped in Iran following the Coronavirus (COVID-19) outbreak there. \r\nChief Minister Pinarayi Vijayan has written to Union Minister for External Affairs S. Jaishankar re… [+1404 chars]"}, {"source": {"id": null, "name": "Israelnationalnews.com"}, "author": null, "title": "Sheba Hospital ranked 9th best in the world", "description": "Sheba Medical Center at Tel Hashomer moves up a space in annual Newsweek ranking of world's best hospitals.", "url": "http://www.israelnationalnews.com/News/News.aspx/276656", "urlToImage": "http://k6s3v6r4.ssl.hwcdn.net/pictures/805/805719.jpg", "publishedAt": "2020-03-01T15:53:00Z", "content": "Newsweek magazine has deemed the Sheba Medical Center at Tel Hashomer the world's ninth-best hospital, one place ahead of last year's ranking, and placing it alongside the Mayo Clinic, Cleveland Clinic, Toronto General Hospital, and more. \r\nLocated in the Tel… [+1505 chars]"}, {"source": {"id": null, "name": "Thelocal.fr"}, "author": null, "title": "Coronavirus: France's Louvre museum closed due to staff fears - The Local France", "description": "Coronavirus: France's Louvre museum closed due to staff fears The Local France COVID-19 Fears Shut Down Paris' Louvre Museum TIME Louvre museum in Paris closes over coronavirus fears FRANCE 24 Louvre museum in Paris closes over coronavirus fears | AFP AFP New…", "url": "https://www.thelocal.fr/20200301/frances-louvre-museum-closed-due-to-virus-fears", "urlToImage": null, "publishedAt": "2020-03-01T15:42:45Z", "content": null}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Justine Coleman", "title": "Head of HHS says 'partisan sniping' during coronavirus crisis is 'unnecessary'", "description": "Health and Human Services (HHS) Secretary Alex Azar said Sunday that \"partisan sniping\" during the coronavirus crisis is \"unnecessary\" as he defended President Trump's response. ABC's George Step...", "url": "https://thehill.com/homenews/sunday-talk-shows/485349-head-of-hhs-says-partisan-sniping-during-coronavirus-crisis-is", "urlToImage": "https://thehill.com/sites/default/files/azaralex_022520gn_lead.jpg", "publishedAt": "2020-03-01T15:52:09Z", "content": "Health and Human Services (HHS) Secretary Alex Azar said Sunday that partisan sniping during the coronavirus crisis is unnecessary as he defended President TrumpDonald John TrumpRatcliffe rebuts criticism over experience for DNI nominationOn The Trail: Steyer… [+2163 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "none@none.com (Imtiaz Ali)", "title": "Sindh extends closure of educational institutions till March 13 to contain coronavirus", "description": "The Sindh government on Sunday decided to keep all educational institutions in the province closed until March 13 in view of the threat posed by the novel coronavirus. The decision was taken by Sindh Chief Minister Syed Murad Ali Shah, who was heading the fou…", "url": "https://www.dawn.com/news/1537635", "urlToImage": "https://i.dawn.com/large/2020/03/5e5bce7101398.jpg", "publishedAt": "2020-03-01T15:14:09Z", "content": "The Sindh government on Sunday decided to keep all educational institutions in the province closed until March 13 in view of the threat posed by the novel coronavirus. \r\nThe decision was taken by Sindh Chief Minister Syed Murad Ali Shah, who was heading the f… [+1418 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "EditorDavid", "title": "Amazon Bans 1 million Products Over Coronavirus Claims", "description": "\"Amazon has pulled more than 1 million items from its digital shelves due to claims that the products could either cure or help prevent the spread of coronavirus,\" reports SiliconValley.com: The move comes during the same week that Facebook said it would ban …", "url": "https://science.slashdot.org/story/20/03/01/073233/amazon-bans-1-million-products-over-coronavirus-claims", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2020-03-01T15:34:00Z", "content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."}, {"source": {"id": null, "name": "Npr.org"}, "author": null, "title": "COVID-19 UPDATE", "description": "The coronavirus that causes the disease COVID-19 is spreading in the U.S. but the general threat to average Americans in still low. Elsewhere, the virus is causing disruptions.", "url": "https://www.npr.org/2020/03/01/810935570/covid-19-update", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2020-03-01T15:53:42Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jackie Salo", "title": "Australia confirms first death from coronavirus", "description": "Australia reported the country’s first death of the coronavirus was a former passenger of the quarantined Diamond Princess cruise. The 78-year-old man died early Sunday in the intensive care unit at a Perth hospital after he was infected on the ship docked in…", "url": "https://nypost.com/2020/03/01/australia-confirms-first-death-from-coronavirus/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/ap_20052345528167.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-01T15:50:46Z", "content": "Australia reported the country’s first death of the coronavirus was a former passenger of the quarantined Diamond Princess cruise.\r\nThe 78-year-old man died early Sunday in the intensive care unit at a Perth hospital after he was infected on the ship docked i… [+1173 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "Nwafor", "title": "Coronavirus: When will Buhari address Nigerians? PDP asks", "description": "The Peoples Democratic Party, PDP, Sunday expressed worry at what it called President Muhammadu Buhari’s delay in standing up to the responsibilities of his office to address heightening national anxieties since the detection of the deadly COVID-19 in our cou…", "url": "https://www.vanguardngr.com/2020/03/coronavirus-when-will-buhari-address-nigerians-pdp-asks/", "urlToImage": "https://i0.wp.com/www.vanguardngr.com/wp-content/uploads/2020/01/Muhammadu-Buhari.jpg?fit=1500%2C851&ssl=1", "publishedAt": "2020-03-01T15:41:39Z", "content": "President Muhammadu Buhari\r\nBy Dirisu Yakubu\r\nThe Peoples Democratic Party, PDP, Sunday expressed worry at what it called President Muhammadu Buharis delay in standing up to the responsibilities of his office to address heightening national anxieties since th… [+1052 chars]"}, {"source": {"id": null, "name": "Letstalkbitcoin.com"}, "author": "adam@letstalkbitcoin.com (The LTB Network), The LTB Network", "title": "Chain Reaction - Eric Feigl-Ding: The Coronavirus Pandemic is Inevitable", "description": "Host Tom Shaughnessy sat down to speak on short notice with Eric Feigl-Ding, PhD, an epidemiologist, health economist, and nutrition scientist at the Harvard Chan School of Public Health to discuss the Coronavirus (COVID-19). Eric has been an extremely inform…", "url": "https://letstalkbitcoin.com/blog/post/chain-reaction-eric-feigl-ding-the-coronavirus-pandemic-is-inevitable?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+TheDailyBitcoinShow+%28Let%27s+Talk+Bitcoin+Network+Feed%29", "urlToImage": "https://letstalkbitcoin.com/files/blogs/8498-ab1838b769ed0005b7db677869f6cab6eb298b4fc7fa44ead86afe206d8345f8.jpg", "publishedAt": "2020-03-01T15:31:00Z", "content": "Click to download audio version\r\nHost Tom Shaughnessy sat down to speak on short notice with Eric Feigl-Ding, PhD, an epidemiologist, health economist, and nutrition scientist at the Harvard Chan School of Public Health to discuss the Coronavirus (COVID-19).\r… [+1372 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "GeekWire", "title": "Week in Review: Most popular stories on GeekWire for the week of Feb. 23, 2020", "description": "See the technology stories that people were reading on GeekWire for the week of Feb. 23, 2020.… Read More", "url": "https://www.geekwire.com/2020/geekwire-weekly-roundup-2020-02-23/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2015/11/geekwire-week-in-review1.png", "publishedAt": "2020-03-01T16:00:43Z", "content": "Get caught up on the latest technology and startup news from the past week. Here are the most popular stories on GeekWire for the week of Feb. 23, 2020.\r\nSign up to receive these updates every Sunday in your inbox by subscribing to our GeekWire Weekly email n… [+2307 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Mark Moore", "title": "Pence says ‘there’s no question’ US will have more cases of coronavirus", "description": "Vice President Pence, who’s running point on the Trump administration’s response to the coronavirus crisis, said “there’s no question” the US will see more cases of the disease that is rapidly spreading worldwide. “There will be more cases. There’s no questio…", "url": "https://nypost.com/2020/03/01/pence-says-theres-no-question-us-will-have-more-cases-of-coronavirus/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/pence-coronavirus.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-01T15:28:25Z", "content": "Vice President Pence, who’s running point on the Trump administration’s response to the coronavirus crisis, said “there’s no question” the US will see more cases of the disease that is rapidly spreading worldwide.\r\n“There will be more cases. There’s no questi… [+1751 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Barbie Latza Nadeau", "title": "Coronavirus Fever: An Infected Priest, a Murder Charge, and a Shortage of Tests", "description": "ROME—It is, by now, impossible to keep up with the fast-changing coronavirus statistics: the number of confirmed cases in new countries seems to roll like ticker tape. The latest confirmations include an American student studying in Italy who reportedly just …", "url": "https://news.yahoo.com/coronavirus-fever-infected-priest-murder-155411057.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MK2._ZZOYRwdt7.0a1x0KQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuODYzMjQ3ODYzMjQ3OA--/https://s.yimg.com/uu/api/res/1.2/iOqVEB8.iO4dKg_8KBi4qw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/8438911128699658c12183728e81656e", "publishedAt": "2020-03-01T15:54:11Z", "content": "Jason Cairnduff /Reuters\r\nROMEIt is, by now, impossible to keep up with the fast-changing coronavirus statistics: the number of confirmed cases in new countries seems to roll like ticker tape. The latest confirmations include an American student studying in I… [+2564 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Azar says he's personally overseeing investigation into HHS whistleblower allegations on coronavirus", "description": "The secretary of health and human services says he is looking into allegations that health workers weren't properly protected when interacting with Americans returning from China.", "url": "https://www.cbsnews.com/video/azar-says-hes-personally-overseeing-investigation-into-hhs-whistleblower-allegations-on-coronavirus/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/03/01/d38710fb-0d3f-46ae-8939-be4bd1bb7a32/thumbnail/1200x630/1ce2236d83a7337c83c0043df0eee139/0301-ftn-alexazar-2038985-640x360.jpg", "publishedAt": "2020-03-01T16:09:56Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Lauren Thomas", "title": "'We knew this was coming': Biden criticizes Trump administration's coronavirus response", "description": "Former Vice President Joe Biden on Sunday criticized President Donald Trump's response to the coronavirus outbreak here in the U.S., saying Trump's administration was largely unprepared.", "url": "https://www.cnbc.com/2020/03/01/biden-criticizes-trump-administrations-coronavirus-response.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106325046-1578425558933rts2xje2.jpg?v=1578425634", "publishedAt": "2020-03-01T15:36:16Z", "content": "Former Vice President Joe Biden on Sunday criticized President Donald Trump's response to the coronavirus outbreak here in the U.S., accusing the administration of being largely unprepared.\r\n\"We knew this was coming ... back as far as January,\" the current De… [+1612 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "Ric Garrido", "title": "World’s largest travel conference canceled due to COVID-19", "description": "ITB Berlin, the world’s largest travel trade show, was canceled Friday evening due to the spread of novel coronavirus COVID-19 in Europe. The travel conference and trade show brings together industry people from around the world for tourism promotiom was sche…", "url": "https://loyaltytraveler.boardingarea.com/2020/03/01/wolrds-largest-travel-conference-canceled-due-to-covid-19/", "urlToImage": "https://loyaltytraveler.boardingarea.com/wp-content/uploads/2013/06/ITB-Berlin-Brasil.jpg", "publishedAt": "2020-03-01T15:51:26Z", "content": "ITB Berlin, the world’s largest travel trade show, was canceled Friday evening due to the spread of novel coronavirus COVID-19 in Europe. The travel conference and trade show brings together industry people from around the world for tourism promotiom was sche… [+3859 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Justin Baragona", "title": "Chuck Todd Grills Pence, Says It Feels Like Team Trump’s ‘Gaslighting’ on Dems’ Coronavirus Rhetoric", "description": "Meet the Press anchor Chuck Todd pressed Vice President Mike Pence on Sunday to “name some names” after the veep groused that there was “irresponsible rhetoric” from Democrats on the coronavirus, with Todd further telling Pence that it feels like Team Trump i…", "url": "https://news.yahoo.com/chuck-todd-grills-pence-says-151841897.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hRZjk5GDA.leUd4C2_PR4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/RmoufUcvw8eiO5Z7iSCw7A--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/9a28590ae8981555a50639273d898e74", "publishedAt": "2020-03-01T15:18:41Z", "content": "Meet the Press anchor Chuck Todd pressed Vice President Mike Pence on Sunday to name some names after the veep groused that there was irresponsible rhetoric from Democrats on the coronavirus, with Todd further telling Pence that it feels like Team Trump is ga… [+3629 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "FRANCE 24", "title": "Netanyahu, Gantz neck and neck on eve of third Israeli elections in a year", "description": "Israeli Prime Minister Benjamin Netanyahu and his rival Benny Gantz were wrapping up another bitter election campaign on Sunday, a day before voters were to cast their ballots for the third time in 12 months.", "url": "https://www.france24.com/en/20200301-netanyahu-gantz-neck-and-neck-on-eve-of-third-israeli-elections-in-a-year", "urlToImage": "https://s.france24.com/media/display/de541a12-5bcc-11ea-b341-005056bf87d6/w:1240/p:16x9/2020 03 01 A banner depicts Gantz and Netanyahu Reuters Ammar Awad.JPG", "publishedAt": "2020-03-01T15:38:00Z", "content": "Israeli Prime Minister Benjamin Netanyahu and his rival Benny Gantz were wrapping up another bitter election campaign on Sunday, a day before voters were to cast their ballots for the third time in 12 months.\r\n Netanyahu, Israels longest-serving leader, has b… [+6143 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jackie Salo", "title": "Coughing Pope Francis cancels participation in week-long spiritual retreat", "description": "A coughing Pope Francis said Sunday that “unfortunately a cold” will prevent him from participating in a week-long spiritual retreat. The 83-year-old pontiff paused twice to cough while addressing thousands for his weekly blessing from St. Peter’s Square, whe…", "url": "https://nypost.com/2020/03/01/coughing-pope-francis-cancels-participation-in-week-long-spiritual-retreat/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/ap_20061424496134.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-01T15:20:58Z", "content": "A coughing Pope Francis said Sunday that “unfortunately a cold” will prevent him from participating in a week-long spiritual retreat.\r\nThe 83-year-old pontiff paused twice to cough while addressing thousands for his weekly blessing from St. Peter’s Square, wh… [+782 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jackie Salo", "title": "Rhode Island patient tests positive for the coronavirus after traveling to Italy", "description": "Rhode Island announced Sunday that a patient has tested positive for the coronavirus, marking the first possible case in the state. The Department of Health said the case, a person in their 40s, is presumed positive and will have to be confirmed by the US Cen…", "url": "https://nypost.com/2020/03/01/rhode-island-patient-tests-positive-for-the-coronavirus-after-traveling-to-italy/", "urlToImage": "https://thenypost.files.wordpress.com/2020/03/ap_20061347490179.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-03-01T15:14:30Z", "content": "Rhode Island announced Sunday that a patient has tested positive for the coronavirus, marking the first possible case in the state.\r\nThe Department of Health said the case, a person in their 40s, is presumed positive and will have to be confirmed by the US Ce… [+1451 chars]"}, {"source": {"id": null, "name": "Alternet.org"}, "author": "Ian Reifowitz", "title": "Weaponizing an epidemic for political purposes is exactly what Limbaugh did to Obama", "description": "“It looks like the coronavirus is being weaponized as yet another element to bring down Donald Trump,” Rush Limbaugh, February 26, 2020 The Man Who Lost The Popular Vote has said much the… Related Stories Pence defends Trump Jr’s claim that Dems want ‘million…", "url": "https://www.alternet.org/2020/03/weaponizing-an-epidemic-for-political-purposes-is-exactly-what-limbaugh-did-to-obama/", "urlToImage": "https://www.alternet.org/wp-content/uploads/2019/10/obama-2.jpg", "publishedAt": "2020-03-01T16:03:36Z", "content": "It looks like the coronavirus is being weaponized as yet another element to bring down Donald Trump,” Rush Limbaugh, February 26, 2020\r\nThe Man Who Lost The Popular Vote has said much the same, accusing Democrats of politicizing the coronavirus, which he char… [+9252 chars]"}, {"source": {"id": null, "name": "Mediaite.com"}, "author": "Ken Meyer", "title": "Bernie Sanders Rejects Trump’s Promotion of His Campaign, Rips ‘Pathetic’ Effort to ‘Steal’ Media Attention From Dems", "description": "Senator Bernie Sanders said he has no interest in accepting President Donald Trump's \"help\" in promoting his 2020 presidential campaign.", "url": "https://www.mediaite.com/tv/bernie-sanders-rejects-trumps-promotion-of-his-campaign-rips-pathetic-effort-to-steal-media-attention-from-dems/", "urlToImage": "https://www.mediaite.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-01-at-10.41.20-AM-1200x683.jpg", "publishedAt": "2020-03-01T15:51:43Z", "content": "Senator Bernie Sanders said he has no interest in accepting President Donald Trump’s “help” in promoting his 2020 presidential campaign.\r\nIn the last few weeks, Trump has issued several positivetweets about Sanders campaign, most of which gravitate around POT… [+1523 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ben Miller For Mailonline", "title": "Serie A president claims Inter Milan refused to play Juventus in front of fans over coronavirus", "description": "Serie A supremo Dal Pino has revealed that the Nerazzurri were offered the chance to switch their clash with Juve to Monday and face the reigning champions without playing behind closed doors.", "url": "https://www.dailymail.co.uk/sport/football/article-8062275/Serie-president-claims-Inter-Milan-refused-play-Juventus-fans-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/01/15/25392678-0-image-a-15_1583076509671.jpg", "publishedAt": "2020-03-01T15:52:59Z", "content": "2020 OLYMPIC GAMES \r\nIn doubt \r\nThe scale of the outbreak in Japan saw senior International Olympic Committee member Dick Pound describe the disease as 'the new war' threatening Tokyo 2020 and he warned the Games may have to be cancelled if the virus was stil… [+11800 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Extend qualification period, say shuttlers", "description": "Saina and Kashyap feel coronavirus outbreak is affecting the schedule", "url": "https://www.thehindu.com/sport/other-sports/extend-qualification-period-say-shuttlers/article30957756.ece", "urlToImage": "https://www.thehindu.com/sport/other-sports/qgqcgs/article30957755.ece/ALTERNATES/LANDSCAPE_615/TH02SAINA", "publishedAt": "2020-03-01T15:52:18Z", "content": "Indian shuttlers Saina Nehwal and P. Kashyap feel that the BWF should extend the Olympic qualification period in view of the novel coronavirus outbreak wrecking havoc on the qualifying events for the Tokyo Games.\r\nConcerns over the rapid spread of the deadly … [+1502 chars]"}, {"source": {"id": null, "name": "Vaxbeforetravel.com"}, "author": null, "title": "CDC Updates Japan’s Level 2 Travel Alert - Vax Before Travel", "description": "CDC Updates Japan’s Level 2 Travel Alert Vax Before Travel View Full coverage on Google News", "url": "https://www.vaxbeforetravel.com/japan-travel-alert-updated-centers-disease-control-and-prevention", "urlToImage": "https://www.vaxbeforetravel.com/sites/default/files/senso-ji-1447399.jpg", "publishedAt": "2020-03-01T15:47:59Z", "content": "The US Centers for Disease Control and Prevention (CDC) updated the Level 2 Travel Alert for Japan on February 28, 2020.\r\nThis Practice Enhanced Precautions Travel Alert says Japan is experiencing sustained community transmission of respiratory illness now ca… [+2592 chars]"}, {"source": {"id": null, "name": "Spectator.co.uk"}, "author": "Cindy Yu", "title": "Beware the super-spreaders of coronavirus conspiracy theories", "description": "When a new virus is discovered, conspiracy theories often spread faster than the disease. I’ve been following the debate in China and the latest theory doing the rounds on social media is: what if the…", "url": "https://blogs.spectator.co.uk/2020/03/beware-the-super-spreaders-of-coronavirus-conspiracy-theories/", "urlToImage": "https://spectatorblogs.imgix.net/files/2020/03/GettyImages-1204308073.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=486", "publishedAt": "2020-03-01T15:28:14Z", "content": "When a new virus is discovered, conspiracy theories often spread faster than the disease. I’ve been following the debate in China and the latest theory doing the rounds on social media is: what if the coronavirus didn’t come from China, but originated in the … [+3243 chars]"}, {"source": {"id": null, "name": "Alternet.org"}, "author": "David Edwards", "title": "Pence defends Trump Jr’s claim that Dems want ‘millions’ to die from coronavirus: ‘Understandable’", "description": "Vice President Mike Pence said over the weekend that it is “understandable” that President Donald Trump’s son, Donald Trump Jr., would say that Democrats want millions of Americans to die… Related Stories CNN host Michael Smerconish slammed for comparing Sand…", "url": "https://www.alternet.org/2020/03/pence-defends-trump-jrs-claim-that-dems-want-millions-to-die-from-coronavirus-understandable/", "urlToImage": "https://www.alternet.org/wp-content/uploads/2019/10/pence.jpg", "publishedAt": "2020-03-01T15:49:31Z", "content": "Vice President Mike Pence said over the weekend that it is understandable that President Donald Trumps son, Donald Trump Jr., would say that Democrats want millions of Americans to die of the coronavirus.\r\nIn an interview that aired on Sunday, CNNs Jake Tappe… [+1251 chars]"}, {"source": {"id": null, "name": "Hotair.com"}, "author": "<![CDATA[Allahpundit]]>, tips@hotair.com (Hot Air Network, LLC), Hot Air Network, LLC", "title": "Scientist: Genetic analysis suggests coronavirus has been spreading in Washington state for weeks", "description": "<![CDATA[Not a surprise given the news yesterday that one person there has died of the disease and two more, a teenager and a woman in her 50s, are presumptive positives. A fourth man from Washington was diagnosed with COVID-19 in January after traveling in C…", "url": "https://hotair.com/archives/allahpundit/2020/03/01/scientist-genetic-analysis-suggests-coronavirus-spreading-washington-state-weeks/", "urlToImage": "https://hotair.com/wp/wp-content/uploads/2020/03/c.jpg", "publishedAt": "2020-03-01T15:31:16Z", "content": "Not a surprise given the news yesterday that one person there has died of the disease and two more, a teenager and a woman in her 50s, are presumptive positives. A fourth man from Washington was diagnosed with COVID-19 in January after traveling in China near… [+7339 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Annapurna Singh", "title": "Is the Indian economy growing only in numbers? - Deccan Herald", "description": "Is the Indian economy growing only in numbers? Deccan Herald Not Q3 GDP growth but revision of past data is the biggest worry CNBCTV18 GDP growth may not revive unless investment does Livemint A bad time for India, but with bad leadership Deccan Chronicle Ind…", "url": "https://www.deccanherald.com/business/is-the-indian-economy-growing-only-in-numbers-809568.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/03/01/file6x5v8japrjr14yqfuila-1583079596.jpg", "publishedAt": "2020-03-01T15:28:01Z", "content": "What is the state of Indias economy now? Has the growth picked up in the latest quarter (Oct-Dec) for which the data was released late last week or, has it weakened? Well, the latest statistical jugglery has left the average Indian, who may not read numbers b… [+4962 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "China’s Oil Demand Could Rebound Sooner Than Expected", "description": "Depending on the speed of containment, China could ramp up oil imports again by the end of March as the hunger for cheap fuel could spark a buying spree", "url": "https://finance.yahoo.com/news/china-oil-demand-could-rebound-160000692.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-01T16:00:00Z", "content": "Chinas fuel demand has materially weakened after the coronavirus outbreak forced authorities to lock down cities and discourage travels.\r\nSome estimates put the current demand loss in China at around 4 million barrels per day (bpd) of fuel.  \r\nStill, Chinas c… [+3973 chars]"}, {"source": {"id": null, "name": "Esquire.com"}, "author": "Gabrielle Bruney", "title": "John Mulaney Debuted His Joe Biden Impression in SNL 's Coronavirus Press Conference Cold Open", "description": "\"The year was nineteen Rikki Tikki Tavi,\" said Mulaney,  \"and me and Nelson Mandela were palling around South Africa, 'Green Book'-style.\"", "url": "https://www.esquire.com/entertainment/tv/a31175338/john-mulaney-saturday-night-live-cold-open/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2020-03-01-at-10-05-55-am-1583075240.png?crop=1.00xw:0.929xh;0,0&resize=1200:*", "publishedAt": "2020-03-01T15:49:00Z", "content": "It's rare to see one character played by three different performers over a single season of Saturday Night Live. But in recent months, Woody Harrelson, Jason Sudeikis, and now John Mulaney have all taken turns in the role of former Vice President Joe Biden. A… [+1637 chars]"}, {"source": {"id": null, "name": "Freethoughtblogs.com"}, "author": "Mano Singham", "title": "Coronavirus epidemic shows the danger of having a lying, incompetent president", "description": "It is clear that what got Donald Trump’s attention about the coronavirus was that it caused a slump in the stock market, the only piece of data he seems to pay attention to and cares about. He is reportedly thinking of tax cuts as a response. His initial resp…", "url": "https://freethoughtblogs.com/singham/2020/03/01/coronavirus-epidemic-shows-the-danger-of-having-a-lying-incompetent-president/", "urlToImage": "https://freethoughtblogs.com/singham/wp-content/themes/ftb2-theme/images/logo.png", "publishedAt": "2020-03-01T15:22:27Z", "content": "It is clear that what got Donald Trump’s attention about the coronavirus was that it caused a slump in the stock market, the only piece of data he seems to pay attention to and cares about. He is reportedly thinking of tax cuts as a response. His initial resp… [+3957 chars]"}, {"source": {"id": null, "name": "Dcrainmaker.com"}, "author": "DC Rainmaker", "title": "Week in Review–March 1st, 2020", "description": "The Week in Review is a collection of both all the goodness I’ve written during the past week around the internet, as well as a small pile of links I found interesting – generally endurance sports related. I’ve often wondered … Read More Here →", "url": "https://www.dcrainmaker.com/2020/03/week-in-review-march-1st-2020.html", "urlToImage": "https://media.dcrainmaker.com/images/2019/08/WeekinReview_thumb3_thumb_thumb1_thu.jpg", "publishedAt": "2020-03-01T15:57:36Z", "content": "The Week in Review is a collection of both all the goodness Ive written during the past week around the internet, as well as a small pile of links I found interesting generally endurance sports related. Ive often wondered what to do with all of the coolness t… [+9556 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Tom Aspray, Contributor, Tom Aspray, Contributor https://www.forbes.com/sites/tomaspray/", "title": "Are The Wall Street Strategists Wrong?", "description": "The stock market plunge last week was similar in magnitude to the decline in early 2018. Many fundamental analysts were buying that decline though some technicians were bearish. What is the correct strategy now?", "url": "https://www.forbes.com/sites/tomaspray/2020/03/01/are-the-wall-street-strategists-wrong/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1175337129%2F960x0.jpg", "publishedAt": "2020-03-01T15:15:00Z", "content": "New York Stock Exchange (NYSE) (Photo by JOHANNES EISELE/AFP via Getty Images)\r\nAFP via Getty Images\r\nThe investor euphoria prior to last weeks market collapse reminded me a bit of the early-2000 market top. I was at a trader conference in New York in Februar… [+14704 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "By Jake Sherman and Anna Palmer", "title": "POLITICO Playbook: The return of Joe Biden?", "description": null, "url": "https://www.politico.com/newsletters/playbook/2020/03/01/the-return-of-joe-biden-488445", "urlToImage": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg", "publishedAt": "2020-03-01T15:42:26Z", "content": "Former Vice President Joe Bidenmade the rounds on the Sunday shows this morning after his South Carolina victory. | Scott Olson/Getty Images\r\nDRIVING THE DAY\r\nJOE BIDENS CAMPAIGN plans to use last nights massive victory in South Carolina to make the case to v… [+19176 chars]"}, {"source": {"id": null, "name": "Retailnews.asia"}, "author": null, "title": "Apple promised first Apple India store next year - Retail News Asia", "description": "Apple promised first Apple India store next year Retail News Asia Apple CEO Tim Cook said the Trump administration directly intervened to help the iPhone maker break into India Business Insider India Apple can sell devices in India because of Trump administra…", "url": "https://www.retailnews.asia/apple-promised-first-apple-india-store-next-year/", "urlToImage": "https://www.retailnews.asia//135525-391882-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2018/09/Apple-store-China.jpg", "publishedAt": "2020-03-01T16:05:06Z", "content": "Apple CEO Tim Cook says the first Apple India store is on track to open next year.\r\nCook made the announcement in response to a question at the firms annual shareholder meeting. The companys plans for the region have been anticipated for some time, following … [+1005 chars]"}, {"source": {"id": null, "name": "Thestar.com"}, "author": "The Canadian Press", "title": "Quebec couple who got coronavirus on Diamond Princess cruise ship to come home, daughter says", "description": "Diane and Bernard Menard, who are in their 70s, were among the more than 700 people who contracted COVID-19 aboard the ship.", "url": "https://www.thestar.com/news/canada/2020/03/01/quebec-couple-who-got-coronavirus-on-diamond-princess-cruise-ship-to-come-home-daughter-says.html", "urlToImage": "https://images.thestar.com/ecU1QyosCxZpmwaSM3Q-71K43fU=/1200x800/smart/filters:cb(1583078079838)/https://www.thestar.com/content/dam/thestar/news/canada/2020/03/01/quebec-couple-who-got-coronavirus-on-diamond-princess-cruise-ship-to-come-home-daughter-says/diamondprincess.jpg", "publishedAt": "2020-03-01T15:54:39Z", "content": "MONTREAL—The daughter of a Quebec couple who contracted the novel coronavirus aboard the Diamond Princess cruise ship in Japan says her parents can come home after testing negative for the virus.\r\nChantal Menard says she learned early this morning that her mo… [+893 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Cole Blake", "title": "John Mulaney Brings Out Flying Jake Gyllenhaal For Absurd \"SNL\" Sketch", "description": "\"Saturday Night Live\" pulled no punches in their sketch about LaGuardia Airport. https://www.hotnewhiphop.com/john-mulaney-brings-out-flying-jake-gyllenhaal-for-absurd-snl-sketch-news.105117.html", "url": "https://www.hotnewhiphop.com/john-mulaney-brings-out-flying-jake-gyllenhaal-for-absurd-snl-sketch-news.105117.html", "urlToImage": "https://www.hotnewhiphop.com/image/740x416/cover/1583078432_2e648b942755758ae598e5e0f6d0265e.jpg/37d86a8a1fe8e485747555566d43f998/1583078432_ad5ed2ea651018e444137086ffea4fd0.jpg", "publishedAt": "2020-03-01T16:08:17Z", "content": "New York City's Queens-based LaGuardia Airport can be a horrible place, something that Saturday Night Live made abundantly clear with their \"Airport Sushi\" sketch during last night's episode.\r\nJohn Moore / Getty Images\r\nWhen Pete Davidson attempts to purchase… [+988 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By EYTAN HALON", "title": "Kahlon: Israel coordinating with PA to contain coronavirus outbreak", "description": "'We are in contact with [the Palestinian Authority] because the virus has no borders, and doesn't know to distinguish between ethnic groups, religions or nations.' ;", "url": "https://www.jpost.com/Israel-News/Kahlon-Israel-coordinating-with-PA-to-contain-coronavirus-outbreak-619399", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/454034", "publishedAt": "2020-03-01T15:23:26Z", "content": null}]