[{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what it was like on cruise ship with coronavirus", "description": "The Grand Princess cruise ship was put under quarantine as 21 people tested positive for the novel coronavirus.", "url": "https://www.cnn.com/videos/health/2020/03/10/grand-princess-cruise-coronavirus-orig-na.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200310144441-grand-princess-super-tease.jpg", "publishedAt": "2020-03-10T18:53:50Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Trump explains why he hasn't been tested for coronavirus", "description": "President Trump told reporters he was feeling great and had not been tested for the novel coronavirus after having contact with multiple lawmakers who announced they would be self-quarantining themselves. Trump said he would not be opposed to being tested for…", "url": "https://www.cnn.com/videos/politics/2020/03/10/trump-coronavirus-test-sot-nr-cohen-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200310144246-trump-remarks-3-10-super-tease.jpg", "publishedAt": "2020-03-10T18:45:08Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "glandsverk@businessinsider.com (Gabby Landsverk), Gabby Landsverk", "title": "Avoiding processed food won't protect you from the coronavirus, but sleep, exercise, and reducing stress will help", "description": "Paulo Whitaker/Reuters Wellness gurus are recommending that people \"boost\" their immune system with superfoods to help protect themselves from the coronavirus. Eating a nutritious, balanced diet is important for your overall health and your immune system, but…", "url": "https://www.businessinsider.com/eating-clean-wont-cure-or-prevent-coronavirus-experts-2020-3", "urlToImage": "https://i.insider.com/5e67dc7854f25c68f0114027?width=1200&format=jpeg", "publishedAt": "2020-03-10T19:07:00Z", "content": "With hand sanitizer and other disinfectants running low around the world, people are looking for more innovative ways to help protect themselves against the coronavirus. Cue the wellness gurus advertising a wealth of superfoods and supplements, often expensiv… [+4948 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pentagon says coronavirus cases likely higher than official count", "description": "The U.S. military's official tally of servicemembers and related personnel who have been infected by the coronavirus likely undercounts the actual total, the Pentagon acknowledged on Tuesday, as a second servicemember in the United States tested positive for …", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-pentagon-idUSKBN20X2PR", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T18:12:35Z", "content": "WASHINGTON (Reuters) - The U.S. military’s official tally of servicemembers and related personnel who have been infected by the coronavirus likely undercounts the actual total, the Pentagon acknowledged on Tuesday, as a second servicemember in the United Stat… [+318 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "McConnell says he hopes coronavirus relief deal can be reached soon", "description": "U.S. Senate Republicans on Tuesday said they hoped the Trump administration could reach a deal with House Democrats for an economic package amid the coronavirus outbreak, including a possible $300 billion in payroll tax relief.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-republicans-idUSKBN20X2QO", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501354060&w=1200&r=LYNXMPEG291PN", "publishedAt": "2020-03-10T18:22:44Z", "content": "WASHINGTON (Reuters) - U.S. Senate Republicans on Tuesday said they hoped the Trump administration could reach a deal with House Democrats for an economic package amid the coronavirus outbreak, including a possible $300 billion in payroll tax relief. \r\nSenate… [+316 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Emily Cavanagh", "title": "Play spaces are protecting against the coronavirus by using hospital-grade cleaning equipment and taking kids' temperatures", "description": "As the coronavirus continues to spread worldwide, and within the US, centers that offer classes for children are taking extra precautions to sanitize their facilities and equipment. In general, play spaces are \"Petri plates\" for infection, since children tend…", "url": "https://www.businessinsider.com/how-childrens-play-spaces-are-protecting-against-the-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e67dd0154f25c69b90a2c13?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:29:00Z", "content": "Before the coronavirus outbreak, the Play Place in Westchester County, New York was abuzz every morning. Neighborhood children would participate in music and sports classes and play in the indoor jungle gym. \r\nBut as the coronavirus has spread across the US, … [+5223 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Daily Crunch: French data watchdog investigates Criteo", "description": "Criteo faces a privacy investigation, an e-discovery startup raises $62 million and hackers hack other hackers. Here’s your Daily Crunch for March 10, 2020. 1. Adtech giant Criteo is being investigated by France’s data watchdog Criteo is under investigation b…", "url": "http://techcrunch.com/2020/03/10/daily-crunch-french-data-watchdog-investigates-criteo/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-512136509.jpg?w=534", "publishedAt": "2020-03-10T18:16:25Z", "content": "Criteo faces a privacy investigation, an e-discovery startup raises $62 million and hackers hack other hackers. Here’s your Daily Crunch for March 10, 2020.\r\n1. Adtech giant Criteo is being investigated by Frances data watchdog\r\nCriteo is under investigation … [+2741 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Lahut", "title": "Angela Merkel just estimated '60 to 70%' of the German population will contract coronavirus", "description": "German Chancellor Angela Merkel told parliament Tuesday that \"60 to 70%\" of the German population will contract the coronavirus. Dropping the figure at the outset of a parliamentary meeting, Merkel's proclamation left the room silent, according to a report fr…", "url": "https://www.businessinsider.com/angela-merkel-estimates-coronavirus-will-hit-large-majority-german-population-2020-3", "urlToImage": "https://i.insider.com/5e67dad154f25c65d830b083?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:45:06Z", "content": "German Chancellor Angela Merkel gave a grave prognosis to parliament on Tuesday, telling members that \"60 to 70%\" of the German population will contract the coronavirus at some point, according to Bild.\r\nThe German tabloid reported that upon dropping the stat… [+813 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Top U.S. Senate Democrat says corporate tax cuts not the way to fight coronavirus", "description": "Senator Chuck Schumer, the top Democrat in the U.S. Senate, said on Tuesday more corporate tax cuts were not the way to combat coronavirus and Democrats would seek paid sick leave and emergency unemployment insurance as part of a relief plan.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-schumer-idUSKBN20X2SW", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501362888&w=1200&r=LYNXMPEG291QJ", "publishedAt": "2020-03-10T18:50:54Z", "content": "WASHINGTON (Reuters) - Senator Chuck Schumer, the top Democrat in the U.S. Senate, said on Tuesday more corporate tax cuts were not the way to combat coronavirus and Democrats would seek paid sick leave and emergency unemployment insurance as part of a relief… [+182 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "New York to close schools in suburb at center of coronavirus outbreak", "description": "Schools and \"major gathering places\" in a part of the New York City suburb of New Rochelle will shut down for two weeks in an effort to contain the coronavirus outbreak at its local epicenter, Governor Andrew Cuomo said on Tuesday.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/n_HddeEfFsM/new-york-to-close-schools-in-suburb-at-center-of-coronavirus-outbreak-idUSKBN20X2IH", "urlToImage": null, "publishedAt": "2020-03-10T18:32:13Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Consumer confidence is dropping sharply around the world as coronavirus spreads", "description": "The coronavirus outbreak has rattled consumers around the globe in recent weeks, putting one of the largest drivers of the economy at risk. Consumer confidence fell in the US, Japan, Germany, the UK, and France over the past three months, according to a Morni…", "url": "https://www.businessinsider.com/consumer-confidence-drops-world-coronavirus-spreads-economy-impact-us-france-2020-3", "urlToImage": "https://images.markets.businessinsider.com/image/5e543b08fee23d672d03ebf5-2400/2020-02-23t111340z925141307rc2b6f9lgatxrtrmadp3china-health-italy.jpg", "publishedAt": "2020-03-10T18:34:49Z", "content": "Guglielmo Mangiapane/Reuters\r\n<ul><li>The coronavirus outbreak has rattled consumers around the globe in recent weeks, putting one of the largest drivers of the economy at risk. </li><li>Consumer confidence fell in the US, Japan, Germany, the UK, and France o… [+2024 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mélissa Godin", "title": "Why Is Italy’s Coronavirus Outbreak So Bad?", "description": "In less than a month, Italy has gone from having only three cases of the coronavirus to having the highest number of cases and deaths outside of China", "url": "https://time.com/5799586/italy-coronavirus-outbreak/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/GettyImages-1206167223.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2020-03-10T18:18:29Z", "content": "On Monday, Italy placed its 60 million residents under lockdown, as the number of cases of the COVID-19 virus throughout the country continues to rise.\r\nIn less than a month, Italy has gone from having only three cases of the coronavirus to having the highest… [+8996 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "Coronavirus updates: New York announces containment, Trump hasn't been tested - CNET", "description": "The COVID-19 outbreak sees Italy lock down 60 million residents. In the US, an area of New York has been designated a containment zone.", "url": "https://www.cnet.com/news/coronavirus-updates-new-york-announces-containment-trump-hasnt-been-tested/", "urlToImage": "https://cnet3.cbsistatic.com/img/HVJXYNBvtQh-3T-4WTDE0fqE1H8=/756x567/2020/03/09/8ef1deeb-c72b-4895-97be-7ad2c1cf3487/gettyimages-1204352391.jpg", "publishedAt": "2020-03-10T18:48:00Z", "content": "In three months, coronavirus has spread across every continent, except Antarctica, leaving some cities empty.\r\nMarco Di Lauro/Getty Images\r\nCOVID-19, the disease caused by a newly identified coronavirus first detected in China in December, has rapidly spread … [+39296 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ricardo Alonso-Zaldivar / AP", "title": "Insurance Companies Pledge No-Cost Coronavirus Tests at White House Meeting, But Concerns Remain", "description": "Several health insurance CEOs met with Donald Trump and Mike Pence to discuss what they are doing to fight the coronavirus outbreak.", "url": "https://time.com/5800390/coronavirus-tests-insurance-companies/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/no-cost-coronavirus-tests.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-10T19:04:52Z", "content": "(WASHINGTON) — Major insurers pledged to cover coronavirus tests at no cost to patients at the White House Tuesday, but those assurances — while welcome — may not resolve public concerns about testing.\r\nFor one, insurers can’t control the availability of the … [+3508 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Nicole Gallucci", "title": "Screw it, here are a bunch of stock photos of Babybel cheese", "description": "There are only so many articles about politics and the coronavirus a person can read before having to seek refuge in something else Anything else. Some people attempt to distract themselves from the harsh realities of unsettling news by consuming news-adjacen…", "url": "https://mashable.com/article/babybel-cheese-stock-photos/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F10%252F15%252F3a9b71e1acbb4c519076f227a9aa5122.47c94.png%252F1200x630.png?signature=KBs1mvJUG4k7p9ROQ3SkUojLzH0=", "publishedAt": "2020-03-10T18:21:07Z", "content": "There are only so many articles about politics and the coronavirus a person can read before having to seek refuge in something else. Anything else.\r\nSome people attempt to distract themselves from the harsh realities of unsettling news by consuming news-adjac… [+2909 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Taylor Nicole Rogers", "title": "Coronavirus fears cost Mark Zuckerberg more than $4 billion from his personal fortune in just a week as Facebook's stock is hit by market volatility", "description": "Mark Zuckerberg lost $4.1 billion last week — more than anyone else on the Forbes Billionaires List — as Facebook shares plummeted amid a market selloff inspired by coronavirus fears, Forbes' Hayley C. Cuccinello reported. Facebook's ad sales may shrink as so…", "url": "https://www.businessinsider.com/coronavirus-cost-facebook-ceo-mark-zuckerberg-4-billion-one-week-2020-3", "urlToImage": "https://i.insider.com/5dc2e0fe7eece52b915534b4?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:58:00Z", "content": "Facebook CEO Mark Zuckerberg is $4.1 billion less rich than he was last Monday.\r\nThe 35-year-old billionaire's fortune shrank last week as Facebook shares plummeted amid a larger market sell-off inspired by the growing coronavirus health crisis, Forbes' Hayle… [+2329 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck", "title": "Coronavirus fallout and the oil-price war will push 2020 GDP into 'spitting range of a typical global recession,' Bank of America says", "description": "Bank of America lowered its global 2020 growth expectation to 2.2% from 2.8% on Tuesday, just two weeks after its last downward revision. The updated projection lands well below the 3.5% GDP growth trend and places the world economy \"in spitting range of a ty…", "url": "https://markets.businessinsider.com/news/stocks/economic-outlook-coronavirus-oil-price-war-risk-recession-bofa-gdp-2020-3-1028982431", "urlToImage": "https://images.markets.businessinsider.com/image/5e224fa024306a48a740a665-2400/rtr22hzq.jpg", "publishedAt": "2020-03-10T18:22:53Z", "content": "REUTERS/Brendan McDermid\r\n<ul><li>Bank of America lowered its global 2020 growth expectation to 2.2% from 2.8% on Tuesday, just two weeks after its last downward revision.</li><li>The updated projection lands well below the 3.5% GDP growth trend and places th… [+3717 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shira Feder", "title": "A Survivor contestant and scarcity expert explains why you're panic-buying", "description": "As the number of coronavirus cases tops 100,000, more and more people are panic-buying items like hand sanitizer, toilet paper, and face masks. Kelly Goldsmith, a former Survivor contestant turned academic expert on scarcity, tells Business Insider this hoard…", "url": "https://www.businessinsider.com/survivor-contestant-scarcity-expert-how-survive-coronavirus-2020-3", "urlToImage": "https://i.insider.com/5e67d988e4f9fe680373a4b6?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:18:00Z", "content": "To her students at Vanderbilt University, Kelly Goldsmith is an expert on consumer behavior in the face of scarcity. To Survivor fans, she's a trooper who lasted 24 days in the searing Kenyan heat on the third season of the reality TV show. \r\nBut to people an… [+6530 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "LeBron will 'listen' if NBA bars fans over virus", "description": "LeBron James said he would be \"very disappointed\" if the NBA decided to play games without fans in response to the coronavirus crisis, but admitted he would \"listen\" to the league if that's what it decided to do.", "url": "https://www.espn.com/nba/story/_/id/28878573/lebron-james-says-listen-nba-bars-fans-coronavirus", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0207%2Fr663076_1296x729_16%2D9.jpg", "publishedAt": "2020-03-10T19:06:41Z", "content": "Los Angeles Lakers star LeBron James said he would be \"very disappointed\" if the NBA decided to play games without fans in response to the coronavirus crisis, but admitted he would \"listen\" to the league if that's what it decided to do.\r\nJames' answer Tuesday… [+899 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Why Coronavirus May Be the Biggest Threat Yet to Donald Trump’s Re-Election", "description": "The biggest threat to Donald Trump’s re-election in 2020 may be COVID-19. The spread of the novel coronavirus is shaping up as a test of Trump’s core pitch to voters: that they are better off than they were when he took office. Sharp drops in the stock market…", "url": "https://time.com/5800093/coronavirus-donald-trump-2020-election/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/trump-st-patricks-day-luncheon.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-10T19:00:18Z", "content": "The biggest threat to Donald Trump’s re-election in 2020 may be COVID-19.\r\nThe spread of the novel coronavirus is shaping up as a test of Trump’s core pitch to voters: that they are better off than they were when he took office. Sharp drops in the stock marke… [+7294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by James Phillips", "title": "How to improve your chances", "description": "The most important thing you can do to empower yourself is to maximize your own health, writes James Phillips", "url": "https://www.cnn.com/2020/03/10/opinions/improve-chances-against-coronavirus-opinion-phillips/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175741-04-coronavirus-0213-super-tease.jpg", "publishedAt": "2020-03-10T18:22:02Z", "content": "James P. Phillips, MD, is an assistant professor of emergency medicine at the George Washington University, where he serves as chief of the Section of Disaster and Operational Medicine. Follow him on Twitter @DrPhillipsMD. The opinions expressed in this comme… [+5407 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hayley Peterson", "title": "Risks of coronavirus infection from packages are 'extremely low,' even though the virus could live on surfaces for days, one expert says", "description": "The risk of contracting coronavirus from a package is low, even though the virus can live on some surfaces for days, according to health officials. Coronaviruses are most often spread by respiratory droplets, which are transmitted through sneezing and coughin…", "url": "https://www.businessinsider.com/how-long-can-coronavirus-live-on-packages-2020-3", "urlToImage": "https://i.insider.com/5cc0742bb14bf43ccd220265?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:59:59Z", "content": "The spread of coronavirus in China led to a surge in online orders from consumers who were stuck at home. \r\nAs the number of cases of the new virus climbs in the US, the same could happen here.\r\nBut is shopping online any safer than going to a store? Can a pa… [+2446 chars]"}, {"source": {"id": null, "name": "Dezeen.com"}, "author": "Frankie Entwistle", "title": "Comments update: \"I always thought in times of crisis people would shine\"", "description": "This week, readers pondered the long-term impact of the coronavirus and shared their opinions of Frank Gehry's twisting tower in France. Forward thinking: readers reacted with cynicism to Li Edelkoort's optimistic predictions for a post-coronavirus future. In…", "url": "http://www.dezeen.com/2020/03/10/comments-update-coronavirus-predictions-gehry-tower/", "urlToImage": "https://static.dezeen.com/uploads/2020/02/milan-salone-del-mobile-furniture-fair-cancelled-postponed-coronavirus1_dezeen_2364_col_0-1024x1024.jpg", "publishedAt": "2020-03-10T19:00:27Z", "content": "This week, readers pondered the long-term impact of the coronavirus and shared their opinions of Frank Gehry's twisting tower in France.\r\nForward thinking: readers reacted with cynicism to Li Edelkoort's optimistic predictions for a post-coronavirus future. I… [+5409 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Joy Wiltermuth", "title": "Market Extra: The U.S. corporate bond market is open again after the worst day since 2008", "description": "Starbucks and aircraft maker Textron are among the investment-grade companies tipping their toes back into the corporate bond market to borrow funds, a day after shocks from plunging oil prices and the further spread of the coronavirus led to the worst one-da…", "url": "http://www.marketwatch.com/story/the-us-corporate-bond-market-is-open-again-after-the-worst-day-since-2008-2020-03-10", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IB948_Starbu_ZG_20200310142253.jpg", "publishedAt": "2020-03-10T18:24:57Z", "content": "The U.S. corporate bond market is open again Tuesday, only a day after U.S. credit saw its worst selloff since the height of the financial crisis in 2008.Starbucks Corp.\r\n SBUX, \r\n +4.30%\r\nand Textron Inc.\r\n TXT, \r\n +8.66%\r\nare two of the companies that looke… [+3555 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Johnson", "title": "Why I invested $10,000 in the stock market during one of its darkest days", "description": "On March 9, the Dow dropped by more than 2,000 points and the S&P 500 dropped by more than 7% as fears over the coronavirus spread worldwide. I chose that day to invest another $10,000. Despite these dramatic losses, most financial advisers seem to agree that…", "url": "https://www.businessinsider.com/why-i-invested-in-the-stock-market-during-darkest-days-2020-3", "urlToImage": "https://i.insider.com/5e67e16954f25c70200da7d3?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:59:43Z", "content": "As of the end of the day on Monday, March 9, the Dow Jones industrial average had dropped more than 2,000 points and the S&amp;P 500 dropped by more than 7%. Fortunately, I didn't panic or freak out at all. Instead, I logged into my Vanguard brokerage account… [+5176 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "The Warning Signs of Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-10/the-warning-signs-of-coronavirus-video", "urlToImage": null, "publishedAt": "2020-03-10T18:35:59Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Social Media and the Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-10/social-media-and-the-coronavirus-video", "urlToImage": null, "publishedAt": "2020-03-10T19:06:05Z", "content": null}, {"source": {"id": null, "name": "Vox.com"}, "author": "Jen Kirby", "title": "3 things you need to know about the coronavirus today", "description": "Italy is under quarantine and more.", "url": "https://www.vox.com/2020/3/10/21173079/coronavirus-news-italy-quarantine-white-house-trump-march-10", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ZYo3t0CJSuwO9ZxBiGrmGBqYzGE=/0x0:6016x3150/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19782426/AP_20070491746217.jpg", "publishedAt": "2020-03-10T18:20:00Z", "content": "Countries are implementing sanitization efforts against coronavirus in public areas like airports, train stations, and museums like this one in Naples, Italy. | Alessandro Pone/LaPresse via AP Italy is under quarantine and more. As of March 10, there are more… [+5526 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Quint Forgey", "title": "Trump says he’s open to being tested for coronavirus", "description": "“I don’t think it’s a big deal. I would do it,” the president said.", "url": "https://www.politico.com/news/2020/03/10/donald-trump-coronavirus-test-125059", "urlToImage": "https://static.politico.com/fa/b0/d73638cf4817ae25130db4a3ed39/200310-donald-trump-ap-773.jpg", "publishedAt": "2020-03-10T18:51:02Z", "content": "I dont feel that any reason I feel extremely good. I feel very good, but I guess its not a big deal to get tested, and I something I would do, the president continued. \r\nBut again, I spoke to the White House doctor, terrific guy, talented guy. He said he sees… [+1295 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Coronavirus: Pressure builds on UK government to step up measures", "description": "The British government says it is putting science at the heart of all coronavirus planning.", "url": "https://www.aljazeera.com/news/2020/03/coronavirus-pressure-builds-uk-government-step-measures-200310185706136.html", "urlToImage": "https://www.aljazeera.com/mritems/images/2020/3/10/image-20200310185707469.jpg", "publishedAt": "2020-03-10T18:57:06Z", "content": "The United Kingdom government is coming under increased pressure to do more to tackle the coronavirus.\r\nSchools and universities remain open, and there are few restrictions on people returning from Italy.\r\nAl Jazeera's Neave Barker reports."}, {"source": {"id": null, "name": "Thedrive.com"}, "author": "Rob Stumpf", "title": "The Coronavirus Outbreak Has Emptied Out Seattle's Hectic Highways", "description": "Data specialists say travel times could be cut in half thanks to a new wave of telecommuting.", "url": "https://www.thedrive.com/news/32512/coronavirus-outbreak-has-emptied-out-seattles-hectic-highways", "urlToImage": "https://api.thedrive.com/wp-content/uploads/2020/03/GettyImages-635880134.jpg?quality=85", "publishedAt": "2020-03-10T19:06:24Z", "content": "Everybody hates traffic. Sitting bumper-to-bumper while commuting can work out to be one of the most frustrating tasks of your entire day, and large tech capitals have proven to be home to some of the most troublesome traffic hotspots. As more companies insti… [+3288 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus: Linfield player has contracted illness confirms Belfast club", "description": "A player from Irish Premiership team Linfield has tested positive for coronavirus, the club confirms.", "url": "https://www.bbc.co.uk/sport/football/51816897", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/DD54/production/_111206665_untitleddesign.png", "publishedAt": "2020-03-10T18:23:04Z", "content": "Linfield are the defending Irish Premiership champions\r\nA Linfield player has tested positive for coronavirus, the Irish Premiership club confirmed on Tuesday evening.\r\nEarlier, Linfield chairman Roy McGivern told BBC Sport NI that a player had chosen to self… [+1238 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Apple iPhone Sales Plummet Over 60% in China", "description": "Apple has experienced a 61% drop in iPhone sales in China compared to last year due to the coronavirus outbreak. Apple shipped 2 million iPhones in January 2020, but only 494,000 phones in February according to the China Academy of Information and Communicati…", "url": "https://hypebeast.com/2020/3/apple-iphone-sales-plummet-over-60-china", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2020%2F03%2Fapple-iphone-sales-plummet-over-60-china-twtr.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2020-03-10T18:40:35Z", "content": "Apple has experienced a 61% drop in iPhone sales in China compared to last year due to the coronavirus outbreak. Apple shipped 2 million iPhones in January 2020, but only 494,000 phones in February according to the China Academy of Information and Communicati… [+838 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": "Jake Rossen", "title": "The Psychological Reason Coronavirus Is Prompting People to Hoard Toilet Paper", "description": "Of all the personal essentials needed in the event of a national health concern, why are people stocking up on Charmin?", "url": "https://www.mentalfloss.com/article/620067/coronavirus-hoarding-toilet-paper", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1124,w_2000,x_0,y_70/v1583856364/shape/mentalfloss/620067-praneat-gettyimages-1181803358.jpg?itok=TSP6Mzp8", "publishedAt": "2020-03-10T18:30:00Z", "content": "The ALDI emblazoned in big, block letters on signs around the world has come to stand for stress-free, affordable grocery shoppingbut what does it literally stand for?\r\nConsidering its almost always spelled in all-caps, ALDI gives off a decidedly acronymic vi… [+1476 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "'Serie A might not finish due to coronavirus'", "description": "The Italian football federation (FIGC) admitted on Tuesday the Serie A season might not finish because of the coronavirus outbreak.", "url": "https://www.skysports.com/football/news/11095/11954762/coronavirus-figc-admit-serie-a-might-not-finish-because-of-outbreak-in-italy", "urlToImage": "https://e2.365dm.com/20/03/1600x900/skysports-inter-milan-juventus_4944194.jpg", "publishedAt": "2020-03-10T19:04:00Z", "content": "The Italian football federation (FIGC) admitted on Tuesday the Serie A season might not finish because of the coronavirus outbreak.\r\nThe FIGC confirmed in a statement Serie A would stop until at least April 3 following a government decree issued on Monday as … [+3234 chars]"}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "Ferragamo Says It Cannot Forecast Impact of Coronavirus on Results", "description": "The news comes after the Italian luxury group posted a 4 percent drop in its 2019 core profit.", "url": "https://www.businessoffashion.com/articles/news-analysis/ferragamo-says-it-cannot-forecast-impact-of-coronavirus-on-results", "urlToImage": null, "publishedAt": "2020-03-10T18:13:09Z", "content": null}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Reuters", "title": "Orders Sink for Italy's Luxury Suppliers on Coronavirus Fears", "description": "Brands have been forced to shut shops, shelve new openings and postpone advertising spending in the region.", "url": "https://www.businessoffashion.com/articles/news-analysis/orders-sink-for-italys-luxury-suppliers-on-coronavirus-fears", "urlToImage": null, "publishedAt": "2020-03-10T18:11:41Z", "content": null}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Jessica Morgan, interviewed by Jessica Morgan", "title": "“I Don’t Risk Leaving The House”: Coronavirus & My Health Anxiety", "description": "Coronavirus (Covid-19) is spreading at a rapid rate. As of today, more than 113,000 people are known to be infected and 4000 deaths have been recorded. While the majority of cases have been recorded in mainland China, it has spread internationally to countrie…", "url": "https://www.refinery29.com/en-ca/2020/03/9536083/coronavirus-health-anxiety", "urlToImage": "https://www.refinery29.com/images/9473214.jpg?crop=40%3A21", "publishedAt": "2020-03-10T18:32:32Z", "content": "Skip navigation!\r\nNow ReadingMy Coronavirus Health Anxiety Has Left Me In Fear\r\nCovid-19, the respiratory disease caused by the virus, was first detected in Wuhan, China in December last year. The virus starts with a fever, followed by a dry cough, and leads … [+3802 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "NY creates 'containment zone' in coronavirus-hit New Rochelle", "description": "National Guard to help clean surfaces, deliver food in heart of what appears to be the epicentre of state's outbreak.", "url": "https://www.aljazeera.com/news/2020/03/ny-creates-containment-zone-coroanvirus-hit-rochelle-200310180825770.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/10/85d2f471147549fa805f83c32bb39d6d_18.jpg", "publishedAt": "2020-03-10T18:43:21Z", "content": "Schools, houses of worship and large gathering places will be shuttered for two weeks in a \"containment area\" centred in New York suburb of New Rochelle, the heart of what appears to be the nation's biggest cluster of cases of the coronavirus, the state's Gov… [+1883 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "William Roberts", "title": "Trump, Democrats at odds over coronavirus economic proposals", "description": "Trump looks for support on economic stimulus proposal that includes payroll tax cuts - a plan some Democrats dismiss.", "url": "https://www.aljazeera.com/news/2020/03/trump-democrats-odds-coronavirus-economic-proposals-200310173515585.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/10/f30282ab1c414998ae41e7bc5f770ad3_18.jpg", "publishedAt": "2020-03-10T18:36:53Z", "content": "Washington, DC - United States President Donald Trump and Congress are moving towards new legislation to support the US economy with competing priorities.\r\nDemocrats in the US House of Representatives want to focus any legislation on helping families that may… [+3787 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Barclays Says NYC Employee Tested Positive for Coronavirus", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/barclays-says-new-york-employee-tested-positive-for-coronavirus", "urlToImage": null, "publishedAt": "2020-03-10T18:19:33Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Trump Says Getting Tested For Coronavirus Isn't a 'Big Deal'", "description": null, "url": "https://www.bloomberg.com/news/videos/2020-03-10/trump-says-getting-tested-for-coronavirus-isn-t-a-big-deal-video", "urlToImage": null, "publishedAt": "2020-03-10T19:08:49Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Norway Steps Up Coronavirus Measures After First Untraced Cases", "description": null, "url": "https://www.bloomberg.com/news/articles/2020-03-10/norway-steps-up-coronavirus-measures-after-first-untraced-cases", "urlToImage": null, "publishedAt": "2020-03-10T18:43:13Z", "content": null}, {"source": {"id": null, "name": "Vox.com"}, "author": "Jason Del Rey", "title": "Amazon will spend $5 million to prop up Seattle businesses harmed by coronavirus precautions", "description": "The ecommerce giant is focusing its efforts on small businesses surrounding its offices.", "url": "https://www.vox.com/recode/2020/3/10/21173383/amazon-seattle-small-business-fund-grants-coronavirus", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RXUghyCZgOw5mARhyB47vSQVhAo=/0x230:3200x1905/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19782648/GettyImages_1171232362.jpg", "publishedAt": "2020-03-10T18:50:00Z", "content": "Amazon is making an effort to help out business in the neighborhoods surrounding its original headquarters and new corporate towers. | David Ryder/Washington Post/Getty Images The ecommerce giant is focusing its efforts on small businesses surrounding its off… [+3108 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "N.J. school district disinfects 72 buses daily to prevent coronavirus spread - NJ.com", "description": "N.J. school district disinfects 72 buses daily to prevent coronavirus spread NJ.com Is it really a good idea to close schools to fight coronavirus? The Washington Post Most Bay Area schools remain open until further notice from state as coronavirus spreads Th…", "url": "https://www.youtube.com/watch?v=fdlljxIrqO8", "urlToImage": "https://i.ytimg.com/vi/fdlljxIrqO8/maxresdefault.jpg", "publishedAt": "2020-03-10T19:00:08Z", "content": "This N.J. school district disinfects 72 buses daily with cleaning solution four times more powerful than chlorine. And that's not the only precaution they're taking. What plan of action is your district taking? http://nj-ne.ws/c4bjx9R"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'I don't think it's a big deal': President Trump asked about getting a coronavirus test - ABC News", "description": "'I don't think it's a big deal': President Trump asked about getting a coronavirus test ABC News Gaetz slept in Walmart lot after potentially exposing Trump to coronavirus - Business Insider Business Insider GOP Rep. Matt Gaetz says he tested negative for cor…", "url": "https://www.youtube.com/watch?v=TTafRoutf7M", "urlToImage": "https://i.ytimg.com/vi/TTafRoutf7M/maxresdefault.jpg", "publishedAt": "2020-03-10T18:54:02Z", "content": "The president said he feels extremely good after being asked about coronavirus testing. \r\nLEARN MORE:\r\nGOP Reps. Meadows, Collins and Gaetz to self-quarantine, interacted with infected individual at CPAC: https://abcn.ws/2wK6lK8\r\nTed Cruz, Paul Gosar to self-… [+328 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Leh death not caused by coronavirus", "description": "“We have received the test report of the patient who expired on early Sunday morning. It has been confirmed that he was not infected with coronavirus. He died because of other ailments,” said an official.", "url": "https://indianexpress.com/article/india/leh-death-not-caused-by-coronavirus-6308423/", "urlToImage": "https://images.indianexpress.com/2020/02/death-2.jpg?w=759", "publishedAt": "2020-03-10T19:00:15Z", "content": "On Sunday, the administration had ordered closing of all schools in Leh district till Match 31. Ladakh has two positive cases of coronavirus and health officials said that the patients are undergoing treatment. (Representational Image)A Leh resident who died … [+808 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Joanne Rosa", "title": "Sen. Cory Booker says while Biden isn't 'perfect,' he's best to unify Americans", "description": "New Jersey Senator Cory Booker discusses his support for former Vice President Joe Biden on \"The View\" Tuesday, Mar. 10, 2020.", "url": "https://abcnews.go.com/Politics/jersey-sen-cory-booker-biden-perfect-hes-best/story?id=69502085", "urlToImage": "https://s.abcnews.com/images/Politics/corey-booker-01-gty-jc-200310_hpMain_16x9_992.jpg", "publishedAt": "2020-03-10T18:48:49Z", "content": "New Jersey Sen. Cory Booker on Thursday told \"The View\" hosts that while he's critiqued former Vice President Joe Biden in the past, he still thinks he's the best candidate to defeat President Donald Trump and \"create a more perfect union\" in America.\r\n\"As I … [+5500 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Carter Coudriet, Forbes Staff, Carter Coudriet, Forbes Staff https://www.forbes.com/sites/cartercoudriet/", "title": "Coachella Postponed Due To Coronavirus", "description": "The giant two-weekend California music festival is the latest event canceled due to C19. More than 250,000 people were expected to attend. Track all virus-related cancelations and postponements with our new C19 Cancelation Tracker.", "url": "https://www.forbes.com/sites/cartercoudriet/2020/03/10/coachella-postponed-due-to-coronavirus/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5e67e0d4ea197600073ea30b%2F0x0.jpg", "publishedAt": "2020-03-10T18:49:04Z", "content": "Coachella draws an estimated 250,000 attendees, who will have to wait until October for this year's ... [+] music festival.\r\nAmy Harris/Invision/AP\r\nOrganizers of Coachella have postponed the popular music festival Tuesday afternoon according to reports from … [+1099 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Rachel DeSantis", "title": "Here Are All the U.S. Universities Suspending In-Person Classes Due to Coronavirus", "description": "A number of U.S. colleges and universities have taken the precautionary measure of suspending or canceling classes as the coronavirus continues to spread. What began for many schools as a ban on travel to affected areas has since evolved, with many now requir…", "url": "https://people.com/human-interest/universities-suspending-in-person-classes-amid-coronavirus/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F02%2Funiversity-of-southern-california.jpg%3Fcrop%3D0px%2C0px%2C1500px%2C787.5px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T18:42:36Z", "content": "A number of U.S. colleges and universities have taken the precautionary measure of suspending or canceling classes as the coronavirus continues to spread.\r\nWhat began for many schools as a ban on travel to affected areas has since evolved, with many now requi… [+2500 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Novel Coronavirus explained l ABC News - ABC News", "description": "Novel Coronavirus explained l ABC News ABC News Don’t Let the Chinese Government Escape Blame for Coronavirus’s Initial Spread National Review Coronavirus Confronts Global Economy With Long Road to Recovery The Wall Street Journal Op-Ed: In the global respons…", "url": "https://www.youtube.com/watch?v=CXOsVXybVJY", "urlToImage": "https://i.ytimg.com/vi/CXOsVXybVJY/maxresdefault.jpg", "publishedAt": "2020-03-10T19:01:15Z", "content": "Early cases of COVID-19 are believed to be linked to a live-animal market in Wuhan, China.\r\n#Coronavirus#COVID19#News#Explainer#ABCNews#Outbreak"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "Michael Simon, Michael Simon", "title": "iOS 14 and iPad OS 14: Everything we know about Apple’s upcoming OS upgrades", "description": "WWDC may be in limbo due to the coronavirus outbreak, but that’s not stopping the release of iOS 14 and iPad OS 14. Apple is hard at work on the next update for the iPhone and iPad, and details are starting to leak ahead of the big reveal. Here is everything …", "url": "https://www.macworld.com/article/3531949/ios-14-ipad-os-14-apps-features-compatibility-release.html", "urlToImage": "https://images.idgesg.net/images/article/2019/09/dsc05363_final-100812229-large.3x2.jpg", "publishedAt": "2020-03-10T18:30:00Z", "content": "WWDC may be in limbo due to the coronavirus outbreak, but thats not stopping the release of iOS 14 and iPad OS 14. Apple is hard at work on the next update for the iPhone and iPad, and details are starting to leak ahead of the big reveal. Here is everything w… [+6051 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jem Aswad", "title": "SXSW May Be Canceled, but There’s a Lot Happening in Austin This Week", "description": "Without losing perspective, the city in the U.S. that may have been hit hardest thus far by the spread of the coronavirus may be one that has not yet seen a single case of the illness: Austin, Texas, where the annual South by Southwest conference, which bring…", "url": "https://variety.com/2020/biz/news/sxsw-canceled-austin-list-events-concerts-parties-1203529120/", "urlToImage": "https://pmcvariety.files.wordpress.com/2020/03/sxsw2.jpg?w=700&h=393&crop=1", "publishedAt": "2020-03-10T19:05:14Z", "content": "Without losing perspective, the city in the U.S. that may have been hit hardest thus far by the spread of the coronavirus may be one that has not yet seen a single case of the illness: Austin, Texas, where the annual South by Southwest conference, which bring… [+2002 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Rahul V Pisharody", "title": "Coronavirus outbreak: Virus clips wings of Hyderabad aeroshow", "description": "As per the earlier schedule, the first two days were meant for business events, with March 14 and 15, the weekend, set aside for the general public. Now the show won’t have dedicated days for public entry,", "url": "https://indianexpress.com/article/india/coronavirus-outbreak-virus-clips-wings-of-hyderabad-aeroshow-6308410/", "urlToImage": "https://images.indianexpress.com/2020/03/tokyo-global-markets-reuters-759.jpg?w=759", "publishedAt": "2020-03-10T18:51:06Z", "content": "The last minute change of plans came after the governments direction restricting large public gatherings. (Representational/Reuters Image)The biennial aeroshow in Hyderabad, scheduled to begin in a couple of days, wont have dedicated days for public entry, as… [+1388 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Randy Kulman Ph.D.", "title": "How Are Children and Teens Learning about Coronavirus?", "description": "What are kids learning about the coronavirus from their peers and social media? Parents can use reliable information to help reduce anxiety and promote safe behavior.", "url": "https://www.psychologytoday.com/ca/blog/screen-play/202003/how-are-children-and-teens-learning-about-coronavirus", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2020-03/shutterstock_685407808_2.jpg?itok=HuLrKrM7", "publishedAt": "2020-03-10T18:18:08Z", "content": "Children and teens learn much about their world from screen-based media, and that is where they are learning about coronavirus. They may be actively watching television, searching the Internet or social media, or overhearing their parents radio on the drive t… [+2565 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Sam Stein", "title": "Meet The Insane People Still Planning Cruise Ship Vacations", "description": "Some people see the prospect of a deadly virus and a 14-day quarantine and run far, far away. Others see the deal of a lifetime.", "url": "https://www.thedailybeast.com/meet-the-insane-people-still-planning-cruise-ship-vacations-despite-coronavirus", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583863170/200310-stein-cruise-virus-tease_efbvto", "publishedAt": "2020-03-10T18:54:27Z", "content": "The cruise ship industry is reeling. The outbreak of the new coronavirus has made the basic fundamentals of the business medically inadvisable to the point that the State Department has issued a warning to U.S. travelerschief among them the elderlyto stop tak… [+8975 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.N. urges Iran to free political prisoners temporarily amid coronavirus", "description": "The U.N. Special Rapporteur on human rights in Iran said on Tuesday he had asked Iran to free all political prisoners temporarily from its overcrowded and disease-ridden jails to help stem the spread of coronavirus.", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/5K65-FW7CEA/u-n-urges-iran-to-free-political-prisoners-temporarily-amid-coronavirus-idUSKBN20X1YV", "urlToImage": null, "publishedAt": "2020-03-10T18:14:15Z", "content": null}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Johns Hopkins University", "title": "COVID-19 symptoms pop up 5 days after exposure", "description": "How soon do symptoms show up after COVID-19 exposure? About five days, new research shows.", "url": "https://www.futurity.org/?p=2302932", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2020/03/covid-19-symptoms-after-exposure_1600.jpg", "publishedAt": "2020-03-10T18:58:11Z", "content": "The average time from exposure to onset of COVID-19 symptoms is 5.1 days, researchers report.\r\nThis suggests that the 14-day quarantine period the US Centers for Disease Control and Prevention are using for individuals with likely exposure to SARS-CoV-2, the … [+3645 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Matthew Schneier", "title": "Coronavirus or No Coronavirus, the Met Gala Is Still On", "description": "Fashion brands are canceling events, but the year’s biggest party is still on.", "url": "http://www.thecut.com/2020/03/coronavirus-or-no-coronavirus-the-met-gala-is-still-on.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/10/10-met-gala.w1200.h630.jpg", "publishedAt": "2020-03-10T18:41:36Z", "content": "This is looking likely to be a season of cancelations. COVID-19  the disease caused by the new coronavirus  continues to spread, and public-health officials have now bypassed discussions of containment for discussions of mitigation. Cases have been reported w… [+3127 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "With Coronavirus Looming, Should You Buy or Sell Stocks Right Now?", "description": "Troubled times have hit Wall Street. What's an investor to do?", "url": "https://www.fool.com/investing/2020/03/10/with-coronavirus-looming-should-you-buy-or-sell-st.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562600/finance-trade-manager-analysing-stock-market-indicators-for-best-investment-strategy-financial-data-and-charts-with-business-buildings-in-background-getty.jpg", "publishedAt": "2020-03-10T18:55:00Z", "content": "A decade-long bull run on Wall Street has come crashing down in recent weeks, with the S&amp;P 500 giving up more than 15% of its value since mid-February on growing concerns that the COVID-19 coronavirus will drive the U.S. economy into a recession.\r\nStocks … [+5032 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Letters To The Editor", "title": "Letter: Trump must reject business as usual with coronavirus - The Mercury News", "description": "The world needs a coronavirus vaccine now — one that prioritizes saving lives over Big Pharma’s bottom line.", "url": "https://www.mercurynews.com/letter-coronavirus-pandemic-requires-trump-to-reject-pharmas-business-as-usual", "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2020/03/sjm-Outbreak_73229385.jpg?w=1024&h=683", "publishedAt": "2020-03-10T18:15:26Z", "content": "World needs a vaccine thatprioritizes lives, not profits\r\nThe coronavirus pandemic requires rejecting pharmas business as usual. The government has already pledged $1 billion in additional taxpayer funding to cover the research, development and manufacturing … [+898 chars]"}, {"source": {"id": null, "name": "Abovethelaw.com"}, "author": "Staci Zaretsky", "title": "A Coronavirus Conundrum: Should Lawyers Keep Dining Out For Meals?", "description": "Is it worth the risk? Take our poll.", "url": "https://abovethelaw.com/2020/03/a-coronavirus-conundrum-should-lawyers-keep-dining-out-for-meals/", "urlToImage": "https://abovethelaw.com/uploads/2016/08/GettyImages-200356035-001.jpg", "publishedAt": "2020-03-10T18:45:26Z", "content": "(Image via Getty)\r\nI’m fully aware of the absurdity of my actions right now. I don’t think it’s worth putting my family’s safety or friends’ or colleagues’ safety in jeopardy with me getting sick. But at some point, I think it’s going to be a necessity for ev… [+768 chars]"}, {"source": {"id": null, "name": "Goodmenproject.com"}, "author": "Dr. Vibe", "title": "Coronavirus … Worry or Hype?", "description": "How is the world handling the coronavirus? The post Coronavirus … Worry or Hype? appeared first on The Good Men Project.", "url": "https://goodmenproject.com/featured-content/coronavirus-worry-or-hype/", "urlToImage": "https://goodmenproject.com/wp-content/uploads/2020/03/shutterstock_1622496262.jpg", "publishedAt": "2020-03-10T18:30:07Z", "content": "Dr. Vibe asks two Black American women thought leaders about the current coronavirus situation\r\nDr. Vibe asks Aisha K. Staggers and Jill Jones for their takes on the following topics:\r\n The coronavirus situationNina Turner vs. Hillary Rosen, a Biden supporter… [+611 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Claudia Harmata", "title": "Olympic Official Says 2020 Olympics Could Still Be Postponed 1 to 2 Years If Needed", "description": "A member of the 2020 Tokyo Olympics organizing committee’s executive board said that the games could likely be postponed one to two years if needed due to the novel coronavirus (COVID-19). “I don’t think the Games could be canceled; it’d be a delay. The Inter…", "url": "https://people.com/sports/olympic-official-says-2020-olympics-could-still-be-postponed/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpeopledotcom.files.wordpress.com%2F2020%2F03%2Ftokyo-2020.jpg%3Fcrop%3D0px%2C133px%2C1500px%2C788px%26resize%3D1200%2C630", "publishedAt": "2020-03-10T18:47:52Z", "content": "A member of the 2020 Tokyo Olympics organizing committee’s executive board said that the games could likely be postponed one to two years if needed due to the novel coronavirus (COVID-19).\r\n“I don’t think the Games could be canceled; it’d be a delay. The Inte… [+2735 chars]"}, {"source": {"id": null, "name": "Adweek.com"}, "author": "Ian Zelaya", "title": "How Are Brands With Activations Coping After South by Southwest’s Cancellation?", "description": "For the first time in South by Southwest's 34-year history, its host city of Austin, Texas canceled the cultural festival as the coronavirus--the pathogen that causes the illness COVID-19--threatens to become a pandemic. The festival, which was slated for Mar…", "url": "https://www.adweek.com/brand-marketing/south-by-southwests-cancellation-affecting-brands-activations/", "urlToImage": "https://www.adweek.com/wp-content/uploads/2020/03/sxsw-mainstay-brands-PAGE-2020-600x315.jpg", "publishedAt": "2020-03-10T18:51:17Z", "content": "For the first time in South by Southwests 34-year history, its host city of Austin, Texas canceled the cultural festival as the coronavirusthe pathogen that causes the illness COVID-19threatens to become a pandemic.The festival, which was slated for March 13-… [+3650 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Imani Moise", "title": "Barclays reports coronavirus case on New York trading floor", "description": "Barclays PLC told employees on Tuesday that a member of the trading staff in its Manhattan office has tested positive for the coronavirus, according to a memo viewed by Reuters.", "url": "https://www.reuters.com/article/us-health-coronavirus-barclays-idUSKBN20X2PV", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200310&t=2&i=1501350660&w=1200&r=LYNXMPEG291PB", "publishedAt": "2020-03-10T18:13:00Z", "content": "(Reuters) - Barclays PLC (BARC.L) told employees on Tuesday that a member of the trading staff in its Manhattan office has tested positive for the coronavirus, according to a memo viewed by Reuters. \r\nThe person, who worked out of the 745 7th Ave office, had … [+773 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Lou Whiteman)", "title": "Why Shares of Boeing Are Down Today", "description": "A key 737 Max customer says it could slow deliveries if the travel slowdown continues.", "url": "https://www.fool.com/investing/2020/03/10/why-shares-of-boeing-are-down-today.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/562584/ba-737-max-source-ba.jpg", "publishedAt": "2020-03-10T18:21:00Z", "content": "What happened\r\nShares of Boeing(NYSE:BA) fell nearly 5% on Tuesday after a key airline customer said it could stall plane deliveries if travel demand does not quickly recover.\r\nSo what\r\nBoeing's issues predate the COVID-19 coronavirus, as the company has been… [+1752 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Aarthi Swaminathan", "title": "'It’s all very confusing': Harvard closes campus amid coronavirus fears", "description": "On Tuesday, Harvard University told its students to vacate the campus by Sunday and not return from spring break amid the coronavirus outbreak.", "url": "https://finance.yahoo.com/news/coronavirus-harvard-colleges-closed-184640323.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-10T18:46:40Z", "content": "On Tuesday, Harvard University told its students to vacate the campus by Sunday and not return from spring break amid the coronavirus outbreak.\r\nStarting March 23, the Ivy League college will be transitioning to virtual instruction for both graduates and unde… [+3654 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anjalee Khemlani", "title": "Coronavirus update: Markets recover but outlook darkens as NY orders New Rochelle containment", "description": "The U.S. and Europe underscored the world’s increasingly fraught coronavirus containment efforts, as the disease moves closer to becoming a pandemic.", "url": "https://finance.yahoo.com/news/coronavirus-update-markets-recover-but-us-outlook-darkens-as-ny-orders-new-rochelle-containment-183513663.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/zwHAhkFmr6QUIVXoZAxpjw--~B/aD0zNjAwO3c9NTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-03/f4333a20-62fc-11ea-b4ff-25815ed9f971", "publishedAt": "2020-03-10T18:35:13Z", "content": "The coronavirus crisis grew more serious on Tuesday, as Italys countrywide quarantine and New Yorks governor sending National Guard forces to one town in order to isolate rising infections there underscored the worlds increasingly fraught containment efforts … [+4454 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " COVID-19 Megathread #5 via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_a396e7ebf4c622c445727af7998729c4", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T18:40:09Z", "content": "Virginia Beach, Coronavirus\r\nVIRGINIA BEACH, Va. (WAVY) Several festivals across the nation have canceled their plans because of coronavirus concerns, which prompted 10 On..."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: 'Cabin fever' in locked-down Lombardy", "description": "\"I never thought I'd say this - but I'd probably rather be in school,\" says 16-year-old Oliver Fox.", "url": "https://www.bbc.co.uk/news/av/uk-england-manchester-51822315/coronavirus-cabin-fever-in-locked-down-lombardy", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/57E5/production/_111210522_p08676x8.jpg", "publishedAt": "2020-03-10T18:17:29Z", "content": null}, {"source": {"id": null, "name": "Snopes.com"}, "author": "AP News", "title": "New York Sending National Guard to Suburb to Control Coronavirus", "description": "Schools, houses of worship, and large gathering spaces will close in a \"containment zone\" in New Rochelle, New York. The New York City suburb is believed to be the nation's biggest cluster of coronavirus cases.", "url": "https://www.snopes.com/ap/2020/03/10/new-york-sending-national-guard-to-suburb-to-control-coronavirus/", "urlToImage": "https://www.snopes.com/tachyon/2020/03/ap-new-rochelle-containment-zone-e1583866535396.jpg?fit=1200,800", "publishedAt": "2020-03-10T19:01:37Z", "content": "New Yorks governor announced Tuesday he is sending the National Guard into a New York City suburb to help fight what is believed to be the nations biggest cluster of coronavirus cases one of the most dramatic actions yet to control the outbreak in the U.S.\r\nT… [+5171 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Bridget Read", "title": "Trump Doesn’t Want to Face This", "description": "One terrifying chart shows how little we know about the spread of the coronavirus in the United States.", "url": "http://www.thecut.com/2020/03/chart-shows-little-coronavirus-testing-has-been-done-in-u-s.html", "urlToImage": "https://pixel.nymag.com/imgs/fashion/daily/2020/03/10/10-covid-chart-lede.w1200.h630.jpg", "publishedAt": "2020-03-10T18:49:01Z", "content": "One terrifying chart shows just how far behind the United States is in testing its citizens for coronavirus compared to other countries which is a marker of how little our federal government has a handle on what is likely turning into a pandemic. Trump, in hi… [+3415 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Emma Tucker", "title": "Every Major Event Canceled or Postponed Worldwide Due to Coronavirus", "description": "Massimo Pinca/Reuters As the 2019 novel coronavirus continues to wreak havoc on world financial markets and fuel fears of widespread contagion, major events such as conferences, summits, concerts, and sporting events are being forced to cancel or postpone. Th…", "url": "https://www.thedailybeast.com/every-major-event-festival-and-sports-match-canceled-or-postponed-worldwide-due-to-coronavirus", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2450,w_4357,x_0,y_372/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1583865309/RTS358QT_czqhg0", "publishedAt": "2020-03-10T18:40:28Z", "content": "As the 2019 novel coronavirus continues to wreak havoc on world financial markets and fuel fears of widespread contagion, major events such as conferences, summits, concerts, and sporting events are being forced to cancel or postpone. The virus has reached mo… [+4300 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Patrick Coffee", "title": "Email shows how SXSW is scrambling after a no-refund coronavirus cancellation that leaves sponsors and attendees hanging", "description": "Austin, Texas-based SXSW cancelled the festival last week over coronavirus-related concerns and only offering refunds on hotel reservations. The festival's organizers are trying to minimize the damage by deferring payments until 2021, 2022, or 2023 and workin…", "url": "https://www.businessinsider.com/sxsw-is-scrambling-to-recover-from-coronavirus-cancellation-2020-3", "urlToImage": "https://i.insider.com/5e67de8f54f25c6c0c3e08a6?width=1200&format=jpeg", "publishedAt": "2020-03-10T18:40:21Z", "content": "Austin, Texas-based South by Southwest cancelled the tech, music, and film festival for the first time in its 34-year history over concerns about the spread of the coronavirus and won't refund attendees and vendors. \r\nAn email, printed below, that SXSW sent t… [+4315 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sarah Hansen, Forbes Staff, Sarah Hansen, Forbes Staff https://www.forbes.com/sites/sarahhansen/", "title": "What Does Coronavirus Have To Do With Crashing Oil Prices? Russia And Saudi Arabia’s Spat Explained.", "description": "Saudi Arabia is prepared to ramp up production to more than 12 million barrels a day.", "url": "https://www.forbes.com/sites/sarahhansen/2020/03/10/what-does-coronavirus-have-to-do-with-crashing-oil-prices-russia-and-saudi-arabias-spat-explained/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F155380480%2F0x0.jpg%3FcropX1%3D196%26cropX2%3D4050%26cropY1%3D596%26cropY2%3D2766", "publishedAt": "2020-03-10T19:03:19Z", "content": "Saudi Arabia is prepared to ramp up production to more than 12 million barrels a day.\r\nGetty\r\nTopline: An all-out price war between two oil-producing giants, Russia and Saudi Arabia, has rocked global markets this week, with prices plummeting by more than 30%… [+3401 chars]"}, {"source": {"id": null, "name": "Idownloadblog.com"}, "author": "Christian Zibreg", "title": "iOS 14 code suggests the next iPhone SE will have Touch ID and Express Transit support", "description": "The iPhone SE successor should retain Apple's fingerprint reader while adding support for the Express Transit feature for quickly paying for rides without validating with Touch ID.", "url": "https://www.idownloadblog.com/2020/03/10/ios-14-iphone-se-2-touch-id-express-transit/", "urlToImage": "https://media.idownloadblog.com/wp-content/uploads/2016/01/iPhone-5s-Home-Button-Touch-ID-730x480.jpg", "publishedAt": "2020-03-10T18:45:42Z", "content": "Aside from other discovered features, leaked iOS 14 code has indicated that the next iPhone SE, tentatively named iPhone 9, might use a fingerprint sensor for biometrics and add support for the Express Transit feature for quickly paying for rides without vali… [+1273 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rosie Spinks, Skift", "title": "Nothing Could Stop the Cruise Industry — Then Came Coronavirus", "description": "On Saturday, after Vice President Mike Pence met with cruise industry executives in Fort Lauderdale, it's easy to imagine the industry breathing a sigh of relief. “The American people value our cruise line industry, it brings great joy and great entertainment…", "url": "https://finance.yahoo.com/news/nothing-could-stop-cruise-industry-183001414.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-03-10T18:30:01Z", "content": "Nothing Could Stop the Cruise Industry Then Came Coronavirus\r\nOn Saturday, after Vice President Mike Pence met with cruise industry executives in Fort Lauderdale, its easy to imagine the industry breathing a sigh of relief.\r\nThe American people value our crui… [+10716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Washington state has coronavirus in 3 different nursing homes - ABC News", "description": "Washington state has coronavirus in 3 different nursing homes ABC News She’s Been a Nurse for 10 Years. Panic Has Finally Arrived. The New York Times Life Care Nursing Home In Washington Announces 31 Additional Coronavirus Cases | NBC News NBC News Death toll…", "url": "https://www.youtube.com/watch?v=WIWDyHXaPm0", "urlToImage": null, "publishedAt": "2020-03-10T18:40:37Z", "content": "[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Troops sent to New York 'containment zone' - BBC News", "description": "Coronavirus: Troops sent to New York 'containment zone' BBC News NY governor debuts state's hand sanitizer, made by prisoners ABC News New York Gov. Cuomo deploys National Guard to New Rochelle, establishes containment center to stem coronavirus CNBC N.Y. Cre…", "url": "https://www.bbc.com/news/world-us-canada-51826317", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/131D2/production/_111209287_gettyimages-1206351754.jpg", "publishedAt": "2020-03-10T18:15:57Z", "content": "Image copyrightGetty ImagesImage caption\r\n New York Governor Andrew Cuomo says travel is not restricted in and out of the city\r\nNew York Governor Andrew Cuomo has announced one-mile (1.6km) coronavirus \"containment zone\" around a community north of New York C… [+3532 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Isabel Togoh, Forbes Staff, Isabel Togoh, Forbes Staff https://www.forbes.com/sites/isabeltogoh/", "title": "As Coronavirus Lockdowns Hit Supply Chains, Luxury Fashion Is Not Immune", "description": "Luxury retailers could face shortages later this year and into the festive season if the Covid-19 outbreak continues to impact supply chains over the next few months.", "url": "https://www.forbes.com/sites/isabeltogoh/2020/03/10/as-coronavirus-lockdowns-hit-supply-chains-luxury-fashion-is-not-immune/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1140926763%2F0x0.jpg", "publishedAt": "2020-03-10T18:19:51Z", "content": "Milan's Vittorio Emanuele II luxury Gallery (above) has this week been hit by lockdowns across Italy\r\nAFP via Getty Images\r\nTopline: Luxury retailers have been hit by a double-whammy of falling demand from Chinese buyers, and lockdowns across major manufactur… [+4269 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Nate Madden", "title": "VP Pence announces that health insurance companies will waive copays related to coronavirus testing", "description": "Vice President Mike Pence announced Tuesday that multiple insurance companies have agreed to waive copays associated with coronavirus testing in an effort to encourage Americans to get tested for the new disease. \"I'm pleased to report, as you requested, Mr. …", "url": "https://www.theblaze.com/news/vp-pence-announces-that-health-insurance-companies-will-waive-copays-related-to-coronavirus-testing", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjg2OTY4NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYxNTQ3MTYxMH0.eqmASD37CR6gFj9Ols_89k3U8n5WrClvpGLw-ThrGr8/img.jpg?width=1200&coordinates=0%2C82%2C0%2C82&height=600", "publishedAt": "2020-03-10T18:30:08Z", "content": "Vice President Mike Pence announced Tuesday that multiple insurance companies have agreed to waive copays associated with coronavirus testing in an effort to encourage Americans to get tested for the new disease.\r\n\"I'm pleased to report, as you requested, Mr.… [+2225 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Olga Khazan", "title": "The Stress of a Wedding, Now With Coronavirus", "description": "Wedding-cancelation insurance doesn't cover an outbreak.", "url": "https://www.theatlantic.com/health/archive/2020/03/wedding-plans-coronavirus/607723/", "urlToImage": "https://cdn.theatlantic.com/thumbor/toTP3ZiW-zsubQqo9FiBSm6Adxg=/0x43:2000x1085/960x500/media/img/mt/2020/03/0320_Khazan_Martin_CoronaWedding_wide/original.jpg", "publishedAt": "2020-03-10T18:43:00Z", "content": "Steven Zarnfaller’s elderly cousin couldn’t risk attending his wedding. Last week, Zarnfaller got a call from the 78-year-old, who has been like a mother to him. Given the news about the coronavirus, she told him, it was too dangerous for her to fly from New … [+8559 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus in the UK: How are people responding?", "description": "Alongside health worries, there's anger, fear that not enough is being done... and lots of questions.", "url": "https://www.bbc.co.uk/news/uk-51815486", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16480/production/_111146219_coronavirus-london_index_virus.jpg", "publishedAt": "2020-03-10T18:44:35Z", "content": "Image copyrightGetty Images\r\nLife in the UK has certainly changed in recent weeks as the number of coronavirus cases continues to rise. But how is the British public responding?\r\nMostly, with questions. \r\nShould I be self-isolating? How will my travel plans b… [+3835 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Marc Bain", "title": "Italy’s luxury manufacturing is grappling with a nationwide lockdown", "description": "As the crisis grows, global luxury sales are plummeting.", "url": "https://qz.com/1815731/italys-luxury-manufacturing-is-threatened-by-coronavirus/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/03/RTS35GOW-e1583857210403.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-03-10T18:39:27Z", "content": "Made in Italy is a sign of prestige for the global luxury companies that manufacture clothes, bags, and shoes in the country.\r\nNow the factories behind that work are contending with the spread of coronavirus through Italy. That includes a government-mandated … [+3204 chars]"}, {"source": {"id": null, "name": "Brandchannel.com"}, "author": "Maria Barea", "title": "Brand Moves Roundup", "description": "In a fast-moving global crisis such as the current coronavirus outbreak, brands have an important role to play. Staying true to their read more: The post Brand Moves Roundup appeared first on brandchannel:.", "url": "https://www.brandchannel.com/2020/03/10/brand-moves-roundup/", "urlToImage": "https://www.brandchannel.com/wp-content/uploads/2020/03/shutterstock_1654908052-2.jpg", "publishedAt": "2020-03-10T18:33:32Z", "content": "In a fast-moving global crisis such as the current coronavirus outbreak, brands have an important role to play. Staying true to their ambition creates a perception of integrity. Reputations can be made by activating brand purpose during a crisis – and just as… [+13345 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Vanessa Chalmers Health Reporter For Mailonline", "title": "Fury at travel agents #KeepCalmTravelOn campaign during coronavirus outbreak", "description": "The travel industry launched the campaign to 'spread advice and travel deals' as flight and package holiday sales plummet amid the outbreak. But it was slammed as irresponsible.", "url": "https://www.dailymail.co.uk/health/article-8096431/Fury-travel-agents-KeepCalmTravelOn-campaign-coronavirus-outbreak.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/03/10/18/25796996-0-image-a-3_1583864619124.jpg", "publishedAt": "2020-03-10T18:41:59Z", "content": "A #KeepCalmTravelOn campaign promoted by travel agents amid the coronavirus outbreak has been met with furious backlash.\r\nAs flight and package holiday sales plummet, the travel industry launched the hashtag to 'spread advice and travel deals' to encourage pe… [+12308 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anthony Ha", "title": "Daily Crunch: French data watchdog investigates Criteo", "description": "Criteo faces a privacy investigation, an e-discovery startup raises $62 million and hackers hack other hackers. Criteo is under investigation by the French data protection watchdog, the CNIL, following a complaint filed by privacy rights campaign group Privac…", "url": "https://finance.yahoo.com/news/daily-crunch-french-data-watchdog-181625416.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/yilGqiDkA1Aa_A5LzSj84g--~B/aD0xNDk5O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/8fc26ef154f35695007d152af14c568b", "publishedAt": "2020-03-10T18:16:25Z", "content": "Criteo faces a privacy investigation, an e-discovery startup raises $62 million and hackers hack other hackers. Here's your Daily Crunch for March 10, 2020.\r\n1. Adtech giant Criteo is being investigated by Frances data watchdog\r\nCriteo is under investigation … [+2741 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Trump says coronavirus \"will go away\" and to \"stay calm\"", "description": "President Trump and top economic advisers went to Capitol Hill today to lobby for coronavirus tax relief.", "url": "https://www.cbsnews.com/news/trump-says-coronavirus-will-go-away-and-urges-americans-to-just-stay-calm-2020-03-10/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/03/10/1fa35d57-50cd-4b88-9474-408edba4e3e5/thumbnail/1200x630/a90d861de36e49379a65c5a77f96af63/gettyimages-1211609303.jpg", "publishedAt": "2020-03-10T18:43:06Z", "content": "President Trump is urging Americans to remain calm in the face of fear about the spread of coronavirus in the U.S. \"It will go away, just stay calm,\" Mr. Trump said of the coronavirus Tuesday. He added, \"Be calm. It's really working out. And a lot of good thi… [+2623 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Greta Privitera", "title": "Coronavirus Diaries: What Italy Is Like Now", "description": "I didn’t know anyone with the virus. Today I know three.", "url": "https://slate.com/technology/2020/03/coronavirus-diaries-update-from-italy.html", "urlToImage": "https://compote.slate.com/images/37740a9c-8b53-4c84-9973-d4b44c674ef5.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2020-03-10T18:20:35Z", "content": "<ol><li>\r\nCOVID-19 Isnt As Deadly As We Think\r\n </li><li>\r\nA Warning From a Scientist Who Saw the Coronavirus Coming\r\n </li><li>\r\nThe Most Drastic Anti-Coronavirus Travel Ban in the World\r\n </li><li>\r\nCoronavirus Diaries: My Spouse Is High-Risk\r\n </li></ol>\r\n… [+5176 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " you godless fuck. via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_bcdb0e42339f5b10d51da0869a069d19", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T18:40:09Z", "content": "Bucks County, Steve Santarsiero, Coronavirus, Emergency\r\nLawmaker's Bill Would Protect Workers In Outbreaks - Yardley, PA - Sen. Steve Santarsiero's bill would prevent employers from punishing workers..."}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Quite Fretful via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_35c128cc2a154958aac22bfdda969621", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T18:40:09Z", "content": "Bucks County, Steve Santarsiero, Coronavirus, Emergency\r\nLawmaker's Bill Would Protect Workers In Outbreaks - Yardley, PA - Sen. Steve Santarsiero's bill would prevent employers from punishing workers..."}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jonathan Garber", "title": "Stocks roar as Trump floats payroll tax cut", "description": "Investors are evaluating Trump's economic ideas to combat coronavirus fueled slowdown.", "url": "https://finance.yahoo.com/news/stocks-roar-higher-trump-talks-133022275.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8eLSAa2IESZri2mv.s50nA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/_y3yDeqQS_TscrgtZ7uCvg--~B/aD00ODY1O3c9ODY2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/hd/cp-video-transcode/prod/2020-03/10/5e67b067da8e83431aa328a8/5e67b067da8e83431aa328a9_o_U_v2.jpg", "publishedAt": "2020-03-10T18:57:22Z", "content": "U.S. equity markets ebbed and flowed on Tuesday after President Trump backed very substantial relief for the areas of the economy hardest hit by the new coronavirus outbreak.\r\nWe are going to take care of, and have been taking care of, the American public and… [+2273 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Mike Hixenbaugh", "title": "'I don't know when I'll see you again': Coronavirus lockdown separates couple married 58 years", "description": "For nearly six decades, Bonnie Polin was rarely apart from her husband. But with nursing homes working to stop the spread of the coronavirus, she's stuck on the outside.", "url": "https://www.nbcnews.com/news/us-news/nursing-home-s-coronavirus-lockdown-keeps-wife-her-husband-58-n1154246", "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2020_11/3263306/200310-bonnie-polin-mn-0805_d45c5c8877f5ff91ce657ae7be2b4e00.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-03-10T18:26:07Z", "content": "Twice a day, Bonnie Polin, 78, drives a few miles to visit her husband at his nursing home in Portland, Oregon. She sits with him while he eats breakfast and tells him stories that she knows he probably wont remember.\r\nI fell in love with him because he was s… [+6599 chars]"}, {"source": {"id": null, "name": "Hvper.com"}, "author": null, "title": " Joe Biden told a factory worker 'you're full of sh--' during a tense argument over guns - CNBC via Hvper.com", "description": "The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas", "url": "http://www.hvper.com/?ref=feed_7be3ca4af1a033dc11290442a2f42a1e", "urlToImage": "http://www.hvper.com/static/img/og_09.png", "publishedAt": "2020-03-10T18:40:10Z", "content": "Bucks County, Steve Santarsiero, Coronavirus, Emergency\r\nLawmaker's Bill Would Protect Workers In Outbreaks - Yardley, PA - Sen. Steve Santarsiero's bill would prevent employers from punishing workers..."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Washington state considering 'real action' to slow coronavirus: Governor", "description": "Washington state Governor Jay Inslee on Tuesday said he was considering \"real action\" to prevent a rapid increase in coronavirus cases.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-washington-idUSKBN20X2R8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-03-10T18:31:52Z", "content": "OLYMPIA, Wa. (Reuters) - Washington state Governor Jay Inslee on Tuesday said he was considering “real action” to prevent a rapid increase in coronavirus cases. \r\nAsked at a press conference whether he was considering mandatory measures to slow the virus, Ins… [+224 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Catherine Muccigrosso", "title": "Charlotte area employers push sick time or work from home plans as coronavirus spreads", "description": "From banks to restaurants and grocers, companies are making policy changes to help prevent the spread of the new coronavirus.", "url": "https://news.yahoo.com/charlotte-area-employers-push-sick-191007845.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/o5dcZVku4wjuhqHCZD8D.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/CG_kf8yFCpvfiGkGDF4aLQ--~B/aD04NTU7dz0xMTQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/charlotte_observer_mcclatchy_513/0da1b72e1b3a6659c2b791ae1ee5a5f9", "publishedAt": "2020-03-10T19:10:07Z", "content": "Bankers, waiters, local government workers and grocery store clerks in the Charlotte area are among the employees seeing more flexible policies on the job regarding sick time or working from home.\r\nAll this comes as North Carolina Gov. Roy Cooper declared a s… [+3582 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Marcus Baram", "title": "Why the coronavirus crisis is a ‘gray rhino’ and not a ‘black swan’", "description": "Linguists say that the proper metaphor for the crisis is a “gray rhino,” which refers to highly probable but neglected threats that have an enormous impact. Are you using the wrong animal metaphor to describe the coronavirus crisis ? In recent weeks, headline…", "url": "https://www.fastcompany.com/90475793/why-the-coronavirus-crisis-is-a-gray-rhino-and-not-a-black-swan", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2020/03/p-1-grey-rhino.jpg", "publishedAt": "2020-03-10T18:28:28Z", "content": "Are you using the wrong animal metaphor to describe the coronavirus crisis? In recent weeks, headlines about COVID-19 have been full of so-called experts describing the pandemic as a “black swan,” a metaphor for an extremely rare event that is unforeseen and … [+1103 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mélissa Godin", "title": "Why Is Italy's Coronavirus Outbreak So Bad?", "description": "In less than a month, Italy has gone from having only three cases of the coronavirus to having the highest number of cases and deaths outside of China", "url": "https://news.yahoo.com/why-italys-coronavirus-outbreak-bad-181829021.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HbCHWY8n1WO4MK0zjHXdOw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuNzU-/https://s.yimg.com/uu/api/res/1.2/t40CUmaQNDW1ztd1SHdPBw--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/a97b780e80ba3c91b66850c0f7ad8454", "publishedAt": "2020-03-10T18:18:29Z", "content": "On Monday, Italy placed its 60 million residents under lockdown, as the number of cases of the COVID-19 virus throughout the country continues to rise.\r\nIn less than a month, Italy has gone from having only three cases of the coronavirus to having the highest… [+9578 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "David Mikkelson", "title": "If You Get Sick With Coronavirus, Can Donald Trump Make You Stay Home?", "description": "Who really is in charge of the outbreak response?  As with most things in American government, the answer is complicated.", "url": "https://www.snopes.com/news/2020/03/10/if-you-get-sick-with-coronavirus-can-donald-trump-make-you-stay-home/", "urlToImage": "https://www.snopes.com/tachyon/2018/10/trumphead2.jpg?fit=895,517", "publishedAt": "2020-03-10T19:06:06Z", "content": "This article by Brian Labus is republished here with permission from The Conversation. This content is shared here because the topic may interest Snopes readers; it does not, however, represent the work of Snopes fact-checkers or editors.\r\nPresident Donald Tr… [+7108 chars]"}]